#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ItemDarkChaoPerformance

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_ItemDarkChaoPerformance.ABP_ItemDarkChaoPerformance_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemDarkChaoPerformance_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_ItemDarkChaoPerformance_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_ItemDarkChaoPerformance_C_AnimGraph");
static_assert(sizeof(ABP_ItemDarkChaoPerformance_C_AnimGraph) == 0x000010, "Wrong size on ABP_ItemDarkChaoPerformance_C_AnimGraph");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_ItemDarkChaoPerformance_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_ItemDarkChaoPerformance.ABP_ItemDarkChaoPerformance_C.ExecuteUbergraph_ABP_ItemDarkChaoPerformance
// 0x0058 (0x0058 - 0x0000)
struct ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ItemDarkChaoPerformance_C*          K2Node_DynamicCast_AsBP_Item_Dark_Chao_Performance; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ItemDarkChaoPerformance_C*          K2Node_DynamicCast_AsBP_Item_Dark_Chao_Performance_1; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance) == 0x000008, "Wrong alignment on ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance");
static_assert(sizeof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance) == 0x000058, "Wrong size on ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, EntryPoint) == 0x000000, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000010, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, K2Node_DynamicCast_AsBP_Item_Dark_Chao_Performance) == 0x000018, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::K2Node_DynamicCast_AsBP_Item_Dark_Chao_Performance' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000021, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000024, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, CallFunc_GetOwningActor_ReturnValue_1) == 0x000030, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::CallFunc_GetOwningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, K2Node_DynamicCast_AsBP_Item_Dark_Chao_Performance_1) == 0x000038, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::K2Node_DynamicCast_AsBP_Item_Dark_Chao_Performance_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1) == 0x000050, "Member 'ABP_ItemDarkChaoPerformance_C_ExecuteUbergraph_ABP_ItemDarkChaoPerformance::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

}

