#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Shadow_Physics

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "UNION_structs.hpp"
#include "ControlRig_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Shadow_Physics.ABP_Shadow_Physics_C
// 0x4020 (0x4390 - 0x0370)
class UABP_Shadow_Physics_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0388(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0440(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x04F8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x05B0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x05D0(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x0688(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x0740(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x0760(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x0818(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x08D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x08F0(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x09A8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x0A60(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x0A80(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x0B38(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x0BF0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0C10(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0CC8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0CE8(0x00B8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0DA0(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1270(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1290(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1348(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1368(0x0020)()
	uint8                                         Pad_1388[0x8];                                     // 0x1388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x1390(0x07F0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x1B80(0x07F0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x2370(0x07F0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x2B60(0x07F0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x3350(0x07F0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x3B40(0x07F0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x4330(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x4350(0x0020)()
	struct FKawaiiPhysicsSettings                 ShadouwCommon_Physics_Settings;                    // 0x4370(0x0018)(Edit, BlueprintVisible, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_Shadow_Physics(int32 EntryPoint);
	void HoverboardControlRogLayer(const struct FPoseLink& HoverboardPose, struct FPoseLink* HoverboardControlRogLayer_0);
	void HoverboardItemHoldBlendLeft(const struct FPoseLink& BasePose, const struct FPoseLink& LeftHoldPose, struct FPoseLink* HoverboardItemHoldBlendLeft_0);
	void HoverboardItemHoldBlendRight(const struct FPoseLink& BasePose, const struct FPoseLink& RightHoldPose, struct FPoseLink* HoverboardItemHoldBlendRight_0);
	void KawaiiPhysicsLayer(const struct FPoseLink& InPose, struct FPoseLink* KawaiiPhysicsLayer_0);
	void MachineItemHoldBlendLeft(const struct FPoseLink& BasePose, const struct FPoseLink& LeftHoldPose, struct FPoseLink* MachineItemHoldBlendLeft_0);
	void MachineItemHoldBlendRight(const struct FPoseLink& BasePose, const struct FPoseLink& LeftHoldPose, struct FPoseLink* MachineItemHoldBlendRight_0);
	void MenuFacialOverride(const struct FPoseLink& MenuFinalPose, bool InPlayingMontage, const struct FPoseLink& MenuDefaltFace, const struct FPoseLink& MenuOverrideFace, struct FPoseLink* MenuFacialOverride_0);
	void ScaleFaceLayer(const struct FPoseLink& InFaceOverride, bool bPlayMontage, EBoneScaleFaceType InStateMachineFaceType, EBoneScaleFaceType InMontageFaceType, struct FPoseLink* ScaleFaceLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Shadow_Physics_C">();
	}
	static class UABP_Shadow_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Shadow_Physics_C>();
	}
};
static_assert(alignof(UABP_Shadow_Physics_C) == 0x000010, "Wrong alignment on UABP_Shadow_Physics_C");
static_assert(sizeof(UABP_Shadow_Physics_C) == 0x004390, "Wrong size on UABP_Shadow_Physics_C");
static_assert(offsetof(UABP_Shadow_Physics_C, UberGraphFrame) == 0x000370, "Member 'UABP_Shadow_Physics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_Shadow_Physics_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_Shadow_Physics_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_13) == 0x000388, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_12) == 0x000440, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_11) == 0x0004F8, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_Root_8) == 0x0005B0, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_10) == 0x0005D0, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_9) == 0x000688, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_Root_7) == 0x000740, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_8) == 0x000760, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_7) == 0x000818, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_Root_6) == 0x0008D0, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_6) == 0x0008F0, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_5) == 0x0009A8, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_Root_5) == 0x000A60, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_4) == 0x000A80, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_3) == 0x000B38, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_Root_4) == 0x000BF0, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_2) == 0x000C10, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_Root_3) == 0x000CC8, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose_1) == 0x000CE8, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_ControlRig) == 0x000DA0, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_Root_2) == 0x001270, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LinkedInputPose) == 0x001290, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_LocalToComponentSpace) == 0x001348, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_ComponentToLocalSpace) == 0x001368, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_KawaiiPhysics_5) == 0x001390, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_KawaiiPhysics_4) == 0x001B80, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_KawaiiPhysics_3) == 0x002370, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_KawaiiPhysics_2) == 0x002B60, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_KawaiiPhysics_1) == 0x003350, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_KawaiiPhysics) == 0x003B40, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_Root_1) == 0x004330, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, AnimGraphNode_Root) == 0x004350, "Member 'UABP_Shadow_Physics_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Shadow_Physics_C, ShadouwCommon_Physics_Settings) == 0x004370, "Member 'UABP_Shadow_Physics_C::ShadouwCommon_Physics_Settings' has a wrong offset!");

}

