#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ItemDarkChaoHero

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_ItemDarkChaoHero.ABP_ItemDarkChaoHero_C
// 0x0040 (0x03B0 - 0x0370)
class UABP_ItemDarkChaoHero_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_ItemDisable();
	void AnimNotify_ItemEnable();
	void ExecuteUbergraph_ABP_ItemDarkChaoHero(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_ItemDarkChaoHero_C">();
	}
	static class UABP_ItemDarkChaoHero_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_ItemDarkChaoHero_C>();
	}
};
static_assert(alignof(UABP_ItemDarkChaoHero_C) == 0x000010, "Wrong alignment on UABP_ItemDarkChaoHero_C");
static_assert(sizeof(UABP_ItemDarkChaoHero_C) == 0x0003B0, "Wrong size on UABP_ItemDarkChaoHero_C");
static_assert(offsetof(UABP_ItemDarkChaoHero_C, UberGraphFrame) == 0x000370, "Member 'UABP_ItemDarkChaoHero_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChaoHero_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_ItemDarkChaoHero_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChaoHero_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_ItemDarkChaoHero_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChaoHero_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_ItemDarkChaoHero_C::AnimGraphNode_Root' has a wrong offset!");

}

