#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_KingBoomBoo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_KingBoomBoo.ABP_KingBoomBoo_C
// 0x0490 (0x0800 - 0x0370)
class UABP_KingBoomBoo_C final : public UKingBoomBooAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x03A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x03D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x03F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0420(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0448(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0470(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0498(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x04C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0508(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0528(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0570(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0590(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x05D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x05F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0640(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0660(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x06A8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x06C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0710(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0730(0x00C8)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_AnimationEnd();
	void AnimNotify_Avoid();
	void AnimNotify_EndAttack();
	void AnimNotify_StartAttack();
	void ExecuteUbergraph_ABP_KingBoomBoo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_KingBoomBoo_C">();
	}
	static class UABP_KingBoomBoo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_KingBoomBoo_C>();
	}
};
static_assert(alignof(UABP_KingBoomBoo_C) == 0x000010, "Wrong alignment on UABP_KingBoomBoo_C");
static_assert(sizeof(UABP_KingBoomBoo_C) == 0x000800, "Wrong size on UABP_KingBoomBoo_C");
static_assert(offsetof(UABP_KingBoomBoo_C, UberGraphFrame) == 0x000370, "Member 'UABP_KingBoomBoo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_KingBoomBoo_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_KingBoomBoo_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_TransitionResult_6) == 0x0003A8, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_TransitionResult_5) == 0x0003D0, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_TransitionResult_4) == 0x0003F8, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_TransitionResult_3) == 0x000420, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_TransitionResult_2) == 0x000448, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_TransitionResult_1) == 0x000470, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_TransitionResult) == 0x000498, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_SequencePlayer_5) == 0x0004C0, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_StateResult_5) == 0x000508, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_SequencePlayer_4) == 0x000528, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_StateResult_4) == 0x000570, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_SequencePlayer_3) == 0x000590, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_StateResult_3) == 0x0005D8, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_SequencePlayer_2) == 0x0005F8, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_StateResult_2) == 0x000640, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_SequencePlayer_1) == 0x000660, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_StateResult_1) == 0x0006A8, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_SequencePlayer) == 0x0006C8, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_StateResult) == 0x000710, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_KingBoomBoo_C, AnimGraphNode_StateMachine) == 0x000730, "Member 'UABP_KingBoomBoo_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

