#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Rouge_Physics

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Rouge_Physics.ABP_Rouge_Physics_C.AnimBlueprintGeneratedConstantData
// 0x044F (0x0450 - 0x0001)
struct ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_89;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_90;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_91;                                 // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_92;                                 // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_93;                                 // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_94;                                 // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_95;                                 // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_96;                                 // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_97;                                 // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_98;                               // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_99;                                 // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_100;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0080(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0100(0x0040)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_8;                         // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_13;                  // 0x0170(0x0008)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_12;                  // 0x0178(0x0008)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_11;                  // 0x0180(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_7;                         // 0x0188(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_10;                  // 0x01B8(0x0008)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_9;                   // 0x01C0(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_6;                         // 0x01C8(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_8;                   // 0x01F8(0x0008)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_7;                   // 0x0200(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_5;                         // 0x0208(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_6;                   // 0x0238(0x0008)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_5;                   // 0x0240(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                         // 0x0248(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_4;                   // 0x0278(0x0008)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_3;                   // 0x0280(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                         // 0x0288(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_2;                   // 0x02B8(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_1;                // 0x02C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics;                  // 0x02F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0320(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0350(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                         // 0x0380(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_1;                   // 0x03B0(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                     // 0x03B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                         // 0x03E8(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose;                     // 0x0418(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0420(0x0030)()
};
static_assert(alignof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData) == 0x000450, "Wrong size on ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_89) == 0x000004, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_89' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_90) == 0x00000C, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_90' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_91) == 0x000014, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_91' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_92) == 0x00001C, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_92' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_93) == 0x000024, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_93' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_94) == 0x00002C, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_94' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_95) == 0x000034, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_95' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_96) == 0x00003C, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_96' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_97) == 0x000044, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_97' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, __StructProperty_98) == 0x000050, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::__StructProperty_98' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_99) == 0x000070, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_99' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_100) == 0x000078, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_100' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000080, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000100, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_8) == 0x000140, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_13) == 0x000170, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_12) == 0x000178, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_11) == 0x000180, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_7) == 0x000188, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_10) == 0x0001B8, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_9) == 0x0001C0, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_6) == 0x0001C8, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_8) == 0x0001F8, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_7) == 0x000200, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_5) == 0x000208, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_6) == 0x000238, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_5) == 0x000240, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_4) == 0x000248, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_4) == 0x000278, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_3) == 0x000280, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_3) == 0x000288, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_2) == 0x0002B8, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_1) == 0x0002C0, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics) == 0x0002F0, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000320, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000350, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_2) == 0x000380, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_1) == 0x0003B0, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x0003B8, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_1) == 0x0003E8, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000418, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000420, "Member 'ABP_Rouge_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");

// ScriptStruct ABP_Rouge_Physics.ABP_Rouge_Physics_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct ABP_Rouge_Physics::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(ABP_Rouge_Physics::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_Rouge_Physics::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Rouge_Physics::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on ABP_Rouge_Physics::FAnimBlueprintGeneratedMutableData");

}

