#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ItemDarkChao

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_ItemDarkChao_structs.hpp"
#include "UnionRun_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_ItemDarkChao.ABP_ItemDarkChao_C
// 0x08A0 (0x0C20 - 0x0380)
class UABP_ItemDarkChao_C final : public UItemDarkChaoAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_ItemDarkChao::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;             // 0x0388(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0390(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0398(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03A0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x03C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x03E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x04B0(0x0028)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_3;           // 0x04D8(0x00A8)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_2;           // 0x0580(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_CustomTransitionResult_1;            // 0x0628(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0648(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0670(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0698(0x0028)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_1;           // 0x06C0(0x00A8)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator;             // 0x0768(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_CustomTransitionResult;              // 0x0810(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0830(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0858(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x08A0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x08C0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0930(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0950(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0998(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x09B8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0A00(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0A20(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0A68(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0A88(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0AD0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0AF0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0B38(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0B58(0x00C8)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_EndMotionStart();
	void AnimNotify_ReaveAnimation();
	void AnimNotify_ThrowStart();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ItemDarkChao_AnimGraphNode_TransitionResult_1A426A2248012F5695241FB1C2269DB3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ItemDarkChao_AnimGraphNode_TransitionResult_307930234B67516D09D61C8BBA190ECC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ItemDarkChao_AnimGraphNode_TransitionResult_B8ECAC61426C524B037048A9678A07F4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ItemDarkChao_AnimGraphNode_TransitionResult_BE8F6845454ACFA58371F1A389BDB6AF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ItemDarkChao_AnimGraphNode_TransitionResult_E10DAC064EFD89C21AA4E1BEC3D21FAA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ItemDarkChao_AnimGraphNode_TransitionResult_E6F4645A4ED26862261B8293E09F9237();
	void ExecuteUbergraph_ABP_ItemDarkChao(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_ItemDarkChao_C">();
	}
	static class UABP_ItemDarkChao_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_ItemDarkChao_C>();
	}
};
static_assert(alignof(UABP_ItemDarkChao_C) == 0x000010, "Wrong alignment on UABP_ItemDarkChao_C");
static_assert(sizeof(UABP_ItemDarkChao_C) == 0x000C20, "Wrong size on UABP_ItemDarkChao_C");
static_assert(offsetof(UABP_ItemDarkChao_C, UberGraphFrame) == 0x000380, "Member 'UABP_ItemDarkChao_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, __AnimBlueprintMutables) == 0x000388, "Member 'UABP_ItemDarkChao_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimBlueprintExtension_PropertyAccess) == 0x000390, "Member 'UABP_ItemDarkChao_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimBlueprintExtension_Base) == 0x000398, "Member 'UABP_ItemDarkChao_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_Root) == 0x0003A0, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionResult_10) == 0x0003C0, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionResult_9) == 0x0003E8, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionResult_8) == 0x000410, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionResult_7) == 0x000438, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionResult_6) == 0x000460, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionResult_5) == 0x000488, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionResult_4) == 0x0004B0, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionPoseEvaluator_3) == 0x0004D8, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionPoseEvaluator_3' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionPoseEvaluator_2) == 0x000580, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionPoseEvaluator_2' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_CustomTransitionResult_1) == 0x000628, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_CustomTransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionResult_3) == 0x000648, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionResult_2) == 0x000670, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionResult_1) == 0x000698, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionPoseEvaluator_1) == 0x0006C0, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionPoseEvaluator_1' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionPoseEvaluator) == 0x000768, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionPoseEvaluator' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_CustomTransitionResult) == 0x000810, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_CustomTransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_TransitionResult) == 0x000830, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_SequencePlayer_5) == 0x000858, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_StateResult_6) == 0x0008A0, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_BlendSpacePlayer) == 0x0008C0, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_StateResult_5) == 0x000930, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_SequencePlayer_4) == 0x000950, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_StateResult_4) == 0x000998, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_SequencePlayer_3) == 0x0009B8, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_StateResult_3) == 0x000A00, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_SequencePlayer_2) == 0x000A20, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_StateResult_2) == 0x000A68, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_SequencePlayer_1) == 0x000A88, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_StateResult_1) == 0x000AD0, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_SequencePlayer) == 0x000AF0, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_StateResult) == 0x000B38, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_ItemDarkChao_C, AnimGraphNode_StateMachine) == 0x000B58, "Member 'UABP_ItemDarkChao_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

