#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_DialogueCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_DialogueCharacter.ABP_DialogueCharacter_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_DialogueCharacter_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_DialogueCharacter_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_DialogueCharacter_C_AnimGraph");
static_assert(sizeof(ABP_DialogueCharacter_C_AnimGraph) == 0x000010, "Wrong size on ABP_DialogueCharacter_C_AnimGraph");
static_assert(offsetof(ABP_DialogueCharacter_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_DialogueCharacter_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_DialogueCharacter.ABP_DialogueCharacter_C.ExecuteUbergraph_ABP_DialogueCharacter
// 0x0080 (0x0080 - 0x0000)
struct ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_2; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetAnimationAssetById_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetAnimationAssetById_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetAnimationAssetById_ReturnValue_2;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetAnimationAssetById_ReturnValue_3;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetAnimationAssetById_ReturnValue_4;      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetAnimationAssetById_ReturnValue_5;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetAnimationAssetById_ReturnValue_6;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetAnimationAssetById_ReturnValue_7;      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetAnimationAssetById_ReturnValue_8;      // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_2;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter) == 0x000008, "Wrong alignment on ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter");
static_assert(sizeof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter) == 0x000080, "Wrong size on ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, EntryPoint) == 0x000000, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue) == 0x000004, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1) == 0x00000C, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000011, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000012, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000013, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_2) == 0x000014, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x000018, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000019, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_GetAnimationAssetById_ReturnValue) == 0x000020, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_GetAnimationAssetById_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_GetAnimationAssetById_ReturnValue_1) == 0x000028, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_GetAnimationAssetById_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_GetAnimationAssetById_ReturnValue_2) == 0x000030, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_GetAnimationAssetById_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_GetAnimationAssetById_ReturnValue_3) == 0x000038, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_GetAnimationAssetById_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_GetAnimationAssetById_ReturnValue_4) == 0x000040, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_GetAnimationAssetById_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_GetAnimationAssetById_ReturnValue_5) == 0x000048, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_GetAnimationAssetById_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_GetAnimationAssetById_ReturnValue_6) == 0x000050, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_GetAnimationAssetById_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_GetAnimationAssetById_ReturnValue_7) == 0x000058, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_GetAnimationAssetById_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_GetAnimationAssetById_ReturnValue_8) == 0x000060, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_GetAnimationAssetById_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1) == 0x000070, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_2) == 0x000078, "Member 'ABP_DialogueCharacter_C_ExecuteUbergraph_ABP_DialogueCharacter::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

}

