#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ItemOmochao

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_ItemOmochao.ABP_ItemOmochao_C.AnimBlueprintGeneratedConstantData
// 0x0577 (0x0578 - 0x0001)
struct ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_142;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_143;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_144;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_145;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_146;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_147;                               // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_148;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_149;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_150;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_151;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_152;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_153;                                 // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_154;                                // 0x004C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_155;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_156;                              // 0x0054(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_157;                               // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_158;                                // 0x0084(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_159;                                // 0x0085(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_160;                                // 0x0086(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_161;                                // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_162;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_163;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_164;                                 // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_165;                              // 0x00A8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0040)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0188(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;             // 0x01B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;             // 0x01E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;             // 0x0218(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x0248(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x0278(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x02A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x02D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;               // 0x0308(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;                  // 0x0338(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;               // 0x0368(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                  // 0x0398(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x03C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x03F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x0428(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x0458(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0488(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x04B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x04E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0518(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0548(0x0030)()
};
static_assert(alignof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData) == 0x000578, "Wrong size on ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __NameProperty_142) == 0x000004, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__NameProperty_142' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __NameProperty_143) == 0x00000C, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__NameProperty_143' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __IntProperty_144) == 0x000014, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__IntProperty_144' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __NameProperty_145) == 0x000018, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__NameProperty_145' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __IntProperty_146) == 0x000020, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__IntProperty_146' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __FloatProperty_147) == 0x000024, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__FloatProperty_147' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __NameProperty_148) == 0x000028, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__NameProperty_148' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __IntProperty_149) == 0x000030, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__IntProperty_149' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __NameProperty_150) == 0x000034, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__NameProperty_150' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __IntProperty_151) == 0x00003C, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__IntProperty_151' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __NameProperty_152) == 0x000040, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__NameProperty_152' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __IntProperty_153) == 0x000048, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__IntProperty_153' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __BoolProperty_154) == 0x00004C, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__BoolProperty_154' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __FloatProperty_155) == 0x000050, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__FloatProperty_155' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __StructProperty_156) == 0x000054, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__StructProperty_156' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __FloatProperty_157) == 0x000080, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__FloatProperty_157' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __BoolProperty_158) == 0x000084, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__BoolProperty_158' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __EnumProperty_159) == 0x000085, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__EnumProperty_159' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __ByteProperty_160) == 0x000086, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__ByteProperty_160' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __NameProperty_161) == 0x000088, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__NameProperty_161' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __NameProperty_162) == 0x000090, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__NameProperty_162' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __NameProperty_163) == 0x000098, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__NameProperty_163' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __IntProperty_164) == 0x0000A0, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__IntProperty_164' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, __StructProperty_165) == 0x0000A8, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::__StructProperty_165' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000188, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_6) == 0x0001B8, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x0001E8, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x000218, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000248, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000278, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x0002A8, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0002D8, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_5) == 0x000308, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_5) == 0x000338, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_4) == 0x000368, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_4) == 0x000398, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x0003C8, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x0003F8, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000428, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000458, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000488, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0004B8, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0004E8, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000518, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000548, "Member 'ABP_ItemOmochao::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

// ScriptStruct ABP_ItemOmochao.ABP_ItemOmochao_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct ABP_ItemOmochao::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(ABP_ItemOmochao::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_ItemOmochao::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_ItemOmochao::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on ABP_ItemOmochao::FAnimBlueprintGeneratedMutableData");

}

