#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MetalSonic_Physics

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_MetalSonic_Physics.ABP_MetalSonic_Physics_C.AnimBlueprintGeneratedConstantData
// 0x03AF (0x03B0 - 0x0001)
struct ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_78;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_79;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_80;                                 // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_81;                                 // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_82;                                 // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_83;                                 // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_84;                                 // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_85;                                 // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_86;                               // 0x0048(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_87;                                 // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_88;                                 // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0078(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00F8(0x0040)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_13;                  // 0x0138(0x0008)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_12;                  // 0x0140(0x0008)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_11;                  // 0x0148(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_8;                         // 0x0150(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_10;                  // 0x0180(0x0008)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_9;                   // 0x0188(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_7;                         // 0x0190(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_8;                   // 0x01C0(0x0008)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_7;                   // 0x01C8(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_6;                         // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_6;                   // 0x0200(0x0008)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_5;                   // 0x0208(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_5;                         // 0x0210(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_4;                   // 0x0240(0x0008)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_3;                   // 0x0248(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                         // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_2;                   // 0x0280(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                         // 0x0288(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_1;                   // 0x02B8(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                     // 0x02C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                         // 0x02F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                // 0x0320(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                         // 0x0350(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0380(0x0030)()
};
static_assert(alignof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData) == 0x0003B0, "Wrong size on ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_78) == 0x000004, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_78' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_79) == 0x00000C, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_79' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_80) == 0x000014, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_80' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_81) == 0x00001C, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_81' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_82) == 0x000024, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_82' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_83) == 0x00002C, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_83' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_84) == 0x000034, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_84' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_85) == 0x00003C, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_85' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, __StructProperty_86) == 0x000048, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::__StructProperty_86' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_87) == 0x000068, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_87' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, __NameProperty_88) == 0x000070, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::__NameProperty_88' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000078, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000F8, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_13) == 0x000138, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_12) == 0x000140, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_11) == 0x000148, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_8) == 0x000150, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_10) == 0x000180, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_9) == 0x000188, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_7) == 0x000190, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_8) == 0x0001C0, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_7) == 0x0001C8, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_6) == 0x0001D0, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_6) == 0x000200, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_5) == 0x000208, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_5) == 0x000210, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_4) == 0x000240, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_3) == 0x000248, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_4) == 0x000250, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_2) == 0x000280, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_3) == 0x000288, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_1) == 0x0002B8, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x0002C0, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_2) == 0x0002F0, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000320, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_1) == 0x000350, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000380, "Member 'ABP_MetalSonic_Physics::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");

// ScriptStruct ABP_MetalSonic_Physics.ABP_MetalSonic_Physics_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct ABP_MetalSonic_Physics::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_MetalSonic_Physics::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_MetalSonic_Physics::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on ABP_MetalSonic_Physics::FAnimBlueprintGeneratedMutableData");

}

