#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ItemDarkChao

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_ItemDarkChao.ABP_ItemDarkChao_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemDarkChao_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_ItemDarkChao_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_ItemDarkChao_C_AnimGraph");
static_assert(sizeof(ABP_ItemDarkChao_C_AnimGraph) == 0x000010, "Wrong size on ABP_ItemDarkChao_C_AnimGraph");
static_assert(offsetof(ABP_ItemDarkChao_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_ItemDarkChao_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_ItemDarkChao.ABP_ItemDarkChao_C.ExecuteUbergraph_ABP_ItemDarkChao
// 0x0090 (0x0090 - 0x0000)
struct ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AItemDarkChaoObject*                    K2Node_DynamicCast_AsItem_Dark_Chao_Object;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_3;     // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_4;     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_5;     // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_1;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AItemDarkChaoObject*                    K2Node_DynamicCast_AsItem_Dark_Chao_Object_1;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_2;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_3;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_4;  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_5;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao) == 0x000008, "Wrong alignment on ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao");
static_assert(sizeof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao) == 0x000090, "Wrong size on ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, EntryPoint) == 0x000000, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, K2Node_DynamicCast_AsItem_Dark_Chao_Object) == 0x000010, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::K2Node_DynamicCast_AsItem_Dark_Chao_Object' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x00001C, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000020, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000024, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000025, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x000028, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x00002C, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3) == 0x000030, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_BooleanAND_ReturnValue) == 0x000034, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_LessEqual_DoubleDouble_ReturnValue_3) == 0x000035, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_LessEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4) == 0x000038, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_LessEqual_DoubleDouble_ReturnValue_4) == 0x00003C, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_LessEqual_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5) == 0x000040, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_BooleanAND_ReturnValue_1) == 0x000044, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_LessEqual_DoubleDouble_ReturnValue_5) == 0x000045, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_LessEqual_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_GetOwningActor_ReturnValue_1) == 0x000048, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_GetOwningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, K2Node_DynamicCast_AsItem_Dark_Chao_Object_1) == 0x000050, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::K2Node_DynamicCast_AsItem_Dark_Chao_Object_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1) == 0x000068, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_2) == 0x000070, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_3) == 0x000078, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_4) == 0x000080, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_5) == 0x000088, "Member 'ABP_ItemDarkChao_C_ExecuteUbergraph_ABP_ItemDarkChao::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_5' has a wrong offset!");

}

