#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Eggman_Physics

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Eggman_Physics.ABP_Eggman_Physics_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Eggman_Physics_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Eggman_Physics_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Eggman_Physics_C_AnimGraph");
static_assert(sizeof(ABP_Eggman_Physics_C_AnimGraph) == 0x000010, "Wrong size on ABP_Eggman_Physics_C_AnimGraph");
static_assert(offsetof(ABP_Eggman_Physics_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Eggman_Physics_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Eggman_Physics.ABP_Eggman_Physics_C.ExecuteUbergraph_ABP_Eggman_Physics
// 0x0004 (0x0004 - 0x0000)
struct ABP_Eggman_Physics_C_ExecuteUbergraph_ABP_Eggman_Physics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Eggman_Physics_C_ExecuteUbergraph_ABP_Eggman_Physics) == 0x000004, "Wrong alignment on ABP_Eggman_Physics_C_ExecuteUbergraph_ABP_Eggman_Physics");
static_assert(sizeof(ABP_Eggman_Physics_C_ExecuteUbergraph_ABP_Eggman_Physics) == 0x000004, "Wrong size on ABP_Eggman_Physics_C_ExecuteUbergraph_ABP_Eggman_Physics");
static_assert(offsetof(ABP_Eggman_Physics_C_ExecuteUbergraph_ABP_Eggman_Physics, EntryPoint) == 0x000000, "Member 'ABP_Eggman_Physics_C_ExecuteUbergraph_ABP_Eggman_Physics::EntryPoint' has a wrong offset!");

// Function ABP_Eggman_Physics.ABP_Eggman_Physics_C.HoverboardControlRogLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Eggman_Physics_C_HoverboardControlRogLayer final
{
public:
	struct FPoseLink                              HoverboardPose;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HoverboardControlRogLayer_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Eggman_Physics_C_HoverboardControlRogLayer) == 0x000008, "Wrong alignment on ABP_Eggman_Physics_C_HoverboardControlRogLayer");
static_assert(sizeof(ABP_Eggman_Physics_C_HoverboardControlRogLayer) == 0x000020, "Wrong size on ABP_Eggman_Physics_C_HoverboardControlRogLayer");
static_assert(offsetof(ABP_Eggman_Physics_C_HoverboardControlRogLayer, HoverboardPose) == 0x000000, "Member 'ABP_Eggman_Physics_C_HoverboardControlRogLayer::HoverboardPose' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_HoverboardControlRogLayer, HoverboardControlRogLayer_0) == 0x000010, "Member 'ABP_Eggman_Physics_C_HoverboardControlRogLayer::HoverboardControlRogLayer_0' has a wrong offset!");

// Function ABP_Eggman_Physics.ABP_Eggman_Physics_C.HoverboardItemHoldBlendLeft
// 0x0030 (0x0030 - 0x0000)
struct ABP_Eggman_Physics_C_HoverboardItemHoldBlendLeft final
{
public:
	struct FPoseLink                              BasePose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LeftHoldPose;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HoverboardItemHoldBlendLeft_0;                     // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Eggman_Physics_C_HoverboardItemHoldBlendLeft) == 0x000008, "Wrong alignment on ABP_Eggman_Physics_C_HoverboardItemHoldBlendLeft");
static_assert(sizeof(ABP_Eggman_Physics_C_HoverboardItemHoldBlendLeft) == 0x000030, "Wrong size on ABP_Eggman_Physics_C_HoverboardItemHoldBlendLeft");
static_assert(offsetof(ABP_Eggman_Physics_C_HoverboardItemHoldBlendLeft, BasePose) == 0x000000, "Member 'ABP_Eggman_Physics_C_HoverboardItemHoldBlendLeft::BasePose' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_HoverboardItemHoldBlendLeft, LeftHoldPose) == 0x000010, "Member 'ABP_Eggman_Physics_C_HoverboardItemHoldBlendLeft::LeftHoldPose' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_HoverboardItemHoldBlendLeft, HoverboardItemHoldBlendLeft_0) == 0x000020, "Member 'ABP_Eggman_Physics_C_HoverboardItemHoldBlendLeft::HoverboardItemHoldBlendLeft_0' has a wrong offset!");

// Function ABP_Eggman_Physics.ABP_Eggman_Physics_C.HoverboardItemHoldBlendRight
// 0x0030 (0x0030 - 0x0000)
struct ABP_Eggman_Physics_C_HoverboardItemHoldBlendRight final
{
public:
	struct FPoseLink                              BasePose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              RightHoldPose;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HoverboardItemHoldBlendRight_0;                    // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Eggman_Physics_C_HoverboardItemHoldBlendRight) == 0x000008, "Wrong alignment on ABP_Eggman_Physics_C_HoverboardItemHoldBlendRight");
static_assert(sizeof(ABP_Eggman_Physics_C_HoverboardItemHoldBlendRight) == 0x000030, "Wrong size on ABP_Eggman_Physics_C_HoverboardItemHoldBlendRight");
static_assert(offsetof(ABP_Eggman_Physics_C_HoverboardItemHoldBlendRight, BasePose) == 0x000000, "Member 'ABP_Eggman_Physics_C_HoverboardItemHoldBlendRight::BasePose' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_HoverboardItemHoldBlendRight, RightHoldPose) == 0x000010, "Member 'ABP_Eggman_Physics_C_HoverboardItemHoldBlendRight::RightHoldPose' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_HoverboardItemHoldBlendRight, HoverboardItemHoldBlendRight_0) == 0x000020, "Member 'ABP_Eggman_Physics_C_HoverboardItemHoldBlendRight::HoverboardItemHoldBlendRight_0' has a wrong offset!");

// Function ABP_Eggman_Physics.ABP_Eggman_Physics_C.KawaiiPhysicsLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Eggman_Physics_C_KawaiiPhysicsLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              KawaiiPhysicsLayer_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Eggman_Physics_C_KawaiiPhysicsLayer) == 0x000008, "Wrong alignment on ABP_Eggman_Physics_C_KawaiiPhysicsLayer");
static_assert(sizeof(ABP_Eggman_Physics_C_KawaiiPhysicsLayer) == 0x000020, "Wrong size on ABP_Eggman_Physics_C_KawaiiPhysicsLayer");
static_assert(offsetof(ABP_Eggman_Physics_C_KawaiiPhysicsLayer, InPose) == 0x000000, "Member 'ABP_Eggman_Physics_C_KawaiiPhysicsLayer::InPose' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_KawaiiPhysicsLayer, KawaiiPhysicsLayer_0) == 0x000010, "Member 'ABP_Eggman_Physics_C_KawaiiPhysicsLayer::KawaiiPhysicsLayer_0' has a wrong offset!");

// Function ABP_Eggman_Physics.ABP_Eggman_Physics_C.MachineItemHoldBlendLeft
// 0x0030 (0x0030 - 0x0000)
struct ABP_Eggman_Physics_C_MachineItemHoldBlendLeft final
{
public:
	struct FPoseLink                              BasePose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LeftHoldPose;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MachineItemHoldBlendLeft_0;                        // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Eggman_Physics_C_MachineItemHoldBlendLeft) == 0x000008, "Wrong alignment on ABP_Eggman_Physics_C_MachineItemHoldBlendLeft");
static_assert(sizeof(ABP_Eggman_Physics_C_MachineItemHoldBlendLeft) == 0x000030, "Wrong size on ABP_Eggman_Physics_C_MachineItemHoldBlendLeft");
static_assert(offsetof(ABP_Eggman_Physics_C_MachineItemHoldBlendLeft, BasePose) == 0x000000, "Member 'ABP_Eggman_Physics_C_MachineItemHoldBlendLeft::BasePose' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_MachineItemHoldBlendLeft, LeftHoldPose) == 0x000010, "Member 'ABP_Eggman_Physics_C_MachineItemHoldBlendLeft::LeftHoldPose' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_MachineItemHoldBlendLeft, MachineItemHoldBlendLeft_0) == 0x000020, "Member 'ABP_Eggman_Physics_C_MachineItemHoldBlendLeft::MachineItemHoldBlendLeft_0' has a wrong offset!");

// Function ABP_Eggman_Physics.ABP_Eggman_Physics_C.MachineItemHoldBlendRight
// 0x0030 (0x0030 - 0x0000)
struct ABP_Eggman_Physics_C_MachineItemHoldBlendRight final
{
public:
	struct FPoseLink                              BasePose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LeftHoldPose;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MachineItemHoldBlendRight_0;                       // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Eggman_Physics_C_MachineItemHoldBlendRight) == 0x000008, "Wrong alignment on ABP_Eggman_Physics_C_MachineItemHoldBlendRight");
static_assert(sizeof(ABP_Eggman_Physics_C_MachineItemHoldBlendRight) == 0x000030, "Wrong size on ABP_Eggman_Physics_C_MachineItemHoldBlendRight");
static_assert(offsetof(ABP_Eggman_Physics_C_MachineItemHoldBlendRight, BasePose) == 0x000000, "Member 'ABP_Eggman_Physics_C_MachineItemHoldBlendRight::BasePose' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_MachineItemHoldBlendRight, LeftHoldPose) == 0x000010, "Member 'ABP_Eggman_Physics_C_MachineItemHoldBlendRight::LeftHoldPose' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_MachineItemHoldBlendRight, MachineItemHoldBlendRight_0) == 0x000020, "Member 'ABP_Eggman_Physics_C_MachineItemHoldBlendRight::MachineItemHoldBlendRight_0' has a wrong offset!");

// Function ABP_Eggman_Physics.ABP_Eggman_Physics_C.MenuFacialOverride
// 0x0048 (0x0048 - 0x0000)
struct ABP_Eggman_Physics_C_MenuFacialOverride final
{
public:
	struct FPoseLink                              MenuFinalPose;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          InPlayingMontage;                                  // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              MenuDefaltFace;                                    // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MenuOverrideFace;                                  // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MenuFacialOverride_0;                              // 0x0038(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Eggman_Physics_C_MenuFacialOverride) == 0x000008, "Wrong alignment on ABP_Eggman_Physics_C_MenuFacialOverride");
static_assert(sizeof(ABP_Eggman_Physics_C_MenuFacialOverride) == 0x000048, "Wrong size on ABP_Eggman_Physics_C_MenuFacialOverride");
static_assert(offsetof(ABP_Eggman_Physics_C_MenuFacialOverride, MenuFinalPose) == 0x000000, "Member 'ABP_Eggman_Physics_C_MenuFacialOverride::MenuFinalPose' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_MenuFacialOverride, InPlayingMontage) == 0x000010, "Member 'ABP_Eggman_Physics_C_MenuFacialOverride::InPlayingMontage' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_MenuFacialOverride, MenuDefaltFace) == 0x000018, "Member 'ABP_Eggman_Physics_C_MenuFacialOverride::MenuDefaltFace' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_MenuFacialOverride, MenuOverrideFace) == 0x000028, "Member 'ABP_Eggman_Physics_C_MenuFacialOverride::MenuOverrideFace' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_MenuFacialOverride, MenuFacialOverride_0) == 0x000038, "Member 'ABP_Eggman_Physics_C_MenuFacialOverride::MenuFacialOverride_0' has a wrong offset!");

// Function ABP_Eggman_Physics.ABP_Eggman_Physics_C.ScaleFaceLayer
// 0x0028 (0x0028 - 0x0000)
struct ABP_Eggman_Physics_C_ScaleFaceLayer final
{
public:
	struct FPoseLink                              InFaceOverride;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          bPlayMontage;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoneScaleFaceType                            InStateMachineFaceType;                            // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoneScaleFaceType                            InMontageFaceType;                                 // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              ScaleFaceLayer_0;                                  // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Eggman_Physics_C_ScaleFaceLayer) == 0x000008, "Wrong alignment on ABP_Eggman_Physics_C_ScaleFaceLayer");
static_assert(sizeof(ABP_Eggman_Physics_C_ScaleFaceLayer) == 0x000028, "Wrong size on ABP_Eggman_Physics_C_ScaleFaceLayer");
static_assert(offsetof(ABP_Eggman_Physics_C_ScaleFaceLayer, InFaceOverride) == 0x000000, "Member 'ABP_Eggman_Physics_C_ScaleFaceLayer::InFaceOverride' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_ScaleFaceLayer, bPlayMontage) == 0x000010, "Member 'ABP_Eggman_Physics_C_ScaleFaceLayer::bPlayMontage' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_ScaleFaceLayer, InStateMachineFaceType) == 0x000011, "Member 'ABP_Eggman_Physics_C_ScaleFaceLayer::InStateMachineFaceType' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_ScaleFaceLayer, InMontageFaceType) == 0x000012, "Member 'ABP_Eggman_Physics_C_ScaleFaceLayer::InMontageFaceType' has a wrong offset!");
static_assert(offsetof(ABP_Eggman_Physics_C_ScaleFaceLayer, ScaleFaceLayer_0) == 0x000018, "Member 'ABP_Eggman_Physics_C_ScaleFaceLayer::ScaleFaceLayer_0' has a wrong offset!");

}

