#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HoldPackageRing

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_HoldPackageRing.ABP_HoldPackageRing_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_HoldPackageRing_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_HoldPackageRing_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_HoldPackageRing_C_AnimGraph");
static_assert(sizeof(ABP_HoldPackageRing_C_AnimGraph) == 0x000010, "Wrong size on ABP_HoldPackageRing_C_AnimGraph");
static_assert(offsetof(ABP_HoldPackageRing_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_HoldPackageRing_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_HoldPackageRing.ABP_HoldPackageRing_C.ExecuteUbergraph_ABP_HoldPackageRing
// 0x0018 (0x0018 - 0x0000)
struct ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsed_ReturnValue;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsed_ReturnValue_1;                     // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing) == 0x000008, "Wrong alignment on ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing");
static_assert(sizeof(ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing) == 0x000018, "Wrong size on ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing");
static_assert(offsetof(ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing, EntryPoint) == 0x000000, "Member 'ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing, CallFunc_IsUsed_ReturnValue) == 0x000008, "Member 'ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing::CallFunc_IsUsed_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000009, "Member 'ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing, CallFunc_IsUsed_ReturnValue_1) == 0x00000A, "Member 'ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing::CallFunc_IsUsed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'ABP_HoldPackageRing_C_ExecuteUbergraph_ABP_HoldPackageRing::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

