#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ItemDarkChaoHero

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_ItemDarkChaoHero.ABP_ItemDarkChaoHero_C.AnimBlueprintGeneratedConstantData
// 0x0127 (0x0128 - 0x0001)
struct ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1;                                // 0x0008(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_2;                                  // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3;                                  // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0038(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B8(0x0040)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x00F8(0x0030)()
};
static_assert(alignof(ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData) == 0x000128, "Wrong size on ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData, __StructProperty_1) == 0x000008, "Member 'ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData::__StructProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData, __NameProperty_2) == 0x000028, "Member 'ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData::__NameProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData, __NameProperty_3) == 0x000030, "Member 'ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData::__NameProperty_3' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000038, "Member 'ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B8, "Member 'ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000F8, "Member 'ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");

// ScriptStruct ABP_ItemDarkChaoHero.ABP_ItemDarkChaoHero_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on ABP_ItemDarkChaoHero::FAnimBlueprintGeneratedMutableData");

}

