#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Eggpawn_Physics

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "ControlRig_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Eggpawn_Physics.ABP_Eggpawn_Physics_C
// 0x1020 (0x1390 - 0x0370)
class UABP_Eggpawn_Physics_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x0388(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x03A8(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0460(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x0518(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x05D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x05F0(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x06A8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x0760(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x0780(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x0838(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x08F0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x0910(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x09C8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x0A80(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x0AA0(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x0B58(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0C10(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0C30(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0CE8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0D08(0x00B8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0DC0(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1290(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x12B0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1368(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_Eggpawn_Physics(int32 EntryPoint);
	void HoverboardControlRogLayer(const struct FPoseLink& HoverboardPose, struct FPoseLink* HoverboardControlRogLayer_0);
	void KawaiiPhysicsLayer(const struct FPoseLink& InPose, struct FPoseLink* KawaiiPhysicsLayer_0);
	void ScaleFaceLayer(const struct FPoseLink& InFaceOverride, bool bPlayMontage, EBoneScaleFaceType InStateMachineFaceType, EBoneScaleFaceType InMontageFaceType, struct FPoseLink* ScaleFaceLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Eggpawn_Physics_C">();
	}
	static class UABP_Eggpawn_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Eggpawn_Physics_C>();
	}
};
static_assert(alignof(UABP_Eggpawn_Physics_C) == 0x000010, "Wrong alignment on UABP_Eggpawn_Physics_C");
static_assert(sizeof(UABP_Eggpawn_Physics_C) == 0x001390, "Wrong size on UABP_Eggpawn_Physics_C");
static_assert(offsetof(UABP_Eggpawn_Physics_C, UberGraphFrame) == 0x000370, "Member 'UABP_Eggpawn_Physics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_Eggpawn_Physics_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_Eggpawn_Physics_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_Root_8) == 0x000388, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_13) == 0x0003A8, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_12) == 0x000460, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_11) == 0x000518, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_Root_7) == 0x0005D0, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_10) == 0x0005F0, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_9) == 0x0006A8, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_Root_6) == 0x000760, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_8) == 0x000780, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_7) == 0x000838, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_Root_5) == 0x0008F0, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_6) == 0x000910, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_5) == 0x0009C8, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_Root_4) == 0x000A80, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_4) == 0x000AA0, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_3) == 0x000B58, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_Root_3) == 0x000C10, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_2) == 0x000C30, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_Root_2) == 0x000CE8, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose_1) == 0x000D08, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_ControlRig) == 0x000DC0, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_Root_1) == 0x001290, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_LinkedInputPose) == 0x0012B0, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Eggpawn_Physics_C, AnimGraphNode_Root) == 0x001368, "Member 'UABP_Eggpawn_Physics_C::AnimGraphNode_Root' has a wrong offset!");

}

