#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MonsterTruck_SmallCockpit

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_MonsterTruck_SmallCockpit.ABP_MonsterTruck_SmallCockpit_C.AnimBlueprintGeneratedConstantData
// 0x075F (0x0760 - 0x0001)
struct ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_183;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_184;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_185;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_186;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_187;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_188;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_189;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_190;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_191;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_192;                              // 0x003C(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_193;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_194;                                 // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_195;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_196;                                 // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_197;                               // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_198;                                // 0x0084(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_199;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_200;                                // 0x008C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_201;                                // 0x008D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_202;                                // 0x008E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_203;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_204;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_205;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_206;                                 // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_207;                              // 0x00B0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0150(0x0040)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;            // 0x01C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;            // 0x01F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;             // 0x0220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;             // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;             // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;             // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;             // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;             // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x03D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x0400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;                  // 0x0430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x0460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;                  // 0x0490(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_2;             // 0x04C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                  // 0x04F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0520(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x0550(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0580(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x05B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;             // 0x05E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0610(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;               // 0x0640(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0670(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x06A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig_1;                   // 0x06D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0700(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                     // 0x0730(0x0030)()
};
static_assert(alignof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData) == 0x000760, "Wrong size on ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __NameProperty_183) == 0x000004, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__NameProperty_183' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __NameProperty_184) == 0x00000C, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__NameProperty_184' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __IntProperty_185) == 0x000014, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__IntProperty_185' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __NameProperty_186) == 0x000018, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__NameProperty_186' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __IntProperty_187) == 0x000020, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__IntProperty_187' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __NameProperty_188) == 0x000024, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__NameProperty_188' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __IntProperty_189) == 0x00002C, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__IntProperty_189' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __NameProperty_190) == 0x000030, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__NameProperty_190' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __IntProperty_191) == 0x000038, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__IntProperty_191' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __StructProperty_192) == 0x00003C, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__StructProperty_192' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __NameProperty_193) == 0x000068, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__NameProperty_193' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __IntProperty_194) == 0x000070, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__IntProperty_194' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __NameProperty_195) == 0x000074, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__NameProperty_195' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __IntProperty_196) == 0x00007C, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__IntProperty_196' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __FloatProperty_197) == 0x000080, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__FloatProperty_197' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __BoolProperty_198) == 0x000084, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__BoolProperty_198' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __FloatProperty_199) == 0x000088, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__FloatProperty_199' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __BoolProperty_200) == 0x00008C, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__BoolProperty_200' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __EnumProperty_201) == 0x00008D, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__EnumProperty_201' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __ByteProperty_202) == 0x00008E, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__ByteProperty_202' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __NameProperty_203) == 0x000090, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__NameProperty_203' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __NameProperty_204) == 0x000098, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__NameProperty_204' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __NameProperty_205) == 0x0000A0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__NameProperty_205' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __IntProperty_206) == 0x0000A8, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__IntProperty_206' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, __StructProperty_207) == 0x0000B0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::__StructProperty_207' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000150, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000190, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_11) == 0x0001C0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_10) == 0x0001F0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_9) == 0x000220, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_8) == 0x000250, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_7) == 0x000280, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_6) == 0x0002B0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x0002E0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x000310, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000340, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000370, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x0003A0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0003D0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000400, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_6) == 0x000430, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000460, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_5) == 0x000490, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_2) == 0x0004C0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_4) == 0x0004F0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000520, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000550, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000580, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x0005B0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_1) == 0x0005E0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000610, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x000640, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000670, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x0006A0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig_1) == 0x0006D0, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig_1' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000700, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x000730, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");

// ScriptStruct ABP_MonsterTruck_SmallCockpit.ABP_MonsterTruck_SmallCockpit_C.AnimBlueprintGeneratedMutableData
// 0x0017 (0x0018 - 0x0001)
struct ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData) == 0x000018, "Wrong size on ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'ABP_MonsterTruck_SmallCockpit::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");

}

