#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ItemVioletVoid

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_ItemVioletVoid.ABP_ItemVioletVoid_C.AnimBlueprintGeneratedConstantData
// 0x0407 (0x0408 - 0x0001)
struct ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_89;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_90;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_91;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_92;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_93;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_94;                                 // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_95;                                 // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_96;                                  // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_97;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_98;                               // 0x0038(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_99;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_100;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_101;                                // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_102;                                // 0x006A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_103;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_104;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_105;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_106;                                 // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_107;                              // 0x0088(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0040)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0168(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x0198(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x01C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x01F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0228(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x0258(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x0288(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x02B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x02E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0318(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0348(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0378(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x03A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x03D8(0x0030)()
};
static_assert(alignof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData) == 0x000408, "Wrong size on ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __NameProperty_89) == 0x000004, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__NameProperty_89' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __NameProperty_90) == 0x00000C, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__NameProperty_90' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __IntProperty_91) == 0x000014, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__IntProperty_91' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __NameProperty_92) == 0x000018, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__NameProperty_92' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __IntProperty_93) == 0x000020, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__IntProperty_93' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __BoolProperty_94) == 0x000024, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__BoolProperty_94' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __NameProperty_95) == 0x000028, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__NameProperty_95' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __IntProperty_96) == 0x000030, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__IntProperty_96' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __FloatProperty_97) == 0x000034, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__FloatProperty_97' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __StructProperty_98) == 0x000038, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__StructProperty_98' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __FloatProperty_99) == 0x000064, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__FloatProperty_99' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __BoolProperty_100) == 0x000068, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__BoolProperty_100' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __EnumProperty_101) == 0x000069, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__EnumProperty_101' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __ByteProperty_102) == 0x00006A, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__ByteProperty_102' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __NameProperty_103) == 0x00006C, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__NameProperty_103' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __NameProperty_104) == 0x000074, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__NameProperty_104' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __NameProperty_105) == 0x00007C, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__NameProperty_105' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __IntProperty_106) == 0x000084, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__IntProperty_106' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, __StructProperty_107) == 0x000088, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::__StructProperty_107' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000168, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000198, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x0001C8, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x0001F8, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000228, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000258, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000288, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x0002B8, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x0002E8, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000318, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000348, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000378, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0003A8, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x0003D8, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

// ScriptStruct ABP_ItemVioletVoid.ABP_ItemVioletVoid_C.AnimBlueprintGeneratedMutableData
// 0x000F (0x0010 - 0x0001)
struct ABP_ItemVioletVoid::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_ItemVioletVoid::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedMutableData) == 0x000010, "Wrong size on ABP_ItemVioletVoid::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_ItemVioletVoid::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'ABP_ItemVioletVoid::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");

}

