#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPT_Menu_CockpitBase

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABPT_Menu_CockpitBase.ABPT_Menu_CockpitBase_C
// 0x0170 (0x0650 - 0x04E0)
class UABPT_Menu_CockpitBase_C : public UMachineAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04E8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04F0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0518(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0560(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0580(0x00C8)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABPT_Menu_CockpitBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABPT_Menu_CockpitBase_C">();
	}
	static class UABPT_Menu_CockpitBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABPT_Menu_CockpitBase_C>();
	}
};
static_assert(alignof(UABPT_Menu_CockpitBase_C) == 0x000010, "Wrong alignment on UABPT_Menu_CockpitBase_C");
static_assert(sizeof(UABPT_Menu_CockpitBase_C) == 0x000650, "Wrong size on UABPT_Menu_CockpitBase_C");
static_assert(offsetof(UABPT_Menu_CockpitBase_C, UberGraphFrame) == 0x0004E0, "Member 'UABPT_Menu_CockpitBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABPT_Menu_CockpitBase_C, AnimBlueprintExtension_PropertyAccess) == 0x0004E8, "Member 'UABPT_Menu_CockpitBase_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABPT_Menu_CockpitBase_C, AnimBlueprintExtension_Base) == 0x0004F0, "Member 'UABPT_Menu_CockpitBase_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABPT_Menu_CockpitBase_C, AnimGraphNode_Root) == 0x0004F8, "Member 'UABPT_Menu_CockpitBase_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABPT_Menu_CockpitBase_C, AnimGraphNode_SequencePlayer) == 0x000518, "Member 'UABPT_Menu_CockpitBase_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABPT_Menu_CockpitBase_C, AnimGraphNode_StateResult) == 0x000560, "Member 'UABPT_Menu_CockpitBase_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABPT_Menu_CockpitBase_C, AnimGraphNode_StateMachine) == 0x000580, "Member 'UABPT_Menu_CockpitBase_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

