#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPT_CockpitBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABPT_CockpitBase.ABPT_CockpitBase_C.AnimBlueprintGeneratedConstantData
// 0x1E47 (0x1E48 - 0x0001)
struct ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_866;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_867;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_868;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_869;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_870;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_871;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_872;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_873;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_874;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_875;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_876;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_877;                                 // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_878;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_879;                                 // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_880;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_881;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_882;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_883;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_884;                                 // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_885;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_886;                                 // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_887;                                // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_888;                                // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_889;                                 // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_890;                                // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_891;                                 // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_892;                                // 0x00B4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_893;                                 // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_894;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_895;                                 // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_896;                               // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_897;                              // 0x00D0(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_898;                               // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_899;                                // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_900;                                // 0x0101(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_901;                                // 0x0104(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_902;                                // 0x010C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_903;                                // 0x0114(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_904;                                 // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_905;                                // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_906;                                  // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_907;                                // 0x0130(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_908;                                // 0x0131(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_909;                                // 0x0132(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_910;                               // 0x0138(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_911;                              // 0x0148(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0168(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01E8(0x0040)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                         // 0x0228(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_3;                   // 0x0258(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0288(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x02B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;                   // 0x02E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                   // 0x0318(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                     // 0x0348(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                // 0x0378(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x03A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_61;            // 0x03D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_60;            // 0x0408(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_59;            // 0x0438(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_58;            // 0x0468(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_57;            // 0x0498(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_56;            // 0x04C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_55;            // 0x04F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_54;            // 0x0528(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_53;            // 0x0558(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_52;            // 0x0588(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_51;            // 0x05B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_50;            // 0x05E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_49;            // 0x0618(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_48;            // 0x0648(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_47;            // 0x0678(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_46;            // 0x06A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_45;            // 0x06D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_44;            // 0x0708(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_43;            // 0x0738(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_42;            // 0x0768(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_41;            // 0x0798(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_40;            // 0x07C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_39;            // 0x07F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_38;            // 0x0828(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_37;            // 0x0858(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_36;            // 0x0888(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_35;            // 0x08B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_34;            // 0x08E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_33;            // 0x0918(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend;                    // 0x0948(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_7;             // 0x0978(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_6;             // 0x09A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_29;                 // 0x09D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_32;            // 0x0A08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_31;            // 0x0A38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_30;            // 0x0A68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_29;            // 0x0A98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_28;            // 0x0AC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_27;            // 0x0AF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_26;            // 0x0B28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_25;            // 0x0B58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;              // 0x0B88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_28;                 // 0x0BB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;              // 0x0BE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_27;                 // 0x0C18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;              // 0x0C48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_26;                 // 0x0C78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;              // 0x0CA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_25;                 // 0x0CD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpaceEvaluator;            // 0x0D08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_24;                 // 0x0D38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_6;                 // 0x0D68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_23;                 // 0x0D98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_24;            // 0x0DC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_23;            // 0x0DF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_22;            // 0x0E28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_21;            // 0x0E58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_20;            // 0x0E88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_19;            // 0x0EB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;              // 0x0EE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_22;                 // 0x0F18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;              // 0x0F48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_21;                 // 0x0F78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;               // 0x0FA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_20;                 // 0x0FD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_5;                 // 0x1008(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_19;                 // 0x1038(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_18;            // 0x1068(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_4;                 // 0x1098(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_18;                 // 0x10C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_17;            // 0x10F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_16;            // 0x1128(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;            // 0x1158(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;            // 0x1188(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;            // 0x11B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;            // 0x11E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;            // 0x1218(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;            // 0x1248(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;             // 0x1278(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_5;             // 0x12A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_17;                 // 0x12D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_4;             // 0x1308(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_16;                 // 0x1338(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_3;             // 0x1368(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_15;                 // 0x1398(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;             // 0x13C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_3;                 // 0x13F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_14;                 // 0x1428(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;             // 0x1458(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;             // 0x1488(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;             // 0x14B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;               // 0x14E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_13;                 // 0x1518(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;               // 0x1548(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_12;                 // 0x1578(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;               // 0x15A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_11;                 // 0x15D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;             // 0x1608(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_2;                 // 0x1638(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_10;                 // 0x1668(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x1698(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x16C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x16F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_2;             // 0x1728(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;                  // 0x1758(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;             // 0x1788(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;                  // 0x17B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;               // 0x17E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;                  // 0x1818(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x1848(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;                 // 0x1878(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;                  // 0x18A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;               // 0x18D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;                  // 0x1908(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;               // 0x1938(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                  // 0x1968(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x1998(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x19C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x19F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x1A28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x1A58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x1A88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x1AB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x1AE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x1B18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                         // 0x1B48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig_1;                   // 0x1B78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                         // 0x1BA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                     // 0x1BD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                // 0x1C08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;               // 0x1C38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x1C68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x1C98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;               // 0x1CC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                // 0x1CF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                // 0x1D28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x1D58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x1D88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer;                // 0x1DB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x1DE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x1E18(0x0030)()
};
static_assert(alignof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData) == 0x001E48, "Wrong size on ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_866) == 0x000004, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_866' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_867) == 0x00000C, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_867' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_868) == 0x000014, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_868' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_869) == 0x00001C, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_869' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_870) == 0x000024, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_870' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_871) == 0x00002C, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_871' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_872) == 0x000034, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_872' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_873) == 0x00003C, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_873' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_874) == 0x000044, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_874' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __IntProperty_875) == 0x00004C, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__IntProperty_875' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_876) == 0x000050, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_876' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __IntProperty_877) == 0x000058, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__IntProperty_877' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_878) == 0x00005C, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_878' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __IntProperty_879) == 0x000064, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__IntProperty_879' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_880) == 0x000068, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_880' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_881) == 0x000070, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_881' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_882) == 0x000078, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_882' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_883) == 0x000080, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_883' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __IntProperty_884) == 0x000088, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__IntProperty_884' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_885) == 0x00008C, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_885' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __IntProperty_886) == 0x000094, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__IntProperty_886' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __BoolProperty_887) == 0x000098, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__BoolProperty_887' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_888) == 0x00009C, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_888' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __IntProperty_889) == 0x0000A4, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__IntProperty_889' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_890) == 0x0000A8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_890' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __IntProperty_891) == 0x0000B0, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__IntProperty_891' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_892) == 0x0000B4, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_892' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __IntProperty_893) == 0x0000BC, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__IntProperty_893' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_894) == 0x0000C0, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_894' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __IntProperty_895) == 0x0000C8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__IntProperty_895' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __FloatProperty_896) == 0x0000CC, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__FloatProperty_896' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __StructProperty_897) == 0x0000D0, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__StructProperty_897' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __FloatProperty_898) == 0x0000FC, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__FloatProperty_898' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_899) == 0x000100, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_899' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __ByteProperty_900) == 0x000101, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__ByteProperty_900' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_901) == 0x000104, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_901' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_902) == 0x00010C, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_902' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __NameProperty_903) == 0x000114, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__NameProperty_903' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __IntProperty_904) == 0x00011C, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__IntProperty_904' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __BlendProfile_905) == 0x000120, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__BlendProfile_905' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __CurveFloat_906) == 0x000128, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__CurveFloat_906' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __BoolProperty_907) == 0x000130, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__BoolProperty_907' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_908) == 0x000131, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_908' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_909) == 0x000132, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_909' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __ArrayProperty_910) == 0x000138, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__ArrayProperty_910' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, __StructProperty_911) == 0x000148, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::__StructProperty_911' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000168, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001E8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_1) == 0x000228, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_3) == 0x000258, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000288, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x0002B8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_2) == 0x0002E8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_1) == 0x000318, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x000348, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000378, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0003A8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_61) == 0x0003D8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_61' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_60) == 0x000408, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_60' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_59) == 0x000438, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_59' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_58) == 0x000468, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_58' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_57) == 0x000498, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_57' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_56) == 0x0004C8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_56' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_55) == 0x0004F8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_55' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_54) == 0x000528, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_54' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_53) == 0x000558, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_53' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_52) == 0x000588, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_52' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_51) == 0x0005B8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_51' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_50) == 0x0005E8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_50' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_49) == 0x000618, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_49' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_48) == 0x000648, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_48' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_47) == 0x000678, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_47' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_46) == 0x0006A8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_46' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_45) == 0x0006D8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_45' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_44) == 0x000708, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_44' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_43) == 0x000738, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_43' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_42) == 0x000768, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_42' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_41) == 0x000798, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_41' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_40) == 0x0007C8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_40' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_39) == 0x0007F8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_39' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_38) == 0x000828, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_38' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_37) == 0x000858, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_37' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_36) == 0x000888, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_36' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_35) == 0x0008B8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_35' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_34) == 0x0008E8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_34' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_33) == 0x000918, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_33' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TwoWayBlend) == 0x000948, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_7) == 0x000978, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_7' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_6) == 0x0009A8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_6' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_29) == 0x0009D8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_29' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_32) == 0x000A08, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_32' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_31) == 0x000A38, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_31' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_30) == 0x000A68, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_30' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_29) == 0x000A98, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_29' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_28) == 0x000AC8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_28' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_27) == 0x000AF8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_27' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_26) == 0x000B28, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_26' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_25) == 0x000B58, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_25' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_15) == 0x000B88, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_28) == 0x000BB8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_28' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_14) == 0x000BE8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_27) == 0x000C18, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_27' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_13) == 0x000C48, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_26) == 0x000C78, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_26' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_12) == 0x000CA8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_25) == 0x000CD8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_25' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpaceEvaluator) == 0x000D08, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpaceEvaluator' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_24) == 0x000D38, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_24' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_6) == 0x000D68, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_6' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_23) == 0x000D98, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_23' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_24) == 0x000DC8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_24' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_23) == 0x000DF8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_23' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_22) == 0x000E28, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_22' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_21) == 0x000E58, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_21' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_20) == 0x000E88, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_20' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_19) == 0x000EB8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_19' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_11) == 0x000EE8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_22) == 0x000F18, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_22' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_10) == 0x000F48, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_21) == 0x000F78, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_21' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_9) == 0x000FA8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_20) == 0x000FD8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_20' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_5) == 0x001008, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_5' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_19) == 0x001038, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_19' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_18) == 0x001068, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_18' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_4) == 0x001098, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_4' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_18) == 0x0010C8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_18' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_17) == 0x0010F8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_17' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_16) == 0x001128, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_15) == 0x001158, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_14) == 0x001188, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_13) == 0x0011B8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_12) == 0x0011E8, "Member 'ABPT_CockpitBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_12' has a wrong offset!");
