#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_Cubot

#include "Basic.hpp"


namespace SDK::Params
{

// Function AC_Cubot.AC_Cubot_C.ExecuteUbergraph_AC_Cubot
// 0x0020 (0x0020 - 0x0000)
struct AC_Cubot_C_ExecuteUbergraph_AC_Cubot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_DialogueCharacter_C*               K2Node_DynamicCast_AsABP_Dialogue_Character;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_Cubot_C_ExecuteUbergraph_AC_Cubot) == 0x000008, "Wrong alignment on AC_Cubot_C_ExecuteUbergraph_AC_Cubot");
static_assert(sizeof(AC_Cubot_C_ExecuteUbergraph_AC_Cubot) == 0x000020, "Wrong size on AC_Cubot_C_ExecuteUbergraph_AC_Cubot");
static_assert(offsetof(AC_Cubot_C_ExecuteUbergraph_AC_Cubot, EntryPoint) == 0x000000, "Member 'AC_Cubot_C_ExecuteUbergraph_AC_Cubot::EntryPoint' has a wrong offset!");
static_assert(offsetof(AC_Cubot_C_ExecuteUbergraph_AC_Cubot, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'AC_Cubot_C_ExecuteUbergraph_AC_Cubot::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AC_Cubot_C_ExecuteUbergraph_AC_Cubot, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'AC_Cubot_C_ExecuteUbergraph_AC_Cubot::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_Cubot_C_ExecuteUbergraph_AC_Cubot, K2Node_DynamicCast_AsABP_Dialogue_Character) == 0x000010, "Member 'AC_Cubot_C_ExecuteUbergraph_AC_Cubot::K2Node_DynamicCast_AsABP_Dialogue_Character' has a wrong offset!");
static_assert(offsetof(AC_Cubot_C_ExecuteUbergraph_AC_Cubot, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AC_Cubot_C_ExecuteUbergraph_AC_Cubot::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AC_Cubot.AC_Cubot_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AC_Cubot_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_Cubot_C_ReceiveTick) == 0x000004, "Wrong alignment on AC_Cubot_C_ReceiveTick");
static_assert(sizeof(AC_Cubot_C_ReceiveTick) == 0x000004, "Wrong size on AC_Cubot_C_ReceiveTick");
static_assert(offsetof(AC_Cubot_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'AC_Cubot_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

