#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_DialogueEventDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_DialogueEventDisplay.AC_DialogueEventDisplay_C
// 0x0078 (0x0308 - 0x0290)
class AAC_DialogueEventDisplay_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDisplayWidgetComponent_C*              DisplayWidgetComponent;                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeltalMesh;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_MonitorFrame;                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Static_Mesh;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UDodonpaEventDisplayWidget*             Widget;                                            // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          IsFirstCalledAnim;                                 // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnAnimationEnd;                                    // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnCommandWaitEnd;                                  // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UABP_Display_C*                         AnimBP;                                            // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UUserWidget>                WidgetClass_Festa;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWidgetAnimation*                       CurrentAnim;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimationEnd();
	void Event_AnimationEnd();
	void ExecuteUbergraph_AC_DialogueEventDisplay(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Set_Widget(class FName WidgetID);
	void SetFestaInfo(class UTexture2D* Texture);
	void StartDisplayAnim(class FName AnimationName);
	void StartDisplayAnimByName(class FName AnimationName);
	void StartMotion(class FName MotionName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AC_DialogueEventDisplay_C">();
	}
	static class AAC_DialogueEventDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAC_DialogueEventDisplay_C>();
	}
};
static_assert(alignof(AAC_DialogueEventDisplay_C) == 0x000008, "Wrong alignment on AAC_DialogueEventDisplay_C");
static_assert(sizeof(AAC_DialogueEventDisplay_C) == 0x000308, "Wrong size on AAC_DialogueEventDisplay_C");
static_assert(offsetof(AAC_DialogueEventDisplay_C, UberGraphFrame) == 0x000290, "Member 'AAC_DialogueEventDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAC_DialogueEventDisplay_C, DisplayWidgetComponent) == 0x000298, "Member 'AAC_DialogueEventDisplay_C::DisplayWidgetComponent' has a wrong offset!");
static_assert(offsetof(AAC_DialogueEventDisplay_C, SkeltalMesh) == 0x0002A0, "Member 'AAC_DialogueEventDisplay_C::SkeltalMesh' has a wrong offset!");
static_assert(offsetof(AAC_DialogueEventDisplay_C, Scene) == 0x0002A8, "Member 'AAC_DialogueEventDisplay_C::Scene' has a wrong offset!");
static_assert(offsetof(AAC_DialogueEventDisplay_C, StaticMesh_MonitorFrame) == 0x0002B0, "Member 'AAC_DialogueEventDisplay_C::StaticMesh_MonitorFrame' has a wrong offset!");
static_assert(offsetof(AAC_DialogueEventDisplay_C, Static_Mesh) == 0x0002B8, "Member 'AAC_DialogueEventDisplay_C::Static_Mesh' has a wrong offset!");
static_assert(offsetof(AAC_DialogueEventDisplay_C, Widget) == 0x0002C0, "Member 'AAC_DialogueEventDisplay_C::Widget' has a wrong offset!");
static_assert(offsetof(AAC_DialogueEventDisplay_C, IsFirstCalledAnim) == 0x0002C8, "Member 'AAC_DialogueEventDisplay_C::IsFirstCalledAnim' has a wrong offset!");
static_assert(offsetof(AAC_DialogueEventDisplay_C, OnAnimationEnd) == 0x0002D0, "Member 'AAC_DialogueEventDisplay_C::OnAnimationEnd' has a wrong offset!");
static_assert(offsetof(AAC_DialogueEventDisplay_C, OnCommandWaitEnd) == 0x0002E0, "Member 'AAC_DialogueEventDisplay_C::OnCommandWaitEnd' has a wrong offset!");
static_assert(offsetof(AAC_DialogueEventDisplay_C, AnimBP) == 0x0002F0, "Member 'AAC_DialogueEventDisplay_C::AnimBP' has a wrong offset!");
static_assert(offsetof(AAC_DialogueEventDisplay_C, WidgetClass_Festa) == 0x0002F8, "Member 'AAC_DialogueEventDisplay_C::WidgetClass_Festa' has a wrong offset!");
static_assert(offsetof(AAC_DialogueEventDisplay_C, CurrentAnim) == 0x000300, "Member 'AAC_DialogueEventDisplay_C::CurrentAnim' has a wrong offset!");

}

