#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_DialogueEventDisplay

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AC_DialogueEventDisplay.AC_DialogueEventDisplay_C.ExecuteUbergraph_AC_DialogueEventDisplay
// 0x0290 (0x0290 - 0x0000)
struct AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_DeprojectScreenToWorld_WorldPosition;     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_DeprojectScreenToWorld_WorldDirection;    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeprojectScreenToWorld_ReturnValue;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Display_C*                         K2Node_DynamicCast_AsABP_Display;                  // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_Texture;                        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_AnimationName;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0120(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGrandPrixDisplayWidgetFile            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0228(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDodonpaEventDisplayWidget*             K2Node_DynamicCast_AsDodonpa_Event_Display_Widget; // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_PlayAnimationByName_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0258(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0268(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_EventTip_Festa_Monitor_Festa_C*    K2Node_DynamicCast_AsWBP_Event_Tip_Festa_Monitor_Festa; // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay) == 0x000008, "Wrong alignment on AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay");
static_assert(sizeof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay) == 0x000290, "Wrong size on AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, EntryPoint) == 0x000000, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_GetViewportSize_ReturnValue) == 0x000010, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000028, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_DeprojectScreenToWorld_WorldPosition) == 0x000038, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_DeprojectScreenToWorld_WorldPosition' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_DeprojectScreenToWorld_WorldDirection) == 0x000050, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_DeprojectScreenToWorld_WorldDirection' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_DeprojectScreenToWorld_ReturnValue) == 0x000068, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_DeprojectScreenToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000070, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_GetCameraLocation_ReturnValue) == 0x000078, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, K2Node_Event_DeltaSeconds) == 0x000090, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_GetAnimInstance_ReturnValue) == 0x000098, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, K2Node_DynamicCast_AsABP_Display) == 0x0000A0, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::K2Node_DynamicCast_AsABP_Display' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, K2Node_CustomEvent_Texture) == 0x0000B0, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000B8, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000D0, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E8, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, K2Node_CustomEvent_AnimationName) == 0x000100, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::K2Node_CustomEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_FindLookAtRotation_ReturnValue) == 0x000108, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000120, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x000218, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_GetWidget_ReturnValue) == 0x000220, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_GetDataTableRowFromName_OutRow) == 0x000228, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000238, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, K2Node_DynamicCast_AsDodonpa_Event_Display_Widget) == 0x000240, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::K2Node_DynamicCast_AsDodonpa_Event_Display_Widget' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, K2Node_DynamicCast_bSuccess_1) == 0x000248, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_PlayAnimationByName_ReturnValue) == 0x000250, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, K2Node_CreateDelegate_OutputDelegate) == 0x000258, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, K2Node_CreateDelegate_OutputDelegate_1) == 0x000268, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, CallFunc_ObjectIsA_ReturnValue) == 0x000278, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, K2Node_DynamicCast_AsWBP_Event_Tip_Festa_Monitor_Festa) == 0x000280, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::K2Node_DynamicCast_AsWBP_Event_Tip_Festa_Monitor_Festa' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay, K2Node_DynamicCast_bSuccess_2) == 0x000288, "Member 'AC_DialogueEventDisplay_C_ExecuteUbergraph_AC_DialogueEventDisplay::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function AC_DialogueEventDisplay.AC_DialogueEventDisplay_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AC_DialogueEventDisplay_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_DialogueEventDisplay_C_ReceiveTick) == 0x000004, "Wrong alignment on AC_DialogueEventDisplay_C_ReceiveTick");
static_assert(sizeof(AC_DialogueEventDisplay_C_ReceiveTick) == 0x000004, "Wrong size on AC_DialogueEventDisplay_C_ReceiveTick");
static_assert(offsetof(AC_DialogueEventDisplay_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'AC_DialogueEventDisplay_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function AC_DialogueEventDisplay.AC_DialogueEventDisplay_C.Set Widget
// 0x0040 (0x0040 - 0x0000)
struct AC_DialogueEventDisplay_C_Set_Widget final
{
public:
	class FName                                   WidgetID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGrandPrixDisplayWidgetFile            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDodonpaEventDisplayWidget*             K2Node_DynamicCast_AsDodonpa_Event_Display_Widget; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_DialogueEventDisplay_C_Set_Widget) == 0x000008, "Wrong alignment on AC_DialogueEventDisplay_C_Set_Widget");
static_assert(sizeof(AC_DialogueEventDisplay_C_Set_Widget) == 0x000040, "Wrong size on AC_DialogueEventDisplay_C_Set_Widget");
static_assert(offsetof(AC_DialogueEventDisplay_C_Set_Widget, WidgetID) == 0x000000, "Member 'AC_DialogueEventDisplay_C_Set_Widget::WidgetID' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_Set_Widget, CallFunc_NotEqual_NameName_ReturnValue) == 0x000008, "Member 'AC_DialogueEventDisplay_C_Set_Widget::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_Set_Widget, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'AC_DialogueEventDisplay_C_Set_Widget::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_Set_Widget, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000020, "Member 'AC_DialogueEventDisplay_C_Set_Widget::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_Set_Widget, CallFunc_Create_ReturnValue) == 0x000028, "Member 'AC_DialogueEventDisplay_C_Set_Widget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_Set_Widget, K2Node_DynamicCast_AsDodonpa_Event_Display_Widget) == 0x000030, "Member 'AC_DialogueEventDisplay_C_Set_Widget::K2Node_DynamicCast_AsDodonpa_Event_Display_Widget' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_Set_Widget, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AC_DialogueEventDisplay_C_Set_Widget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AC_DialogueEventDisplay.AC_DialogueEventDisplay_C.SetFestaInfo
// 0x0008 (0x0008 - 0x0000)
struct AC_DialogueEventDisplay_C_SetFestaInfo final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_DialogueEventDisplay_C_SetFestaInfo) == 0x000008, "Wrong alignment on AC_DialogueEventDisplay_C_SetFestaInfo");
static_assert(sizeof(AC_DialogueEventDisplay_C_SetFestaInfo) == 0x000008, "Wrong size on AC_DialogueEventDisplay_C_SetFestaInfo");
static_assert(offsetof(AC_DialogueEventDisplay_C_SetFestaInfo, Texture) == 0x000000, "Member 'AC_DialogueEventDisplay_C_SetFestaInfo::Texture' has a wrong offset!");

// Function AC_DialogueEventDisplay.AC_DialogueEventDisplay_C.StartDisplayAnim
// 0x0008 (0x0008 - 0x0000)
struct AC_DialogueEventDisplay_C_StartDisplayAnim final
{
public:
	class FName                                   AnimationName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_DialogueEventDisplay_C_StartDisplayAnim) == 0x000004, "Wrong alignment on AC_DialogueEventDisplay_C_StartDisplayAnim");
static_assert(sizeof(AC_DialogueEventDisplay_C_StartDisplayAnim) == 0x000008, "Wrong size on AC_DialogueEventDisplay_C_StartDisplayAnim");
static_assert(offsetof(AC_DialogueEventDisplay_C_StartDisplayAnim, AnimationName) == 0x000000, "Member 'AC_DialogueEventDisplay_C_StartDisplayAnim::AnimationName' has a wrong offset!");

// Function AC_DialogueEventDisplay.AC_DialogueEventDisplay_C.StartDisplayAnimByName
// 0x0040 (0x0040 - 0x0000)
struct AC_DialogueEventDisplay_C_StartDisplayAnimByName final
{
public:
	class FName                                   AnimationName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDodonpaEventDisplayWidget*             K2Node_DynamicCast_AsDodonpa_Event_Display_Widget; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_PlayAnimationByName_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AC_DialogueEventDisplay_C_StartDisplayAnimByName) == 0x000008, "Wrong alignment on AC_DialogueEventDisplay_C_StartDisplayAnimByName");
static_assert(sizeof(AC_DialogueEventDisplay_C_StartDisplayAnimByName) == 0x000040, "Wrong size on AC_DialogueEventDisplay_C_StartDisplayAnimByName");
static_assert(offsetof(AC_DialogueEventDisplay_C_StartDisplayAnimByName, AnimationName) == 0x000000, "Member 'AC_DialogueEventDisplay_C_StartDisplayAnimByName::AnimationName' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_StartDisplayAnimByName, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'AC_DialogueEventDisplay_C_StartDisplayAnimByName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_StartDisplayAnimByName, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'AC_DialogueEventDisplay_C_StartDisplayAnimByName::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_StartDisplayAnimByName, CallFunc_GetWidget_ReturnValue) == 0x000020, "Member 'AC_DialogueEventDisplay_C_StartDisplayAnimByName::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_StartDisplayAnimByName, K2Node_DynamicCast_AsDodonpa_Event_Display_Widget) == 0x000028, "Member 'AC_DialogueEventDisplay_C_StartDisplayAnimByName::K2Node_DynamicCast_AsDodonpa_Event_Display_Widget' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_StartDisplayAnimByName, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AC_DialogueEventDisplay_C_StartDisplayAnimByName::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_StartDisplayAnimByName, CallFunc_PlayAnimationByName_ReturnValue) == 0x000038, "Member 'AC_DialogueEventDisplay_C_StartDisplayAnimByName::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");

// Function AC_DialogueEventDisplay.AC_DialogueEventDisplay_C.StartMotion
// 0x0088 (0x0088 - 0x0000)
struct AC_DialogueEventDisplay_C_StartMotion final
{
public:
	class FName                                   MotionName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0008(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0010)()
};
static_assert(alignof(AC_DialogueEventDisplay_C_StartMotion) == 0x000008, "Wrong alignment on AC_DialogueEventDisplay_C_StartMotion");
static_assert(sizeof(AC_DialogueEventDisplay_C_StartMotion) == 0x000088, "Wrong size on AC_DialogueEventDisplay_C_StartMotion");
static_assert(offsetof(AC_DialogueEventDisplay_C_StartMotion, MotionName) == 0x000000, "Member 'AC_DialogueEventDisplay_C_StartMotion::MotionName' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_StartMotion, CallFunc_Conv_NameToText_ReturnValue) == 0x000008, "Member 'AC_DialogueEventDisplay_C_StartMotion::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_DialogueEventDisplay_C_StartMotion, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'AC_DialogueEventDisplay_C_StartMotion::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
