#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharaMachineSequence

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionLib_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_RacerTransformOffset_structs.hpp"
#include "UnionRun_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.BndEvt__BP_CharaMachineSequence_BPC_CharaSelectState_K2Node_ComponentBoundEvent_2_OnBackStateDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_CharaSelectState_K2Node_ComponentBoundEvent_2_OnBackStateDelegate__DelegateSignature final
{
public:
	EMenuSequenceSubState                         State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_CharaSelectState_K2Node_ComponentBoundEvent_2_OnBackStateDelegate__DelegateSignature) == 0x000001, "Wrong alignment on BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_CharaSelectState_K2Node_ComponentBoundEvent_2_OnBackStateDelegate__DelegateSignature");
static_assert(sizeof(BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_CharaSelectState_K2Node_ComponentBoundEvent_2_OnBackStateDelegate__DelegateSignature) == 0x000001, "Wrong size on BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_CharaSelectState_K2Node_ComponentBoundEvent_2_OnBackStateDelegate__DelegateSignature");
static_assert(offsetof(BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_CharaSelectState_K2Node_ComponentBoundEvent_2_OnBackStateDelegate__DelegateSignature, State) == 0x000000, "Member 'BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_CharaSelectState_K2Node_ComponentBoundEvent_2_OnBackStateDelegate__DelegateSignature::State' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.BndEvt__BP_CharaMachineSequence_BPC_MachineState_K2Node_ComponentBoundEvent_3_OnBackStateDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_MachineState_K2Node_ComponentBoundEvent_3_OnBackStateDelegate__DelegateSignature final
{
public:
	EMenuSequenceSubState                         State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_MachineState_K2Node_ComponentBoundEvent_3_OnBackStateDelegate__DelegateSignature) == 0x000001, "Wrong alignment on BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_MachineState_K2Node_ComponentBoundEvent_3_OnBackStateDelegate__DelegateSignature");
static_assert(sizeof(BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_MachineState_K2Node_ComponentBoundEvent_3_OnBackStateDelegate__DelegateSignature) == 0x000001, "Wrong size on BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_MachineState_K2Node_ComponentBoundEvent_3_OnBackStateDelegate__DelegateSignature");
static_assert(offsetof(BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_MachineState_K2Node_ComponentBoundEvent_3_OnBackStateDelegate__DelegateSignature, State) == 0x000000, "Member 'BP_CharaMachineSequence_C_BndEvt__BP_CharaMachineSequence_BPC_MachineState_K2Node_ComponentBoundEvent_3_OnBackStateDelegate__DelegateSignature::State' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.CustomEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_CharaMachineSequence_C_CustomEvent final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_CustomEvent) == 0x000001, "Wrong alignment on BP_CharaMachineSequence_C_CustomEvent");
static_assert(sizeof(BP_CharaMachineSequence_C_CustomEvent) == 0x000001, "Wrong size on BP_CharaMachineSequence_C_CustomEvent");
static_assert(offsetof(BP_CharaMachineSequence_C_CustomEvent, FadeDirection) == 0x000000, "Member 'BP_CharaMachineSequence_C_CustomEvent::FadeDirection' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.ExecuteUbergraph_BP_CharaMachineSequence
// 0x01A0 (0x01A0 - 0x0000)
struct BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppSequenceLogManagerSubsystem*        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AMenuRacerBase*>                 CallFunc_GetMenuRacers_ReturnValue;                // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAppSequenceLogManagerSubsystem*        CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMenuRacerBase*                         CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 PlayerControllerIndex, ECarStatusType machineType, EMachineId MachineId)> K2Node_CreateDelegate_OutputDelegate; // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerControllerIndex, ECarStatusType machineType, EMachineId MachineId)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, UNION::EMachineSelectMode Mode)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, EMachineId FrontPartsId, EMachineId RearPartsId, EMachineId TirePartsId)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, EMachineId FrontPartsId, EMachineId RearPartsId, EMachineId TirePartsId)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_ComponentBoundEvent_State_1;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_ComponentBoundEvent_State;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PlayerControllerIndex_1;        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                K2Node_CustomEvent_MachineType_1;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    K2Node_CustomEvent_MachineID_1;                    // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PlayerControllerIndex;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                K2Node_CustomEvent_MachineType;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    K2Node_CustomEvent_MachineID;                      // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate_5;     // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerIndex_2;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    K2Node_CustomEvent_FrontPartsId_1;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    K2Node_CustomEvent_RearPartsId_1;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    K2Node_CustomEvent_TirePartsId_1;                  // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PlayerIndex_1;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    K2Node_CustomEvent_FrontPartsId;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    K2Node_CustomEvent_RearPartsId;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    K2Node_CustomEvent_TirePartsId;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PlayerIndex;                    // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UNION::EMachineSelectMode                     K2Node_CustomEvent_Mode;                           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GrandPrixSequence_C*                K2Node_DynamicCast_AsBP_Grand_Prix_Sequence;       // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue_1;             // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PartyRaceMenuSequence_C*            K2Node_DynamicCast_AsBP_Party_Race_Menu_Sequence;  // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuSequenceUIInterface> CallFunc_SetNextSubMenuSequenceState_self_CastInput; // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuSequenceUIInterface> CallFunc_SetNextSubMenuSequenceState_self_CastInput_1; // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         K2Node_CustomEvent_FadeDirection;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue_2;             // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_TimeTrialSequence_C*                K2Node_DynamicCast_AsBP_Time_Trial_Sequence;       // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuSequenceUIInterface> CallFunc_SetNextSubMenuSequenceState_self_CastInput_2; // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelLoaded_ReturnValue;                // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_3;          // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsParentSequenceReady_ReturnValue;        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence) == 0x000008, "Wrong alignment on BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence");
static_assert(sizeof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence) == 0x0001A0, "Wrong size on BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, EntryPoint) == 0x000000, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000010, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_GetMenuRacers_ReturnValue) == 0x000018, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_GetMenuRacers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CreateDelegate_OutputDelegate_2) == 0x000064, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CreateDelegate_OutputDelegate_3) == 0x000074, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CreateDelegate_OutputDelegate_4) == 0x000084, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_ComponentBoundEvent_State_1) == 0x000094, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_ComponentBoundEvent_State_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_ComponentBoundEvent_State) == 0x000095, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_ComponentBoundEvent_State' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_PlayerControllerIndex_1) == 0x000098, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_PlayerControllerIndex_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_MachineType_1) == 0x00009C, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_MachineType_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_MachineID_1) == 0x00009D, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_MachineID_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_PlayerControllerIndex) == 0x0000A0, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_MachineType) == 0x0000A4, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_MachineType' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_MachineID) == 0x0000A5, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_MachineID' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, Temp_int_Loop_Counter_Variable) == 0x0000A8, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000AC, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_Less_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_Add_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_PlayerIndex_2) == 0x0000C4, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_PlayerIndex_2' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_FrontPartsId_1) == 0x0000C8, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_FrontPartsId_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_RearPartsId_1) == 0x0000C9, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_RearPartsId_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_TirePartsId_1) == 0x0000CA, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_TirePartsId_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_PlayerIndex_1) == 0x0000CC, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_PlayerIndex_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_FrontPartsId) == 0x0000D0, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_FrontPartsId' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_RearPartsId) == 0x0000D1, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_RearPartsId' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_TirePartsId) == 0x0000D2, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_TirePartsId' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_PlayerIndex) == 0x0000D4, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_Mode) == 0x0000D8, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_Mode' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_GetParentActor_ReturnValue) == 0x0000E0, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_DynamicCast_AsBP_Grand_Prix_Sequence) == 0x0000E8, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_DynamicCast_AsBP_Grand_Prix_Sequence' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_GetParentActor_ReturnValue_1) == 0x0000F8, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_GetParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_DynamicCast_AsBP_Party_Race_Menu_Sequence) == 0x000100, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_DynamicCast_AsBP_Party_Race_Menu_Sequence' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_SetNextSubMenuSequenceState_self_CastInput) == 0x000110, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_SetNextSubMenuSequenceState_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000120, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_SetNextSubMenuSequenceState_self_CastInput_1) == 0x000128, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_SetNextSubMenuSequenceState_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000138, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CustomEvent_FadeDirection) == 0x000140, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CustomEvent_FadeDirection' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_CreateDelegate_OutputDelegate_6) == 0x000144, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_GetParentActor_ReturnValue_2) == 0x000158, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_GetParentActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_DynamicCast_AsBP_Time_Trial_Sequence) == 0x000160, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_DynamicCast_AsBP_Time_Trial_Sequence' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, K2Node_DynamicCast_bSuccess_2) == 0x000168, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_SetNextSubMenuSequenceState_self_CastInput_2) == 0x000170, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_SetNextSubMenuSequenceState_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_IsLevelLoaded_ReturnValue) == 0x000180, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_IsLevelLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_GetWorldSubsystem_ReturnValue_2) == 0x000188, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_GetWorldSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_GetWorldSubsystem_ReturnValue_3) == 0x000190, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_GetWorldSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence, CallFunc_IsParentSequenceReady_ReturnValue) == 0x000198, "Member 'BP_CharaMachineSequence_C_ExecuteUbergraph_BP_CharaMachineSequence::CallFunc_IsParentSequenceReady_ReturnValue' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.FinalizeMessageBar
// 0x0001 (0x0001 - 0x0000)
struct BP_CharaMachineSequence_C_FinalizeMessageBar final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_FinalizeMessageBar) == 0x000001, "Wrong alignment on BP_CharaMachineSequence_C_FinalizeMessageBar");
static_assert(sizeof(BP_CharaMachineSequence_C_FinalizeMessageBar) == 0x000001, "Wrong size on BP_CharaMachineSequence_C_FinalizeMessageBar");
static_assert(offsetof(BP_CharaMachineSequence_C_FinalizeMessageBar, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_CharaMachineSequence_C_FinalizeMessageBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.HideLoadingDisplayWidget
// 0x0010 (0x0010 - 0x0000)
struct BP_CharaMachineSequence_C_HideLoadingDisplayWidget final
{
public:
	class UUnionUILoadingDisplay*                 InLoadingDisplayWidget;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_HideLoadingDisplayWidget) == 0x000008, "Wrong alignment on BP_CharaMachineSequence_C_HideLoadingDisplayWidget");
static_assert(sizeof(BP_CharaMachineSequence_C_HideLoadingDisplayWidget) == 0x000010, "Wrong size on BP_CharaMachineSequence_C_HideLoadingDisplayWidget");
static_assert(offsetof(BP_CharaMachineSequence_C_HideLoadingDisplayWidget, InLoadingDisplayWidget) == 0x000000, "Member 'BP_CharaMachineSequence_C_HideLoadingDisplayWidget::InLoadingDisplayWidget' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_HideLoadingDisplayWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_CharaMachineSequence_C_HideLoadingDisplayWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.InitializeSelectedPlayerCharacterIndex
// 0x001C (0x001C - 0x0000)
struct BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex final
{
public:
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex) == 0x000004, "Wrong alignment on BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex");
static_assert(sizeof(BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex) == 0x00001C, "Wrong size on BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex");
static_assert(offsetof(BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex, CallFunc_MakeLiteralInt_ReturnValue) == 0x000000, "Member 'BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex, CallFunc_Array_Add_ReturnValue) == 0x000004, "Member 'BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex, Temp_int_Variable) == 0x000008, "Member 'BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x00000C, "Member 'BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_CharaMachineSequence_C_InitializeSelectedPlayerCharacterIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.MachineState_OnMachinePartsFocus
// 0x0008 (0x0008 - 0x0000)
struct BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    FrontPartsId;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    RearPartsId;                                       // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    TirePartsId;                                       // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus) == 0x000004, "Wrong alignment on BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus");
static_assert(sizeof(BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus) == 0x000008, "Wrong size on BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus, PlayerIndex) == 0x000000, "Member 'BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus, FrontPartsId) == 0x000004, "Member 'BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus::FrontPartsId' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus, RearPartsId) == 0x000005, "Member 'BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus::RearPartsId' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus, TirePartsId) == 0x000006, "Member 'BP_CharaMachineSequence_C_MachineState_OnMachinePartsFocus::TirePartsId' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.MachineState_OnMachinePartsSelect
// 0x0008 (0x0008 - 0x0000)
struct BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    FrontPartsId;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    RearPartsId;                                       // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    TirePartsId;                                       // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect) == 0x000004, "Wrong alignment on BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect");
static_assert(sizeof(BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect) == 0x000008, "Wrong size on BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect, PlayerIndex) == 0x000000, "Member 'BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect, FrontPartsId) == 0x000004, "Member 'BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect::FrontPartsId' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect, RearPartsId) == 0x000005, "Member 'BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect::RearPartsId' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect, TirePartsId) == 0x000006, "Member 'BP_CharaMachineSequence_C_MachineState_OnMachinePartsSelect::TirePartsId' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.MachineState_OnMachineSelectModeChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_CharaMachineSequence_C_MachineState_OnMachineSelectModeChanged final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UNION::EMachineSelectMode                     Mode;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_MachineState_OnMachineSelectModeChanged) == 0x000004, "Wrong alignment on BP_CharaMachineSequence_C_MachineState_OnMachineSelectModeChanged");
static_assert(sizeof(BP_CharaMachineSequence_C_MachineState_OnMachineSelectModeChanged) == 0x000008, "Wrong size on BP_CharaMachineSequence_C_MachineState_OnMachineSelectModeChanged");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineState_OnMachineSelectModeChanged, PlayerIndex) == 0x000000, "Member 'BP_CharaMachineSequence_C_MachineState_OnMachineSelectModeChanged::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineState_OnMachineSelectModeChanged, Mode) == 0x000004, "Member 'BP_CharaMachineSequence_C_MachineState_OnMachineSelectModeChanged::Mode' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.MachineTypeDecide_Event
// 0x0008 (0x0008 - 0x0000)
struct BP_CharaMachineSequence_C_MachineTypeDecide_Event final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                machineType;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    MachineId;                                         // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_MachineTypeDecide_Event) == 0x000004, "Wrong alignment on BP_CharaMachineSequence_C_MachineTypeDecide_Event");
static_assert(sizeof(BP_CharaMachineSequence_C_MachineTypeDecide_Event) == 0x000008, "Wrong size on BP_CharaMachineSequence_C_MachineTypeDecide_Event");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineTypeDecide_Event, PlayerControllerIndex) == 0x000000, "Member 'BP_CharaMachineSequence_C_MachineTypeDecide_Event::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineTypeDecide_Event, machineType) == 0x000004, "Member 'BP_CharaMachineSequence_C_MachineTypeDecide_Event::machineType' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineTypeDecide_Event, MachineId) == 0x000005, "Member 'BP_CharaMachineSequence_C_MachineTypeDecide_Event::MachineId' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.MachineTypeScrollStart_Event
// 0x0008 (0x0008 - 0x0000)
struct BP_CharaMachineSequence_C_MachineTypeScrollStart_Event final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                machineType;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    MachineId;                                         // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_MachineTypeScrollStart_Event) == 0x000004, "Wrong alignment on BP_CharaMachineSequence_C_MachineTypeScrollStart_Event");
static_assert(sizeof(BP_CharaMachineSequence_C_MachineTypeScrollStart_Event) == 0x000008, "Wrong size on BP_CharaMachineSequence_C_MachineTypeScrollStart_Event");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineTypeScrollStart_Event, PlayerControllerIndex) == 0x000000, "Member 'BP_CharaMachineSequence_C_MachineTypeScrollStart_Event::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineTypeScrollStart_Event, machineType) == 0x000004, "Member 'BP_CharaMachineSequence_C_MachineTypeScrollStart_Event::machineType' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_MachineTypeScrollStart_Event, MachineId) == 0x000005, "Member 'BP_CharaMachineSequence_C_MachineTypeScrollStart_Event::MachineId' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.OnDecideCharaIcon
// 0x0028 (0x0028 - 0x0000)
struct BP_CharaMachineSequence_C_OnDecideCharaIcon final
{
public:
	int32                                         InPlayerControllerIndex;                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCharaIndex;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     DriverId;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CharaIndex;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetDriverIdByCharaSelectIndex_ReturnValue; // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetupParamWindow_InCorrectionVal_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_OnDecideCharaIcon) == 0x000008, "Wrong alignment on BP_CharaMachineSequence_C_OnDecideCharaIcon");
static_assert(sizeof(BP_CharaMachineSequence_C_OnDecideCharaIcon) == 0x000028, "Wrong size on BP_CharaMachineSequence_C_OnDecideCharaIcon");
static_assert(offsetof(BP_CharaMachineSequence_C_OnDecideCharaIcon, InPlayerControllerIndex) == 0x000000, "Member 'BP_CharaMachineSequence_C_OnDecideCharaIcon::InPlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnDecideCharaIcon, InCharaIndex) == 0x000004, "Member 'BP_CharaMachineSequence_C_OnDecideCharaIcon::InCharaIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnDecideCharaIcon, DriverId) == 0x000008, "Member 'BP_CharaMachineSequence_C_OnDecideCharaIcon::DriverId' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnDecideCharaIcon, CharaIndex) == 0x00000C, "Member 'BP_CharaMachineSequence_C_OnDecideCharaIcon::CharaIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnDecideCharaIcon, PlayerIndex) == 0x000010, "Member 'BP_CharaMachineSequence_C_OnDecideCharaIcon::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnDecideCharaIcon, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000018, "Member 'BP_CharaMachineSequence_C_OnDecideCharaIcon::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnDecideCharaIcon, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000020, "Member 'BP_CharaMachineSequence_C_OnDecideCharaIcon::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnDecideCharaIcon, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'BP_CharaMachineSequence_C_OnDecideCharaIcon::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnDecideCharaIcon, CallFunc_GetDriverIdByCharaSelectIndex_ReturnValue) == 0x000022, "Member 'BP_CharaMachineSequence_C_OnDecideCharaIcon::CallFunc_GetDriverIdByCharaSelectIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnDecideCharaIcon, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000023, "Member 'BP_CharaMachineSequence_C_OnDecideCharaIcon::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnDecideCharaIcon, CallFunc_SetupParamWindow_InCorrectionVal_ImplicitCast) == 0x000024, "Member 'BP_CharaMachineSequence_C_OnDecideCharaIcon::CallFunc_SetupParamWindow_InCorrectionVal_ImplicitCast' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.OnFocusCharaIcon
// 0x000C (0x000C - 0x0000)
struct BP_CharaMachineSequence_C_OnFocusCharaIcon final
{
public:
	int32                                         InPlayerControllerIndex;                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCharaIndex;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetDriverIdByCharaSelectIndex_ReturnValue; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_OnFocusCharaIcon) == 0x000004, "Wrong alignment on BP_CharaMachineSequence_C_OnFocusCharaIcon");
static_assert(sizeof(BP_CharaMachineSequence_C_OnFocusCharaIcon) == 0x00000C, "Wrong size on BP_CharaMachineSequence_C_OnFocusCharaIcon");
static_assert(offsetof(BP_CharaMachineSequence_C_OnFocusCharaIcon, InPlayerControllerIndex) == 0x000000, "Member 'BP_CharaMachineSequence_C_OnFocusCharaIcon::InPlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnFocusCharaIcon, InCharaIndex) == 0x000004, "Member 'BP_CharaMachineSequence_C_OnFocusCharaIcon::InCharaIndex' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnFocusCharaIcon, CallFunc_GetDriverIdByCharaSelectIndex_ReturnValue) == 0x000008, "Member 'BP_CharaMachineSequence_C_OnFocusCharaIcon::CallFunc_GetDriverIdByCharaSelectIndex_ReturnValue' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.OnSetRacerDriver
// 0x0020 (0x0020 - 0x0000)
struct BP_CharaMachineSequence_C_OnSetRacerDriver final
{
public:
	class AMenuRacerBase*                         InRacer;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     InDriverId;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MenuRacerPreview_C*                 K2Node_DynamicCast_AsBP_Menu_Racer_Preview;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_OnSetRacerDriver) == 0x000008, "Wrong alignment on BP_CharaMachineSequence_C_OnSetRacerDriver");
static_assert(sizeof(BP_CharaMachineSequence_C_OnSetRacerDriver) == 0x000020, "Wrong size on BP_CharaMachineSequence_C_OnSetRacerDriver");
static_assert(offsetof(BP_CharaMachineSequence_C_OnSetRacerDriver, InRacer) == 0x000000, "Member 'BP_CharaMachineSequence_C_OnSetRacerDriver::InRacer' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnSetRacerDriver, InDriverId) == 0x000008, "Member 'BP_CharaMachineSequence_C_OnSetRacerDriver::InDriverId' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnSetRacerDriver, K2Node_DynamicCast_AsBP_Menu_Racer_Preview) == 0x000010, "Member 'BP_CharaMachineSequence_C_OnSetRacerDriver::K2Node_DynamicCast_AsBP_Menu_Racer_Preview' has a wrong offset!");
static_assert(offsetof(BP_CharaMachineSequence_C_OnSetRacerDriver, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CharaMachineSequence_C_OnSetRacerDriver::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_CharaMachineSequence.BP_CharaMachineSequence_C.OnSetRacerMachineCustomData
// 0x0090 (0x0090 - 0x0000)
struct BP_CharaMachineSequence_C_OnSetRacerMachineCustomData final
{
public:
	class AMenuRacerBase*                         InRacer;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUserMachineCustomizeData              InData;                                            // 0x0008(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	class ABP_MenuRacerPreview_C*                 K2Node_DynamicCast_AsBP_Menu_Racer_Preview;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaMachineSequence_C_OnSetRacerMachineCustomData) == 0x000008, "Wrong alignment on BP_CharaMachineSequence_C_OnSetRacerMachineCustomData");
static_assert(sizeof(BP_CharaMachineSequence_C_OnSetRacerMachineCustomData) == 0x000090, "Wrong size on BP_CharaMachineSequence_C_OnSetRacerMachineCustomData");
