#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntryRival

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"
#include "LevelSequence_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EntryRival.BP_EntryRival_C
// 0x0040 (0x0378 - 0x0338)
class ABP_EntryRival_C final : public ALevelSequenceActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FMovieSceneObjectBindingID             RacerBindingId;                                    // 0x0340(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnFinishedPlay;                                    // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_RaceBefore_RivalRacer_C*           UI;                                                // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          StartSE;                                           // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_FeaturedRacer_SequencePlayer_K2Node_ComponentBoundEvent_0_OnMovieSceneSequencePlayerEvent__DelegateSignature();
	void ExecuteUbergraph_BP_EntryRival(int32 EntryPoint);
	void OnDestroyed_Event(class AActor* DestroyedActor);
	void Play(const struct FTransform& In_Transform, int32 In_RacerIndex);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EntryRival_C">();
	}
	static class ABP_EntryRival_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EntryRival_C>();
	}
};
static_assert(alignof(ABP_EntryRival_C) == 0x000008, "Wrong alignment on ABP_EntryRival_C");
static_assert(sizeof(ABP_EntryRival_C) == 0x000378, "Wrong size on ABP_EntryRival_C");
static_assert(offsetof(ABP_EntryRival_C, UberGraphFrame) == 0x000338, "Member 'ABP_EntryRival_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EntryRival_C, RacerBindingId) == 0x000340, "Member 'ABP_EntryRival_C::RacerBindingId' has a wrong offset!");
static_assert(offsetof(ABP_EntryRival_C, OnFinishedPlay) == 0x000358, "Member 'ABP_EntryRival_C::OnFinishedPlay' has a wrong offset!");
static_assert(offsetof(ABP_EntryRival_C, UI) == 0x000368, "Member 'ABP_EntryRival_C::UI' has a wrong offset!");
static_assert(offsetof(ABP_EntryRival_C, StartSE) == 0x000370, "Member 'ABP_EntryRival_C::StartSE' has a wrong offset!");

}

