#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventInfoManageActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_EventInfoManageActor.BP_EventInfoManageActor_C.ExecuteUbergraph_BP_EventInfoManageActor
// 0x0040 (0x0040 - 0x0000)
struct BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_StatusInfo_CMN_Window_C*           K2Node_DynamicCast_AsWBP_Status_Info_CMN_Window;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor) == 0x000008, "Wrong alignment on BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor");
static_assert(sizeof(BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor) == 0x000040, "Wrong size on BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor");
static_assert(offsetof(BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor, EntryPoint) == 0x000000, "Member 'BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor, K2Node_DynamicCast_AsWBP_Status_Info_CMN_Window) == 0x000018, "Member 'BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor::K2Node_DynamicCast_AsWBP_Status_Info_CMN_Window' has a wrong offset!");
static_assert(offsetof(BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000030, "Member 'BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor, CallFunc_UnregisterSingleSubMenu_ReturnValue) == 0x000039, "Member 'BP_EventInfoManageActor_C_ExecuteUbergraph_BP_EventInfoManageActor::CallFunc_UnregisterSingleSubMenu_ReturnValue' has a wrong offset!");

}

