#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EntryRacers

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "LevelSequence_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EntryRacers.BP_EntryRacers_C
// 0x0148 (0x0480 - 0x0338)
class ABP_EntryRacers_C final : public ALevelSequenceActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FMovieSceneObjectBindingID>     RingIdArray;                                       // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMovieSceneObjectBindingID>     CarIdArray;                                        // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMovieSceneObjectBindingID>     DriverIdArray;                                     // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMovieSceneObjectBindingID             CameraId;                                          // 0x0370(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            RingForLoad;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnFinishedPlay;                                    // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_SceneDriver_C*                      TempSceneDriver;                                   // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     ParentIdArray;                                     // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                         ParentActors;                                      // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         RingActors;                                        // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FMovieSceneObjectBindingID             MainRingId;                                        // 0x03D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneObjectBindingID             MainCarId;                                         // 0x03F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneObjectBindingID             MainDriverId;                                      // 0x0408(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneObjectBindingID             MainParent;                                        // 0x0420(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneObjectBindingID             Root;                                              // 0x0438(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_RaceBefore_VoltageMaxInfo_C*       VoltageMax;                                        // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bGroupRaceRule;                                    // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinishedUI;                                      // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UObject*>                        DriverAnimationAssets;                             // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__BP_EntryAllRacers_SequencePlayer_K2Node_ComponentBoundEvent_0_OnMovieSceneSequencePlayerEvent__DelegateSignature();
	void CalcCameraOffset(const struct FTransform& In_Transform, struct FTransform* Out_Transform);
	void Clear();
	void ExecuteUbergraph_BP_EntryRacers(int32 EntryPoint);
	void Play(int32 In_RacerCount, TArray<class AActor*>& In_Actors, TArray<struct FTransform>& In_Transforms, const struct FTransform& In_BaseTransform, int32 In_MainRacerIndex, TArray<class ASceneDriver*>& In_SceneDrivers, EStageId In_StageId);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RemoveMCEvent();
	void StartRuleWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EntryRacers_C">();
	}
	static class ABP_EntryRacers_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EntryRacers_C>();
	}
};
static_assert(alignof(ABP_EntryRacers_C) == 0x000008, "Wrong alignment on ABP_EntryRacers_C");
static_assert(sizeof(ABP_EntryRacers_C) == 0x000480, "Wrong size on ABP_EntryRacers_C");
static_assert(offsetof(ABP_EntryRacers_C, UberGraphFrame) == 0x000338, "Member 'ABP_EntryRacers_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, RingIdArray) == 0x000340, "Member 'ABP_EntryRacers_C::RingIdArray' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, CarIdArray) == 0x000350, "Member 'ABP_EntryRacers_C::CarIdArray' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, DriverIdArray) == 0x000360, "Member 'ABP_EntryRacers_C::DriverIdArray' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, CameraId) == 0x000370, "Member 'ABP_EntryRacers_C::CameraId' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, RingForLoad) == 0x000388, "Member 'ABP_EntryRacers_C::RingForLoad' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, OnFinishedPlay) == 0x000390, "Member 'ABP_EntryRacers_C::OnFinishedPlay' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, TempSceneDriver) == 0x0003A0, "Member 'ABP_EntryRacers_C::TempSceneDriver' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, ParentIdArray) == 0x0003A8, "Member 'ABP_EntryRacers_C::ParentIdArray' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, ParentActors) == 0x0003B8, "Member 'ABP_EntryRacers_C::ParentActors' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, RingActors) == 0x0003C8, "Member 'ABP_EntryRacers_C::RingActors' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, MainRingId) == 0x0003D8, "Member 'ABP_EntryRacers_C::MainRingId' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, MainCarId) == 0x0003F0, "Member 'ABP_EntryRacers_C::MainCarId' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, MainDriverId) == 0x000408, "Member 'ABP_EntryRacers_C::MainDriverId' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, MainParent) == 0x000420, "Member 'ABP_EntryRacers_C::MainParent' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, Root) == 0x000438, "Member 'ABP_EntryRacers_C::Root' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, VoltageMax) == 0x000450, "Member 'ABP_EntryRacers_C::VoltageMax' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, bGroupRaceRule) == 0x000458, "Member 'ABP_EntryRacers_C::bGroupRaceRule' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, OnFinishedUI) == 0x000460, "Member 'ABP_EntryRacers_C::OnFinishedUI' has a wrong offset!");
static_assert(offsetof(ABP_EntryRacers_C, DriverAnimationAssets) == 0x000470, "Member 'ABP_EntryRacers_C::DriverAnimationAssets' has a wrong offset!");

}

