#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventBG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EventBG.BP_EventBG_C.ExecuteUbergraph_BP_EventBG
// 0x0148 (0x0148 - 0x0000)
struct BP_EventBG_C_ExecuteUbergraph_BP_EventBG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0048(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventBG_C_ExecuteUbergraph_BP_EventBG) == 0x000008, "Wrong alignment on BP_EventBG_C_ExecuteUbergraph_BP_EventBG");
static_assert(sizeof(BP_EventBG_C_ExecuteUbergraph_BP_EventBG) == 0x000148, "Wrong size on BP_EventBG_C_ExecuteUbergraph_BP_EventBG");
static_assert(offsetof(BP_EventBG_C_ExecuteUbergraph_BP_EventBG, EntryPoint) == 0x000000, "Member 'BP_EventBG_C_ExecuteUbergraph_BP_EventBG::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventBG_C_ExecuteUbergraph_BP_EventBG, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_EventBG_C_ExecuteUbergraph_BP_EventBG::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EventBG_C_ExecuteUbergraph_BP_EventBG, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'BP_EventBG_C_ExecuteUbergraph_BP_EventBG::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBG_C_ExecuteUbergraph_BP_EventBG, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_EventBG_C_ExecuteUbergraph_BP_EventBG::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBG_C_ExecuteUbergraph_BP_EventBG, CallFunc_GetCameraLocation_ReturnValue) == 0x000018, "Member 'BP_EventBG_C_ExecuteUbergraph_BP_EventBG::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBG_C_ExecuteUbergraph_BP_EventBG, CallFunc_GetCameraRotation_ReturnValue) == 0x000030, "Member 'BP_EventBG_C_ExecuteUbergraph_BP_EventBG::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventBG_C_ExecuteUbergraph_BP_EventBG, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000048, "Member 'BP_EventBG_C_ExecuteUbergraph_BP_EventBG::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EventBG_C_ExecuteUbergraph_BP_EventBG, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x000140, "Member 'BP_EventBG_C_ExecuteUbergraph_BP_EventBG::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");

// Function BP_EventBG.BP_EventBG_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EventBG_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventBG_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EventBG_C_ReceiveTick");
static_assert(sizeof(BP_EventBG_C_ReceiveTick) == 0x000004, "Wrong size on BP_EventBG_C_ReceiveTick");
static_assert(offsetof(BP_EventBG_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EventBG_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EventBG.BP_EventBG_C.SetBackGroundPlaneVisible
// 0x0002 (0x0002 - 0x0000)
struct BP_EventBG_C_SetBackGroundPlaneVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventBG_C_SetBackGroundPlaneVisible) == 0x000001, "Wrong alignment on BP_EventBG_C_SetBackGroundPlaneVisible");
static_assert(sizeof(BP_EventBG_C_SetBackGroundPlaneVisible) == 0x000002, "Wrong size on BP_EventBG_C_SetBackGroundPlaneVisible");
static_assert(offsetof(BP_EventBG_C_SetBackGroundPlaneVisible, bVisible) == 0x000000, "Member 'BP_EventBG_C_SetBackGroundPlaneVisible::bVisible' has a wrong offset!");
static_assert(offsetof(BP_EventBG_C_SetBackGroundPlaneVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_EventBG_C_SetBackGroundPlaneVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_EventBG.BP_EventBG_C.SetImagePanelInfo
// 0x0010 (0x0010 - 0x0000)
struct BP_EventBG_C_SetImagePanelInfo final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisible;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventBG_C_SetImagePanelInfo) == 0x000008, "Wrong alignment on BP_EventBG_C_SetImagePanelInfo");
static_assert(sizeof(BP_EventBG_C_SetImagePanelInfo) == 0x000010, "Wrong size on BP_EventBG_C_SetImagePanelInfo");
static_assert(offsetof(BP_EventBG_C_SetImagePanelInfo, Texture) == 0x000000, "Member 'BP_EventBG_C_SetImagePanelInfo::Texture' has a wrong offset!");
static_assert(offsetof(BP_EventBG_C_SetImagePanelInfo, bVisible) == 0x000008, "Member 'BP_EventBG_C_SetImagePanelInfo::bVisible' has a wrong offset!");
static_assert(offsetof(BP_EventBG_C_SetImagePanelInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_EventBG_C_SetImagePanelInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

