#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventInfoManageActor

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventInfoManageActor.BP_EventInfoManageActor_C
// 0x0020 (0x02D8 - 0x02B8)
class ABP_EventInfoManageActor_C final : public AEventInfoManageActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              CloseEvent;                                        // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_EventInfoManageActor(int32 EntryPoint);
	void ForceClose();
	void OnClosed();
	void Open();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventInfoManageActor_C">();
	}
	static class ABP_EventInfoManageActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventInfoManageActor_C>();
	}
};
static_assert(alignof(ABP_EventInfoManageActor_C) == 0x000008, "Wrong alignment on ABP_EventInfoManageActor_C");
static_assert(sizeof(ABP_EventInfoManageActor_C) == 0x0002D8, "Wrong size on ABP_EventInfoManageActor_C");
static_assert(offsetof(ABP_EventInfoManageActor_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_EventInfoManageActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EventInfoManageActor_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_EventInfoManageActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EventInfoManageActor_C, CloseEvent) == 0x0002C8, "Member 'ABP_EventInfoManageActor_C::CloseEvent' has a wrong offset!");

}

