#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FeaturedRacer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionLib_structs.hpp"


namespace SDK::Params
{

// Function BP_FeaturedRacer.BP_FeaturedRacer_C.ExecuteUbergraph_BP_FeaturedRacer
// 0x0008 (0x0008 - 0x0000)
struct BP_FeaturedRacer_C_ExecuteUbergraph_BP_FeaturedRacer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedRacer_C_ExecuteUbergraph_BP_FeaturedRacer) == 0x000004, "Wrong alignment on BP_FeaturedRacer_C_ExecuteUbergraph_BP_FeaturedRacer");
static_assert(sizeof(BP_FeaturedRacer_C_ExecuteUbergraph_BP_FeaturedRacer) == 0x000008, "Wrong size on BP_FeaturedRacer_C_ExecuteUbergraph_BP_FeaturedRacer");
static_assert(offsetof(BP_FeaturedRacer_C_ExecuteUbergraph_BP_FeaturedRacer, EntryPoint) == 0x000000, "Member 'BP_FeaturedRacer_C_ExecuteUbergraph_BP_FeaturedRacer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_ExecuteUbergraph_BP_FeaturedRacer, CallFunc_IsInViewport_ReturnValue) == 0x000004, "Member 'BP_FeaturedRacer_C_ExecuteUbergraph_BP_FeaturedRacer::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_ExecuteUbergraph_BP_FeaturedRacer, K2Node_Event_EndPlayReason) == 0x000005, "Member 'BP_FeaturedRacer_C_ExecuteUbergraph_BP_FeaturedRacer::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_FeaturedRacer.BP_FeaturedRacer_C.Play
// 0x0220 (0x0220 - 0x0000)
struct BP_FeaturedRacer_C_Play final
{
public:
	class ASceneDriver*                           In_SceneDriver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         In_RacerIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAppRaceRacerConfigData                CallFunc_GetAppRaceRacerConfigData_OutData;        // 0x0018(0x0180)()
	EOutputExecsPin_SuccessFailed                 CallFunc_GetAppRaceRacerConfigData_OutExecsPin;    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMachineName_OutMachineName;            // 0x01A0(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRacerName_OutRacerName;                // 0x01B8(0x0010)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01D8(0x0010)(ReferenceParm)
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F0(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0208(0x0010)(ConstParm)
	class UWBP_RaceBefore_FeaturedRacer_C*        CallFunc_Create_ReturnValue;                       // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedRacer_C_Play) == 0x000008, "Wrong alignment on BP_FeaturedRacer_C_Play");
static_assert(sizeof(BP_FeaturedRacer_C_Play) == 0x000220, "Wrong size on BP_FeaturedRacer_C_Play");
static_assert(offsetof(BP_FeaturedRacer_C_Play, In_SceneDriver) == 0x000000, "Member 'BP_FeaturedRacer_C_Play::In_SceneDriver' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, In_RacerIndex) == 0x000008, "Member 'BP_FeaturedRacer_C_Play::In_RacerIndex' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, CallFunc_GetSequencePlayer_ReturnValue) == 0x000010, "Member 'BP_FeaturedRacer_C_Play::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, CallFunc_GetAppRaceRacerConfigData_OutData) == 0x000018, "Member 'BP_FeaturedRacer_C_Play::CallFunc_GetAppRaceRacerConfigData_OutData' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, CallFunc_GetAppRaceRacerConfigData_OutExecsPin) == 0x000198, "Member 'BP_FeaturedRacer_C_Play::CallFunc_GetAppRaceRacerConfigData_OutExecsPin' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, K2Node_SwitchEnum_CmpSuccess) == 0x000199, "Member 'BP_FeaturedRacer_C_Play::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, CallFunc_GetMachineName_OutMachineName) == 0x0001A0, "Member 'BP_FeaturedRacer_C_Play::CallFunc_GetMachineName_OutMachineName' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, Temp_bool_Variable) == 0x0001B0, "Member 'BP_FeaturedRacer_C_Play::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, CallFunc_GetRacerName_OutRacerName) == 0x0001B8, "Member 'BP_FeaturedRacer_C_Play::CallFunc_GetRacerName_OutRacerName' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, CallFunc_TextIsEmpty_ReturnValue) == 0x0001C8, "Member 'BP_FeaturedRacer_C_Play::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, CallFunc_PlayAnimation_ReturnValue) == 0x0001D0, "Member 'BP_FeaturedRacer_C_Play::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, K2Node_MakeArray_Array) == 0x0001D8, "Member 'BP_FeaturedRacer_C_Play::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, CallFunc_SpawnSound2D_ReturnValue) == 0x0001E8, "Member 'BP_FeaturedRacer_C_Play::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, CallFunc_Format_ReturnValue) == 0x0001F0, "Member 'BP_FeaturedRacer_C_Play::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, CallFunc_GetPlayerController_ReturnValue) == 0x000200, "Member 'BP_FeaturedRacer_C_Play::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, K2Node_Select_Default) == 0x000208, "Member 'BP_FeaturedRacer_C_Play::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FeaturedRacer_C_Play, CallFunc_Create_ReturnValue) == 0x000218, "Member 'BP_FeaturedRacer_C_Play::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_FeaturedRacer.BP_FeaturedRacer_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_FeaturedRacer_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FeaturedRacer_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_FeaturedRacer_C_ReceiveEndPlay");
static_assert(sizeof(BP_FeaturedRacer_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_FeaturedRacer_C_ReceiveEndPlay");
static_assert(offsetof(BP_FeaturedRacer_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_FeaturedRacer_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

