#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_SummonRing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FX_SummonRing.BP_FX_SummonRing_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_FX_SummonRing_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUnionStaticMeshComponent*              Ring_SM;                                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FX_SummonRing(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FX_SummonRing_C">();
	}
	static class ABP_FX_SummonRing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FX_SummonRing_C>();
	}
};
static_assert(alignof(ABP_FX_SummonRing_C) == 0x000008, "Wrong alignment on ABP_FX_SummonRing_C");
static_assert(sizeof(ABP_FX_SummonRing_C) == 0x0002A8, "Wrong size on ABP_FX_SummonRing_C");
static_assert(offsetof(ABP_FX_SummonRing_C, UberGraphFrame) == 0x000290, "Member 'ABP_FX_SummonRing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FX_SummonRing_C, Ring_SM) == 0x000298, "Member 'ABP_FX_SummonRing_C::Ring_SM' has a wrong offset!");
static_assert(offsetof(ABP_FX_SummonRing_C, Scene) == 0x0002A0, "Member 'ABP_FX_SummonRing_C::Scene' has a wrong offset!");

}

