#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FestResultBG

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FestResultBG.BP_FestResultBG_C
// 0x00D8 (0x0368 - 0x0290)
class ABP_FestResultBG_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_1000_mh1_FestaResultUI_zoom;                    // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CineCameraActor_start;                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Dummy_Biggest_Car6;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Dummy_Biggest_Car5;                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CineCameraActor_zoom1_20_1st;                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Sample_Car_SPD6;                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Sample_Car_SPD5;                                // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_1000_mh1_FestaResultUI1;                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CineCameraActor_all_20;                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Sample_Car_SPD2;                                // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Sample_Car_SPD4;                                // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Dummy_Biggest_Car2;                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Dummy_Biggest_Car4;                             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MovatarManD2;                                   // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MovatarWomanB2;                                 // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MovatarWomanB1;                                 // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MovatarWomanC;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MovatarManD;                                    // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MovatarWomanB;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MovatarCameraB;                                 // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MovatarWomanC2;                                 // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MovatarWomanC1;                                 // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MovatarManD1;                                   // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MovatarCameraB1;                                // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_1016_kh1_MonitorWallAFrameB;                    // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_1000_mh1_Plate4;                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FestResultBG_C">();
	}
	static class ABP_FestResultBG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FestResultBG_C>();
	}
};
static_assert(alignof(ABP_FestResultBG_C) == 0x000008, "Wrong alignment on ABP_FestResultBG_C");
static_assert(sizeof(ABP_FestResultBG_C) == 0x000368, "Wrong size on ABP_FestResultBG_C");
static_assert(offsetof(ABP_FestResultBG_C, SM_1000_mh1_FestaResultUI_zoom) == 0x000290, "Member 'ABP_FestResultBG_C::SM_1000_mh1_FestaResultUI_zoom' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, CineCameraActor_start) == 0x000298, "Member 'ABP_FestResultBG_C::CineCameraActor_start' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, BP_Dummy_Biggest_Car6) == 0x0002A0, "Member 'ABP_FestResultBG_C::BP_Dummy_Biggest_Car6' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, BP_Dummy_Biggest_Car5) == 0x0002A8, "Member 'ABP_FestResultBG_C::BP_Dummy_Biggest_Car5' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, CineCameraActor_zoom1_20_1st) == 0x0002B0, "Member 'ABP_FestResultBG_C::CineCameraActor_zoom1_20_1st' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, BP_Sample_Car_SPD6) == 0x0002B8, "Member 'ABP_FestResultBG_C::BP_Sample_Car_SPD6' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, BP_Sample_Car_SPD5) == 0x0002C0, "Member 'ABP_FestResultBG_C::BP_Sample_Car_SPD5' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_1000_mh1_FestaResultUI1) == 0x0002C8, "Member 'ABP_FestResultBG_C::SM_1000_mh1_FestaResultUI1' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, CineCameraActor_all_20) == 0x0002D0, "Member 'ABP_FestResultBG_C::CineCameraActor_all_20' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, BP_Sample_Car_SPD2) == 0x0002D8, "Member 'ABP_FestResultBG_C::BP_Sample_Car_SPD2' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, BP_Sample_Car_SPD4) == 0x0002E0, "Member 'ABP_FestResultBG_C::BP_Sample_Car_SPD4' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, BP_Dummy_Biggest_Car2) == 0x0002E8, "Member 'ABP_FestResultBG_C::BP_Dummy_Biggest_Car2' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, BP_Dummy_Biggest_Car4) == 0x0002F0, "Member 'ABP_FestResultBG_C::BP_Dummy_Biggest_Car4' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_MovatarManD2) == 0x0002F8, "Member 'ABP_FestResultBG_C::SM_MovatarManD2' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_MovatarWomanB2) == 0x000300, "Member 'ABP_FestResultBG_C::SM_MovatarWomanB2' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_MovatarWomanB1) == 0x000308, "Member 'ABP_FestResultBG_C::SM_MovatarWomanB1' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_MovatarWomanC) == 0x000310, "Member 'ABP_FestResultBG_C::SM_MovatarWomanC' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_MovatarManD) == 0x000318, "Member 'ABP_FestResultBG_C::SM_MovatarManD' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_MovatarWomanB) == 0x000320, "Member 'ABP_FestResultBG_C::SM_MovatarWomanB' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_MovatarCameraB) == 0x000328, "Member 'ABP_FestResultBG_C::SM_MovatarCameraB' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_MovatarWomanC2) == 0x000330, "Member 'ABP_FestResultBG_C::SM_MovatarWomanC2' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_MovatarWomanC1) == 0x000338, "Member 'ABP_FestResultBG_C::SM_MovatarWomanC1' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_MovatarManD1) == 0x000340, "Member 'ABP_FestResultBG_C::SM_MovatarManD1' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_MovatarCameraB1) == 0x000348, "Member 'ABP_FestResultBG_C::SM_MovatarCameraB1' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_1016_kh1_MonitorWallAFrameB) == 0x000350, "Member 'ABP_FestResultBG_C::SM_1016_kh1_MonitorWallAFrameB' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, SM_1000_mh1_Plate4) == 0x000358, "Member 'ABP_FestResultBG_C::SM_1000_mh1_Plate4' has a wrong offset!");
static_assert(offsetof(ABP_FestResultBG_C, DefaultSceneRoot) == 0x000360, "Member 'ABP_FestResultBG_C::DefaultSceneRoot' has a wrong offset!");

}

