#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrandPrixSequence

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GrandPrixSequence.BP_GrandPrixSequence_C
// 0x0050 (0x03D0 - 0x0380)
class ABP_GrandPrixSequence_C final : public AGrandPrixSequence
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_GadgetCustomize2State_C*           BPC_GadgetCustomize2State;                         // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_RivalSelectState_C*                BPC_RivalSelectState;                              // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_SelectCourse_C*                    BPC_SelectCourse;                                  // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharaMachineState_C*               BPC_CharaMachineState;                             // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_MenuSubStateSelectClass_C*         BPC_MenuSubStateSelectClass;                       // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWBP_FooterMenu_C*                      Footer;                                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuSequence_C*                     MenuSequence;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_CMN_BG_01_C*                       CommonBlueBK;                                      // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          LClassSelect;                                      // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_GrandPrixSequence_BPC_CharaMachineState_K2Node_ComponentBoundEvent_4_OnBackStateDelegate__DelegateSignature(EMenuSequenceSubState State);
	void BndEvt__BP_GrandPrixSequence_BPC_MenuSubStateSelectClass_K2Node_ComponentBoundEvent_1_OnBackStateDelegate__DelegateSignature(EMenuSequenceSubState State);
	void BndEvt__BP_GrandPrixSequence_BPC_SelectCourse_K2Node_ComponentBoundEvent_0_OnDecideGrandPrixAndCourse__DelegateSignature();
	void BndEvt__BP_GrandPrixSequence_BPC_SelectCourse_K2Node_ComponentBoundEvent_2_OnDecideGrandPrixAndCourse__DelegateSignature();
	void DestroyPlayer();
	void ExecuteUbergraph_BP_GrandPrixSequence(int32 EntryPoint);
	void FadeFinished(EUnionUIFadeDirection FadeDirection);
	class UObject* GetFooter();
	void GetLastStateIsClassSelect(bool* LClassSelect_0);
	class UObject* GetOwnerMenuSequence();
	void InitializeState();
	void OnBackFromGadgetCustomize(EMenuSequenceSubState State);
	void OnFinalize();
	void OnInitialize();
	void OnInitStateExit();
	void OnUpdate(float InDeltaTime);
	void RivalSelect_OnExit(EMenuSequenceSubState State);
	void SelectCource_OnDecideRivalSelect();
	void SelectCourse_Cancel();
	void SelectCourse_Decide();
	void SetNextSubMenuSequenceState(EMenuSequenceSubState InState, class UObject* PrevSequence);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GrandPrixSequence_C">();
	}
	static class ABP_GrandPrixSequence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GrandPrixSequence_C>();
	}
};
static_assert(alignof(ABP_GrandPrixSequence_C) == 0x000008, "Wrong alignment on ABP_GrandPrixSequence_C");
static_assert(sizeof(ABP_GrandPrixSequence_C) == 0x0003D0, "Wrong size on ABP_GrandPrixSequence_C");
static_assert(offsetof(ABP_GrandPrixSequence_C, UberGraphFrame) == 0x000380, "Member 'ABP_GrandPrixSequence_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GrandPrixSequence_C, BPC_GadgetCustomize2State) == 0x000388, "Member 'ABP_GrandPrixSequence_C::BPC_GadgetCustomize2State' has a wrong offset!");
static_assert(offsetof(ABP_GrandPrixSequence_C, BPC_RivalSelectState) == 0x000390, "Member 'ABP_GrandPrixSequence_C::BPC_RivalSelectState' has a wrong offset!");
static_assert(offsetof(ABP_GrandPrixSequence_C, BPC_SelectCourse) == 0x000398, "Member 'ABP_GrandPrixSequence_C::BPC_SelectCourse' has a wrong offset!");
static_assert(offsetof(ABP_GrandPrixSequence_C, BPC_CharaMachineState) == 0x0003A0, "Member 'ABP_GrandPrixSequence_C::BPC_CharaMachineState' has a wrong offset!");
static_assert(offsetof(ABP_GrandPrixSequence_C, BPC_MenuSubStateSelectClass) == 0x0003A8, "Member 'ABP_GrandPrixSequence_C::BPC_MenuSubStateSelectClass' has a wrong offset!");
static_assert(offsetof(ABP_GrandPrixSequence_C, Footer) == 0x0003B0, "Member 'ABP_GrandPrixSequence_C::Footer' has a wrong offset!");
static_assert(offsetof(ABP_GrandPrixSequence_C, MenuSequence) == 0x0003B8, "Member 'ABP_GrandPrixSequence_C::MenuSequence' has a wrong offset!");
static_assert(offsetof(ABP_GrandPrixSequence_C, CommonBlueBK) == 0x0003C0, "Member 'ABP_GrandPrixSequence_C::CommonBlueBK' has a wrong offset!");
static_assert(offsetof(ABP_GrandPrixSequence_C, LClassSelect) == 0x0003C8, "Member 'ABP_GrandPrixSequence_C::LClassSelect' has a wrong offset!");

}

