#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GhostResultUploadActor

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GhostResultUploadActor.BP_GhostResultUploadActor_C
// 0x0070 (0x0300 - 0x0290)
class ABP_GhostResultUploadActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGhostDataController*                   GhostDataController;                               // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_PrivateMatch_Popup_C*              LoadingWidget;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnFinishEvent;                                     // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUnionUIPopupWindowBase*                PopupWindow;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAllUpload;                                      // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuInputRecieveObject*                SubInputReciever;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUploadCancel;                                    // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FooterMenu_C*                      FooterMenu;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNotCancelEntry;                                 // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CountTimer;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CancelEntryTime;                                   // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindUploaderEvent();
	void Create_Network_Error_Window(EResponseCodeAbstract ResponseCode);
	void CreateErrorWindow(const class FText& MessageText);
	void ExecuteUbergraph_BP_GhostResultUploadActor(int32 EntryPoint);
	void OnCancelUpload(class UObject* Object);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void Setup_All_Upload();
	void Setup_Single_Upload(ESpeedClassId InSpeedClassId, EStageId InStageId);
	void StartCancelEntry();
	void StartUpload();
	void TimeTrialErrorWindow_OnDecide(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void UnbindCancel();
	void UnbindUploaderEvent();
	void UploadCompleteEvent(bool IsError, EUploadState UploadState);
	void UploadFinish();
	void UploadFinishEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GhostResultUploadActor_C">();
	}
	static class ABP_GhostResultUploadActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GhostResultUploadActor_C>();
	}
};
static_assert(alignof(ABP_GhostResultUploadActor_C) == 0x000008, "Wrong alignment on ABP_GhostResultUploadActor_C");
static_assert(sizeof(ABP_GhostResultUploadActor_C) == 0x000300, "Wrong size on ABP_GhostResultUploadActor_C");
static_assert(offsetof(ABP_GhostResultUploadActor_C, UberGraphFrame) == 0x000290, "Member 'ABP_GhostResultUploadActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GhostResultUploadActor_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_GhostResultUploadActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GhostResultUploadActor_C, GhostDataController) == 0x0002A0, "Member 'ABP_GhostResultUploadActor_C::GhostDataController' has a wrong offset!");
static_assert(offsetof(ABP_GhostResultUploadActor_C, LoadingWidget) == 0x0002A8, "Member 'ABP_GhostResultUploadActor_C::LoadingWidget' has a wrong offset!");
static_assert(offsetof(ABP_GhostResultUploadActor_C, OnFinishEvent) == 0x0002B0, "Member 'ABP_GhostResultUploadActor_C::OnFinishEvent' has a wrong offset!");
static_assert(offsetof(ABP_GhostResultUploadActor_C, PopupWindow) == 0x0002C0, "Member 'ABP_GhostResultUploadActor_C::PopupWindow' has a wrong offset!");
static_assert(offsetof(ABP_GhostResultUploadActor_C, bIsAllUpload) == 0x0002C8, "Member 'ABP_GhostResultUploadActor_C::bIsAllUpload' has a wrong offset!");
static_assert(offsetof(ABP_GhostResultUploadActor_C, SubInputReciever) == 0x0002D0, "Member 'ABP_GhostResultUploadActor_C::SubInputReciever' has a wrong offset!");
static_assert(offsetof(ABP_GhostResultUploadActor_C, IsUploadCancel) == 0x0002D8, "Member 'ABP_GhostResultUploadActor_C::IsUploadCancel' has a wrong offset!");
static_assert(offsetof(ABP_GhostResultUploadActor_C, FooterMenu) == 0x0002E0, "Member 'ABP_GhostResultUploadActor_C::FooterMenu' has a wrong offset!");
static_assert(offsetof(ABP_GhostResultUploadActor_C, bIsNotCancelEntry) == 0x0002E8, "Member 'ABP_GhostResultUploadActor_C::bIsNotCancelEntry' has a wrong offset!");
static_assert(offsetof(ABP_GhostResultUploadActor_C, CountTimer) == 0x0002F0, "Member 'ABP_GhostResultUploadActor_C::CountTimer' has a wrong offset!");
static_assert(offsetof(ABP_GhostResultUploadActor_C, CancelEntryTime) == 0x0002F8, "Member 'ABP_GhostResultUploadActor_C::CancelEntryTime' has a wrong offset!");

}

