#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GadgetCustomize2Sequence

#include "Basic.hpp"

#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function BP_GadgetCustomize2Sequence.BP_GadgetCustomize2Sequence_C.ExecuteUbergraph_BP_GadgetCustomize2Sequence
// 0x0048 (0x0048 - 0x0000)
struct BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGadgetPlateUIData                     CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData; // 0x0018(0x0028)()
	class UAppSequenceLogManagerSubsystem*        CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence) == 0x000008, "Wrong alignment on BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence");
static_assert(sizeof(BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence) == 0x000048, "Wrong size on BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence, EntryPoint) == 0x000000, "Member 'BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence, CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData) == 0x000018, "Member 'BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence::CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData' has a wrong offset!");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000040, "Member 'BP_GadgetCustomize2Sequence_C_ExecuteUbergraph_BP_GadgetCustomize2Sequence::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");

// Function BP_GadgetCustomize2Sequence.BP_GadgetCustomize2Sequence_C.Exit
// 0x0030 (0x0030 - 0x0000)
struct BP_GadgetCustomize2Sequence_C_Exit final
{
public:
	struct FGadgetPlateUIData                     CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData; // 0x0000(0x0028)()
	bool                                          CallFunc_GadgetPlateUIDataEquals_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GadgetCustomize2Sequence_C_Exit) == 0x000008, "Wrong alignment on BP_GadgetCustomize2Sequence_C_Exit");
static_assert(sizeof(BP_GadgetCustomize2Sequence_C_Exit) == 0x000030, "Wrong size on BP_GadgetCustomize2Sequence_C_Exit");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_Exit, CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData) == 0x000000, "Member 'BP_GadgetCustomize2Sequence_C_Exit::CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData' has a wrong offset!");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_Exit, CallFunc_GadgetPlateUIDataEquals_ReturnValue) == 0x000028, "Member 'BP_GadgetCustomize2Sequence_C_Exit::CallFunc_GadgetPlateUIDataEquals_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_Exit, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'BP_GadgetCustomize2Sequence_C_Exit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_GadgetCustomize2Sequence.BP_GadgetCustomize2Sequence_C.GetPlayerNum
// 0x0004 (0x0004 - 0x0000)
struct BP_GadgetCustomize2Sequence_C_GetPlayerNum final
{
public:
	int32                                         OutPlayerNum;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GadgetCustomize2Sequence_C_GetPlayerNum) == 0x000004, "Wrong alignment on BP_GadgetCustomize2Sequence_C_GetPlayerNum");
static_assert(sizeof(BP_GadgetCustomize2Sequence_C_GetPlayerNum) == 0x000004, "Wrong size on BP_GadgetCustomize2Sequence_C_GetPlayerNum");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_GetPlayerNum, OutPlayerNum) == 0x000000, "Member 'BP_GadgetCustomize2Sequence_C_GetPlayerNum::OutPlayerNum' has a wrong offset!");

// Function BP_GadgetCustomize2Sequence.BP_GadgetCustomize2Sequence_C.GetSelectMode
// 0x0001 (0x0001 - 0x0000)
struct BP_GadgetCustomize2Sequence_C_GetSelectMode final
{
public:
	EGadgetCustomizeSelectMode                    OutSelectMode;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GadgetCustomize2Sequence_C_GetSelectMode) == 0x000001, "Wrong alignment on BP_GadgetCustomize2Sequence_C_GetSelectMode");
static_assert(sizeof(BP_GadgetCustomize2Sequence_C_GetSelectMode) == 0x000001, "Wrong size on BP_GadgetCustomize2Sequence_C_GetSelectMode");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_GetSelectMode, OutSelectMode) == 0x000000, "Member 'BP_GadgetCustomize2Sequence_C_GetSelectMode::OutSelectMode' has a wrong offset!");

// Function BP_GadgetCustomize2Sequence.BP_GadgetCustomize2Sequence_C.IsDirty
// 0x0001 (0x0001 - 0x0000)
struct BP_GadgetCustomize2Sequence_C_IsDirty final
{
public:
	bool                                          bOutIsDirty;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GadgetCustomize2Sequence_C_IsDirty) == 0x000001, "Wrong alignment on BP_GadgetCustomize2Sequence_C_IsDirty");
static_assert(sizeof(BP_GadgetCustomize2Sequence_C_IsDirty) == 0x000001, "Wrong size on BP_GadgetCustomize2Sequence_C_IsDirty");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_IsDirty, bOutIsDirty) == 0x000000, "Member 'BP_GadgetCustomize2Sequence_C_IsDirty::bOutIsDirty' has a wrong offset!");

// Function BP_GadgetCustomize2Sequence.BP_GadgetCustomize2Sequence_C.IsMessageBarVisible
// 0x0001 (0x0001 - 0x0000)
struct BP_GadgetCustomize2Sequence_C_IsMessageBarVisible final
{
public:
	bool                                          bOutIsVisible;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GadgetCustomize2Sequence_C_IsMessageBarVisible) == 0x000001, "Wrong alignment on BP_GadgetCustomize2Sequence_C_IsMessageBarVisible");
static_assert(sizeof(BP_GadgetCustomize2Sequence_C_IsMessageBarVisible) == 0x000001, "Wrong size on BP_GadgetCustomize2Sequence_C_IsMessageBarVisible");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_IsMessageBarVisible, bOutIsVisible) == 0x000000, "Member 'BP_GadgetCustomize2Sequence_C_IsMessageBarVisible::bOutIsVisible' has a wrong offset!");

// Function BP_GadgetCustomize2Sequence.BP_GadgetCustomize2Sequence_C.SetDirty
// 0x0001 (0x0001 - 0x0000)
struct BP_GadgetCustomize2Sequence_C_SetDirty final
{
public:
	bool                                          bInIsDirty;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GadgetCustomize2Sequence_C_SetDirty) == 0x000001, "Wrong alignment on BP_GadgetCustomize2Sequence_C_SetDirty");
static_assert(sizeof(BP_GadgetCustomize2Sequence_C_SetDirty) == 0x000001, "Wrong size on BP_GadgetCustomize2Sequence_C_SetDirty");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_SetDirty, bInIsDirty) == 0x000000, "Member 'BP_GadgetCustomize2Sequence_C_SetDirty::bInIsDirty' has a wrong offset!");

// Function BP_GadgetCustomize2Sequence.BP_GadgetCustomize2Sequence_C.Setup
// 0x0008 (0x0008 - 0x0000)
struct BP_GadgetCustomize2Sequence_C_Setup final
{
public:
	int32                                         InPlayerNum;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetCustomizeSelectMode                    InSelectMode;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMessageBarVisible_0;                            // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GadgetCustomize2Sequence_C_Setup) == 0x000004, "Wrong alignment on BP_GadgetCustomize2Sequence_C_Setup");
static_assert(sizeof(BP_GadgetCustomize2Sequence_C_Setup) == 0x000008, "Wrong size on BP_GadgetCustomize2Sequence_C_Setup");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_Setup, InPlayerNum) == 0x000000, "Member 'BP_GadgetCustomize2Sequence_C_Setup::InPlayerNum' has a wrong offset!");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_Setup, InSelectMode) == 0x000004, "Member 'BP_GadgetCustomize2Sequence_C_Setup::InSelectMode' has a wrong offset!");
static_assert(offsetof(BP_GadgetCustomize2Sequence_C_Setup, bIsMessageBarVisible_0) == 0x000005, "Member 'BP_GadgetCustomize2Sequence_C_Setup::bIsMessageBarVisible_0' has a wrong offset!");

}

