#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HoldItemSTM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HoldItemSTM.BP_HoldItemSTM_C
// 0x0030 (0x0380 - 0x0350)
class ABP_HoldItemSTM_C final : public AHoldItemSTM
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        OffsetScene;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUnionStaticMeshComponent*              UnionStaticMesh;                                   // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FHoldItemCreateParam                   HoldItemCreateParam;                               // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UNiagaraComponent*                      RareItemEffect;                                    // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Create(const struct FHoldItemCreateParam& Param);
	void CreateItem(const struct FHoldItemCreateParam& In_Param);
	void Destroy();
	void DestroyItem();
	void ExecuteUbergraph_BP_HoldItemSTM(int32 EntryPoint);
	void PlayGetEffect();
	void PlayLuckyItemEffect();
	void PlayRareItemEffect();
	void PlayUseEffect();
	void ReceiveBeginPlay();
	void SetLightChannels(bool Channel0, bool Channel1, bool Channel2);
	void Use();

	class UMeshComponent* GetMeshComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HoldItemSTM_C">();
	}
	static class ABP_HoldItemSTM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HoldItemSTM_C>();
	}
};
static_assert(alignof(ABP_HoldItemSTM_C) == 0x000008, "Wrong alignment on ABP_HoldItemSTM_C");
static_assert(sizeof(ABP_HoldItemSTM_C) == 0x000380, "Wrong size on ABP_HoldItemSTM_C");
static_assert(offsetof(ABP_HoldItemSTM_C, UberGraphFrame) == 0x000350, "Member 'ABP_HoldItemSTM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HoldItemSTM_C, OffsetScene) == 0x000358, "Member 'ABP_HoldItemSTM_C::OffsetScene' has a wrong offset!");
static_assert(offsetof(ABP_HoldItemSTM_C, UnionStaticMesh) == 0x000360, "Member 'ABP_HoldItemSTM_C::UnionStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_HoldItemSTM_C, HoldItemCreateParam) == 0x000368, "Member 'ABP_HoldItemSTM_C::HoldItemCreateParam' has a wrong offset!");
static_assert(offsetof(ABP_HoldItemSTM_C, RareItemEffect) == 0x000378, "Member 'ABP_HoldItemSTM_C::RareItemEffect' has a wrong offset!");

}

