#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HoldItemVAT

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "ST_HoldItemVATData_structs.hpp"


namespace SDK::Params
{

// Function BP_HoldItemVAT.BP_HoldItemVAT_C.Create
// 0x0010 (0x0010 - 0x0000)
struct BP_HoldItemVAT_C_Create final
{
public:
	struct FHoldItemCreateParam                   Param;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_HoldItemVAT_C_Create) == 0x000004, "Wrong alignment on BP_HoldItemVAT_C_Create");
static_assert(sizeof(BP_HoldItemVAT_C_Create) == 0x000010, "Wrong size on BP_HoldItemVAT_C_Create");
static_assert(offsetof(BP_HoldItemVAT_C_Create, Param) == 0x000000, "Member 'BP_HoldItemVAT_C_Create::Param' has a wrong offset!");

// Function BP_HoldItemVAT.BP_HoldItemVAT_C.CreateItem
// 0x0080 (0x0080 - 0x0000)
struct BP_HoldItemVAT_C_CreateItem final
{
public:
	struct FHoldItemCreateParam                   In_Param;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_HoldItemVATData                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldItemVAT_C_CreateItem) == 0x000008, "Wrong alignment on BP_HoldItemVAT_C_CreateItem");
static_assert(sizeof(BP_HoldItemVAT_C_CreateItem) == 0x000080, "Wrong size on BP_HoldItemVAT_C_CreateItem");
static_assert(offsetof(BP_HoldItemVAT_C_CreateItem, In_Param) == 0x000000, "Member 'BP_HoldItemVAT_C_CreateItem::In_Param' has a wrong offset!");
static_assert(offsetof(BP_HoldItemVAT_C_CreateItem, CallFunc_GetEnumeratorName_ReturnValue) == 0x000010, "Member 'BP_HoldItemVAT_C_CreateItem::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldItemVAT_C_CreateItem, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'BP_HoldItemVAT_C_CreateItem::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_HoldItemVAT_C_CreateItem, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000078, "Member 'BP_HoldItemVAT_C_CreateItem::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BP_HoldItemVAT.BP_HoldItemVAT_C.DestroyItem
// 0x0002 (0x0002 - 0x0000)
struct BP_HoldItemVAT_C_DestroyItem final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldItemVAT_C_DestroyItem) == 0x000001, "Wrong alignment on BP_HoldItemVAT_C_DestroyItem");
static_assert(sizeof(BP_HoldItemVAT_C_DestroyItem) == 0x000002, "Wrong size on BP_HoldItemVAT_C_DestroyItem");
static_assert(offsetof(BP_HoldItemVAT_C_DestroyItem, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'BP_HoldItemVAT_C_DestroyItem::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldItemVAT_C_DestroyItem, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_HoldItemVAT_C_DestroyItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_HoldItemVAT.BP_HoldItemVAT_C.ExecuteUbergraph_BP_HoldItemVAT
// 0x0014 (0x0014 - 0x0000)
struct BP_HoldItemVAT_C_ExecuteUbergraph_BP_HoldItemVAT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHoldItemCreateParam                   K2Node_Event_Param;                                // 0x0004(0x0010)(ConstParm, NoDestructor)
};
static_assert(alignof(BP_HoldItemVAT_C_ExecuteUbergraph_BP_HoldItemVAT) == 0x000004, "Wrong alignment on BP_HoldItemVAT_C_ExecuteUbergraph_BP_HoldItemVAT");
static_assert(sizeof(BP_HoldItemVAT_C_ExecuteUbergraph_BP_HoldItemVAT) == 0x000014, "Wrong size on BP_HoldItemVAT_C_ExecuteUbergraph_BP_HoldItemVAT");
static_assert(offsetof(BP_HoldItemVAT_C_ExecuteUbergraph_BP_HoldItemVAT, EntryPoint) == 0x000000, "Member 'BP_HoldItemVAT_C_ExecuteUbergraph_BP_HoldItemVAT::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HoldItemVAT_C_ExecuteUbergraph_BP_HoldItemVAT, K2Node_Event_Param) == 0x000004, "Member 'BP_HoldItemVAT_C_ExecuteUbergraph_BP_HoldItemVAT::K2Node_Event_Param' has a wrong offset!");

// Function BP_HoldItemVAT.BP_HoldItemVAT_C.PlayRareItemEffect
// 0x0010 (0x0010 - 0x0000)
struct BP_HoldItemVAT_C_PlayRareItemEffect final
{
public:
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldItemVAT_C_PlayRareItemEffect) == 0x000008, "Wrong alignment on BP_HoldItemVAT_C_PlayRareItemEffect");
static_assert(sizeof(BP_HoldItemVAT_C_PlayRareItemEffect) == 0x000010, "Wrong size on BP_HoldItemVAT_C_PlayRareItemEffect");
static_assert(offsetof(BP_HoldItemVAT_C_PlayRareItemEffect, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000000, "Member 'BP_HoldItemVAT_C_PlayRareItemEffect::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldItemVAT_C_PlayRareItemEffect, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000008, "Member 'BP_HoldItemVAT_C_PlayRareItemEffect::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function BP_HoldItemVAT.BP_HoldItemVAT_C.GetMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_HoldItemVAT_C_GetMeshComponent final
{
public:
	class UMeshComponent*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldItemVAT_C_GetMeshComponent) == 0x000008, "Wrong alignment on BP_HoldItemVAT_C_GetMeshComponent");
static_assert(sizeof(BP_HoldItemVAT_C_GetMeshComponent) == 0x000008, "Wrong size on BP_HoldItemVAT_C_GetMeshComponent");
static_assert(offsetof(BP_HoldItemVAT_C_GetMeshComponent, ReturnValue) == 0x000000, "Member 'BP_HoldItemVAT_C_GetMeshComponent::ReturnValue' has a wrong offset!");

}

