#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HoldItemVAT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HoldItemVAT.BP_HoldItemVAT_C
// 0x0020 (0x03F8 - 0x03D8)
class ABP_HoldItemVAT_C final : public AHoldItemVAT
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FHoldItemCreateParam                   HoldItemCreateParam;                               // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UNiagaraComponent*                      RareItemEffect;                                    // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Create(const struct FHoldItemCreateParam& Param);
	void CreateItem(const struct FHoldItemCreateParam& In_Param);
	void Destroy();
	void DestroyItem();
	void ExecuteUbergraph_BP_HoldItemVAT(int32 EntryPoint);
	void PlayGetEffect();
	void PlayLuckyItemEffect();
	void PlayRareItemEffect();
	void PlayUseEffect();
	void Use();

	class UMeshComponent* GetMeshComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HoldItemVAT_C">();
	}
	static class ABP_HoldItemVAT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HoldItemVAT_C>();
	}
};
static_assert(alignof(ABP_HoldItemVAT_C) == 0x000008, "Wrong alignment on ABP_HoldItemVAT_C");
static_assert(sizeof(ABP_HoldItemVAT_C) == 0x0003F8, "Wrong size on ABP_HoldItemVAT_C");
static_assert(offsetof(ABP_HoldItemVAT_C, UberGraphFrame) == 0x0003D8, "Member 'ABP_HoldItemVAT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HoldItemVAT_C, HoldItemCreateParam) == 0x0003E0, "Member 'ABP_HoldItemVAT_C::HoldItemCreateParam' has a wrong offset!");
static_assert(offsetof(ABP_HoldItemVAT_C, RareItemEffect) == 0x0003F0, "Member 'ABP_HoldItemVAT_C::RareItemEffect' has a wrong offset!");

}

