#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemVioletVoidObject

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ItemVioletVoidObject.BP_ItemVioletVoidObject_C.ExecuteUbergraph_BP_ItemVioletVoidObject
// 0x0080 (0x0080 - 0x0000)
struct BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_SEName;                         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_ItemVioletVoid_C*                  K2Node_DynamicCast_AsABP_Item_Violet_Void;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_ItemVioletVoid_C*                  K2Node_DynamicCast_AsABP_Item_Violet_Void_1;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAppearance;                          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName SEName)>           K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetAnimePlayRate_PlayRate;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAnimePlayRate_PlayRate_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAnimePlayRate_PlayRate_2;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_ItemVioletVoid_C*                  K2Node_DynamicCast_AsABP_Item_Violet_Void_2;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject) == 0x000008, "Wrong alignment on BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject");
static_assert(sizeof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject) == 0x000080, "Wrong size on BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, EntryPoint) == 0x000000, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, K2Node_CustomEvent_SEName) == 0x000004, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::K2Node_CustomEvent_SEName' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000018, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, K2Node_DynamicCast_AsABP_Item_Violet_Void) == 0x000020, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::K2Node_DynamicCast_AsABP_Item_Violet_Void' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, K2Node_DynamicCast_AsABP_Item_Violet_Void_1) == 0x000030, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::K2Node_DynamicCast_AsABP_Item_Violet_Void_1' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, K2Node_Event_bAppearance) == 0x000039, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::K2Node_Event_bAppearance' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, CallFunc_GetAnimePlayRate_PlayRate) == 0x000050, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::CallFunc_GetAnimePlayRate_PlayRate' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, CallFunc_GetAnimePlayRate_PlayRate_1) == 0x000058, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::CallFunc_GetAnimePlayRate_PlayRate_1' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, CallFunc_GetAnimePlayRate_PlayRate_2) == 0x000060, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::CallFunc_GetAnimePlayRate_PlayRate_2' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000068, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, K2Node_DynamicCast_AsABP_Item_Violet_Void_2) == 0x000070, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::K2Node_DynamicCast_AsABP_Item_Violet_Void_2' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'BP_ItemVioletVoidObject_C_ExecuteUbergraph_BP_ItemVioletVoidObject::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_ItemVioletVoidObject.BP_ItemVioletVoidObject_C.GetAnimePlayRate
// 0x0028 (0x0028 - 0x0000)
struct BP_ItemVioletVoidObject_C_GetAnimePlayRate final
{
public:
	double                                        PlayTime;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BaseFrame;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PlayRate;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemVioletVoidObject_C_GetAnimePlayRate) == 0x000008, "Wrong alignment on BP_ItemVioletVoidObject_C_GetAnimePlayRate");
static_assert(sizeof(BP_ItemVioletVoidObject_C_GetAnimePlayRate) == 0x000028, "Wrong size on BP_ItemVioletVoidObject_C_GetAnimePlayRate");
static_assert(offsetof(BP_ItemVioletVoidObject_C_GetAnimePlayRate, PlayTime) == 0x000000, "Member 'BP_ItemVioletVoidObject_C_GetAnimePlayRate::PlayTime' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_GetAnimePlayRate, BaseFrame) == 0x000008, "Member 'BP_ItemVioletVoidObject_C_GetAnimePlayRate::BaseFrame' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_GetAnimePlayRate, PlayRate) == 0x000010, "Member 'BP_ItemVioletVoidObject_C_GetAnimePlayRate::PlayRate' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_GetAnimePlayRate, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_ItemVioletVoidObject_C_GetAnimePlayRate::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_GetAnimePlayRate, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'BP_ItemVioletVoidObject_C_GetAnimePlayRate::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_ItemVioletVoidObject.BP_ItemVioletVoidObject_C.IsMeshAnimEating
// 0x0020 (0x0020 - 0x0000)
struct BP_ItemVioletVoidObject_C_IsMeshAnimEating final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_ItemVioletVoid_C*                  K2Node_DynamicCast_AsABP_Item_Violet_Void;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemVioletVoidObject_C_IsMeshAnimEating) == 0x000008, "Wrong alignment on BP_ItemVioletVoidObject_C_IsMeshAnimEating");
static_assert(sizeof(BP_ItemVioletVoidObject_C_IsMeshAnimEating) == 0x000020, "Wrong size on BP_ItemVioletVoidObject_C_IsMeshAnimEating");
static_assert(offsetof(BP_ItemVioletVoidObject_C_IsMeshAnimEating, ReturnValue) == 0x000000, "Member 'BP_ItemVioletVoidObject_C_IsMeshAnimEating::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_IsMeshAnimEating, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_ItemVioletVoidObject_C_IsMeshAnimEating::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_IsMeshAnimEating, K2Node_DynamicCast_AsABP_Item_Violet_Void) == 0x000010, "Member 'BP_ItemVioletVoidObject_C_IsMeshAnimEating::K2Node_DynamicCast_AsABP_Item_Violet_Void' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_IsMeshAnimEating, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ItemVioletVoidObject_C_IsMeshAnimEating::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ItemVioletVoidObject.BP_ItemVioletVoidObject_C.IsMeshAnimInSleep
// 0x0020 (0x0020 - 0x0000)
struct BP_ItemVioletVoidObject_C_IsMeshAnimInSleep final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_ItemVioletVoid_C*                  K2Node_DynamicCast_AsABP_Item_Violet_Void;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemVioletVoidObject_C_IsMeshAnimInSleep) == 0x000008, "Wrong alignment on BP_ItemVioletVoidObject_C_IsMeshAnimInSleep");
static_assert(sizeof(BP_ItemVioletVoidObject_C_IsMeshAnimInSleep) == 0x000020, "Wrong size on BP_ItemVioletVoidObject_C_IsMeshAnimInSleep");
static_assert(offsetof(BP_ItemVioletVoidObject_C_IsMeshAnimInSleep, ReturnValue) == 0x000000, "Member 'BP_ItemVioletVoidObject_C_IsMeshAnimInSleep::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_IsMeshAnimInSleep, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_ItemVioletVoidObject_C_IsMeshAnimInSleep::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_IsMeshAnimInSleep, K2Node_DynamicCast_AsABP_Item_Violet_Void) == 0x000010, "Member 'BP_ItemVioletVoidObject_C_IsMeshAnimInSleep::K2Node_DynamicCast_AsABP_Item_Violet_Void' has a wrong offset!");
static_assert(offsetof(BP_ItemVioletVoidObject_C_IsMeshAnimInSleep, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ItemVioletVoidObject_C_IsMeshAnimInSleep::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ItemVioletVoidObject.BP_ItemVioletVoidObject_C.PlaySE2DEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_ItemVioletVoidObject_C_PlaySE2DEvent final
{
public:
	class FName                                   SEName;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemVioletVoidObject_C_PlaySE2DEvent) == 0x000004, "Wrong alignment on BP_ItemVioletVoidObject_C_PlaySE2DEvent");
static_assert(sizeof(BP_ItemVioletVoidObject_C_PlaySE2DEvent) == 0x000008, "Wrong size on BP_ItemVioletVoidObject_C_PlaySE2DEvent");
static_assert(offsetof(BP_ItemVioletVoidObject_C_PlaySE2DEvent, SEName) == 0x000000, "Member 'BP_ItemVioletVoidObject_C_PlaySE2DEvent::SEName' has a wrong offset!");

// Function BP_ItemVioletVoidObject.BP_ItemVioletVoidObject_C.RequestMeshAnimAppearance
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemVioletVoidObject_C_RequestMeshAnimAppearance final
{
public:
	bool                                          bAppearance;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemVioletVoidObject_C_RequestMeshAnimAppearance) == 0x000001, "Wrong alignment on BP_ItemVioletVoidObject_C_RequestMeshAnimAppearance");
static_assert(sizeof(BP_ItemVioletVoidObject_C_RequestMeshAnimAppearance) == 0x000001, "Wrong size on BP_ItemVioletVoidObject_C_RequestMeshAnimAppearance");
static_assert(offsetof(BP_ItemVioletVoidObject_C_RequestMeshAnimAppearance, bAppearance) == 0x000000, "Member 'BP_ItemVioletVoidObject_C_RequestMeshAnimAppearance::bAppearance' has a wrong offset!");

}

