#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemYellowDrillActor

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ItemYellowDrillActor.BP_ItemYellowDrillActor_C
// 0x0018 (0x0348 - 0x0330)
class ABP_ItemYellowDrillActor_C final : public AYellowDrillActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_CountDown_CountDown_EF64C89B4F9F80B1E6C14D903A73331E; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_CountDown__Direction_EF64C89B4F9F80B1E6C14D903A73331E; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_CountDown;                                // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ItemYellowDrillActor(int32 EntryPoint);
	void OnCountDown(bool bIsPlay);
	void OnEnd();
	void OnStart();
	void Timeline_CountDown__FinishedFunc();
	void Timeline_CountDown__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemYellowDrillActor_C">();
	}
	static class ABP_ItemYellowDrillActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ItemYellowDrillActor_C>();
	}
};
static_assert(alignof(ABP_ItemYellowDrillActor_C) == 0x000008, "Wrong alignment on ABP_ItemYellowDrillActor_C");
static_assert(sizeof(ABP_ItemYellowDrillActor_C) == 0x000348, "Wrong size on ABP_ItemYellowDrillActor_C");
static_assert(offsetof(ABP_ItemYellowDrillActor_C, UberGraphFrame) == 0x000330, "Member 'ABP_ItemYellowDrillActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ItemYellowDrillActor_C, Timeline_CountDown_CountDown_EF64C89B4F9F80B1E6C14D903A73331E) == 0x000338, "Member 'ABP_ItemYellowDrillActor_C::Timeline_CountDown_CountDown_EF64C89B4F9F80B1E6C14D903A73331E' has a wrong offset!");
static_assert(offsetof(ABP_ItemYellowDrillActor_C, Timeline_CountDown__Direction_EF64C89B4F9F80B1E6C14D903A73331E) == 0x00033C, "Member 'ABP_ItemYellowDrillActor_C::Timeline_CountDown__Direction_EF64C89B4F9F80B1E6C14D903A73331E' has a wrong offset!");
static_assert(offsetof(ABP_ItemYellowDrillActor_C, Timeline_CountDown) == 0x000340, "Member 'ABP_ItemYellowDrillActor_C::Timeline_CountDown' has a wrong offset!");

}

