#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemHomingPunchObject

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemHomingPunchObject.BP_ItemHomingPunchObject_C.ExecuteUbergraph_BP_ItemHomingPunchObject
// 0x0014 (0x0014 - 0x0000)
struct BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0004(0x0004)()
	ESoundPan                                     K2Node_Event_SoundPan;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundBuildPlayer_ReturnValue;             // 0x000C(0x0004)()
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue;                  // 0x0010(0x0004)()
};
static_assert(alignof(BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject) == 0x000004, "Wrong alignment on BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject");
static_assert(sizeof(BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject) == 0x000014, "Wrong size on BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject");
static_assert(offsetof(BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject, EntryPoint) == 0x000000, "Member 'BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject, CallFunc_SoundPlay_ReturnValue) == 0x000004, "Member 'BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject, K2Node_Event_SoundPan) == 0x000008, "Member 'BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject::K2Node_Event_SoundPan' has a wrong offset!");
static_assert(offsetof(BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject, CallFunc_SoundBuildPlayer_ReturnValue) == 0x00000C, "Member 'BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject::CallFunc_SoundBuildPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject, CallFunc_SetPanSplit_ReturnValue) == 0x000010, "Member 'BP_ItemHomingPunchObject_C_ExecuteUbergraph_BP_ItemHomingPunchObject::CallFunc_SetPanSplit_ReturnValue' has a wrong offset!");

// Function BP_ItemHomingPunchObject.BP_ItemHomingPunchObject_C.OnPlayDamegeSound
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemHomingPunchObject_C_OnPlayDamegeSound final
{
public:
	ESoundPan                                     SoundPan;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemHomingPunchObject_C_OnPlayDamegeSound) == 0x000001, "Wrong alignment on BP_ItemHomingPunchObject_C_OnPlayDamegeSound");
static_assert(sizeof(BP_ItemHomingPunchObject_C_OnPlayDamegeSound) == 0x000001, "Wrong size on BP_ItemHomingPunchObject_C_OnPlayDamegeSound");
static_assert(offsetof(BP_ItemHomingPunchObject_C_OnPlayDamegeSound, SoundPan) == 0x000000, "Member 'BP_ItemHomingPunchObject_C_OnPlayDamegeSound::SoundPan' has a wrong offset!");

}

