#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LoginProcessor

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LoginProcessor.BP_LoginProcessor_C
// 0x0018 (0x03C0 - 0x03A8)
class ABP_LoginProcessor_C final : public ALoginProcessor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWBP_System_Title_Communication_C*      WBP_System_Title_Communication;                    // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CreateConnectingWindow();
	void CreateUI_Event();
	void DestroyConnectingWindow();
	void DestroyUI_Event();
	void ExecuteUbergraph_BP_LoginProcessor(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void SetupWarningText(const struct FDateTime& FromDateTime, const struct FDateTime& ToDateTime);
	void StartLogin_Event();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LoginProcessor_C">();
	}
	static class ABP_LoginProcessor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LoginProcessor_C>();
	}
};
static_assert(alignof(ABP_LoginProcessor_C) == 0x000008, "Wrong alignment on ABP_LoginProcessor_C");
static_assert(sizeof(ABP_LoginProcessor_C) == 0x0003C0, "Wrong size on ABP_LoginProcessor_C");
static_assert(offsetof(ABP_LoginProcessor_C, UberGraphFrame) == 0x0003A8, "Member 'ABP_LoginProcessor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LoginProcessor_C, DefaultSceneRoot) == 0x0003B0, "Member 'ABP_LoginProcessor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LoginProcessor_C, WBP_System_Title_Communication) == 0x0003B8, "Member 'ABP_LoginProcessor_C::WBP_System_Title_Communication' has a wrong offset!");

}

