#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LoginProcessor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LoginProcessor.BP_LoginProcessor_C.CreateConnectingWindow
// 0x0040 (0x0040 - 0x0000)
struct BP_LoginProcessor_C_CreateConnectingWindow final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0018(0x0010)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_System_Title_Communication_C*      CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LoginProcessor_C_CreateConnectingWindow) == 0x000008, "Wrong alignment on BP_LoginProcessor_C_CreateConnectingWindow");
static_assert(sizeof(BP_LoginProcessor_C_CreateConnectingWindow) == 0x000040, "Wrong size on BP_LoginProcessor_C_CreateConnectingWindow");
static_assert(offsetof(BP_LoginProcessor_C_CreateConnectingWindow, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'BP_LoginProcessor_C_CreateConnectingWindow::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_CreateConnectingWindow, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_LoginProcessor_C_CreateConnectingWindow::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_CreateConnectingWindow, CallFunc_Format_ReturnValue) == 0x000018, "Member 'BP_LoginProcessor_C_CreateConnectingWindow::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_CreateConnectingWindow, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000028, "Member 'BP_LoginProcessor_C_CreateConnectingWindow::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_CreateConnectingWindow, CallFunc_Create_ReturnValue) == 0x000030, "Member 'BP_LoginProcessor_C_CreateConnectingWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_CreateConnectingWindow, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_LoginProcessor_C_CreateConnectingWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_CreateConnectingWindow, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'BP_LoginProcessor_C_CreateConnectingWindow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_LoginProcessor.BP_LoginProcessor_C.DestroyConnectingWindow
// 0x0001 (0x0001 - 0x0000)
struct BP_LoginProcessor_C_DestroyConnectingWindow final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LoginProcessor_C_DestroyConnectingWindow) == 0x000001, "Wrong alignment on BP_LoginProcessor_C_DestroyConnectingWindow");
static_assert(sizeof(BP_LoginProcessor_C_DestroyConnectingWindow) == 0x000001, "Wrong size on BP_LoginProcessor_C_DestroyConnectingWindow");
static_assert(offsetof(BP_LoginProcessor_C_DestroyConnectingWindow, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_LoginProcessor_C_DestroyConnectingWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_LoginProcessor.BP_LoginProcessor_C.ExecuteUbergraph_BP_LoginProcessor
// 0x01C0 (0x01C0 - 0x0000)
struct BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              K2Node_Event_FromDateTime;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              K2Node_Event_ToDateTime;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0020(0x0010)()
	class FText                                   CallFunc_MakeDateTimeText_ReturnValue;             // 0x0030(0x0010)()
	class FText                                   CallFunc_MakeDateTimeText_ReturnValue_1;           // 0x0040(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0138(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0180(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0190(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A0(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01B0(0x0010)()
};
static_assert(alignof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor) == 0x000008, "Wrong alignment on BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor");
static_assert(sizeof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor) == 0x0001C0, "Wrong size on BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, EntryPoint) == 0x000000, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, K2Node_Event_EndPlayReason) == 0x000008, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, K2Node_Event_FromDateTime) == 0x000010, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::K2Node_Event_FromDateTime' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, K2Node_Event_ToDateTime) == 0x000018, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::K2Node_Event_ToDateTime' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, CallFunc_MakeLiteralText_ReturnValue) == 0x000020, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, CallFunc_MakeDateTimeText_ReturnValue) == 0x000030, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::CallFunc_MakeDateTimeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, CallFunc_MakeDateTimeText_ReturnValue_1) == 0x000040, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::CallFunc_MakeDateTimeText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E0, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, K2Node_MakeArray_Array) == 0x000128, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, K2Node_MakeStruct_FormatArgumentData_3) == 0x000138, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000180, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, K2Node_MakeArray_Array_1) == 0x000190, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, CallFunc_Format_ReturnValue) == 0x0001A0, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor, CallFunc_Format_ReturnValue_1) == 0x0001B0, "Member 'BP_LoginProcessor_C_ExecuteUbergraph_BP_LoginProcessor::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_LoginProcessor.BP_LoginProcessor_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_LoginProcessor_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LoginProcessor_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_LoginProcessor_C_ReceiveEndPlay");
static_assert(sizeof(BP_LoginProcessor_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_LoginProcessor_C_ReceiveEndPlay");
static_assert(offsetof(BP_LoginProcessor_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_LoginProcessor_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_LoginProcessor.BP_LoginProcessor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LoginProcessor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LoginProcessor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LoginProcessor_C_ReceiveTick");
static_assert(sizeof(BP_LoginProcessor_C_ReceiveTick) == 0x000004, "Wrong size on BP_LoginProcessor_C_ReceiveTick");
static_assert(offsetof(BP_LoginProcessor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LoginProcessor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_LoginProcessor.BP_LoginProcessor_C.SetupWarningText
// 0x0010 (0x0010 - 0x0000)
struct BP_LoginProcessor_C_SetupWarningText final
{
public:
	struct FDateTime                              FromDateTime;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              ToDateTime;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LoginProcessor_C_SetupWarningText) == 0x000008, "Wrong alignment on BP_LoginProcessor_C_SetupWarningText");
static_assert(sizeof(BP_LoginProcessor_C_SetupWarningText) == 0x000010, "Wrong size on BP_LoginProcessor_C_SetupWarningText");
static_assert(offsetof(BP_LoginProcessor_C_SetupWarningText, FromDateTime) == 0x000000, "Member 'BP_LoginProcessor_C_SetupWarningText::FromDateTime' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_SetupWarningText, ToDateTime) == 0x000008, "Member 'BP_LoginProcessor_C_SetupWarningText::ToDateTime' has a wrong offset!");

// Function BP_LoginProcessor.BP_LoginProcessor_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_LoginProcessor_C_UserConstructionScript final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0010(0x0010)()
};
static_assert(alignof(BP_LoginProcessor_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_LoginProcessor_C_UserConstructionScript");
static_assert(sizeof(BP_LoginProcessor_C_UserConstructionScript) == 0x000020, "Wrong size on BP_LoginProcessor_C_UserConstructionScript");
static_assert(offsetof(BP_LoginProcessor_C_UserConstructionScript, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'BP_LoginProcessor_C_UserConstructionScript::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LoginProcessor_C_UserConstructionScript, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000010, "Member 'BP_LoginProcessor_C_UserConstructionScript::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");

}

