#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MenuRacerPreview

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_structs.hpp"


namespace SDK::Params
{

// Function BP_MenuRacerPreview.BP_MenuRacerPreview_C.AddRotation
// 0x0010 (0x0010 - 0x0000)
struct BP_MenuRacerPreview_C_AddRotation final
{
public:
	double                                        InDeltaRotation;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerPreview_C_AddRotation) == 0x000008, "Wrong alignment on BP_MenuRacerPreview_C_AddRotation");
static_assert(sizeof(BP_MenuRacerPreview_C_AddRotation) == 0x000010, "Wrong size on BP_MenuRacerPreview_C_AddRotation");
static_assert(offsetof(BP_MenuRacerPreview_C_AddRotation, InDeltaRotation) == 0x000000, "Member 'BP_MenuRacerPreview_C_AddRotation::InDeltaRotation' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_AddRotation, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_MenuRacerPreview_C_AddRotation::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_MenuRacerPreview.BP_MenuRacerPreview_C.Attach Driver to Machine
// 0x0110 (0x0110 - 0x0000)
struct BP_MenuRacerPreview_C_Attach_Driver_to_Machine final
{
public:
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult; // 0x0000(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerPreview_C_Attach_Driver_to_Machine) == 0x000008, "Wrong alignment on BP_MenuRacerPreview_C_Attach_Driver_to_Machine");
static_assert(sizeof(BP_MenuRacerPreview_C_Attach_Driver_to_Machine) == 0x000110, "Wrong size on BP_MenuRacerPreview_C_Attach_Driver_to_Machine");
static_assert(offsetof(BP_MenuRacerPreview_C_Attach_Driver_to_Machine, CallFunc_K2_SetActorRelativeRotation_SweepHitResult) == 0x000000, "Member 'BP_MenuRacerPreview_C_Attach_Driver_to_Machine::CallFunc_K2_SetActorRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_Attach_Driver_to_Machine, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000F8, "Member 'BP_MenuRacerPreview_C_Attach_Driver_to_Machine::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_Attach_Driver_to_Machine, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x000100, "Member 'BP_MenuRacerPreview_C_Attach_Driver_to_Machine::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_Attach_Driver_to_Machine, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'BP_MenuRacerPreview_C_Attach_Driver_to_Machine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_Attach_Driver_to_Machine, CallFunc_K2_AttachToActor_ReturnValue) == 0x000109, "Member 'BP_MenuRacerPreview_C_Attach_Driver_to_Machine::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");

// Function BP_MenuRacerPreview.BP_MenuRacerPreview_C.AttachDriverToHoverboard
// 0x0100 (0x0100 - 0x0000)
struct BP_MenuRacerPreview_C_AttachDriverToHoverboard final
{
public:
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult; // 0x0000(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerPreview_C_AttachDriverToHoverboard) == 0x000008, "Wrong alignment on BP_MenuRacerPreview_C_AttachDriverToHoverboard");
static_assert(sizeof(BP_MenuRacerPreview_C_AttachDriverToHoverboard) == 0x000100, "Wrong size on BP_MenuRacerPreview_C_AttachDriverToHoverboard");
static_assert(offsetof(BP_MenuRacerPreview_C_AttachDriverToHoverboard, CallFunc_K2_SetActorRelativeRotation_SweepHitResult) == 0x000000, "Member 'BP_MenuRacerPreview_C_AttachDriverToHoverboard::CallFunc_K2_SetActorRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_AttachDriverToHoverboard, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000F8, "Member 'BP_MenuRacerPreview_C_AttachDriverToHoverboard::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_AttachDriverToHoverboard, CallFunc_K2_AttachToActor_ReturnValue) == 0x0000F9, "Member 'BP_MenuRacerPreview_C_AttachDriverToHoverboard::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");

// Function BP_MenuRacerPreview.BP_MenuRacerPreview_C.CharaMachineMoveStart
// 0x0170 (0x0170 - 0x0000)
struct BP_MenuRacerPreview_C_CharaMachineMoveStart final
{
public:
	struct FTransform                             GoalTransForm_0;                                   // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoLerp;                                            // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0068(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerPreview_C_CharaMachineMoveStart) == 0x000010, "Wrong alignment on BP_MenuRacerPreview_C_CharaMachineMoveStart");
static_assert(sizeof(BP_MenuRacerPreview_C_CharaMachineMoveStart) == 0x000170, "Wrong size on BP_MenuRacerPreview_C_CharaMachineMoveStart");
static_assert(offsetof(BP_MenuRacerPreview_C_CharaMachineMoveStart, GoalTransForm_0) == 0x000000, "Member 'BP_MenuRacerPreview_C_CharaMachineMoveStart::GoalTransForm_0' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CharaMachineMoveStart, NoLerp) == 0x000060, "Member 'BP_MenuRacerPreview_C_CharaMachineMoveStart::NoLerp' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CharaMachineMoveStart, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000068, "Member 'BP_MenuRacerPreview_C_CharaMachineMoveStart::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CharaMachineMoveStart, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000160, "Member 'BP_MenuRacerPreview_C_CharaMachineMoveStart::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function BP_MenuRacerPreview.BP_MenuRacerPreview_C.CorrectCustomizeData
// 0x0080 (0x0080 - 0x0000)
struct BP_MenuRacerPreview_C_CorrectCustomizeData final
{
public:
	struct FUserMachineCustomizeData              InCustomizeData;                                   // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	ECarStatusType                                InVehicleType;                                     // 0x0078(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerPreview_C_CorrectCustomizeData) == 0x000008, "Wrong alignment on BP_MenuRacerPreview_C_CorrectCustomizeData");
static_assert(sizeof(BP_MenuRacerPreview_C_CorrectCustomizeData) == 0x000080, "Wrong size on BP_MenuRacerPreview_C_CorrectCustomizeData");
static_assert(offsetof(BP_MenuRacerPreview_C_CorrectCustomizeData, InCustomizeData) == 0x000000, "Member 'BP_MenuRacerPreview_C_CorrectCustomizeData::InCustomizeData' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CorrectCustomizeData, InVehicleType) == 0x000078, "Member 'BP_MenuRacerPreview_C_CorrectCustomizeData::InVehicleType' has a wrong offset!");

// Function BP_MenuRacerPreview.BP_MenuRacerPreview_C.CreateDriver
// 0x0120 (0x0120 - 0x0000)
struct BP_MenuRacerPreview_C_CreateDriver final
{
public:
	EDriverId                                     Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHoverboard_ReturnValue;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IDriverAnimator>       CallFunc_SetAnimClass_self_CastInput;              // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     K2Node_Select_Default;                             // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue;              // 0x0098(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)()
	class ABP_MenuDriverPawn_C*                   K2Node_DynamicCast_AsBP_Menu_Driver_Pawn;          // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerPreview_C_CreateDriver) == 0x000010, "Wrong alignment on BP_MenuRacerPreview_C_CreateDriver");
static_assert(sizeof(BP_MenuRacerPreview_C_CreateDriver) == 0x000120, "Wrong size on BP_MenuRacerPreview_C_CreateDriver");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, Temp_byte_Variable) == 0x000000, "Member 'BP_MenuRacerPreview_C_CreateDriver::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, Temp_struct_Variable) == 0x000010, "Member 'BP_MenuRacerPreview_C_CreateDriver::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'BP_MenuRacerPreview_C_CreateDriver::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, Temp_bool_Variable) == 0x000078, "Member 'BP_MenuRacerPreview_C_CreateDriver::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, CallFunc_IsHoverboard_ReturnValue) == 0x000079, "Member 'BP_MenuRacerPreview_C_CreateDriver::CallFunc_IsHoverboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, CallFunc_SetAnimClass_self_CastInput) == 0x000080, "Member 'BP_MenuRacerPreview_C_CreateDriver::CallFunc_SetAnimClass_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000090, "Member 'BP_MenuRacerPreview_C_CreateDriver::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000091, "Member 'BP_MenuRacerPreview_C_CreateDriver::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, CallFunc_BooleanAND_ReturnValue) == 0x000092, "Member 'BP_MenuRacerPreview_C_CreateDriver::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000093, "Member 'BP_MenuRacerPreview_C_CreateDriver::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, K2Node_Select_Default) == 0x000094, "Member 'BP_MenuRacerPreview_C_CreateDriver::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, CallFunc_Conv_ByteToText_ReturnValue) == 0x000098, "Member 'BP_MenuRacerPreview_C_CreateDriver::CallFunc_Conv_ByteToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, K2Node_MakeStruct_FormatArgumentData) == 0x0000A8, "Member 'BP_MenuRacerPreview_C_CreateDriver::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, K2Node_MakeArray_Array) == 0x0000F0, "Member 'BP_MenuRacerPreview_C_CreateDriver::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, CallFunc_Format_ReturnValue) == 0x000100, "Member 'BP_MenuRacerPreview_C_CreateDriver::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, K2Node_DynamicCast_AsBP_Menu_Driver_Pawn) == 0x000110, "Member 'BP_MenuRacerPreview_C_CreateDriver::K2Node_DynamicCast_AsBP_Menu_Driver_Pawn' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateDriver, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'BP_MenuRacerPreview_C_CreateDriver::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_MenuRacerPreview.BP_MenuRacerPreview_C.CreateHoverboard
// 0x01D0 (0x01D0 - 0x0000)
struct BP_MenuRacerPreview_C_CreateHoverboard final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x0060(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerHoverboard_C*              K2Node_DynamicCast_AsBP_Menu_Racer_Hoverboard;     // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x00D8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_MenuRacerPreview_C_CreateHoverboard) == 0x000010, "Wrong alignment on BP_MenuRacerPreview_C_CreateHoverboard");
static_assert(sizeof(BP_MenuRacerPreview_C_CreateHoverboard) == 0x0001D0, "Wrong size on BP_MenuRacerPreview_C_CreateHoverboard");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateHoverboard, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'BP_MenuRacerPreview_C_CreateHoverboard::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateHoverboard, Temp_struct_Variable) == 0x000060, "Member 'BP_MenuRacerPreview_C_CreateHoverboard::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateHoverboard, K2Node_DynamicCast_AsBP_Menu_Racer_Hoverboard) == 0x0000C0, "Member 'BP_MenuRacerPreview_C_CreateHoverboard::K2Node_DynamicCast_AsBP_Menu_Racer_Hoverboard' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateHoverboard, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_MenuRacerPreview_C_CreateHoverboard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateHoverboard, CallFunc_AddComponent_ReturnValue) == 0x0000D0, "Member 'BP_MenuRacerPreview_C_CreateHoverboard::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateHoverboard, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0000D8, "Member 'BP_MenuRacerPreview_C_CreateHoverboard::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");

// Function BP_MenuRacerPreview.BP_MenuRacerPreview_C.CreateMachine
// 0x0090 (0x0090 - 0x0000)
struct BP_MenuRacerPreview_C_CreateMachine final
{
public:
	class ABP_MenuRacerMachine_C*                 TempMachineActor;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   TempMachineComponet;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerMachine_C*                 K2Node_DynamicCast_AsBP_Menu_Racer_Machine;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerPreview_C_CreateMachine) == 0x000010, "Wrong alignment on BP_MenuRacerPreview_C_CreateMachine");
static_assert(sizeof(BP_MenuRacerPreview_C_CreateMachine) == 0x000090, "Wrong size on BP_MenuRacerPreview_C_CreateMachine");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateMachine, TempMachineActor) == 0x000000, "Member 'BP_MenuRacerPreview_C_CreateMachine::TempMachineActor' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateMachine, TempMachineComponet) == 0x000008, "Member 'BP_MenuRacerPreview_C_CreateMachine::TempMachineComponet' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateMachine, Temp_struct_Variable) == 0x000010, "Member 'BP_MenuRacerPreview_C_CreateMachine::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateMachine, K2Node_DynamicCast_AsBP_Menu_Racer_Machine) == 0x000070, "Member 'BP_MenuRacerPreview_C_CreateMachine::K2Node_DynamicCast_AsBP_Menu_Racer_Machine' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateMachine, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_MenuRacerPreview_C_CreateMachine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_CreateMachine, CallFunc_AddComponent_ReturnValue) == 0x000080, "Member 'BP_MenuRacerPreview_C_CreateMachine::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function BP_MenuRacerPreview.BP_MenuRacerPreview_C.DecideChara
// 0x0320 (0x0320 - 0x0000)
struct BP_MenuRacerPreview_C_DecideChara final
{
public:
	int32                                         InPlayerIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSelectedPlayerCount;                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     Temp_byte_Variable_2;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_5;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_6;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_7;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_8;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_9;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_10;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_11;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_12;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_13;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_14;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_15;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_16;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_17;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_18;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_19;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_20;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_21;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_22;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_23;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_24;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_25;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_26;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_27;                           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_28;                           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_29;                           // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_30;                           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_31;                           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_32;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_33;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_34;                           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_35;                           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_36;                           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_37;                           // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_38;                           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_39;                           // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_40;                           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_41;                           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_42;                           // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_43;                           // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_44;                           // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_45;                           // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_46;                           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_47;                           // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_48;                           // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_49;                           // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_50;                           // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_51;                           // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_52;                           // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_53;                           // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_54;                           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_55;                           // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_56;                           // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_57;                           // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_58;                           // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_59;                           // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_60;                           // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_61;                           // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_62;                           // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_63;                           // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_64;                           // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_65;                           // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_66;                           // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_67;                           // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_68;                           // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_69;                           // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_70;                           // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_71;                           // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_72;                           // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_73;                           // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_74;                           // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_75;                           // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_76;                           // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_77;                           // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_78;                           // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_79;                           // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_80;                           // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_81;                           // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_82;                           // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_83;                           // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_84;                           // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_85;                           // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_86;                           // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_87;                           // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_88;                           // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_89;                           // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverAnimMontageId                          Temp_byte_Variable_3;                              // 0x02E4(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverAnimMontageId                          Temp_byte_Variable_4;                              // 0x02E5(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverAnimMontageId                          Temp_byte_Variable_5;                              // 0x02E6(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E7[0x1];                                      // 0x02E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          K2Node_Select_Default;                             // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x02F0(0x0004)()
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable_6;                              // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     K2Node_Select_Default_1;                           // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverAnimMontageId                          K2Node_Select_Default_2;                           // 0x0305(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     K2Node_Select_Default_3;                           // 0x0306(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307[0x1];                                      // 0x0307(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IDriverAnimator>       CallFunc_PlayAnimation_self_CastInput;             // 0x0308(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue;                  // 0x0318(0x0004)()
};
static_assert(alignof(BP_MenuRacerPreview_C_DecideChara) == 0x000008, "Wrong alignment on BP_MenuRacerPreview_C_DecideChara");
static_assert(sizeof(BP_MenuRacerPreview_C_DecideChara) == 0x000320, "Wrong size on BP_MenuRacerPreview_C_DecideChara");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, InPlayerIndex) == 0x000000, "Member 'BP_MenuRacerPreview_C_DecideChara::InPlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, InSelectedPlayerCount) == 0x000004, "Member 'BP_MenuRacerPreview_C_DecideChara::InSelectedPlayerCount' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_byte_Variable) == 0x000008, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_bool_Variable) == 0x000009, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_byte_Variable_1) == 0x00000A, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_byte_Variable_2) == 0x00000B, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable) == 0x000010, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_1) == 0x000018, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_2) == 0x000020, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_3) == 0x000028, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_4) == 0x000030, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_5) == 0x000038, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_6) == 0x000040, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_7) == 0x000048, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_8) == 0x000050, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_9) == 0x000058, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_10) == 0x000060, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_11) == 0x000068, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_12) == 0x000070, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_13) == 0x000078, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_14) == 0x000080, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_15) == 0x000088, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_16) == 0x000090, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_17) == 0x000098, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_18) == 0x0000A0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_19) == 0x0000A8, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_20) == 0x0000B0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_20' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_21) == 0x0000B8, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_21' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_22) == 0x0000C0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_22' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_23) == 0x0000C8, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_23' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_24) == 0x0000D0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_24' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_25) == 0x0000D8, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_25' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_26) == 0x0000E0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_26' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_27) == 0x0000E8, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_27' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_28) == 0x0000F0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_28' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_29) == 0x0000F8, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_29' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_30) == 0x000100, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_30' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_31) == 0x000108, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_31' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_32) == 0x000110, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_32' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_33) == 0x000118, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_33' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_34) == 0x000120, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_34' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_35) == 0x000128, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_35' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_36) == 0x000130, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_36' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_37) == 0x000138, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_37' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_38) == 0x000140, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_38' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_39) == 0x000148, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_39' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_40) == 0x000150, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_40' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_41) == 0x000158, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_41' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_42) == 0x000160, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_42' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_43) == 0x000168, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_43' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_44) == 0x000170, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_44' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_45) == 0x000178, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_45' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_46) == 0x000180, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_46' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_47) == 0x000188, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_47' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_48) == 0x000190, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_48' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_49) == 0x000198, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_49' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_50) == 0x0001A0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_50' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_51) == 0x0001A8, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_51' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_52) == 0x0001B0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_52' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_53) == 0x0001B8, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_53' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_54) == 0x0001C0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_54' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_55) == 0x0001C8, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_55' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_56) == 0x0001D0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_56' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_57) == 0x0001D8, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_57' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_58) == 0x0001E0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_58' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_59) == 0x0001E8, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_59' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_60) == 0x0001F0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_60' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_61) == 0x0001F8, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_61' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_62) == 0x000200, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_62' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_63) == 0x000208, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_63' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_64) == 0x000210, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_64' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_65) == 0x000218, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_65' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_66) == 0x000220, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_66' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_67) == 0x000228, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_67' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_68) == 0x000230, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_68' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_69) == 0x000238, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_69' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_70) == 0x000240, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_70' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_71) == 0x000248, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_71' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_72) == 0x000250, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_72' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_73) == 0x000258, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_73' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_74) == 0x000260, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_74' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_75) == 0x000268, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_75' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_76) == 0x000270, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_76' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_77) == 0x000278, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_77' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_78) == 0x000280, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_78' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_79) == 0x000288, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_79' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_80) == 0x000290, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_80' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_81) == 0x000298, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_81' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerPreview_C_DecideChara, Temp_object_Variable_82) == 0x0002A0, "Member 'BP_MenuRacerPreview_C_DecideChara::Temp_object_Variable_82' has a wrong offset!");
