#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MachineCustomizeSequence

#include "Basic.hpp"

#include "ST_GarageData_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionRun_structs.hpp"
#include "EMachineCustomizeSequenceMode_structs.hpp"


namespace SDK::Params
{

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.Deregister
// 0x0068 (0x0068 - 0x0000)
struct BP_MachineCustomizeSequence_C_Deregister final
{
public:
	struct FST_GarageData                         CallFunc_GetGarageData_OutGarageData;              // 0x0000(0x0058)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_Deregister) == 0x000008, "Wrong alignment on BP_MachineCustomizeSequence_C_Deregister");
static_assert(sizeof(BP_MachineCustomizeSequence_C_Deregister) == 0x000068, "Wrong size on BP_MachineCustomizeSequence_C_Deregister");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Deregister, CallFunc_GetGarageData_OutGarageData) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_Deregister::CallFunc_GetGarageData_OutGarageData' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Deregister, CallFunc_GetAppPlayerController_ReturnValue) == 0x000058, "Member 'BP_MachineCustomizeSequence_C_Deregister::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Deregister, CallFunc_UnregisterSingleSubMenu_ReturnValue) == 0x000060, "Member 'BP_MachineCustomizeSequence_C_Deregister::CallFunc_UnregisterSingleSubMenu_ReturnValue' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.DispatchOnMachineSelectedEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_MachineCustomizeSequence_C_DispatchOnMachineSelectedEvent final
{
public:
	EMachineId                                    CallFunc_GetSelectedMachineId_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_DispatchOnMachineSelectedEvent) == 0x000001, "Wrong alignment on BP_MachineCustomizeSequence_C_DispatchOnMachineSelectedEvent");
static_assert(sizeof(BP_MachineCustomizeSequence_C_DispatchOnMachineSelectedEvent) == 0x000001, "Wrong size on BP_MachineCustomizeSequence_C_DispatchOnMachineSelectedEvent");
static_assert(offsetof(BP_MachineCustomizeSequence_C_DispatchOnMachineSelectedEvent, CallFunc_GetSelectedMachineId_ReturnValue) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_DispatchOnMachineSelectedEvent::CallFunc_GetSelectedMachineId_ReturnValue' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.DispatchOnShortcutCustomizeStartedEvent
// 0x0002 (0x0002 - 0x0000)
struct BP_MachineCustomizeSequence_C_DispatchOnShortcutCustomizeStartedEvent final
{
public:
	EMachineId                                    InMachineID;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachinePartsType                             InMachinePartsType;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_DispatchOnShortcutCustomizeStartedEvent) == 0x000001, "Wrong alignment on BP_MachineCustomizeSequence_C_DispatchOnShortcutCustomizeStartedEvent");
static_assert(sizeof(BP_MachineCustomizeSequence_C_DispatchOnShortcutCustomizeStartedEvent) == 0x000002, "Wrong size on BP_MachineCustomizeSequence_C_DispatchOnShortcutCustomizeStartedEvent");
static_assert(offsetof(BP_MachineCustomizeSequence_C_DispatchOnShortcutCustomizeStartedEvent, InMachineID) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_DispatchOnShortcutCustomizeStartedEvent::InMachineID' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_DispatchOnShortcutCustomizeStartedEvent, InMachinePartsType) == 0x000001, "Member 'BP_MachineCustomizeSequence_C_DispatchOnShortcutCustomizeStartedEvent::InMachinePartsType' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.ExecuteUbergraph_BP_MachineCustomizeSequence
// 0x0028 (0x0028 - 0x0000)
struct BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMachineCustomTop*                      CallFunc_GetMachineCustomTop_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMachineCustomTop*                      CallFunc_GetMachineCustomTop_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMachineCustomInfoWindow*               CallFunc_GetMachineInfoWidget_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence) == 0x000008, "Wrong alignment on BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence");
static_assert(sizeof(BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence) == 0x000028, "Wrong size on BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence");
static_assert(offsetof(BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence, EntryPoint) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence, CallFunc_GetMachineCustomTop_ReturnValue) == 0x000008, "Member 'BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence::CallFunc_GetMachineCustomTop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence, CallFunc_GetMachineCustomTop_ReturnValue_1) == 0x000010, "Member 'BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence::CallFunc_GetMachineCustomTop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence, CallFunc_GetMachineInfoWidget_ReturnValue) == 0x000018, "Member 'BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence::CallFunc_GetMachineInfoWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'BP_MachineCustomizeSequence_C_ExecuteUbergraph_BP_MachineCustomizeSequence::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.GetMachineParams
// 0x02E8 (0x02E8 - 0x0000)
struct BP_MachineCustomizeSequence_C_GetMachineParams final
{
public:
	struct FUserMachineCustomizeData              InCustomizeData;                                   // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        OutSpeed;                                          // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutAccel;                                          // 0x0080(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutHandling;                                       // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutPower;                                          // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutDash;                                           // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                CallFunc_GetCarStatusType_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachineCustomParamData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x00B0(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMachineCustomParamData                CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00E0(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_2;          // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_3;          // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachineCustomParamData                CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0118(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachineCustomParamData                CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0140(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_4;          // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachineCustomParamData                CallFunc_GetDataTableRowFromName_OutRow_4;         // 0x0170(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_4;    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_5;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_6;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_7;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_8;           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_9;           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_10;          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_11;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_12;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_13;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_14;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_2;        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_3;        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_4;        // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_5;        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_6;        // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_7;        // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_8;        // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_9;        // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_10;       // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_11;       // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_12;       // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_13;       // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_14;       // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_2;        // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_3;        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_4;        // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_5;        // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_6;        // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_7;        // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_8;        // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_9;        // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_GetMachineParams) == 0x000008, "Wrong alignment on BP_MachineCustomizeSequence_C_GetMachineParams");
static_assert(sizeof(BP_MachineCustomizeSequence_C_GetMachineParams) == 0x0002E8, "Wrong size on BP_MachineCustomizeSequence_C_GetMachineParams");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, InCustomizeData) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::InCustomizeData' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, OutSpeed) == 0x000078, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::OutSpeed' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, OutAccel) == 0x000080, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::OutAccel' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, OutHandling) == 0x000088, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::OutHandling' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, OutPower) == 0x000090, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::OutPower' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, OutDash) == 0x000098, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::OutDash' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetEnumeratorName_ReturnValue) == 0x0000A0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetCarStatusType_ReturnValue) == 0x0000A8, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetCarStatusType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000B0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000D4, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetEnumeratorName_ReturnValue_1) == 0x0000D8, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetEnumeratorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000E0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000100, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetEnumeratorName_ReturnValue_2) == 0x000104, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetEnumeratorName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetEnumeratorName_ReturnValue_3) == 0x00010C, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetEnumeratorName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000118, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000138, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x000140, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetDataTableRowFromName_ReturnValue_3) == 0x000160, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetDataTableRowFromName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetEnumeratorName_ReturnValue_4) == 0x000164, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetEnumeratorName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetDataTableRowFromName_OutRow_4) == 0x000170, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetDataTableRowFromName_OutRow_4' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_GetDataTableRowFromName_ReturnValue_4) == 0x000190, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_GetDataTableRowFromName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000198, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0001A0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0001A8, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x0001B0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x0001B8, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_5) == 0x0001C0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_6) == 0x0001C8, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_7) == 0x0001D0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_8) == 0x0001D8, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_9) == 0x0001E0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_10) == 0x0001E8, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_11) == 0x0001F0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_12) == 0x0001F8, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_13) == 0x000200, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_ReturnValue_14) == 0x000208, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_MakeLiteralByte_ReturnValue) == 0x000210, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000214, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000218, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000220, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x000228, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_2) == 0x000230, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_3) == 0x000238, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_4) == 0x000240, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_5) == 0x000248, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_6) == 0x000250, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_7) == 0x000258, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_8) == 0x000260, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_9) == 0x000268, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_10) == 0x000270, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_10' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_11) == 0x000278, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_11' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_12) == 0x000280, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_12' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_13) == 0x000288, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_13' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_B_ImplicitCast_14) == 0x000290, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_B_ImplicitCast_14' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000298, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x0002A0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_A_ImplicitCast_2) == 0x0002A8, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_A_ImplicitCast_3) == 0x0002B0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_A_ImplicitCast_4) == 0x0002B8, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_A_ImplicitCast_5) == 0x0002C0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_A_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_A_ImplicitCast_6) == 0x0002C8, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_A_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_A_ImplicitCast_7) == 0x0002D0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_A_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_A_ImplicitCast_8) == 0x0002D8, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_A_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_GetMachineParams, CallFunc_Add_DoubleDouble_A_ImplicitCast_9) == 0x0002E0, "Member 'BP_MachineCustomizeSequence_C_GetMachineParams::CallFunc_Add_DoubleDouble_A_ImplicitCast_9' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.Register
// 0x0068 (0x0068 - 0x0000)
struct BP_MachineCustomizeSequence_C_Register final
{
public:
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMachineCustomTab*                      CallFunc_GetTabWidget_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FST_GarageData                         CallFunc_GetGarageData_OutGarageData;              // 0x0010(0x0058)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_Register) == 0x000008, "Wrong alignment on BP_MachineCustomizeSequence_C_Register");
static_assert(sizeof(BP_MachineCustomizeSequence_C_Register) == 0x000068, "Wrong size on BP_MachineCustomizeSequence_C_Register");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Register, CallFunc_GetAppPlayerController_ReturnValue) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_Register::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Register, CallFunc_GetTabWidget_ReturnValue) == 0x000008, "Member 'BP_MachineCustomizeSequence_C_Register::CallFunc_GetTabWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Register, CallFunc_GetGarageData_OutGarageData) == 0x000010, "Member 'BP_MachineCustomizeSequence_C_Register::CallFunc_GetGarageData_OutGarageData' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.ResetMessageBar
// 0x0001 (0x0001 - 0x0000)
struct BP_MachineCustomizeSequence_C_ResetMessageBar final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_ResetMessageBar) == 0x000001, "Wrong alignment on BP_MachineCustomizeSequence_C_ResetMessageBar");
static_assert(sizeof(BP_MachineCustomizeSequence_C_ResetMessageBar) == 0x000001, "Wrong size on BP_MachineCustomizeSequence_C_ResetMessageBar");
static_assert(offsetof(BP_MachineCustomizeSequence_C_ResetMessageBar, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_ResetMessageBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.SetCanControlParamWindow
// 0x0001 (0x0001 - 0x0000)
struct BP_MachineCustomizeSequence_C_SetCanControlParamWindow final
{
public:
	bool                                          bInCanControl;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_SetCanControlParamWindow) == 0x000001, "Wrong alignment on BP_MachineCustomizeSequence_C_SetCanControlParamWindow");
static_assert(sizeof(BP_MachineCustomizeSequence_C_SetCanControlParamWindow) == 0x000001, "Wrong size on BP_MachineCustomizeSequence_C_SetCanControlParamWindow");
static_assert(offsetof(BP_MachineCustomizeSequence_C_SetCanControlParamWindow, bInCanControl) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_SetCanControlParamWindow::bInCanControl' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.SetCanControlTurntable
// 0x0001 (0x0001 - 0x0000)
struct BP_MachineCustomizeSequence_C_SetCanControlTurntable final
{
public:
	bool                                          bInCanControl;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_SetCanControlTurntable) == 0x000001, "Wrong alignment on BP_MachineCustomizeSequence_C_SetCanControlTurntable");
static_assert(sizeof(BP_MachineCustomizeSequence_C_SetCanControlTurntable) == 0x000001, "Wrong size on BP_MachineCustomizeSequence_C_SetCanControlTurntable");
static_assert(offsetof(BP_MachineCustomizeSequence_C_SetCanControlTurntable, bInCanControl) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_SetCanControlTurntable::bInCanControl' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.SetFocusToDummy
// 0x0010 (0x0010 - 0x0000)
struct BP_MachineCustomizeSequence_C_SetFocusToDummy final
{
public:
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_SetFocusToDummy) == 0x000008, "Wrong alignment on BP_MachineCustomizeSequence_C_SetFocusToDummy");
static_assert(sizeof(BP_MachineCustomizeSequence_C_SetFocusToDummy) == 0x000010, "Wrong size on BP_MachineCustomizeSequence_C_SetFocusToDummy");
static_assert(offsetof(BP_MachineCustomizeSequence_C_SetFocusToDummy, CallFunc_GetAppPlayerController_ReturnValue) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_SetFocusToDummy::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_SetFocusToDummy, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_MachineCustomizeSequence_C_SetFocusToDummy::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.SetGarageData
// 0x0058 (0x0058 - 0x0000)
struct BP_MachineCustomizeSequence_C_SetGarageData final
{
public:
	struct FST_GarageData                         InGarageData;                                      // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_SetGarageData) == 0x000008, "Wrong alignment on BP_MachineCustomizeSequence_C_SetGarageData");
static_assert(sizeof(BP_MachineCustomizeSequence_C_SetGarageData) == 0x000058, "Wrong size on BP_MachineCustomizeSequence_C_SetGarageData");
static_assert(offsetof(BP_MachineCustomizeSequence_C_SetGarageData, InGarageData) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_SetGarageData::InGarageData' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.SetHasExitedByShortcut
// 0x0001 (0x0001 - 0x0000)
struct BP_MachineCustomizeSequence_C_SetHasExitedByShortcut final
{
public:
	bool                                          bInHasExited;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_SetHasExitedByShortcut) == 0x000001, "Wrong alignment on BP_MachineCustomizeSequence_C_SetHasExitedByShortcut");
static_assert(sizeof(BP_MachineCustomizeSequence_C_SetHasExitedByShortcut) == 0x000001, "Wrong size on BP_MachineCustomizeSequence_C_SetHasExitedByShortcut");
static_assert(offsetof(BP_MachineCustomizeSequence_C_SetHasExitedByShortcut, bInHasExited) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_SetHasExitedByShortcut::bInHasExited' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.SetMessageBarVisible
// 0x0001 (0x0001 - 0x0000)
struct BP_MachineCustomizeSequence_C_SetMessageBarVisible final
{
public:
	bool                                          Is_Message_Bar_Visible_0;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_SetMessageBarVisible) == 0x000001, "Wrong alignment on BP_MachineCustomizeSequence_C_SetMessageBarVisible");
static_assert(sizeof(BP_MachineCustomizeSequence_C_SetMessageBarVisible) == 0x000001, "Wrong size on BP_MachineCustomizeSequence_C_SetMessageBarVisible");
static_assert(offsetof(BP_MachineCustomizeSequence_C_SetMessageBarVisible, Is_Message_Bar_Visible_0) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_SetMessageBarVisible::Is_Message_Bar_Visible_0' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.Setup
// 0x0070 (0x0070 - 0x0000)
struct BP_MachineCustomizeSequence_C_Setup final
{
public:
	struct FST_GarageData                         InGarageData;                                      // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineCustomizeSequenceMode                 Temp_byte_Variable;                                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasEnteredMachineCustomizeSequence_ReturnValue; // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                CallFunc_GetCarStatusType_ReturnValue;             // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select_Default;                             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_Setup) == 0x000008, "Wrong alignment on BP_MachineCustomizeSequence_C_Setup");
static_assert(sizeof(BP_MachineCustomizeSequence_C_Setup) == 0x000070, "Wrong size on BP_MachineCustomizeSequence_C_Setup");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Setup, InGarageData) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_Setup::InGarageData' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Setup, CallFunc_MakeLiteralByte_ReturnValue) == 0x000058, "Member 'BP_MachineCustomizeSequence_C_Setup::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Setup, Temp_byte_Variable) == 0x000059, "Member 'BP_MachineCustomizeSequence_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Setup, CallFunc_HasEnteredMachineCustomizeSequence_ReturnValue) == 0x00005A, "Member 'BP_MachineCustomizeSequence_C_Setup::CallFunc_HasEnteredMachineCustomizeSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Setup, CallFunc_GetCarStatusType_ReturnValue) == 0x00005B, "Member 'BP_MachineCustomizeSequence_C_Setup::CallFunc_GetCarStatusType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Setup, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000060, "Member 'BP_MachineCustomizeSequence_C_Setup::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Setup, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000068, "Member 'BP_MachineCustomizeSequence_C_Setup::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Setup, K2Node_Select_Default) == 0x000069, "Member 'BP_MachineCustomizeSequence_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_Setup, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00006C, "Member 'BP_MachineCustomizeSequence_C_Setup::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.SetupMessageBar
// 0x0020 (0x0020 - 0x0000)
struct BP_MachineCustomizeSequence_C_SetupMessageBar final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	class UWBP_CMN_MessageBar_C*                  CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_SetupMessageBar) == 0x000008, "Wrong alignment on BP_MachineCustomizeSequence_C_SetupMessageBar");
static_assert(sizeof(BP_MachineCustomizeSequence_C_SetupMessageBar) == 0x000020, "Wrong size on BP_MachineCustomizeSequence_C_SetupMessageBar");
static_assert(offsetof(BP_MachineCustomizeSequence_C_SetupMessageBar, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_SetupMessageBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_SetupMessageBar, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'BP_MachineCustomizeSequence_C_SetupMessageBar::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_SetupMessageBar, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BP_MachineCustomizeSequence_C_SetupMessageBar::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_MachineCustomizeSequence.BP_MachineCustomizeSequence_C.UpdateParamWindowByCustomizeData
// 0x02A8 (0x02A8 - 0x0000)
struct BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData final
{
public:
	struct FUserMachineCustomizeData              InCurrentCustomizeData;                            // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FUserMachineCustomizeData              InCandCustomizeData;                               // 0x0078(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UCharaMachineParamWindow*               ParamWindow;                                       // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<EGadgetId>                             TempGadgetIds;                                     // 0x00F8(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGadgetPlateUIData                     CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData; // 0x0118(0x0028)()
	struct FUserGadgetData                        CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRacerParamData                        K2Node_MakeStruct_RacerParamData;                  // 0x0154(0x0050)(NoDestructor)
	struct FRacerParamData                        K2Node_MakeStruct_RacerParamData_1;                // 0x01A4(0x0050)(NoDestructor)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGadgetId>                             K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ConstParm, ReferenceParm)
	struct FRacerParamData                        CallFunc_GetParamData_OutParamData;                // 0x0208(0x0050)(NoDestructor)
	struct FRacerParamData                        CallFunc_GetParamData_OutParamData_1;              // 0x0258(0x0050)(NoDestructor)
};
static_assert(alignof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData) == 0x000008, "Wrong alignment on BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData");
static_assert(sizeof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData) == 0x0002A8, "Wrong size on BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, InCurrentCustomizeData) == 0x000000, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::InCurrentCustomizeData' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, InCandCustomizeData) == 0x000078, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::InCandCustomizeData' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, ParamWindow) == 0x0000F0, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::ParamWindow' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, TempGadgetIds) == 0x0000F8, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::TempGadgetIds' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, Temp_int_Array_Index_Variable) == 0x000108, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, Temp_int_Loop_Counter_Variable) == 0x00010C, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, CallFunc_Add_IntInt_ReturnValue) == 0x000110, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData) == 0x000118, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, CallFunc_Array_Get_Item) == 0x000140, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, CallFunc_Less_IntInt_ReturnValue) == 0x00014C, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, CallFunc_Array_Add_ReturnValue) == 0x000150, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData, K2Node_MakeStruct_RacerParamData) == 0x000154, "Member 'BP_MachineCustomizeSequence_C_UpdateParamWindowByCustomizeData::K2Node_MakeStruct_RacerParamData' has a wrong offset!");
