#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MenuRacerLobby

#include "Basic.hpp"

#include "ST_RacerDataForPreview_structs.hpp"
#include "UnionRun_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MenuRacerLobby.BP_MenuRacerLobby_C.Attach Driver
// 0x0308 (0x0308 - 0x0000)
struct BP_MenuRacerLobby_C_Attach_Driver final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x0008(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult_1; // 0x0100(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult; // 0x01F8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F3[0x5];                                      // 0x02F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue_1;           // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerLobby_C_Attach_Driver) == 0x000008, "Wrong alignment on BP_MenuRacerLobby_C_Attach_Driver");
static_assert(sizeof(BP_MenuRacerLobby_C_Attach_Driver) == 0x000308, "Wrong size on BP_MenuRacerLobby_C_Attach_Driver");
static_assert(offsetof(BP_MenuRacerLobby_C_Attach_Driver, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_MenuRacerLobby_C_Attach_Driver::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_Attach_Driver, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_MenuRacerLobby_C_Attach_Driver::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_Attach_Driver, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x000008, "Member 'BP_MenuRacerLobby_C_Attach_Driver::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_Attach_Driver, CallFunc_K2_SetActorRelativeLocation_SweepHitResult_1) == 0x000100, "Member 'BP_MenuRacerLobby_C_Attach_Driver::CallFunc_K2_SetActorRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_Attach_Driver, CallFunc_K2_SetActorRelativeRotation_SweepHitResult) == 0x0001F8, "Member 'BP_MenuRacerLobby_C_Attach_Driver::CallFunc_K2_SetActorRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_Attach_Driver, CallFunc_IsValid_ReturnValue_2) == 0x0002F0, "Member 'BP_MenuRacerLobby_C_Attach_Driver::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_Attach_Driver, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0002F1, "Member 'BP_MenuRacerLobby_C_Attach_Driver::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_Attach_Driver, CallFunc_K2_AttachToActor_ReturnValue) == 0x0002F2, "Member 'BP_MenuRacerLobby_C_Attach_Driver::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_Attach_Driver, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x0002F8, "Member 'BP_MenuRacerLobby_C_Attach_Driver::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_Attach_Driver, CallFunc_IsValid_ReturnValue_3) == 0x000300, "Member 'BP_MenuRacerLobby_C_Attach_Driver::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_Attach_Driver, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000301, "Member 'BP_MenuRacerLobby_C_Attach_Driver::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_Attach_Driver, CallFunc_K2_AttachToActor_ReturnValue_1) == 0x000302, "Member 'BP_MenuRacerLobby_C_Attach_Driver::CallFunc_K2_AttachToActor_ReturnValue_1' has a wrong offset!");

// Function BP_MenuRacerLobby.BP_MenuRacerLobby_C.ChangeMachineColor
// 0x0008 (0x0008 - 0x0000)
struct BP_MenuRacerLobby_C_ChangeMachineColor final
{
public:
	int32                                         InGroupIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InEnableEffect;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerLobby_C_ChangeMachineColor) == 0x000004, "Wrong alignment on BP_MenuRacerLobby_C_ChangeMachineColor");
static_assert(sizeof(BP_MenuRacerLobby_C_ChangeMachineColor) == 0x000008, "Wrong size on BP_MenuRacerLobby_C_ChangeMachineColor");
static_assert(offsetof(BP_MenuRacerLobby_C_ChangeMachineColor, InGroupIndex) == 0x000000, "Member 'BP_MenuRacerLobby_C_ChangeMachineColor::InGroupIndex' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ChangeMachineColor, InEnableEffect) == 0x000004, "Member 'BP_MenuRacerLobby_C_ChangeMachineColor::InEnableEffect' has a wrong offset!");

// Function BP_MenuRacerLobby.BP_MenuRacerLobby_C.CheckChangeParam
// 0x000F (0x000F - 0x0000)
struct BP_MenuRacerLobby_C_CheckChangeParam final
{
public:
	EDriverId                                     Racer_Data_Driver_Id;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                Racer_Data_Vehicle_Type;                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    Racer_Data_Front_Parts_Id;                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    Racer_Data_Rear_Parts_Id;                          // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    Racer_Data_Tire_Parts_Id;                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangedDriverId;                                   // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangedVehicleType;                                // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangedFrontPartsId;                               // 0x0007(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangedRearPartsId;                                // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangedTirePartsId;                                // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_4;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerLobby_C_CheckChangeParam) == 0x000001, "Wrong alignment on BP_MenuRacerLobby_C_CheckChangeParam");
static_assert(sizeof(BP_MenuRacerLobby_C_CheckChangeParam) == 0x00000F, "Wrong size on BP_MenuRacerLobby_C_CheckChangeParam");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, Racer_Data_Driver_Id) == 0x000000, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::Racer_Data_Driver_Id' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, Racer_Data_Vehicle_Type) == 0x000001, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::Racer_Data_Vehicle_Type' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, Racer_Data_Front_Parts_Id) == 0x000002, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::Racer_Data_Front_Parts_Id' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, Racer_Data_Rear_Parts_Id) == 0x000003, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::Racer_Data_Rear_Parts_Id' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, Racer_Data_Tire_Parts_Id) == 0x000004, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::Racer_Data_Tire_Parts_Id' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, ChangedDriverId) == 0x000005, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::ChangedDriverId' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, ChangedVehicleType) == 0x000006, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::ChangedVehicleType' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, ChangedFrontPartsId) == 0x000007, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::ChangedFrontPartsId' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, ChangedRearPartsId) == 0x000008, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::ChangedRearPartsId' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, ChangedTirePartsId) == 0x000009, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::ChangedTirePartsId' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00000B, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x00000C, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x00000D, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_CheckChangeParam, CallFunc_NotEqual_ByteByte_ReturnValue_4) == 0x00000E, "Member 'BP_MenuRacerLobby_C_CheckChangeParam::CallFunc_NotEqual_ByteByte_ReturnValue_4' has a wrong offset!");

// Function BP_MenuRacerLobby.BP_MenuRacerLobby_C.DestroyCrown
// 0x0001 (0x0001 - 0x0000)
struct BP_MenuRacerLobby_C_DestroyCrown final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerLobby_C_DestroyCrown) == 0x000001, "Wrong alignment on BP_MenuRacerLobby_C_DestroyCrown");
static_assert(sizeof(BP_MenuRacerLobby_C_DestroyCrown) == 0x000001, "Wrong size on BP_MenuRacerLobby_C_DestroyCrown");
static_assert(offsetof(BP_MenuRacerLobby_C_DestroyCrown, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_MenuRacerLobby_C_DestroyCrown::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MenuRacerLobby.BP_MenuRacerLobby_C.DestroyDriverActor
// 0x0001 (0x0001 - 0x0000)
struct BP_MenuRacerLobby_C_DestroyDriverActor final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerLobby_C_DestroyDriverActor) == 0x000001, "Wrong alignment on BP_MenuRacerLobby_C_DestroyDriverActor");
static_assert(sizeof(BP_MenuRacerLobby_C_DestroyDriverActor) == 0x000001, "Wrong size on BP_MenuRacerLobby_C_DestroyDriverActor");
static_assert(offsetof(BP_MenuRacerLobby_C_DestroyDriverActor, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_MenuRacerLobby_C_DestroyDriverActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MenuRacerLobby.BP_MenuRacerLobby_C.DestroyMachineComponet
// 0x0002 (0x0002 - 0x0000)
struct BP_MenuRacerLobby_C_DestroyMachineComponet final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerLobby_C_DestroyMachineComponet) == 0x000001, "Wrong alignment on BP_MenuRacerLobby_C_DestroyMachineComponet");
static_assert(sizeof(BP_MenuRacerLobby_C_DestroyMachineComponet) == 0x000002, "Wrong size on BP_MenuRacerLobby_C_DestroyMachineComponet");
static_assert(offsetof(BP_MenuRacerLobby_C_DestroyMachineComponet, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_MenuRacerLobby_C_DestroyMachineComponet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_DestroyMachineComponet, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_MenuRacerLobby_C_DestroyMachineComponet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_MenuRacerLobby.BP_MenuRacerLobby_C.ExecuteUbergraph_BP_MenuRacerLobby
// 0x0D90 (0x0D90 - 0x0000)
struct BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ExponentialEaseIn_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EDriverVoiceId                                K2Node_CustomEvent_InDriverVoiceId;                // 0x00B8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     K2Node_CustomEvent_InSoundPan;                     // 0x00B9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IDriverVoicePlayer>    CallFunc_PlayVoice_self_CastInput;                 // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x0100(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x01F8(0x0004)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDriverCrownDataTableStruct            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0278(0x0060)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_3;        // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_3;                      // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult_1; // 0x0348(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult_2; // 0x0440(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Polling_Set_Sticker_IsCompleteSetSticker; // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Polling_Set_Sticker_IsCompleteSetSticker_1; // 0x0539(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A[0x6];                                      // 0x053A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_StateId;                              // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0560(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InGroupIndex;                         // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InEnableEffect;                       // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGroupColorId                                 CallFunc_GetGroupColorId_ReturnValue;              // 0x0572(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineColorPresetId                         CallFunc_GetGroupMachineColorPresetId_ReturnValue; // 0x0573(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0574(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIColorInfo                           CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0580(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x3];                                      // 0x05A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x05A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x05B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x05B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x05B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B7[0x1];                                      // 0x05B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x05C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FDriverCrownDataTableStruct            CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x06B8(0x0060)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0720(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0730(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDriverData                            CallFunc_GetDriverData_OutDriverData;              // 0x0740(0x0390)()
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_2;          // 0x0AD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0AD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDriverCrownDataTableStruct            CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0AE0(0x0060)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0B40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVisible;                           // 0x0B41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0B42(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B43[0x1];                                      // 0x0B43(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0B44(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B54[0x4];                                      // 0x0B54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0B58(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0B60(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsNotSpawn;                          // 0x0B78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B79[0x7];                                      // 0x0B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0B80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0B88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0B90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_4;        // 0x0B98(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_5;        // 0x0BB0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0BC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC9[0x7];                                      // 0x0BC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0BD0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0BE8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0CE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0CE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE2[0x2];                                      // 0x0CE2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NewForcedLodModel;                    // 0x0CE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE8[0x8];                                      // 0x0CE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0CF0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0D50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D51[0x7];                                      // 0x0D51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0D58(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ChampionCrown_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0D60(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0D68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D69[0x3];                                      // 0x0D69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ExponentialEaseIn_t_ImplicitCast;         // 0x0D6C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0D70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x0D78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7C[0x4];                                      // 0x0D7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0D80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby) == 0x000010, "Wrong alignment on BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby");
static_assert(sizeof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby) == 0x000D90, "Wrong size on BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, EntryPoint) == 0x000000, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_MakeLiteralByte_ReturnValue) == 0x000006, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, Temp_bool_Has_Been_Initd_Variable_1) == 0x000007, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, Temp_bool_IsClosed_Variable_1) == 0x00000C, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_IsValid_ReturnValue) == 0x00000D, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, Temp_bool_Variable) == 0x000014, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, Temp_bool_IsClosed_Variable_2) == 0x000015, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000016, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_ExponentialEaseIn_ReturnValue) == 0x000028, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_ExponentialEaseIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00002C, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_VLerp_ReturnValue) == 0x000030, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_AddComponent_ReturnValue) == 0x0000B0, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, K2Node_CustomEvent_InDriverVoiceId) == 0x0000B8, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::K2Node_CustomEvent_InDriverVoiceId' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, K2Node_CustomEvent_InSoundPan) == 0x0000B9, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::K2Node_CustomEvent_InSoundPan' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_PlayVoice_self_CastInput) == 0x0000C0, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_PlayVoice_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_SetStaticMesh_ReturnValue) == 0x0000D0, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_IsValid_ReturnValue_1) == 0x0000D1, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, Temp_bool_Has_Been_Initd_Variable_2) == 0x0000D2, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000D8, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_VLerp_ReturnValue_1) == 0x0000E0, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x0000F8, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_IsValid_ReturnValue_2) == 0x0000F9, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x000100, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_SoundPlay_ReturnValue) == 0x0001F8, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_IsValid_ReturnValue_3) == 0x0001FC, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_IsValid_ReturnValue_4) == 0x0001FD, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, K2Node_Select_Default) == 0x000200, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_IsValid_ReturnValue_5) == 0x000208, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, Temp_bool_Has_Been_Initd_Variable_3) == 0x000209, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000210, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_IsValid_ReturnValue_6) == 0x000228, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000230, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000248, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_VLerp_ReturnValue_2) == 0x000260, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetDataTableRowFromName_OutRow) == 0x000278, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002D8, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Conv_DoubleToVector_ReturnValue_3) == 0x0002E0, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Conv_DoubleToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_IsValid_ReturnValue_7) == 0x0002F8, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Vector_Zero_ReturnValue) == 0x000300, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_SelectVector_ReturnValue) == 0x000318, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_VLerp_ReturnValue_3) == 0x000330, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_VLerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_K2_SetActorRelativeLocation_SweepHitResult_1) == 0x000348, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_K2_SetActorRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_K2_SetActorRelativeLocation_SweepHitResult_2) == 0x000440, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_K2_SetActorRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Polling_Set_Sticker_IsCompleteSetSticker) == 0x000538, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Polling_Set_Sticker_IsCompleteSetSticker' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Polling_Set_Sticker_IsCompleteSetSticker_1) == 0x000539, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Polling_Set_Sticker_IsCompleteSetSticker_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000540, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, K2Node_Event_StateId) == 0x000558, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::K2Node_Event_StateId' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, K2Node_Event_Index) == 0x00055C, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000560, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Conv_IntToByte_ReturnValue) == 0x000568, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, K2Node_Event_InGroupIndex) == 0x00056C, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::K2Node_Event_InGroupIndex' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, K2Node_Event_InEnableEffect) == 0x000570, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::K2Node_Event_InEnableEffect' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetValidValue_ReturnValue) == 0x000571, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetGroupColorId_ReturnValue) == 0x000572, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetGroupColorId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetGroupMachineColorPresetId_ReturnValue) == 0x000573, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetGroupMachineColorPresetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetEnumeratorName_ReturnValue) == 0x000574, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000580, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0005A0, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x0005A4, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_IsValid_ReturnValue_8) == 0x0005B4, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, Temp_bool_IsClosed_Variable_3) == 0x0005B5, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_IsValid_ReturnValue_9) == 0x0005B6, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetEnumeratorName_ReturnValue_1) == 0x0005B8, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetEnumeratorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0005C0, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x0006B8, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000718, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Conv_NameToString_ReturnValue) == 0x000720, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_Concat_StrStr_ReturnValue) == 0x000730, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetDriverData_OutDriverData) == 0x000740, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetDriverData_OutDriverData' has a wrong offset!");
static_assert(offsetof(BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby, CallFunc_GetEnumeratorName_ReturnValue_2) == 0x000AD0, "Member 'BP_MenuRacerLobby_C_ExecuteUbergraph_BP_MenuRacerLobby::CallFunc_GetEnumeratorName_ReturnValue_2' has a wrong offset!");
