#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MonsterTruckActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function BP_MonsterTruckActor.BP_MonsterTruckActor_C.ExecuteUbergraph_BP_MonsterTruckActor
// 0x0378 (0x0378 - 0x0000)
struct BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0018(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0028(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_bIsPlay;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_Color;                                // 0x003C(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWithDriver;                          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0050(0x0010)()
	EDriverSize                                   K2Node_Event_InDriverSize_1;                       // 0x0060(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverSize                                   K2Node_Event_InDriverSize;                         // 0x0061(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_2;          // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_3;          // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0088(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0098(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0138(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0158(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0168(0x0010)()
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_4;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_5;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_2;            // 0x0188(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_3;            // 0x0198(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01A8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01F0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0238(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0248(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0258(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x0268(0x0010)()
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMonsterTruckCockpitAssetData          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0288(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMonsterTruckCockpitAssetData          CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x02E8(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_As_________;                    // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsAnim______;              // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor) == 0x000008, "Wrong alignment on BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor");
static_assert(sizeof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor) == 0x000378, "Wrong size on BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, EntryPoint) == 0x000000, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_Format_ReturnValue) == 0x000018, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_MakeArray_Array_1) == 0x000028, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_Event_bIsPlay) == 0x000038, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_Event_bIsPlay' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_Event_Color) == 0x00003C, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_Event_Color' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_Event_bWithDriver) == 0x00004C, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_Event_bWithDriver' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_Format_ReturnValue_1) == 0x000050, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_Event_InDriverSize_1) == 0x000060, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_Event_InDriverSize_1' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_Event_InDriverSize) == 0x000061, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_Event_InDriverSize' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_GetEnumeratorName_ReturnValue) == 0x000064, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_GetEnumeratorName_ReturnValue_1) == 0x00006C, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_GetEnumeratorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_GetEnumeratorName_ReturnValue_2) == 0x000074, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_GetEnumeratorName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_GetEnumeratorName_ReturnValue_3) == 0x00007C, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_GetEnumeratorName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_Conv_NameToText_ReturnValue) == 0x000088, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000098, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_MakeStruct_FormatArgumentData) == 0x0000A8, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F0, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_MakeArray_Array_2) == 0x000138, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_MakeArray_Array_3) == 0x000148, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_Format_ReturnValue_2) == 0x000158, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_Format_ReturnValue_3) == 0x000168, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_GetEnumeratorName_ReturnValue_4) == 0x000178, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_GetEnumeratorName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_GetEnumeratorName_ReturnValue_5) == 0x000180, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_GetEnumeratorName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_Conv_NameToText_ReturnValue_2) == 0x000188, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_Conv_NameToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_Conv_NameToText_ReturnValue_3) == 0x000198, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_Conv_NameToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001A8, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001F0, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_MakeArray_Array_4) == 0x000238, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_MakeArray_Array_5) == 0x000248, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_Format_ReturnValue_4) == 0x000258, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_Format_ReturnValue_5) == 0x000268, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_Format_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000278, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000280, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_GetDataTableRowFromName_OutRow) == 0x000288, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002E0, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0002E8, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000340, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000348, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000350, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_DynamicCast_As_________) == 0x000358, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_DynamicCast_As_________' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_DynamicCast_bSuccess) == 0x000360, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_ClassDynamicCast_AsAnim______) == 0x000368, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_ClassDynamicCast_AsAnim______' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor, K2Node_ClassDynamicCast_bSuccess) == 0x000370, "Member 'BP_MonsterTruckActor_C_ExecuteUbergraph_BP_MonsterTruckActor::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");

// Function BP_MonsterTruckActor.BP_MonsterTruckActor_C.LoadingCockpitAnimation
// 0x0001 (0x0001 - 0x0000)
struct BP_MonsterTruckActor_C_LoadingCockpitAnimation final
{
public:
	EDriverSize                                   InDriverSize;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MonsterTruckActor_C_LoadingCockpitAnimation) == 0x000001, "Wrong alignment on BP_MonsterTruckActor_C_LoadingCockpitAnimation");
static_assert(sizeof(BP_MonsterTruckActor_C_LoadingCockpitAnimation) == 0x000001, "Wrong size on BP_MonsterTruckActor_C_LoadingCockpitAnimation");
static_assert(offsetof(BP_MonsterTruckActor_C_LoadingCockpitAnimation, InDriverSize) == 0x000000, "Member 'BP_MonsterTruckActor_C_LoadingCockpitAnimation::InDriverSize' has a wrong offset!");

// Function BP_MonsterTruckActor.BP_MonsterTruckActor_C.LoadingCockpitMesh
// 0x0001 (0x0001 - 0x0000)
struct BP_MonsterTruckActor_C_LoadingCockpitMesh final
{
public:
	EDriverSize                                   InDriverSize;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MonsterTruckActor_C_LoadingCockpitMesh) == 0x000001, "Wrong alignment on BP_MonsterTruckActor_C_LoadingCockpitMesh");
static_assert(sizeof(BP_MonsterTruckActor_C_LoadingCockpitMesh) == 0x000001, "Wrong size on BP_MonsterTruckActor_C_LoadingCockpitMesh");
static_assert(offsetof(BP_MonsterTruckActor_C_LoadingCockpitMesh, InDriverSize) == 0x000000, "Member 'BP_MonsterTruckActor_C_LoadingCockpitMesh::InDriverSize' has a wrong offset!");

// Function BP_MonsterTruckActor.BP_MonsterTruckActor_C.OnCountDown
// 0x0018 (0x0018 - 0x0000)
struct BP_MonsterTruckActor_C_OnCountDown final
{
public:
	bool                                          bIsPlay;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0004(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWithDriver;                                       // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MonsterTruckActor_C_OnCountDown) == 0x000004, "Wrong alignment on BP_MonsterTruckActor_C_OnCountDown");
static_assert(sizeof(BP_MonsterTruckActor_C_OnCountDown) == 0x000018, "Wrong size on BP_MonsterTruckActor_C_OnCountDown");
static_assert(offsetof(BP_MonsterTruckActor_C_OnCountDown, bIsPlay) == 0x000000, "Member 'BP_MonsterTruckActor_C_OnCountDown::bIsPlay' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_OnCountDown, Color) == 0x000004, "Member 'BP_MonsterTruckActor_C_OnCountDown::Color' has a wrong offset!");
static_assert(offsetof(BP_MonsterTruckActor_C_OnCountDown, bWithDriver) == 0x000014, "Member 'BP_MonsterTruckActor_C_OnCountDown::bWithDriver' has a wrong offset!");

}

