#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MenuPawn

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MenuPawn.BP_MenuPawn_C
// 0x0018 (0x0330 - 0x0318)
class ABP_MenuPawn_C final : public APawn
{
public:
	class UUnionAtomComponent*                    UnionAtom;                                         // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetInteractionComponent*            WidgetInteraction;                                 // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MenuPawn_C">();
	}
	static class ABP_MenuPawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MenuPawn_C>();
	}
};
static_assert(alignof(ABP_MenuPawn_C) == 0x000008, "Wrong alignment on ABP_MenuPawn_C");
static_assert(sizeof(ABP_MenuPawn_C) == 0x000330, "Wrong size on ABP_MenuPawn_C");
static_assert(offsetof(ABP_MenuPawn_C, UnionAtom) == 0x000318, "Member 'ABP_MenuPawn_C::UnionAtom' has a wrong offset!");
static_assert(offsetof(ABP_MenuPawn_C, WidgetInteraction) == 0x000320, "Member 'ABP_MenuPawn_C::WidgetInteraction' has a wrong offset!");
static_assert(offsetof(ABP_MenuPawn_C, Camera) == 0x000328, "Member 'ABP_MenuPawn_C::Camera' has a wrong offset!");

}

