#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MenuPlayerController

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UnionSystem_classes.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MenuPlayerController.BP_MenuPlayerController_C
// 0x0030 (0x0A68 - 0x0A38)
class ABP_MenuPlayerController_C final : public AMenuPlayerController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FKey>                           Array_Element_Key;                                 // 0x0A40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UInputAction*>                   Array_Element_Action;                              // 0x0A50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          KeyBoardF9Pressed;                                 // 0x0A60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KeyBoardShiftPressed;                              // 0x0A61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KeyBoardCtrlPressed;                               // 0x0A62(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ButtonLeftThumbstickPressed;                       // 0x0A63(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ButtonRightThumbstickPressed;                      // 0x0A64(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ButtonRightTriggerPressed;                         // 0x0A65(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MenuPlayerController(int32 EntryPoint);
	void InpActEvt_F9_K2Node_InputDebugKeyEvent_4(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_F9_K2Node_InputDebugKeyEvent_5(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Gamepad_LeftThumbstick_K2Node_InputDebugKeyEvent_10(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Gamepad_LeftThumbstick_K2Node_InputDebugKeyEvent_11(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Gamepad_RightThumbstick_K2Node_InputDebugKeyEvent_8(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Gamepad_RightThumbstick_K2Node_InputDebugKeyEvent_9(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Gamepad_RightTrigger_K2Node_InputDebugKeyEvent_6(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Gamepad_RightTrigger_K2Node_InputDebugKeyEvent_7(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_LeftControl_K2Node_InputDebugKeyEvent_0(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_LeftControl_K2Node_InputDebugKeyEvent_1(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_LeftShift_K2Node_InputDebugKeyEvent_2(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_LeftShift_K2Node_InputDebugKeyEvent_3(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void KE_DebugInput(EMenuInputKey KeyType);
	void KE_RemoveAllWidgets();
	void OnChangeControllerInputType(EAppControllerInputType BeforeType, EAppControllerInputType AfterType);
	void OnMousePointerEventBP(const struct FPointerEvent& InPointerEvent);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

	bool IsFadeClear() const;
	bool OnIsMenuInputEnabled() const;
	bool OnIsSubMenuInputEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MenuPlayerController_C">();
	}
	static class ABP_MenuPlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MenuPlayerController_C>();
	}
};
static_assert(alignof(ABP_MenuPlayerController_C) == 0x000008, "Wrong alignment on ABP_MenuPlayerController_C");
static_assert(sizeof(ABP_MenuPlayerController_C) == 0x000A68, "Wrong size on ABP_MenuPlayerController_C");
static_assert(offsetof(ABP_MenuPlayerController_C, UberGraphFrame) == 0x000A38, "Member 'ABP_MenuPlayerController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MenuPlayerController_C, Array_Element_Key) == 0x000A40, "Member 'ABP_MenuPlayerController_C::Array_Element_Key' has a wrong offset!");
static_assert(offsetof(ABP_MenuPlayerController_C, Array_Element_Action) == 0x000A50, "Member 'ABP_MenuPlayerController_C::Array_Element_Action' has a wrong offset!");
static_assert(offsetof(ABP_MenuPlayerController_C, KeyBoardF9Pressed) == 0x000A60, "Member 'ABP_MenuPlayerController_C::KeyBoardF9Pressed' has a wrong offset!");
static_assert(offsetof(ABP_MenuPlayerController_C, KeyBoardShiftPressed) == 0x000A61, "Member 'ABP_MenuPlayerController_C::KeyBoardShiftPressed' has a wrong offset!");
static_assert(offsetof(ABP_MenuPlayerController_C, KeyBoardCtrlPressed) == 0x000A62, "Member 'ABP_MenuPlayerController_C::KeyBoardCtrlPressed' has a wrong offset!");
static_assert(offsetof(ABP_MenuPlayerController_C, ButtonLeftThumbstickPressed) == 0x000A63, "Member 'ABP_MenuPlayerController_C::ButtonLeftThumbstickPressed' has a wrong offset!");
static_assert(offsetof(ABP_MenuPlayerController_C, ButtonRightThumbstickPressed) == 0x000A64, "Member 'ABP_MenuPlayerController_C::ButtonRightThumbstickPressed' has a wrong offset!");
static_assert(offsetof(ABP_MenuPlayerController_C, ButtonRightTriggerPressed) == 0x000A65, "Member 'ABP_MenuPlayerController_C::ButtonRightTriggerPressed' has a wrong offset!");

}

