#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcStaticActor

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NpcStaticActor.BP_NpcStaticActor_C
// 0x0018 (0x0AF8 - 0x0AE0)
class ABP_NpcStaticActor_C final : public ASimpleNPCStaticActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_Damage_Spin_DamegeSpin_99E1231D46B8A2069479F4B29E10DF71; // 0x0AE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Damage_Spin__Direction_99E1231D46B8A2069479F4B29E10DF71; // 0x0AEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AED[0x3];                                      // 0x0AED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Damage_Spin;                              // 0x0AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void DamageSpinStart(float Direction);
	void ExecuteUbergraph_BP_NpcStaticActor(int32 EntryPoint);
	void StartSpinAgain(ETimelineDirection Direction);
	void Timeline_Damage_Spin__FinishedFunc();
	void Timeline_Damage_Spin__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NpcStaticActor_C">();
	}
	static class ABP_NpcStaticActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NpcStaticActor_C>();
	}
};
static_assert(alignof(ABP_NpcStaticActor_C) == 0x000008, "Wrong alignment on ABP_NpcStaticActor_C");
static_assert(sizeof(ABP_NpcStaticActor_C) == 0x000AF8, "Wrong size on ABP_NpcStaticActor_C");
static_assert(offsetof(ABP_NpcStaticActor_C, UberGraphFrame) == 0x000AE0, "Member 'ABP_NpcStaticActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_NpcStaticActor_C, Timeline_Damage_Spin_DamegeSpin_99E1231D46B8A2069479F4B29E10DF71) == 0x000AE8, "Member 'ABP_NpcStaticActor_C::Timeline_Damage_Spin_DamegeSpin_99E1231D46B8A2069479F4B29E10DF71' has a wrong offset!");
static_assert(offsetof(ABP_NpcStaticActor_C, Timeline_Damage_Spin__Direction_99E1231D46B8A2069479F4B29E10DF71) == 0x000AEC, "Member 'ABP_NpcStaticActor_C::Timeline_Damage_Spin__Direction_99E1231D46B8A2069479F4B29E10DF71' has a wrong offset!");
static_assert(offsetof(ABP_NpcStaticActor_C, Timeline_Damage_Spin) == 0x000AF0, "Member 'ABP_NpcStaticActor_C::Timeline_Damage_Spin' has a wrong offset!");

}

