#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcStaticMonsterTruckActor

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NpcStaticMonsterTruckActor.BP_NpcStaticMonsterTruckActor_C
// 0x0018 (0x0E40 - 0x0E28)
class ABP_NpcStaticMonsterTruckActor_C final : public ASimpleNpcMonsterTruckActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_CountDown_CountDown_B88CCEC04F046E8498E9F6A08A361ED4; // 0x0E30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_CountDown__Direction_B88CCEC04F046E8498E9F6A08A361ED4; // 0x0E34(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E35[0x3];                                      // 0x0E35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_CountDown;                                // 0x0E38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NpcStaticMonsterTruckActor(int32 EntryPoint);
	void OnCountDown(bool bIsPlay, const struct FLinearColor& Color, bool bWithDriver);
	void Timeline_CountDown__FinishedFunc();
	void Timeline_CountDown__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NpcStaticMonsterTruckActor_C">();
	}
	static class ABP_NpcStaticMonsterTruckActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NpcStaticMonsterTruckActor_C>();
	}
};
static_assert(alignof(ABP_NpcStaticMonsterTruckActor_C) == 0x000008, "Wrong alignment on ABP_NpcStaticMonsterTruckActor_C");
static_assert(sizeof(ABP_NpcStaticMonsterTruckActor_C) == 0x000E40, "Wrong size on ABP_NpcStaticMonsterTruckActor_C");
static_assert(offsetof(ABP_NpcStaticMonsterTruckActor_C, UberGraphFrame) == 0x000E28, "Member 'ABP_NpcStaticMonsterTruckActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_NpcStaticMonsterTruckActor_C, Timeline_CountDown_CountDown_B88CCEC04F046E8498E9F6A08A361ED4) == 0x000E30, "Member 'ABP_NpcStaticMonsterTruckActor_C::Timeline_CountDown_CountDown_B88CCEC04F046E8498E9F6A08A361ED4' has a wrong offset!");
static_assert(offsetof(ABP_NpcStaticMonsterTruckActor_C, Timeline_CountDown__Direction_B88CCEC04F046E8498E9F6A08A361ED4) == 0x000E34, "Member 'ABP_NpcStaticMonsterTruckActor_C::Timeline_CountDown__Direction_B88CCEC04F046E8498E9F6A08A361ED4' has a wrong offset!");
static_assert(offsetof(ABP_NpcStaticMonsterTruckActor_C, Timeline_CountDown) == 0x000E38, "Member 'ABP_NpcStaticMonsterTruckActor_C::Timeline_CountDown' has a wrong offset!");

}

