#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PartyRaceMenuSequence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "InputCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function BP_PartyRaceMenuSequence.BP_PartyRaceMenuSequence_C.BndEvt__BP_GrandPrixSequence_BPC_CharaMachineState_K2Node_ComponentBoundEvent_4_OnBackStateDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_PartyRaceMenuSequence_C_BndEvt__BP_GrandPrixSequence_BPC_CharaMachineState_K2Node_ComponentBoundEvent_4_OnBackStateDelegate__DelegateSignature final
{
public:
	EMenuSequenceSubState                         State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyRaceMenuSequence_C_BndEvt__BP_GrandPrixSequence_BPC_CharaMachineState_K2Node_ComponentBoundEvent_4_OnBackStateDelegate__DelegateSignature) == 0x000001, "Wrong alignment on BP_PartyRaceMenuSequence_C_BndEvt__BP_GrandPrixSequence_BPC_CharaMachineState_K2Node_ComponentBoundEvent_4_OnBackStateDelegate__DelegateSignature");
static_assert(sizeof(BP_PartyRaceMenuSequence_C_BndEvt__BP_GrandPrixSequence_BPC_CharaMachineState_K2Node_ComponentBoundEvent_4_OnBackStateDelegate__DelegateSignature) == 0x000001, "Wrong size on BP_PartyRaceMenuSequence_C_BndEvt__BP_GrandPrixSequence_BPC_CharaMachineState_K2Node_ComponentBoundEvent_4_OnBackStateDelegate__DelegateSignature");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_BndEvt__BP_GrandPrixSequence_BPC_CharaMachineState_K2Node_ComponentBoundEvent_4_OnBackStateDelegate__DelegateSignature, State) == 0x000000, "Member 'BP_PartyRaceMenuSequence_C_BndEvt__BP_GrandPrixSequence_BPC_CharaMachineState_K2Node_ComponentBoundEvent_4_OnBackStateDelegate__DelegateSignature::State' has a wrong offset!");

// Function BP_PartyRaceMenuSequence.BP_PartyRaceMenuSequence_C.BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectGroup_K2Node_ComponentBoundEvent_1_OnChangeStateDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectGroup_K2Node_ComponentBoundEvent_1_OnChangeStateDelegate__DelegateSignature final
{
public:
	EMenuSequenceSubState                         State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectGroup_K2Node_ComponentBoundEvent_1_OnChangeStateDelegate__DelegateSignature) == 0x000001, "Wrong alignment on BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectGroup_K2Node_ComponentBoundEvent_1_OnChangeStateDelegate__DelegateSignature");
static_assert(sizeof(BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectGroup_K2Node_ComponentBoundEvent_1_OnChangeStateDelegate__DelegateSignature) == 0x000001, "Wrong size on BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectGroup_K2Node_ComponentBoundEvent_1_OnChangeStateDelegate__DelegateSignature");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectGroup_K2Node_ComponentBoundEvent_1_OnChangeStateDelegate__DelegateSignature, State) == 0x000000, "Member 'BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectGroup_K2Node_ComponentBoundEvent_1_OnChangeStateDelegate__DelegateSignature::State' has a wrong offset!");

// Function BP_PartyRaceMenuSequence.BP_PartyRaceMenuSequence_C.BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectPreset_K2Node_ComponentBoundEvent_0_OnBackStateDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectPreset_K2Node_ComponentBoundEvent_0_OnBackStateDelegate__DelegateSignature final
{
public:
	EMenuSequenceSubState                         State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectPreset_K2Node_ComponentBoundEvent_0_OnBackStateDelegate__DelegateSignature) == 0x000001, "Wrong alignment on BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectPreset_K2Node_ComponentBoundEvent_0_OnBackStateDelegate__DelegateSignature");
static_assert(sizeof(BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectPreset_K2Node_ComponentBoundEvent_0_OnBackStateDelegate__DelegateSignature) == 0x000001, "Wrong size on BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectPreset_K2Node_ComponentBoundEvent_0_OnBackStateDelegate__DelegateSignature");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectPreset_K2Node_ComponentBoundEvent_0_OnBackStateDelegate__DelegateSignature, State) == 0x000000, "Member 'BP_PartyRaceMenuSequence_C_BndEvt__BP_PartyRaceMenuSequence_BPC_MenuStatePartyRaceSelectPreset_K2Node_ComponentBoundEvent_0_OnBackStateDelegate__DelegateSignature::State' has a wrong offset!");

// Function BP_PartyRaceMenuSequence.BP_PartyRaceMenuSequence_C.ChangePresetCamera
// 0x0090 (0x0090 - 0x0000)
struct BP_PartyRaceMenuSequence_C_ChangePresetCamera final
{
public:
	float                                         FieldOfView;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyRaceMenuSequence_C_ChangePresetCamera) == 0x000010, "Wrong alignment on BP_PartyRaceMenuSequence_C_ChangePresetCamera");
static_assert(sizeof(BP_PartyRaceMenuSequence_C_ChangePresetCamera) == 0x000090, "Wrong size on BP_PartyRaceMenuSequence_C_ChangePresetCamera");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ChangePresetCamera, FieldOfView) == 0x000000, "Member 'BP_PartyRaceMenuSequence_C_ChangePresetCamera::FieldOfView' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ChangePresetCamera, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_PartyRaceMenuSequence_C_ChangePresetCamera::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ChangePresetCamera, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'BP_PartyRaceMenuSequence_C_ChangePresetCamera::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ChangePresetCamera, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000078, "Member 'BP_PartyRaceMenuSequence_C_ChangePresetCamera::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ChangePresetCamera, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BP_PartyRaceMenuSequence_C_ChangePresetCamera::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_PartyRaceMenuSequence.BP_PartyRaceMenuSequence_C.ExecuteUbergraph_BP_PartyRaceMenuSequence
// 0x0260 (0x0260 - 0x0000)
struct BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DebugOneMessage_C*                 CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetForceEnableMCEvent_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetForceEnableMCEvent_ReturnValue_1;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuSequence_C*                     K2Node_DynamicCast_AsBP_Menu_Sequence;             // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_ComponentBoundEvent_State_2;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_ComponentBoundEvent_State_1;                // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuSequenceUIInterface> CallFunc_SetNextMenuSequenceState_self_CastInput; // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUISceneCaptureManager*            CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetCaptureTargetActor_ReturnValue;        // 0x00E0(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PartyRace_02_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonRaceMenuContentId                      CallFunc_GetLastSelectedRaceMenu_ReturnValue;      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputDebugKeyEvent_Key;                     // 0x0138(0x0018)(HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_InputDebugKeyEvent_ActionValue;             // 0x0150(0x0020)(NoDestructor)
	bool                                          CallFunc_IsGroupRace_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_ComponentBoundEvent_State;                  // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_1;     // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_CustomEvent_State;                          // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyRaceClassSelected_ReturnValue;     // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EMenuSequenceSubState State)>  K2Node_CreateDelegate_OutputDelegate_2;            // 0x01B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         Temp_byte_Variable;                                // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLastFadeDirectionOut_ReturnValue;       // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         Temp_byte_Variable_1;                              // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         Temp_byte_Variable_2;                              // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x021C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x022C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERaceSettingGrouping                          CallFunc_GetRaceSettingGrouping_ReturnValue;       // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x023E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23F[0x1];                                      // 0x023F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue_1;     // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERaceSettingGrouping                          Temp_byte_Variable_3;                              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_Select_Default;                             // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x2];                                      // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate_9;     // 0x024C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         K2Node_CustomEvent_FadeDirection;                  // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence) == 0x000008, "Wrong alignment on BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence");
static_assert(sizeof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence) == 0x000260, "Wrong size on BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, EntryPoint) == 0x000000, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetForceEnableMCEvent_ReturnValue) == 0x000010, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetForceEnableMCEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_IsShippingBuild_ReturnValue) == 0x000011, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_IsShippingBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_Not_PreBool_ReturnValue_1) == 0x000013, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetForceEnableMCEvent_ReturnValue_1) == 0x000014, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetForceEnableMCEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_Conv_BoolToText_ReturnValue) == 0x000018, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_MakeArray_Array) == 0x000070, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_Event_InDeltaTime) == 0x000080, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetParentActor_ReturnValue) == 0x000098, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_DynamicCast_AsBP_Menu_Sequence) == 0x0000A0, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_DynamicCast_AsBP_Menu_Sequence' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_IsValid_ReturnValue) == 0x0000A9, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0000B0, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x0000B8, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_IsValid_ReturnValue_1) == 0x0000BC, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_ComponentBoundEvent_State_2) == 0x0000C4, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_ComponentBoundEvent_State_2' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_ComponentBoundEvent_State_1) == 0x0000C5, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_ComponentBoundEvent_State_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_SetNextMenuSequenceState_self_CastInput) == 0x0000C8, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_SetNextMenuSequenceState_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x0000D8, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetCaptureTargetActor_ReturnValue) == 0x0000E0, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetCaptureTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetPlayerController_ReturnValue) == 0x0000F0, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_Create_ReturnValue_1) == 0x000100, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, Temp_bool_Has_Been_Initd_Variable) == 0x000108, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetLastSelectedRaceMenu_ReturnValue) == 0x000109, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetLastSelectedRaceMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_SwitchEnum_CmpSuccess) == 0x00010A, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x00010B, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_MakeLiteralName_ReturnValue) == 0x00010C, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetPlayerController_ReturnValue_1) == 0x000118, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, Temp_int_Variable) == 0x000120, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetAppPlayerController_ReturnValue) == 0x000128, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_IsValid_ReturnValue_2) == 0x000130, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000131, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_Add_IntInt_ReturnValue) == 0x000134, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_InputDebugKeyEvent_Key) == 0x000138, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_InputDebugKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_InputDebugKeyEvent_ActionValue) == 0x000150, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_InputDebugKeyEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_IsGroupRace_ReturnValue) == 0x000170, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_IsGroupRace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_IsValid_ReturnValue_3) == 0x000171, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000172, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_ComponentBoundEvent_State) == 0x000173, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_ComponentBoundEvent_State' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_BooleanAND_ReturnValue) == 0x000174, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, Temp_int_Array_Index_Variable) == 0x000178, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_Array_Get_Item) == 0x000180, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetSelectedPlayerCount_ReturnValue_1) == 0x000188, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetSelectedPlayerCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_CustomEvent_State) == 0x00018C, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_IsPartyRaceClassSelected_ReturnValue) == 0x00018D, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_IsPartyRaceClassSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_CreateDelegate_OutputDelegate) == 0x000190, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A0, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001B0, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001C0, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001D0, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0001E0, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, Temp_byte_Variable) == 0x0001E8, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_IsLastFadeDirectionOut_ReturnValue) == 0x0001E9, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_IsLastFadeDirectionOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_IsValid_ReturnValue_4) == 0x0001EA, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, Temp_byte_Variable_1) == 0x0001EB, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, Temp_byte_Variable_2) == 0x0001EC, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001F0, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_CreateDelegate_OutputDelegate_6) == 0x000200, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, Temp_int_Loop_Counter_Variable) == 0x000210, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_Less_IntInt_ReturnValue) == 0x000214, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_Add_IntInt_ReturnValue_1) == 0x000218, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_CreateDelegate_OutputDelegate_7) == 0x00021C, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_CreateDelegate_OutputDelegate_8) == 0x00022C, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetRaceSettingGrouping_ReturnValue) == 0x00023C, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetRaceSettingGrouping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, Temp_bool_IsClosed_Variable) == 0x00023D, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00023E, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, CallFunc_GetAppPlayerController_ReturnValue_1) == 0x000240, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::CallFunc_GetAppPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, Temp_byte_Variable_3) == 0x000248, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_Select_Default) == 0x000249, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_CreateDelegate_OutputDelegate_9) == 0x00024C, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence, K2Node_CustomEvent_FadeDirection) == 0x00025C, "Member 'BP_PartyRaceMenuSequence_C_ExecuteUbergraph_BP_PartyRaceMenuSequence::K2Node_CustomEvent_FadeDirection' has a wrong offset!");

// Function BP_PartyRaceMenuSequence.BP_PartyRaceMenuSequence_C.FinishedFadeToGadgetCustom
// 0x0001 (0x0001 - 0x0000)
struct BP_PartyRaceMenuSequence_C_FinishedFadeToGadgetCustom final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyRaceMenuSequence_C_FinishedFadeToGadgetCustom) == 0x000001, "Wrong alignment on BP_PartyRaceMenuSequence_C_FinishedFadeToGadgetCustom");
static_assert(sizeof(BP_PartyRaceMenuSequence_C_FinishedFadeToGadgetCustom) == 0x000001, "Wrong size on BP_PartyRaceMenuSequence_C_FinishedFadeToGadgetCustom");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_FinishedFadeToGadgetCustom, FadeDirection) == 0x000000, "Member 'BP_PartyRaceMenuSequence_C_FinishedFadeToGadgetCustom::FadeDirection' has a wrong offset!");

// Function BP_PartyRaceMenuSequence.BP_PartyRaceMenuSequence_C.GetFooter
// 0x0008 (0x0008 - 0x0000)
struct BP_PartyRaceMenuSequence_C_GetFooter final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyRaceMenuSequence_C_GetFooter) == 0x000008, "Wrong alignment on BP_PartyRaceMenuSequence_C_GetFooter");
static_assert(sizeof(BP_PartyRaceMenuSequence_C_GetFooter) == 0x000008, "Wrong size on BP_PartyRaceMenuSequence_C_GetFooter");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_GetFooter, ReturnValue) == 0x000000, "Member 'BP_PartyRaceMenuSequence_C_GetFooter::ReturnValue' has a wrong offset!");

// Function BP_PartyRaceMenuSequence.BP_PartyRaceMenuSequence_C.GetOwnerMenuSequence
// 0x0008 (0x0008 - 0x0000)
struct BP_PartyRaceMenuSequence_C_GetOwnerMenuSequence final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyRaceMenuSequence_C_GetOwnerMenuSequence) == 0x000008, "Wrong alignment on BP_PartyRaceMenuSequence_C_GetOwnerMenuSequence");
static_assert(sizeof(BP_PartyRaceMenuSequence_C_GetOwnerMenuSequence) == 0x000008, "Wrong size on BP_PartyRaceMenuSequence_C_GetOwnerMenuSequence");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_GetOwnerMenuSequence, ReturnValue) == 0x000000, "Member 'BP_PartyRaceMenuSequence_C_GetOwnerMenuSequence::ReturnValue' has a wrong offset!");

// Function BP_PartyRaceMenuSequence.BP_PartyRaceMenuSequence_C.InpActEvt_M_K2Node_InputDebugKeyEvent_0
// 0x0038 (0x0038 - 0x0000)
struct BP_PartyRaceMenuSequence_C_InpActEvt_M_K2Node_InputDebugKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FInputActionValue                      ActionValue;                                       // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_PartyRaceMenuSequence_C_InpActEvt_M_K2Node_InputDebugKeyEvent_0) == 0x000008, "Wrong alignment on BP_PartyRaceMenuSequence_C_InpActEvt_M_K2Node_InputDebugKeyEvent_0");
static_assert(sizeof(BP_PartyRaceMenuSequence_C_InpActEvt_M_K2Node_InputDebugKeyEvent_0) == 0x000038, "Wrong size on BP_PartyRaceMenuSequence_C_InpActEvt_M_K2Node_InputDebugKeyEvent_0");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_InpActEvt_M_K2Node_InputDebugKeyEvent_0, Key) == 0x000000, "Member 'BP_PartyRaceMenuSequence_C_InpActEvt_M_K2Node_InputDebugKeyEvent_0::Key' has a wrong offset!");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_InpActEvt_M_K2Node_InputDebugKeyEvent_0, ActionValue) == 0x000018, "Member 'BP_PartyRaceMenuSequence_C_InpActEvt_M_K2Node_InputDebugKeyEvent_0::ActionValue' has a wrong offset!");

// Function BP_PartyRaceMenuSequence.BP_PartyRaceMenuSequence_C.OnBackFromGadgetCustom
// 0x0001 (0x0001 - 0x0000)
struct BP_PartyRaceMenuSequence_C_OnBackFromGadgetCustom final
{
public:
	EMenuSequenceSubState                         State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyRaceMenuSequence_C_OnBackFromGadgetCustom) == 0x000001, "Wrong alignment on BP_PartyRaceMenuSequence_C_OnBackFromGadgetCustom");
static_assert(sizeof(BP_PartyRaceMenuSequence_C_OnBackFromGadgetCustom) == 0x000001, "Wrong size on BP_PartyRaceMenuSequence_C_OnBackFromGadgetCustom");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_OnBackFromGadgetCustom, State) == 0x000000, "Member 'BP_PartyRaceMenuSequence_C_OnBackFromGadgetCustom::State' has a wrong offset!");

// Function BP_PartyRaceMenuSequence.BP_PartyRaceMenuSequence_C.OnUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_PartyRaceMenuSequence_C_OnUpdate final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyRaceMenuSequence_C_OnUpdate) == 0x000004, "Wrong alignment on BP_PartyRaceMenuSequence_C_OnUpdate");
static_assert(sizeof(BP_PartyRaceMenuSequence_C_OnUpdate) == 0x000004, "Wrong size on BP_PartyRaceMenuSequence_C_OnUpdate");
static_assert(offsetof(BP_PartyRaceMenuSequence_C_OnUpdate, InDeltaTime) == 0x000000, "Member 'BP_PartyRaceMenuSequence_C_OnUpdate::InDeltaTime' has a wrong offset!");

}

