#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RaceSequence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionRun_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UnionLib_structs.hpp"


namespace SDK::Params
{

// Function BP_RaceSequence.BP_RaceSequence_C.ApplyOnlineCharaMachineSetting
// 0x0058 (0x0058 - 0x0000)
struct BP_RaceSequence_C_ApplyOnlineCharaMachineSetting final
{
public:
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionRacers*                           CallFunc_GetRacersRef_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUnionRacer*>                    CallFunc_Map_Values_Values;                        // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacer*                            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRacerStatusObject*                CallFunc_GetRacerStatusObject_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRacerIndex_OutRacerIndex;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRacerMachineID_OutId;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetRacerDriverId_OutId;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting) == 0x000008, "Wrong alignment on BP_RaceSequence_C_ApplyOnlineCharaMachineSetting");
static_assert(sizeof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting) == 0x000058, "Wrong size on BP_RaceSequence_C_ApplyOnlineCharaMachineSetting");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, CallFunc_GetIsOnlineGameMode_ReturnValue) == 0x000000, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::CallFunc_GetIsOnlineGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, CallFunc_GetRacersRef_ReturnValue) == 0x000008, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::CallFunc_GetRacersRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, CallFunc_Map_Values_Values) == 0x000018, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, CallFunc_GetRacerStatusObject_ReturnValue) == 0x000038, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::CallFunc_GetRacerStatusObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, CallFunc_GetRacerIndex_OutRacerIndex) == 0x000044, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::CallFunc_GetRacerIndex_OutRacerIndex' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, CallFunc_GetRacerMachineID_OutId) == 0x00004C, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::CallFunc_GetRacerMachineID_OutId' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyOnlineCharaMachineSetting, CallFunc_GetRacerDriverId_OutId) == 0x000050, "Member 'BP_RaceSequence_C_ApplyOnlineCharaMachineSetting::CallFunc_GetRacerDriverId_OutId' has a wrong offset!");

// Function BP_RaceSequence.BP_RaceSequence_C.ApplyParam
// 0x01A8 (0x01A8 - 0x0000)
struct BP_RaceSequence_C_ApplyParam final
{
public:
	class UUnionRacers*                           Racers_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         RacerIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUserMachineCustomizeData              CallFunc_GetRacerMachineCustomizeData_MachineCustomizeData; // 0x0018(0x0078)()
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMachineCustomParamData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x00A0(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachineCustomParamData                CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00C8(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUnionRaceCustomParam                  K2Node_MakeStruct_UnionRaceCustomParam;            // 0x00EC(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FUnionRaceCustomParam                  K2Node_MakeStruct_UnionRaceCustomParam_1;          // 0x0100(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_2;          // 0x0114(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                CallFunc_GetCarStatusType_ReturnValue;             // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachineCustomParamData                CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0120(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUnionRaceCustomParam                  K2Node_MakeStruct_UnionRaceCustomParam_2;          // 0x0144(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDriverId                                     CallFunc_GetRacerDriverId_OutId;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_3;          // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacerStatusObject*                CallFunc_GetRacerStatusObject_ReturnValue;         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDriverCustomParamData                 CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0170(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUnionRaceCustomParam                  K2Node_MakeStruct_UnionRaceCustomParam_3;          // 0x0194(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RaceSequence_C_ApplyParam) == 0x000008, "Wrong alignment on BP_RaceSequence_C_ApplyParam");
static_assert(sizeof(BP_RaceSequence_C_ApplyParam) == 0x0001A8, "Wrong size on BP_RaceSequence_C_ApplyParam");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, Racers_0) == 0x000000, "Member 'BP_RaceSequence_C_ApplyParam::Racers_0' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, RacerIndex) == 0x000008, "Member 'BP_RaceSequence_C_ApplyParam::RacerIndex' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetRacerMachineCustomizeData_MachineCustomizeData) == 0x000018, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetRacerMachineCustomizeData_MachineCustomizeData' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetEnumeratorName_ReturnValue) == 0x000090, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetEnumeratorName_ReturnValue_1) == 0x000098, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetEnumeratorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000A0, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000C0, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000C8, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0000E8, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, K2Node_MakeStruct_UnionRaceCustomParam) == 0x0000EC, "Member 'BP_RaceSequence_C_ApplyParam::K2Node_MakeStruct_UnionRaceCustomParam' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, K2Node_MakeStruct_UnionRaceCustomParam_1) == 0x000100, "Member 'BP_RaceSequence_C_ApplyParam::K2Node_MakeStruct_UnionRaceCustomParam_1' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetEnumeratorName_ReturnValue_2) == 0x000114, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetEnumeratorName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetCarStatusType_ReturnValue) == 0x00011C, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetCarStatusType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000120, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000140, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000141, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, K2Node_MakeStruct_UnionRaceCustomParam_2) == 0x000144, "Member 'BP_RaceSequence_C_ApplyParam::K2Node_MakeStruct_UnionRaceCustomParam_2' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetRacerDriverId_OutId) == 0x000158, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetRacerDriverId_OutId' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetEnumeratorName_ReturnValue_3) == 0x00015C, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetEnumeratorName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetRacerStatusObject_ReturnValue) == 0x000168, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetRacerStatusObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x000170, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, CallFunc_GetDataTableRowFromName_ReturnValue_3) == 0x000190, "Member 'BP_RaceSequence_C_ApplyParam::CallFunc_GetDataTableRowFromName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ApplyParam, K2Node_MakeStruct_UnionRaceCustomParam_3) == 0x000194, "Member 'BP_RaceSequence_C_ApplyParam::K2Node_MakeStruct_UnionRaceCustomParam_3' has a wrong offset!");

// Function BP_RaceSequence.BP_RaceSequence_C.BindRaceBGMEvent
// 0x0178 (0x0178 - 0x0000)
struct BP_RaceSequence_C_BindRaceBGMEvent final
{
public:
	class UAppRaceEventManager*                   AppRaceEventManager;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Value1, const class FString& Value2)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Value)>   K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Value)>                   K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Value1, const class FString& Value2)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FAppRaceEventGoalData& Value)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Value1, const class FString& Value2)> K2Node_CreateDelegate_OutputDelegate_9; // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Value)>                  K2Node_CreateDelegate_OutputDelegate_13;           // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Value)>                  K2Node_CreateDelegate_OutputDelegate_14;           // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Value)>   K2Node_CreateDelegate_OutputDelegate_15;           // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Value)>                   K2Node_CreateDelegate_OutputDelegate_16;           // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Value1, bool Value2)> K2Node_CreateDelegate_OutputDelegate_17; // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Value)>   K2Node_CreateDelegate_OutputDelegate_21;           // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Value)>   K2Node_CreateDelegate_OutputDelegate_22;           // 0x0168(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RaceSequence_C_BindRaceBGMEvent) == 0x000008, "Wrong alignment on BP_RaceSequence_C_BindRaceBGMEvent");
static_assert(sizeof(BP_RaceSequence_C_BindRaceBGMEvent) == 0x000178, "Wrong size on BP_RaceSequence_C_BindRaceBGMEvent");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, AppRaceEventManager) == 0x000000, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::AppRaceEventManager' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000038, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000048, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_5) == 0x000058, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_6) == 0x000068, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_7) == 0x000078, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_8) == 0x000088, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_9) == 0x000098, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000A8, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_11) == 0x0000B8, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_12) == 0x0000C8, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_13) == 0x0000D8, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_14) == 0x0000E8, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_15) == 0x0000F8, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_16) == 0x000108, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_17) == 0x000118, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_18) == 0x000128, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_19) == 0x000138, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_20) == 0x000148, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_21) == 0x000158, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_21' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindRaceBGMEvent, K2Node_CreateDelegate_OutputDelegate_22) == 0x000168, "Member 'BP_RaceSequence_C_BindRaceBGMEvent::K2Node_CreateDelegate_OutputDelegate_22' has a wrong offset!");

// Function BP_RaceSequence.BP_RaceSequence_C.BindSilenceSoundEvent
// 0x0028 (0x0028 - 0x0000)
struct BP_RaceSequence_C_BindSilenceSoundEvent final
{
public:
	class UAppRaceEventManager*                   AppRaceEventManager;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Value)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Value)>                   K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RaceSequence_C_BindSilenceSoundEvent) == 0x000008, "Wrong alignment on BP_RaceSequence_C_BindSilenceSoundEvent");
static_assert(sizeof(BP_RaceSequence_C_BindSilenceSoundEvent) == 0x000028, "Wrong size on BP_RaceSequence_C_BindSilenceSoundEvent");
static_assert(offsetof(BP_RaceSequence_C_BindSilenceSoundEvent, AppRaceEventManager) == 0x000000, "Member 'BP_RaceSequence_C_BindSilenceSoundEvent::AppRaceEventManager' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindSilenceSoundEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_RaceSequence_C_BindSilenceSoundEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_BindSilenceSoundEvent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_RaceSequence_C_BindSilenceSoundEvent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_RaceSequence.BP_RaceSequence_C.ChangeDomainPre1st
// 0x00E0 (0x00E0 - 0x0000)
struct BP_RaceSequence_C_ChangeDomainPre1st final
{
public:
	int32                                         RacerIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalNewDomainIndex;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_Select_Course_Setting_Impl_Texture;       // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	double                                        CallFunc_Select_Course_Setting_Impl_OrthoRate;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Select_Course_Setting_Impl_Angle;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Select_Course_Setting_Impl_Offset;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceUI*                           CallFunc_GetRaceHUDRef_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IUnionRaceUIInterface> CallFunc_SetCourseSetting_self_CastInput;          // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacers*                           CallFunc_GetRacersRef_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRacer*                            CallFunc_GetRacer_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacerStatusObject*                CallFunc_GetRacerStatusObject_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacePlayerStatus*                 CallFunc_GetRacePlayerStatus_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceLapInfo*                      CallFunc_GetRaceLapInfo_ReturnValue;               // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacerStatusObject*                CallFunc_GetRacerStatusObject_ReturnValue_1;       // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayer_ReturnValue;                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetCourseSetting_OrthoRate_ImplicitCast;  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCourseSetting_Angle_ImplicitCast;      // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RaceSequence_C_ChangeDomainPre1st) == 0x000008, "Wrong alignment on BP_RaceSequence_C_ChangeDomainPre1st");
static_assert(sizeof(BP_RaceSequence_C_ChangeDomainPre1st) == 0x0000E0, "Wrong size on BP_RaceSequence_C_ChangeDomainPre1st");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, RacerIndex) == 0x000000, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::RacerIndex' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, LocalNewDomainIndex) == 0x000004, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::LocalNewDomainIndex' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_SelectInt_ReturnValue) == 0x00000C, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_Select_Course_Setting_Impl_Texture) == 0x000010, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_Select_Course_Setting_Impl_Texture' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_Select_Course_Setting_Impl_OrthoRate) == 0x000038, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_Select_Course_Setting_Impl_OrthoRate' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_Select_Course_Setting_Impl_Angle) == 0x000040, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_Select_Course_Setting_Impl_Angle' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_Select_Course_Setting_Impl_Offset) == 0x000048, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_Select_Course_Setting_Impl_Offset' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_GetRaceHUDRef_ReturnValue) == 0x000060, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_GetRaceHUDRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_SetCourseSetting_self_CastInput) == 0x000068, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_SetCourseSetting_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_GetRacersRef_ReturnValue) == 0x000080, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_GetRacersRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_GetRacer_ReturnValue) == 0x000088, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_GetRacer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000090, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_GetRacerStatusObject_ReturnValue) == 0x000098, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_GetRacerStatusObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_GetRacePlayerStatus_ReturnValue) == 0x0000A8, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_GetRacePlayerStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_IsValid_ReturnValue_2) == 0x0000B0, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000B1, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000B4, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_GetRaceLapInfo_ReturnValue) == 0x0000B8, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_GetRaceLapInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_SelectInt_ReturnValue_1) == 0x0000C0, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_IsValid_ReturnValue_3) == 0x0000C4, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_GetRacerStatusObject_ReturnValue_1) == 0x0000C8, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_GetRacerStatusObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_IsLocalPlayer_ReturnValue) == 0x0000D1, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_IsLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_SetCourseSetting_OrthoRate_ImplicitCast) == 0x0000D4, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_SetCourseSetting_OrthoRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeDomainPre1st, CallFunc_SetCourseSetting_Angle_ImplicitCast) == 0x0000D8, "Member 'BP_RaceSequence_C_ChangeDomainPre1st::CallFunc_SetCourseSetting_Angle_ImplicitCast' has a wrong offset!");

// Function BP_RaceSequence.BP_RaceSequence_C.ChangeSubEvent
// 0x0038 (0x0038 - 0x0000)
struct BP_RaceSequence_C_ChangeSubEvent final
{
public:
	EMainSubCourseIndex                           NextMainSubState;                                  // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RacerId;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageCourseMainSubMapInfo                    CurrentMainSubState;                               // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacers*                           CallFunc_GetRacersRef_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EStageCourseMainSubMapInfo                    CallFunc_ChangeSubMapTexture_MainSubState;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacer*                            CallFunc_GetRacer_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRacerStatusObject*                CallFunc_GetRacerStatusObject_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayer_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RaceSequence_C_ChangeSubEvent) == 0x000008, "Wrong alignment on BP_RaceSequence_C_ChangeSubEvent");
static_assert(sizeof(BP_RaceSequence_C_ChangeSubEvent) == 0x000038, "Wrong size on BP_RaceSequence_C_ChangeSubEvent");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubEvent, NextMainSubState) == 0x000000, "Member 'BP_RaceSequence_C_ChangeSubEvent::NextMainSubState' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubEvent, RacerId) == 0x000004, "Member 'BP_RaceSequence_C_ChangeSubEvent::RacerId' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubEvent, CurrentMainSubState) == 0x000008, "Member 'BP_RaceSequence_C_ChangeSubEvent::CurrentMainSubState' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubEvent, CallFunc_GetRacersRef_ReturnValue) == 0x000010, "Member 'BP_RaceSequence_C_ChangeSubEvent::CallFunc_GetRacersRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubEvent, CallFunc_ChangeSubMapTexture_MainSubState) == 0x000018, "Member 'BP_RaceSequence_C_ChangeSubEvent::CallFunc_ChangeSubMapTexture_MainSubState' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubEvent, CallFunc_GetRacer_ReturnValue) == 0x000020, "Member 'BP_RaceSequence_C_ChangeSubEvent::CallFunc_GetRacer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubEvent, CallFunc_GetRacerStatusObject_ReturnValue) == 0x000028, "Member 'BP_RaceSequence_C_ChangeSubEvent::CallFunc_GetRacerStatusObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubEvent, CallFunc_IsLocalPlayer_ReturnValue) == 0x000030, "Member 'BP_RaceSequence_C_ChangeSubEvent::CallFunc_IsLocalPlayer_ReturnValue' has a wrong offset!");

// Function BP_RaceSequence.BP_RaceSequence_C.ChangeSubMapTexture
// 0x00A8 (0x00A8 - 0x0000)
struct BP_RaceSequence_C_ChangeSubMapTexture final
{
public:
	EMainSubCourseIndex                           NextMainSubState;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageCourseMainSubMapInfo                    MainSubState;                                      // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageCourseMainSubMapInfo                    CurrentMainSubState;                               // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceType                                     Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRaceUI*                           CallFunc_GetRaceHUDRef_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStageCourseMapParam                   CallFunc_Map_Find_Value;                           // 0x0020(0x0028)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRaceDebugParamFinalLap_ReturnValue;    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0050(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUnionRaceUIInterface> CallFunc_SetCourseSetting_self_CastInput;          // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceType                                     CallFunc_GetSelectedRaceType_ReturnValue;          // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageCourseMapInfo                           K2Node_Select_Default;                             // 0x009C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageCourseMapInfo                           K2Node_Select_Default_1;                           // 0x009E(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageCourseMapInfo                           K2Node_Select_Default_2;                           // 0x009F(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RaceSequence_C_ChangeSubMapTexture) == 0x000008, "Wrong alignment on BP_RaceSequence_C_ChangeSubMapTexture");
static_assert(sizeof(BP_RaceSequence_C_ChangeSubMapTexture) == 0x0000A8, "Wrong size on BP_RaceSequence_C_ChangeSubMapTexture");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, NextMainSubState) == 0x000000, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::NextMainSubState' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, MainSubState) == 0x000001, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::MainSubState' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CurrentMainSubState) == 0x000002, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CurrentMainSubState' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_MakeLiteralByte_ReturnValue) == 0x000003, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000004, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000005, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000006, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, Temp_int_Variable) == 0x000008, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, Temp_byte_Variable) == 0x00000C, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00000D, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_GetRaceHUDRef_ReturnValue) == 0x000010, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_GetRaceHUDRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_Map_Find_Value) == 0x000020, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_GetRaceDebugParamFinalLap_ReturnValue) == 0x000049, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_GetRaceDebugParamFinalLap_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000050, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000078, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_SetCourseSetting_self_CastInput) == 0x000080, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_SetCourseSetting_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000090, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, Temp_bool_Variable) == 0x000098, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_Conv_IntToByte_ReturnValue) == 0x000099, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_GetValidValue_ReturnValue) == 0x00009A, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_GetSelectedRaceType_ReturnValue) == 0x00009B, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_GetSelectedRaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, K2Node_Select_Default) == 0x00009C, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00009D, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, K2Node_Select_Default_1) == 0x00009E, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, K2Node_Select_Default_2) == 0x00009F, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_RaceSequence_C_ChangeSubMapTexture, K2Node_SwitchEnum_CmpSuccess) == 0x0000A0, "Member 'BP_RaceSequence_C_ChangeSubMapTexture::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_RaceSequence.BP_RaceSequence_C.Chara Machine COMROM
// 0x0188 (0x0188 - 0x0000)
struct BP_RaceSequence_C_Chara_Machine_COMROM final
{
public:
	TArray<int32>                                 LocalMachineIdTmp_0;                               // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<EDriverId>                             LocalCharaTmp_0;                                   // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 LocalMachineIdTmp;                                 // 0x0020(0x0010)(Edit, BlueprintVisible)
