#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RacePauseMenuSequence

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionUI_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RacePauseMenuSequence.BP_RacePauseMenuSequence_C.ClickedOptionBtn
// 0x0010 (0x0010 - 0x0000)
struct BP_RacePauseMenuSequence_C_ClickedOptionBtn final
{
public:
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         InIndex;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RacePauseMenuSequence_C_ClickedOptionBtn) == 0x000008, "Wrong alignment on BP_RacePauseMenuSequence_C_ClickedOptionBtn");
static_assert(sizeof(BP_RacePauseMenuSequence_C_ClickedOptionBtn) == 0x000010, "Wrong size on BP_RacePauseMenuSequence_C_ClickedOptionBtn");
static_assert(offsetof(BP_RacePauseMenuSequence_C_ClickedOptionBtn, InButton) == 0x000000, "Member 'BP_RacePauseMenuSequence_C_ClickedOptionBtn::InButton' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_ClickedOptionBtn, InIndex) == 0x000008, "Member 'BP_RacePauseMenuSequence_C_ClickedOptionBtn::InIndex' has a wrong offset!");

// Function BP_RacePauseMenuSequence.BP_RacePauseMenuSequence_C.CreateConfirmationPopup
// 0x0178 (0x0178 - 0x0000)
struct BP_RacePauseMenuSequence_C_CreateConfirmationPopup final
{
public:
	EPopupWindowType                              WindowType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupWindowButtonType                        ButtonType;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Attention;                                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUISceneBase*                      WindowWidget;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowBase*                Window;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOwnerPlayerControllerIndex_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacers*                           CallFunc_GetUnionRacers_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceUI*                           CallFunc_GetRaceHUDRef_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Player01_C*               K2Node_DynamicCast_AsWBP_Race_HUD_Player_01;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPopupWarningMessage_ReturnValue;       // 0x0040(0x0010)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Popup_DonpaTicket_Use_C*           K2Node_DynamicCast_AsWBP_Popup_Donpa_Ticket_Use;   // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2; // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3; // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4; // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00F0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0100(0x0010)()
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ConstParm, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0120(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0130(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0140(0x0010)()
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x0158(0x0010)(ConstParm, ReferenceParm)
	class UUnionUIPopupWindowBase*                CallFunc_CreatePopupWindow_ReturnValue;            // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup) == 0x000008, "Wrong alignment on BP_RacePauseMenuSequence_C_CreateConfirmationPopup");
static_assert(sizeof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup) == 0x000178, "Wrong size on BP_RacePauseMenuSequence_C_CreateConfirmationPopup");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, WindowType) == 0x000000, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::WindowType' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, ButtonType) == 0x000001, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::ButtonType' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, Attention) == 0x000002, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::Attention' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, WindowWidget) == 0x000008, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::WindowWidget' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, Window) == 0x000010, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::Window' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_GetOwnerPlayerControllerIndex_ReturnValue) == 0x000018, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_GetOwnerPlayerControllerIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_GetUnionRacers_ReturnValue) == 0x000020, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_GetUnionRacers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_GetRaceHUDRef_ReturnValue) == 0x000028, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_GetRaceHUDRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_AsWBP_Race_HUD_Player_01) == 0x000030, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_AsWBP_Race_HUD_Player_01' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_GetPopupWarningMessage_ReturnValue) == 0x000040, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_GetPopupWarningMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000050, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000051, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_AsMenu_Popup_Window_Interface) == 0x000058, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_AsMenu_Popup_Window_Interface' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1) == 0x000070, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_AsWBP_Popup_Donpa_Ticket_Use) == 0x000088, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_AsWBP_Popup_Donpa_Ticket_Use' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2) == 0x000098, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_bSuccess_4) == 0x0000A8, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000B0, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_AddChildToCanvas_ReturnValue) == 0x0000B8, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3) == 0x0000C0, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_bSuccess_5) == 0x0000D0, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4) == 0x0000D8, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_DynamicCast_bSuccess_6) == 0x0000E8, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_MakeLiteralText_ReturnValue) == 0x0000F0, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000100, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000120, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000130, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_MakeLiteralText_ReturnValue_4) == 0x000140, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000150, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, K2Node_MakeArray_Array_1) == 0x000158, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_CreatePopupWindow_ReturnValue) == 0x000168, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_CreatePopupWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_MakeLiteralByte_ReturnValue) == 0x000170, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateConfirmationPopup, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000174, "Member 'BP_RacePauseMenuSequence_C_CreateConfirmationPopup::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function BP_RacePauseMenuSequence.BP_RacePauseMenuSequence_C.CreateInputRecieveObject
// 0x0090 (0x0090 - 0x0000)
struct BP_RacePauseMenuSequence_C_CreateInputRecieveObject final
{
public:
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuInputRecieveObject*                CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject) == 0x000008, "Wrong alignment on BP_RacePauseMenuSequence_C_CreateInputRecieveObject");
static_assert(sizeof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject) == 0x000090, "Wrong size on BP_RacePauseMenuSequence_C_CreateInputRecieveObject");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x000020, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, K2Node_CreateDelegate_OutputDelegate_4) == 0x000054, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, Temp_int_Variable) == 0x000064, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, K2Node_CreateDelegate_OutputDelegate_5) == 0x000068, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000080, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000089, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RacePauseMenuSequence_C_CreateInputRecieveObject, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'BP_RacePauseMenuSequence_C_CreateInputRecieveObject::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_RacePauseMenuSequence.BP_RacePauseMenuSequence_C.ExecuteUbergraph_BP_RacePauseMenuSequence
// 0x0610 (0x0610 - 0x0000)
struct BP_RacePauseMenuSequence_C_ExecuteUbergraph_BP_RacePauseMenuSequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetLastFocusedButton_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_DynamicCast_AsUnion_UIButton_Base;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonRaceMenuContentId                      Temp_byte_Variable;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_1;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_2;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_3;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_4;                              // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_5;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_6;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_7;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_8;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_9;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_10;                             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_11;                             // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_12;                             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_13;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_14;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_15;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_16;                             // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_17;                             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_18;                             // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_19;                             // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_20;                             // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_21;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_22;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_23;                             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_24;                             // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_25;                             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_26;                             // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_27;                             // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_28;                             // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_29;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            K2Node_Select_Default;                             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPauseManager*                          CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue;                 // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuSequenceExitCode                Temp_byte_Variable_30;                             // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuSequenceExitCode                Temp_byte_Variable_31;                             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuSequenceExitCode                Temp_byte_Variable_32;                             // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate_5;     // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuSequenceExitCode                Temp_byte_Variable_33;                             // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_2;      // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EF[0x1];                                       // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ReadySequenceActor_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0188(0x0004)()
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_3;      // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuSequenceExitCode                Temp_byte_Variable_34;                             // 0x018F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0190(0x0004)()
	int32                                         CallFunc_GetOwnerPlayerControllerIndex_ReturnValue; // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARacePlayerController*                  K2Node_DynamicCast_AsRace_Player_Controller;       // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonRaceMenuContentsInfo*            CallFunc_GeneratePauseMenuContentsInfo_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_1;     // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuSequenceExitCode                Temp_byte_Variable_35;                             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x01C4(0x0004)()
	int32                                         CallFunc_GetExitCode_ReturnValue;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x01CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x01CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuSequenceExitCode                Temp_byte_Variable_36;                             // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOwnerPlayerControllerIndex_ReturnValue_1; // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CMN_RaceMenu_Sub_Btn_C*            CallFunc_GetMenuButton_Button;                     // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CMN_RaceMenu_Sub_Btn_C*            CallFunc_GetMenuButton_Button_1;                   // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_PauseMenu_Sub_Option_Btn_03_C* InButton, int32 InIndex)> K2Node_CreateDelegate_OutputDelegate_6; // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuInputRecieveObject*                CallFunc_Array_Get_Item;                           // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_2;      // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacers*                           CallFunc_GetUnionRacers_ReturnValue;               // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceUI*                           CallFunc_GetRaceHUDRef_ReturnValue;                // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionRacers*                           CallFunc_GetUnionRacers_ReturnValue_1;             // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceUI*                           CallFunc_GetRaceHUDRef_ReturnValue_1;              // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_7; // 0x0248(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Player01_C*               K2Node_DynamicCast_AsWBP_Race_HUD_Player_01;       // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupWindowType                              Temp_byte_Variable_37;                             // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuSequenceExitCode                Temp_byte_Variable_38;                             // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupWindowType                              Temp_byte_Variable_39;                             // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex_1; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetLastFocusedButton_ReturnValue_1;       // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CMN_RaceMenu_Sub_Btn_C*            K2Node_DynamicCast_AsWBP_CMN_Race_Menu_Sub_Btn;    // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x2];                                      // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOwnerPlayerControllerIndex_ReturnValue_2; // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGadgetInfoMode_IsMode;                  // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERacePauseMenuItem                            Temp_byte_Variable_40;                             // 0x0293(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_5;                       // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerControllerIndex_5;        // 0x02A0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOwnerPlayerControllerIndex_ReturnValue_3; // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_4;                       // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerControllerIndex_4;        // 0x02B0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGadgetInfoModeinIndex_IsMode;           // 0x02B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B7[0x1];                                      // 0x02B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex_2; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetLastFocusedButton_ReturnValue_2;       // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CMN_RaceMenu_Sub_Btn_C*            K2Node_DynamicCast_AsWBP_CMN_Race_Menu_Sub_Btn_1;  // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
