#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RacePlayerController

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UnionSystem_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RacePlayerController.BP_RacePlayerController_C
// 0x0010 (0x0BA8 - 0x0B98)
class ABP_RacePlayerController_C final : public ARacePlayerController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          ShiftPressed;                                      // 0x0BA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CtrlPressed;                                       // 0x0BA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AltPressed;                                        // 0x0BA2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          F9Pressed;                                         // 0x0BA3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ButtonLeftThumbstickPressed;                       // 0x0BA4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ButtonRightThumbstickPressed;                      // 0x0BA5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ButtonRightTriggerPressed;                         // 0x0BA6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugTraceStarted;                                 // 0x0BA7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RacePlayerController(int32 EntryPoint);
	void InpActEvt_Alt_G_K2Node_InputDebugKeyEvent_0(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_B_K2Node_InputDebugKeyEvent_5(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Ctrl_G_K2Node_InputDebugKeyEvent_1(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_F9_K2Node_InputDebugKeyEvent_10(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_F9_K2Node_InputDebugKeyEvent_11(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_F_K2Node_InputDebugKeyEvent_3(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_G_K2Node_InputDebugKeyEvent_20(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Gamepad_LeftThumbstick_K2Node_InputDebugKeyEvent_16(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Gamepad_LeftThumbstick_K2Node_InputDebugKeyEvent_17(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Gamepad_RightThumbstick_K2Node_InputDebugKeyEvent_14(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Gamepad_RightThumbstick_K2Node_InputDebugKeyEvent_15(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Gamepad_RightTrigger_K2Node_InputDebugKeyEvent_12(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Gamepad_RightTrigger_K2Node_InputDebugKeyEvent_13(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_LeftControl_K2Node_InputDebugKeyEvent_8(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_LeftShift_K2Node_InputDebugKeyEvent_9(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_M_K2Node_InputDebugKeyEvent_7(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_N_K2Node_InputDebugKeyEvent_6(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_P_K2Node_InputDebugKeyEvent_19(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Period_K2Node_InputDebugKeyEvent_18(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Shift_G_K2Node_InputDebugKeyEvent_2(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Six_K2Node_InputDebugKeyEvent_4(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

	bool IsFadeClear() const;
	bool OnIsMenuInputEnabled() const;
	bool OnIsSubMenuInputEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RacePlayerController_C">();
	}
	static class ABP_RacePlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RacePlayerController_C>();
	}
};
static_assert(alignof(ABP_RacePlayerController_C) == 0x000008, "Wrong alignment on ABP_RacePlayerController_C");
static_assert(sizeof(ABP_RacePlayerController_C) == 0x000BA8, "Wrong size on ABP_RacePlayerController_C");
static_assert(offsetof(ABP_RacePlayerController_C, UberGraphFrame) == 0x000B98, "Member 'ABP_RacePlayerController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RacePlayerController_C, ShiftPressed) == 0x000BA0, "Member 'ABP_RacePlayerController_C::ShiftPressed' has a wrong offset!");
static_assert(offsetof(ABP_RacePlayerController_C, CtrlPressed) == 0x000BA1, "Member 'ABP_RacePlayerController_C::CtrlPressed' has a wrong offset!");
static_assert(offsetof(ABP_RacePlayerController_C, AltPressed) == 0x000BA2, "Member 'ABP_RacePlayerController_C::AltPressed' has a wrong offset!");
static_assert(offsetof(ABP_RacePlayerController_C, F9Pressed) == 0x000BA3, "Member 'ABP_RacePlayerController_C::F9Pressed' has a wrong offset!");
static_assert(offsetof(ABP_RacePlayerController_C, ButtonLeftThumbstickPressed) == 0x000BA4, "Member 'ABP_RacePlayerController_C::ButtonLeftThumbstickPressed' has a wrong offset!");
static_assert(offsetof(ABP_RacePlayerController_C, ButtonRightThumbstickPressed) == 0x000BA5, "Member 'ABP_RacePlayerController_C::ButtonRightThumbstickPressed' has a wrong offset!");
static_assert(offsetof(ABP_RacePlayerController_C, ButtonRightTriggerPressed) == 0x000BA6, "Member 'ABP_RacePlayerController_C::ButtonRightTriggerPressed' has a wrong offset!");
static_assert(offsetof(ABP_RacePlayerController_C, DebugTraceStarted) == 0x000BA7, "Member 'ABP_RacePlayerController_C::DebugTraceStarted' has a wrong offset!");

}

