#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReadySequenceActor

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionLib_structs.hpp"


namespace SDK::Params
{

// Function BP_ReadySequenceActor.BP_ReadySequenceActor_C.BackupSettings
// 0x0020 (0x0020 - 0x0000)
struct BP_ReadySequenceActor_C_BackupSettings final
{
public:
	TArray<struct FUserAssistData>                CallFunc_CalcGetUserAssistData_OutAssistData;      // 0x0000(0x0010)(ReferenceParm)
	TArray<int32>                                 CallFunc_GetSelectedGadgetPresetIdsAllPlayer_ReturnValue; // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_ReadySequenceActor_C_BackupSettings) == 0x000008, "Wrong alignment on BP_ReadySequenceActor_C_BackupSettings");
static_assert(sizeof(BP_ReadySequenceActor_C_BackupSettings) == 0x000020, "Wrong size on BP_ReadySequenceActor_C_BackupSettings");
static_assert(offsetof(BP_ReadySequenceActor_C_BackupSettings, CallFunc_CalcGetUserAssistData_OutAssistData) == 0x000000, "Member 'BP_ReadySequenceActor_C_BackupSettings::CallFunc_CalcGetUserAssistData_OutAssistData' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_BackupSettings, CallFunc_GetSelectedGadgetPresetIdsAllPlayer_ReturnValue) == 0x000010, "Member 'BP_ReadySequenceActor_C_BackupSettings::CallFunc_GetSelectedGadgetPresetIdsAllPlayer_ReturnValue' has a wrong offset!");

// Function BP_ReadySequenceActor.BP_ReadySequenceActor_C.CancelEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_ReadySequenceActor_C_CancelEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerControllerIndex;                             // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReadySequenceActor_C_CancelEvent) == 0x000008, "Wrong alignment on BP_ReadySequenceActor_C_CancelEvent");
static_assert(sizeof(BP_ReadySequenceActor_C_CancelEvent) == 0x000010, "Wrong size on BP_ReadySequenceActor_C_CancelEvent");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelEvent, Object) == 0x000000, "Member 'BP_ReadySequenceActor_C_CancelEvent::Object' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelEvent, PlayerControllerIndex) == 0x000008, "Member 'BP_ReadySequenceActor_C_CancelEvent::PlayerControllerIndex' has a wrong offset!");

// Function BP_ReadySequenceActor.BP_ReadySequenceActor_C.CancelReady
// 0x0040 (0x0040 - 0x0000)
struct BP_ReadySequenceActor_C_CancelReady final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0004(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0008(0x0004)()
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGadgetPlateWindow*                     CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UReadyWindowCharacterIcon*>      CallFunc_GetReadyWindowCharacterIcons_OutReadyWindowCharacterIcons; // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UReadyWindowCharacterIcon*              CallFunc_Array_Get_Item_2;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReadySequenceActor_C_CancelReady) == 0x000008, "Wrong alignment on BP_ReadySequenceActor_C_CancelReady");
static_assert(sizeof(BP_ReadySequenceActor_C_CancelReady) == 0x000040, "Wrong size on BP_ReadySequenceActor_C_CancelReady");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, PlayerIndex) == 0x000000, "Member 'BP_ReadySequenceActor_C_CancelReady::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, CallFunc_SoundPlay_ReturnValue) == 0x000004, "Member 'BP_ReadySequenceActor_C_CancelReady::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, CallFunc_SoundPlay_ReturnValue_1) == 0x000008, "Member 'BP_ReadySequenceActor_C_CancelReady::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_ReadySequenceActor_C_CancelReady::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_ReadySequenceActor_C_CancelReady::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_ReadySequenceActor_C_CancelReady::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'BP_ReadySequenceActor_C_CancelReady::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000022, "Member 'BP_ReadySequenceActor_C_CancelReady::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000023, "Member 'BP_ReadySequenceActor_C_CancelReady::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, Temp_bool_Variable) == 0x000024, "Member 'BP_ReadySequenceActor_C_CancelReady::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, CallFunc_Array_Get_Item_1) == 0x000025, "Member 'BP_ReadySequenceActor_C_CancelReady::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, CallFunc_GetReadyWindowCharacterIcons_OutReadyWindowCharacterIcons) == 0x000028, "Member 'BP_ReadySequenceActor_C_CancelReady::CallFunc_GetReadyWindowCharacterIcons_OutReadyWindowCharacterIcons' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CancelReady, CallFunc_Array_Get_Item_2) == 0x000038, "Member 'BP_ReadySequenceActor_C_CancelReady::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function BP_ReadySequenceActor.BP_ReadySequenceActor_C.Check Permission Input
// 0x000C (0x000C - 0x0000)
struct BP_ReadySequenceActor_C_Check_Permission_Input final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bISPermission;                                     // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReadySequenceActor_C_Check_Permission_Input) == 0x000004, "Wrong alignment on BP_ReadySequenceActor_C_Check_Permission_Input");
static_assert(sizeof(BP_ReadySequenceActor_C_Check_Permission_Input) == 0x00000C, "Wrong size on BP_ReadySequenceActor_C_Check_Permission_Input");
static_assert(offsetof(BP_ReadySequenceActor_C_Check_Permission_Input, PlayerIndex) == 0x000000, "Member 'BP_ReadySequenceActor_C_Check_Permission_Input::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_Check_Permission_Input, bISPermission) == 0x000004, "Member 'BP_ReadySequenceActor_C_Check_Permission_Input::bISPermission' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_Check_Permission_Input, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BP_ReadySequenceActor_C_Check_Permission_Input::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_Check_Permission_Input, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000006, "Member 'BP_ReadySequenceActor_C_Check_Permission_Input::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_Check_Permission_Input, CallFunc_Array_Get_Item) == 0x000007, "Member 'BP_ReadySequenceActor_C_Check_Permission_Input::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_Check_Permission_Input, CallFunc_Not_PreBool_ReturnValue_1) == 0x000008, "Member 'BP_ReadySequenceActor_C_Check_Permission_Input::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function BP_ReadySequenceActor.BP_ReadySequenceActor_C.CheckInputEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_ReadySequenceActor_C_CheckInputEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerControllerIndex;                             // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReadySequenceActor_C_CheckInputEvent) == 0x000008, "Wrong alignment on BP_ReadySequenceActor_C_CheckInputEvent");
static_assert(sizeof(BP_ReadySequenceActor_C_CheckInputEvent) == 0x000010, "Wrong size on BP_ReadySequenceActor_C_CheckInputEvent");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckInputEvent, Object) == 0x000000, "Member 'BP_ReadySequenceActor_C_CheckInputEvent::Object' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckInputEvent, PlayerControllerIndex) == 0x000008, "Member 'BP_ReadySequenceActor_C_CheckInputEvent::PlayerControllerIndex' has a wrong offset!");

// Function BP_ReadySequenceActor.BP_ReadySequenceActor_C.CheckTimeTrialDisableGadget
// 0x0118 (0x0118 - 0x0000)
struct BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReturnValue;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGadgetPlateUIData                     CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData; // 0x0018(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUserGadgetData                        CallFunc_Array_Get_Item;                           // 0x0044(0x0008)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGadgetData                            CallFunc_GetGadgetData_OutGadgetData;              // 0x0050(0x00C0)()
	bool                                          CallFunc_GetGadgetData_ReturnValue;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget) == 0x000008, "Wrong alignment on BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget");
static_assert(sizeof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget) == 0x000118, "Wrong size on BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, bIsValid) == 0x000000, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::bIsValid' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, bReturnValue) == 0x000001, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::bReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, Temp_bool_True_if_break_was_hit_Variable) == 0x000002, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData) == 0x000018, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, CallFunc_Array_Get_Item) == 0x000044, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, CallFunc_BooleanAND_ReturnValue) == 0x00004D, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, CallFunc_GetGadgetData_OutGadgetData) == 0x000050, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::CallFunc_GetGadgetData_OutGadgetData' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, CallFunc_GetGadgetData_ReturnValue) == 0x000110, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::CallFunc_GetGadgetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget, CallFunc_Not_PreBool_ReturnValue_1) == 0x000111, "Member 'BP_ReadySequenceActor_C_CheckTimeTrialDisableGadget::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function BP_ReadySequenceActor.BP_ReadySequenceActor_C.CreateReadyWidget
// 0x0001 (0x0001 - 0x0000)
struct BP_ReadySequenceActor_C_CreateReadyWidget final
{
public:
	bool                                          Optimize;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReadySequenceActor_C_CreateReadyWidget) == 0x000001, "Wrong alignment on BP_ReadySequenceActor_C_CreateReadyWidget");
static_assert(sizeof(BP_ReadySequenceActor_C_CreateReadyWidget) == 0x000001, "Wrong size on BP_ReadySequenceActor_C_CreateReadyWidget");
static_assert(offsetof(BP_ReadySequenceActor_C_CreateReadyWidget, Optimize) == 0x000000, "Member 'BP_ReadySequenceActor_C_CreateReadyWidget::Optimize' has a wrong offset!");

// Function BP_ReadySequenceActor.BP_ReadySequenceActor_C.ExecuteUbergraph_BP_ReadySequenceActor
// 0x06A0 (0x06A0 - 0x0000)
struct BP_ReadySequenceActor_C_ExecuteUbergraph_BP_ReadySequenceActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuInputRecieveObject*                CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDiffSettings_AppDiff;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDiffSettings_OptionDiff;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDiffSettings_AppDiff_1;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDiffSettings_OptionDiff_1;              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_CreatePlayer_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_6;                       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerControllerIndex_6;        // 0x0060(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Optimize_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_5;                       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerControllerIndex_5;        // 0x0078(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_4;                       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerControllerIndex_4;        // 0x0088(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGadgetPlateWindow*>             CallFunc_GetGadgetPlateWindows_OutGadgetPlateWindows; // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UObject*                                K2Node_CustomEvent_Object_3;                       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerControllerIndex_3;        // 0x00A8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UReadyOption*>                   CallFunc_GetReadyOptions_OutReadyOptions;          // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UObject*                                K2Node_CustomEvent_Object_2;                       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerControllerIndex_2;        // 0x00C8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Ready_M4_C*                        K2Node_DynamicCast_AsWBP_Ready_M4;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UReadyOption*                           CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     K2Node_DynamicCast_AsWBP_Pause_Menu_Sub_Option_Btn_03; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHandleAssistEnabled_bOutValidIndex;     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHandleAssistEnabled_ReturnValue;        // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGadgetPlateWindow*                     CallFunc_Array_Get_Item_1;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_1;                       // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerControllerIndex_1;        // 0x0170(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_177[0x1];                                      // 0x0177(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0180(0x0010)()
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_4; // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x01B0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x01C0(0x0010)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x01D8(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_5; // 0x01E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0214(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGadgetPlateWindow*                     CallFunc_Array_Get_Item_2;                         // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_CreatePlayer_ReturnValue_1;               // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGadgetPlateWindow*                     CallFunc_Array_Get_Item_3;                         // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_7; // 0x0284(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_8; // 0x0294(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_9; // 0x02A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_10; // 0x02B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_11; // 0x02C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x02D8(0x0010)()
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_12; // 0x02E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_13; // 0x02F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerControllerIndex;          // 0x0310(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_14; // 0x0314(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCharaMachineParamWindow*>       CallFunc_GetCharaMachineParamWindow_OutCharaMachineParamWindows; // 0x0328(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Variable_6;                               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x0344(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGadgetPlateWindow*                     CallFunc_Array_Get_Item_4;                         // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UReadyOption*                           CallFunc_Array_Get_Item_5;                         // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Optimize;                       // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_4;           // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_396[0x2];                                      // 0x0396(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UReadyWindowCharacterIcon*>      CallFunc_GetReadyWindowCharacterIcons_OutReadyWindowCharacterIcons; // 0x03A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UReadyWindowCharacterIcon*              CallFunc_Array_Get_Item_6;                         // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_6;            // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_5;           // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x03C0(0x0010)(ReferenceParm)
	TArray<class UReadyWindowCharacterIcon*>      CallFunc_GetReadyWindowCharacterIcons_OutReadyWindowCharacterIcons_1; // 0x03D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x03E0(0x0010)()
	class UReadyWindowCharacterIcon*              CallFunc_Array_Get_Item_7;                         // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_7;            // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_6;           // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402[0x2];                                      // 0x0402(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_8;            // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_9;            // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UReadyWindow*                           CallFunc_Array_Get_Item_8;                         // 0x0418(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_422[0x6];                                      // 0x0422(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item_9;                         // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UReadyWindow*                           CallFunc_Create_ReturnValue;                       // 0x0438(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Ready_M4_C*                        K2Node_DynamicCast_AsWBP_Ready_M4_1;               // 0x0440(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Ready_M1_C*                        K2Node_DynamicCast_AsWBP_Ready_M1;                 // 0x0450(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Ready_M2_C*                        K2Node_DynamicCast_AsWBP_Ready_M2;                 // 0x0460(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x046C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x047C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x048C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x049C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x04AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_21;           // 0x04BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface; // 0x04D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIPopupWindowBase*                CallFunc_CreatePopupWindow_ReturnValue;            // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1; // 0x04F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2; // 0x0510(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3; // 0x0528(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4; // 0x0540(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_22;           // 0x0554(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_23;           // 0x0564(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
