#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RaceMasterDataAccessor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_RaceMasterDataAccessor.BP_RaceMasterDataAccessor_C.ExecuteUbergraph_BP_RaceMasterDataAccessor
// 0x001C (0x001C - 0x0000)
struct BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor) == 0x000004, "Wrong alignment on BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor");
static_assert(sizeof(BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor) == 0x00001C, "Wrong size on BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor");
static_assert(offsetof(BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor, EntryPoint) == 0x000000, "Member 'BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor, Temp_int_Variable) == 0x000008, "Member 'BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor, Temp_int_Variable_1) == 0x00000C, "Member 'BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor, CallFunc_Conv_IntToByte_ReturnValue) == 0x000014, "Member 'BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000015, "Member 'BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor, CallFunc_Less_IntInt_ReturnValue) == 0x000016, "Member 'BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'BP_RaceMasterDataAccessor_C_ExecuteUbergraph_BP_RaceMasterDataAccessor::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

}

