#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RaceResultSequence

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_RaceResultSequence.BP_RaceResultSequence_C.ExecuteUbergraph_BP_RaceResultSequence
// 0x0020 (0x0020 - 0x0000)
struct BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence) == 0x000008, "Wrong alignment on BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence");
static_assert(sizeof(BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence) == 0x000020, "Wrong size on BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence");
static_assert(offsetof(BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence, EntryPoint) == 0x000000, "Member 'BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000018, "Member 'BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00001C, "Member 'BP_RaceResultSequence_C_ExecuteUbergraph_BP_RaceResultSequence::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function BP_RaceResultSequence.BP_RaceResultSequence_C.GetGroupRaceResultWidget
// 0x0020 (0x0020 - 0x0000)
struct BP_RaceResultSequence_C_GetGroupRaceResultWidget final
{
public:
	class UWBP_GroupResult_C*                     Widget;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_RaceSequenceStateResult_C*         K2Node_DynamicCast_AsBPC_Race_Sequence_State_Result; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RaceResultSequence_C_GetGroupRaceResultWidget) == 0x000008, "Wrong alignment on BP_RaceResultSequence_C_GetGroupRaceResultWidget");
static_assert(sizeof(BP_RaceResultSequence_C_GetGroupRaceResultWidget) == 0x000020, "Wrong size on BP_RaceResultSequence_C_GetGroupRaceResultWidget");
static_assert(offsetof(BP_RaceResultSequence_C_GetGroupRaceResultWidget, Widget) == 0x000000, "Member 'BP_RaceResultSequence_C_GetGroupRaceResultWidget::Widget' has a wrong offset!");
static_assert(offsetof(BP_RaceResultSequence_C_GetGroupRaceResultWidget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_RaceResultSequence_C_GetGroupRaceResultWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaceResultSequence_C_GetGroupRaceResultWidget, K2Node_DynamicCast_AsBPC_Race_Sequence_State_Result) == 0x000010, "Member 'BP_RaceResultSequence_C_GetGroupRaceResultWidget::K2Node_DynamicCast_AsBPC_Race_Sequence_State_Result' has a wrong offset!");
static_assert(offsetof(BP_RaceResultSequence_C_GetGroupRaceResultWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_RaceResultSequence_C_GetGroupRaceResultWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_RaceResultSequence.BP_RaceResultSequence_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_RaceResultSequence_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RaceResultSequence_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_RaceResultSequence_C_ReceiveTick");
static_assert(sizeof(BP_RaceResultSequence_C_ReceiveTick) == 0x000004, "Wrong size on BP_RaceResultSequence_C_ReceiveTick");
static_assert(offsetof(BP_RaceResultSequence_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_RaceResultSequence_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

