#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RaceSequenceHolder

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RaceSequenceHolder.BP_RaceSequenceHolder_C
// 0x0038 (0x0320 - 0x02E8)
class ABP_RaceSequenceHolder_C final : public ARaceSequenceHolder
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnotherStageLotteryWheel*              NewVar;                                            // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<EStageId>                              New_Id;                                            // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUnionUILoadingDisplay*                 LoadingDisplay;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          In_End_Hide;                                       // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CantFindStage;                                     // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_System_Title_Communication_C*      LoadingWidget;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BindOnLoadingEndAnimFinished();
	void ExecuteUbergraph_BP_RaceSequenceHolder(int32 EntryPoint);
	void FinalizeWirelessModeComplete(class UWirelessLobbyContext* WirelessLobbyContext, const struct FOnlineErrorBP& Error);
	void NextCeremony();
	void OnFinalize();
	void OnLoaded_16C6E5E145BDC897581C02A025FCFC60(class UObject* Loaded);
	void SetGrandPrixNextRaceSetting();
	void SetSelectMode();
	void StartErrorHandling();
	void StartGrandPrix();
	void StartMatchRace();
	void StartMiddleLoading(int32 InLoadingPhaseNum, bool bInLoadingProgressMode, bool bInEndHide);
	void StartOpenLevelToMenu();
	void StartParty();
	void StartTimeTrial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RaceSequenceHolder_C">();
	}
	static class ABP_RaceSequenceHolder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RaceSequenceHolder_C>();
	}
};
static_assert(alignof(ABP_RaceSequenceHolder_C) == 0x000008, "Wrong alignment on ABP_RaceSequenceHolder_C");
static_assert(sizeof(ABP_RaceSequenceHolder_C) == 0x000320, "Wrong size on ABP_RaceSequenceHolder_C");
static_assert(offsetof(ABP_RaceSequenceHolder_C, UberGraphFrame) == 0x0002E8, "Member 'ABP_RaceSequenceHolder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RaceSequenceHolder_C, NewVar) == 0x0002F0, "Member 'ABP_RaceSequenceHolder_C::NewVar' has a wrong offset!");
static_assert(offsetof(ABP_RaceSequenceHolder_C, New_Id) == 0x0002F8, "Member 'ABP_RaceSequenceHolder_C::New_Id' has a wrong offset!");
static_assert(offsetof(ABP_RaceSequenceHolder_C, LoadingDisplay) == 0x000308, "Member 'ABP_RaceSequenceHolder_C::LoadingDisplay' has a wrong offset!");
static_assert(offsetof(ABP_RaceSequenceHolder_C, In_End_Hide) == 0x000310, "Member 'ABP_RaceSequenceHolder_C::In_End_Hide' has a wrong offset!");
static_assert(offsetof(ABP_RaceSequenceHolder_C, CantFindStage) == 0x000311, "Member 'ABP_RaceSequenceHolder_C::CantFindStage' has a wrong offset!");
static_assert(offsetof(ABP_RaceSequenceHolder_C, LoadingWidget) == 0x000318, "Member 'ABP_RaceSequenceHolder_C::LoadingWidget' has a wrong offset!");

}

