#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StickerMasterSystem

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_PullDownMenuItemData_structs.hpp"
#include "ST_ColorDetailWindowData_structs.hpp"
#include "ST_GarageData_structs.hpp"
#include "ST_ColorDetailWindowColorItemData_structs.hpp"
#include "ST_StickerMachineData_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.BindInputReceiver
// 0x00D8 (0x00D8 - 0x0000)
struct BP_StickerMasterSystem_C_BindInputReceiver final
{
public:
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_6;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_9;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_10;           // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_11;           // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FVector2D& Value)> K2Node_CreateDelegate_OutputDelegate_12; // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_BindInputReceiver) == 0x000004, "Wrong alignment on BP_StickerMasterSystem_C_BindInputReceiver");
static_assert(sizeof(BP_StickerMasterSystem_C_BindInputReceiver) == 0x0000D8, "Wrong size on BP_StickerMasterSystem_C_BindInputReceiver");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, CallFunc_IsValid_ReturnValue_1) == 0x000044, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate_4) == 0x000048, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate_5) == 0x000058, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate_6) == 0x000068, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate_7) == 0x000078, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate_8) == 0x000088, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate_9) == 0x000098, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000A8, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate_11) == 0x0000B8, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_BindInputReceiver, K2Node_CreateDelegate_OutputDelegate_12) == 0x0000C8, "Member 'BP_StickerMasterSystem_C_BindInputReceiver::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.CancelEvent
// 0x0068 (0x0068 - 0x0000)
struct BP_StickerMasterSystem_C_CancelEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_GarageData                         CallFunc_GetGarageData_OutGarageData;              // 0x0010(0x0058)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_CancelEvent) == 0x000008, "Wrong alignment on BP_StickerMasterSystem_C_CancelEvent");
static_assert(sizeof(BP_StickerMasterSystem_C_CancelEvent) == 0x000068, "Wrong size on BP_StickerMasterSystem_C_CancelEvent");
static_assert(offsetof(BP_StickerMasterSystem_C_CancelEvent, Object) == 0x000000, "Member 'BP_StickerMasterSystem_C_CancelEvent::Object' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_CancelEvent, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_StickerMasterSystem_C_CancelEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_CancelEvent, CallFunc_GetGarageData_OutGarageData) == 0x000010, "Member 'BP_StickerMasterSystem_C_CancelEvent::CallFunc_GetGarageData_OutGarageData' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.ClampStickerLeft
// 0x0028 (0x0028 - 0x0000)
struct BP_StickerMasterSystem_C_ClampStickerLeft final
{
public:
	int32                                         ContenderIndex;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FirstIndex;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_ClampStickerLeft) == 0x000004, "Wrong alignment on BP_StickerMasterSystem_C_ClampStickerLeft");
static_assert(sizeof(BP_StickerMasterSystem_C_ClampStickerLeft) == 0x000028, "Wrong size on BP_StickerMasterSystem_C_ClampStickerLeft");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, ContenderIndex) == 0x000000, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::ContenderIndex' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, FirstIndex) == 0x000004, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::FirstIndex' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, Temp_bool_Variable) == 0x000008, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000A, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000011, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, Temp_int_Variable) == 0x000018, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerLeft, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'BP_StickerMasterSystem_C_ClampStickerLeft::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.ClampStickerRight
// 0x0028 (0x0028 - 0x0000)
struct BP_StickerMasterSystem_C_ClampStickerRight final
{
public:
	int32                                         ContenderIndex;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FirstIndex;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_ClampStickerRight) == 0x000004, "Wrong alignment on BP_StickerMasterSystem_C_ClampStickerRight");
static_assert(sizeof(BP_StickerMasterSystem_C_ClampStickerRight) == 0x000028, "Wrong size on BP_StickerMasterSystem_C_ClampStickerRight");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, ContenderIndex) == 0x000000, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::ContenderIndex' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, FirstIndex) == 0x000004, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::FirstIndex' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000008, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000009, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, Temp_bool_Variable) == 0x000019, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, Temp_int_Variable) == 0x00001C, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, CallFunc_Not_PreBool_ReturnValue) == 0x000025, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_ClampStickerRight, CallFunc_BooleanAND_ReturnValue) == 0x000026, "Member 'BP_StickerMasterSystem_C_ClampStickerRight::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.CollectMaterials
// 0x0028 (0x0028 - 0x0000)
struct BP_StickerMasterSystem_C_CollectMaterials final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_CollectMaterials) == 0x000008, "Wrong alignment on BP_StickerMasterSystem_C_CollectMaterials");
static_assert(sizeof(BP_StickerMasterSystem_C_CollectMaterials) == 0x000028, "Wrong size on BP_StickerMasterSystem_C_CollectMaterials");
static_assert(offsetof(BP_StickerMasterSystem_C_CollectMaterials, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_StickerMasterSystem_C_CollectMaterials::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_CollectMaterials, CallFunc_GetMaterial_ReturnValue) == 0x000008, "Member 'BP_StickerMasterSystem_C_CollectMaterials::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_CollectMaterials, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'BP_StickerMasterSystem_C_CollectMaterials::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_CollectMaterials, CallFunc_GetMaterial_ReturnValue_1) == 0x000018, "Member 'BP_StickerMasterSystem_C_CollectMaterials::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_CollectMaterials, CallFunc_IsValid_ReturnValue_2) == 0x000020, "Member 'BP_StickerMasterSystem_C_CollectMaterials::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_CollectMaterials, CallFunc_IsValid_ReturnValue_3) == 0x000021, "Member 'BP_StickerMasterSystem_C_CollectMaterials::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.Collision Adjust
// 0x00B8 (0x00B8 - 0x0000)
struct BP_StickerMasterSystem_C_Collision_Adjust final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUnionStickerBase*                      CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Distance2D_ReturnValue;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_Collision_Adjust) == 0x000008, "Wrong alignment on BP_StickerMasterSystem_C_Collision_Adjust");
static_assert(sizeof(BP_StickerMasterSystem_C_Collision_Adjust) == 0x0000B8, "Wrong size on BP_StickerMasterSystem_C_Collision_Adjust");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_BreakVector_X) == 0x000020, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_BreakVector_Y) == 0x000028, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_BreakVector_Z) == 0x000030, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_MakeVector2D_ReturnValue) == 0x000040, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000059, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_BreakVector_X_1) == 0x000078, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_BreakVector_Y_1) == 0x000080, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_BreakVector_Z_1) == 0x000088, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_Not_PreBool_ReturnValue) == 0x000090, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_MakeVector2D_ReturnValue_1) == 0x000098, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_Distance2D_ReturnValue) == 0x0000A8, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000B4, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_Collision_Adjust, CallFunc_Less_IntInt_ReturnValue) == 0x0000B5, "Member 'BP_StickerMasterSystem_C_Collision_Adjust::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.ColorPicker_OnColorItemFocused
// 0x0018 (0x0018 - 0x0000)
struct BP_StickerMasterSystem_C_ColorPicker_OnColorItemFocused final
{
public:
	struct FST_ColorDetailWindowColorItemData     InItemData;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_ColorPicker_OnColorItemFocused) == 0x000004, "Wrong alignment on BP_StickerMasterSystem_C_ColorPicker_OnColorItemFocused");
static_assert(sizeof(BP_StickerMasterSystem_C_ColorPicker_OnColorItemFocused) == 0x000018, "Wrong size on BP_StickerMasterSystem_C_ColorPicker_OnColorItemFocused");
static_assert(offsetof(BP_StickerMasterSystem_C_ColorPicker_OnColorItemFocused, InItemData) == 0x000000, "Member 'BP_StickerMasterSystem_C_ColorPicker_OnColorItemFocused::InItemData' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.ColorPicker_OnColorItemSelected
// 0x0018 (0x0018 - 0x0000)
struct BP_StickerMasterSystem_C_ColorPicker_OnColorItemSelected final
{
public:
	struct FST_ColorDetailWindowColorItemData     InItemData;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_ColorPicker_OnColorItemSelected) == 0x000004, "Wrong alignment on BP_StickerMasterSystem_C_ColorPicker_OnColorItemSelected");
static_assert(sizeof(BP_StickerMasterSystem_C_ColorPicker_OnColorItemSelected) == 0x000018, "Wrong size on BP_StickerMasterSystem_C_ColorPicker_OnColorItemSelected");
static_assert(offsetof(BP_StickerMasterSystem_C_ColorPicker_OnColorItemSelected, InItemData) == 0x000000, "Member 'BP_StickerMasterSystem_C_ColorPicker_OnColorItemSelected::InItemData' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.ColorPicker_OnSurfaceItemFocused
// 0x0020 (0x0020 - 0x0000)
struct BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemFocused final
{
public:
	struct FST_PullDownMenuItemData               InItemData;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemFocused) == 0x000008, "Wrong alignment on BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemFocused");
static_assert(sizeof(BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemFocused) == 0x000020, "Wrong size on BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemFocused");
static_assert(offsetof(BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemFocused, InItemData) == 0x000000, "Member 'BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemFocused::InItemData' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.ColorPicker_OnSurfaceItemSelected
// 0x0020 (0x0020 - 0x0000)
struct BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemSelected final
{
public:
	struct FST_PullDownMenuItemData               InItemData;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemSelected) == 0x000008, "Wrong alignment on BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemSelected");
static_assert(sizeof(BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemSelected) == 0x000020, "Wrong size on BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemSelected");
static_assert(offsetof(BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemSelected, InItemData) == 0x000000, "Member 'BP_StickerMasterSystem_C_ColorPicker_OnSurfaceItemSelected::InItemData' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.ColorWindowEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_StickerMasterSystem_C_ColorWindowEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_ColorWindowEvent) == 0x000008, "Wrong alignment on BP_StickerMasterSystem_C_ColorWindowEvent");
static_assert(sizeof(BP_StickerMasterSystem_C_ColorWindowEvent) == 0x000008, "Wrong size on BP_StickerMasterSystem_C_ColorWindowEvent");
static_assert(offsetof(BP_StickerMasterSystem_C_ColorWindowEvent, Object) == 0x000000, "Member 'BP_StickerMasterSystem_C_ColorWindowEvent::Object' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.DecisionEvent
// 0x0068 (0x0068 - 0x0000)
struct BP_StickerMasterSystem_C_DecisionEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_GarageData                         CallFunc_GetGarageData_OutGarageData;              // 0x0010(0x0058)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_DecisionEvent) == 0x000008, "Wrong alignment on BP_StickerMasterSystem_C_DecisionEvent");
static_assert(sizeof(BP_StickerMasterSystem_C_DecisionEvent) == 0x000068, "Wrong size on BP_StickerMasterSystem_C_DecisionEvent");
static_assert(offsetof(BP_StickerMasterSystem_C_DecisionEvent, Object) == 0x000000, "Member 'BP_StickerMasterSystem_C_DecisionEvent::Object' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_DecisionEvent, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_StickerMasterSystem_C_DecisionEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_DecisionEvent, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'BP_StickerMasterSystem_C_DecisionEvent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_DecisionEvent, CallFunc_BooleanOR_ReturnValue) == 0x00000A, "Member 'BP_StickerMasterSystem_C_DecisionEvent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_DecisionEvent, CallFunc_GetGarageData_OutGarageData) == 0x000010, "Member 'BP_StickerMasterSystem_C_DecisionEvent::CallFunc_GetGarageData_OutGarageData' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.DeregistInputRecevier
// 0x0010 (0x0010 - 0x0000)
struct BP_StickerMasterSystem_C_DeregistInputRecevier final
{
public:
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StickerMasterSystem_C_DeregistInputRecevier) == 0x000008, "Wrong alignment on BP_StickerMasterSystem_C_DeregistInputRecevier");
static_assert(sizeof(BP_StickerMasterSystem_C_DeregistInputRecevier) == 0x000010, "Wrong size on BP_StickerMasterSystem_C_DeregistInputRecevier");
static_assert(offsetof(BP_StickerMasterSystem_C_DeregistInputRecevier, CallFunc_GetAppPlayerController_ReturnValue) == 0x000000, "Member 'BP_StickerMasterSystem_C_DeregistInputRecevier::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_DeregistInputRecevier, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_StickerMasterSystem_C_DeregistInputRecevier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_DeregistInputRecevier, CallFunc_UnregisterSingleSubMenu_ReturnValue) == 0x000009, "Member 'BP_StickerMasterSystem_C_DeregistInputRecevier::CallFunc_UnregisterSingleSubMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StickerMasterSystem_C_DeregistInputRecevier, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'BP_StickerMasterSystem_C_DeregistInputRecevier::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_StickerMasterSystem.BP_StickerMasterSystem_C.ExecuteUbergraph_BP_StickerMasterSystem
// 0x0F50 (0x0F50 - 0x0000)
struct BP_StickerMasterSystem_C_ExecuteUbergraph_BP_StickerMasterSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MachineCustomizeSequence_C*         K2Node_CustomEvent_MCSequence;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsRear;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_10;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_9;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_8;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStickerUIData                         CallFunc_GetStickerUIData_OutStickerUIData;        // 0x0058(0x0088)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetMachineColorById_OutMachineColor;      // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUserMachineCustomizeData              CallFunc_GetSelectedMachineCustomizeData_ReturnValue; // 0x0100(0x0078)()
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_1;     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E8[0x8];                                      // 0x01E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_StickerActorGroup_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUnionStickerCamera*                    CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0270(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x02D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_StickerRenderPlane_C*               CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_Stop_ReturnValue;                         // 0x0344(0x0004)()
	struct FSoundHandle                           CallFunc_Stop_ReturnValue_1;                       // 0x0348(0x0004)()
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_Stop_ReturnValue_2;                       // 0x0350(0x0004)()
	bool                                          CallFunc_IsPlaying_ReturnValue_2;                  // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_356[0x2];                                      // 0x0356(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_2;     // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_7;                       // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_6;                       // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_5;                       // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_4;                       // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0390(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x03A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x03B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue_3;     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTurntableComponent*                    CallFunc_GetTurntableComponent_ReturnValue;        // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTurntableData                         CallFunc_GetCurrentTurntableData_ReturnValue;      // 0x03E8(0x0010)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0448(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0458(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_Vector2dToString_ReturnValue;        // 0x0470(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x04A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
