#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UnionGameInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionSystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UnionGameInstance.BP_UnionGameInstance_C
// 0x0040 (0x0220 - 0x01E0)
class UBP_UnionGameInstance_C final : public UAppGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UDataTable>              DefaultDisableItemTable;                           // 0x01E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<EItemId>                               DefaultDisableItemArr;                             // 0x0210(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_UnionGameInstance(int32 EntryPoint);
	void OnLoaded_C798D8744866C6A781E1E5B0E4C53C75(class UObject* Loaded);
	void ReceiveInit();
	void SetUpMilestone();

	void GetVCSRevisionNumIF(int32* RevisionNum) const;
	void GetVCSRevisionStrIF(class FString* VCSStr) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UnionGameInstance_C">();
	}
	static class UBP_UnionGameInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UnionGameInstance_C>();
	}
};
static_assert(alignof(UBP_UnionGameInstance_C) == 0x000008, "Wrong alignment on UBP_UnionGameInstance_C");
static_assert(sizeof(UBP_UnionGameInstance_C) == 0x000220, "Wrong size on UBP_UnionGameInstance_C");
static_assert(offsetof(UBP_UnionGameInstance_C, UberGraphFrame) == 0x0001E0, "Member 'UBP_UnionGameInstance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UnionGameInstance_C, DefaultDisableItemTable) == 0x0001E8, "Member 'UBP_UnionGameInstance_C::DefaultDisableItemTable' has a wrong offset!");
static_assert(offsetof(UBP_UnionGameInstance_C, DefaultDisableItemArr) == 0x000210, "Member 'UBP_UnionGameInstance_C::DefaultDisableItemArr' has a wrong offset!");

}

