#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MachineCustomizeStickerSlotSelectState

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "ST_GarageData_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_MachineCustomizeStickerSlotSelectState.BPC_MachineCustomizeStickerSlotSelectState_C.SetIsStickerClearSEEnable
// 0x0028 (0x0028 - 0x0000)
struct BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnable;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMachineStickerSlotIcon*                CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMachineStickerSlotIcon*                CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable) == 0x000008, "Wrong alignment on BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable");
static_assert(sizeof(BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable) == 0x000028, "Wrong size on BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable, SlotIndex) == 0x000000, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable::SlotIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable, IsEnable) == 0x000004, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable::IsEnable' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable, CallFunc_Array_Get_Item) == 0x000010, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetIsStickerClearSEEnable::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizeStickerSlotSelectState.BPC_MachineCustomizeStickerSlotSelectState_C.SetStickerClearFooterVisibility
// 0x0098 (0x0098 - 0x0000)
struct BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRear;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_GetSelectedMachineCustomizeData_ReturnValue; // 0x0008(0x0078)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility) == 0x000008, "Wrong alignment on BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility");
static_assert(sizeof(BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility) == 0x000098, "Wrong size on BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility, SlotIndex) == 0x000000, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility::SlotIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility, IsRear) == 0x000004, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility::IsRear' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility, CallFunc_GetSelectedMachineCustomizeData_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility::CallFunc_GetSelectedMachineCustomizeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility, CallFunc_Subtract_IntInt_ReturnValue) == 0x000080, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000088, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000090, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000091, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000092, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility, CallFunc_Not_PreBool_ReturnValue_1) == 0x000093, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetStickerClearFooterVisibility::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function BPC_MachineCustomizeStickerSlotSelectState.BPC_MachineCustomizeStickerSlotSelectState_C.StickerSlot_OnFaceTopEvent
// 0x0358 (0x0358 - 0x0000)
struct BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUserStickerCustomizeData              TempUserStickerCustomizeData;                      // 0x0008(0x0020)(Edit, BlueprintVisible)
	class UWBP_MachineCustom_Sub_StickerTopIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Top_Icon; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserStickerCustomizeData              K2Node_MakeStruct_UserStickerCustomizeData;        // 0x0038(0x0020)()
	struct FUserStickerCustomizeData              K2Node_SetFieldsInStruct_StructOut;                // 0x0058(0x0020)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserStickerCustomizeData              K2Node_MakeStruct_UserStickerCustomizeData_1;      // 0x0088(0x0020)()
	struct FUserStickerCustomizeData              K2Node_SetFieldsInStruct_StructOut_1;              // 0x00A8(0x0020)()
	struct FUserMachineCustomizeData              CallFunc_GetSelectedMachineCustomizeData_ReturnValue; // 0x00C8(0x0078)()
	EMachineId                                    CallFunc_GetSelectedMachineId_ReturnValue;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetSelectedMachineId_ReturnValue_1;       // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuRacerBase*                         CallFunc_GetRacer_ReturnValue;                     // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMenuRacerBase*                         CallFunc_GetRacer_ReturnValue_1;                   // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerPreview_C*                 K2Node_DynamicCast_AsBP_Menu_Racer_Preview;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MenuRacerPreview_C*                 K2Node_DynamicCast_AsBP_Menu_Racer_Preview_1;      // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_Get_Customize_Data_OutCustomizeData;      // 0x0178(0x0078)()
	struct FUserMachineCustomizeData              CallFunc_Get_Customize_Data_OutCustomizeData_1;    // 0x01F0(0x0078)()
	struct FUserMachineCustomizeData              K2Node_SetFieldsInStruct_StructOut_2;              // 0x0268(0x0078)()
	struct FUserMachineCustomizeData              K2Node_SetFieldsInStruct_StructOut_3;              // 0x02E0(0x0078)()
};
static_assert(alignof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent) == 0x000008, "Wrong alignment on BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent");
static_assert(sizeof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent) == 0x000358, "Wrong size on BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, Button) == 0x000000, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::Button' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, TempUserStickerCustomizeData) == 0x000008, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::TempUserStickerCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Top_Icon) == 0x000028, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Top_Icon' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, K2Node_MakeStruct_UserStickerCustomizeData) == 0x000038, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::K2Node_MakeStruct_UserStickerCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, K2Node_SetFieldsInStruct_StructOut) == 0x000058, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, CallFunc_Subtract_IntInt_ReturnValue) == 0x00007C, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000080, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000081, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, K2Node_MakeStruct_UserStickerCustomizeData_1) == 0x000088, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::K2Node_MakeStruct_UserStickerCustomizeData_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, K2Node_SetFieldsInStruct_StructOut_1) == 0x0000A8, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::K2Node_SetFieldsInStruct_StructOut_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, CallFunc_GetSelectedMachineCustomizeData_ReturnValue) == 0x0000C8, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::CallFunc_GetSelectedMachineCustomizeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, CallFunc_GetSelectedMachineId_ReturnValue) == 0x000140, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::CallFunc_GetSelectedMachineId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, CallFunc_GetSelectedMachineId_ReturnValue_1) == 0x000141, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::CallFunc_GetSelectedMachineId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, CallFunc_GetRacer_ReturnValue) == 0x000148, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::CallFunc_GetRacer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, CallFunc_GetRacer_ReturnValue_1) == 0x000150, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::CallFunc_GetRacer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, K2Node_DynamicCast_AsBP_Menu_Racer_Preview) == 0x000158, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::K2Node_DynamicCast_AsBP_Menu_Racer_Preview' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, K2Node_DynamicCast_bSuccess_1) == 0x000160, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, K2Node_DynamicCast_AsBP_Menu_Racer_Preview_1) == 0x000168, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::K2Node_DynamicCast_AsBP_Menu_Racer_Preview_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, K2Node_DynamicCast_bSuccess_2) == 0x000170, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, CallFunc_Get_Customize_Data_OutCustomizeData) == 0x000178, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::CallFunc_Get_Customize_Data_OutCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, CallFunc_Get_Customize_Data_OutCustomizeData_1) == 0x0001F0, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::CallFunc_Get_Customize_Data_OutCustomizeData_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, K2Node_SetFieldsInStruct_StructOut_2) == 0x000268, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::K2Node_SetFieldsInStruct_StructOut_2' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent, K2Node_SetFieldsInStruct_StructOut_3) == 0x0002E0, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFaceTopEvent::K2Node_SetFieldsInStruct_StructOut_3' has a wrong offset!");

// Function BPC_MachineCustomizeStickerSlotSelectState.BPC_MachineCustomizeStickerSlotSelectState_C.StickerSlot_OnDecision
// 0x0100 (0x0100 - 0x0000)
struct BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MachineCustomizeSequence_C*         K2Node_DynamicCast_AsBP_Machine_Customize_Sequence; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_GarageData                         CallFunc_GetGarageData_OutGarageData;              // 0x0028(0x0058)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class ABP_MachineCustomizeSequence_C*         K2Node_DynamicCast_AsBP_Machine_Customize_Sequence_1; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTurntableComponent*                    CallFunc_GetTurntableComponent_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FST_GarageData                         CallFunc_GetGarageData_OutGarageData_1;            // 0x0098(0x0058)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UTurntableComponent*                    CallFunc_GetTurntableComponent_ReturnValue_1;      // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision) == 0x000008, "Wrong alignment on BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision");
static_assert(sizeof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision) == 0x000100, "Wrong size on BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, Button) == 0x000000, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::Button' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, K2Node_DynamicCast_AsBP_Machine_Customize_Sequence) == 0x000018, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::K2Node_DynamicCast_AsBP_Machine_Customize_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, CallFunc_GetGarageData_OutGarageData) == 0x000028, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::CallFunc_GetGarageData_OutGarageData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, K2Node_DynamicCast_AsBP_Machine_Customize_Sequence_1) == 0x000080, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::K2Node_DynamicCast_AsBP_Machine_Customize_Sequence_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, CallFunc_GetTurntableComponent_ReturnValue) == 0x000090, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::CallFunc_GetTurntableComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, CallFunc_GetGarageData_OutGarageData_1) == 0x000098, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::CallFunc_GetGarageData_OutGarageData_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, CallFunc_GetTurntableComponent_ReturnValue_1) == 0x0000F0, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::CallFunc_GetTurntableComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision, CallFunc_Greater_IntInt_ReturnValue) == 0x0000F8, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnDecision::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizeStickerSlotSelectState.BPC_MachineCustomizeStickerSlotSelectState_C.StickerSlot_OnFocus
// 0x0018 (0x0018 - 0x0000)
struct BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus) == 0x000008, "Wrong alignment on BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus");
static_assert(sizeof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus) == 0x000018, "Wrong size on BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus, Button) == 0x000000, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus::Button' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus, PanelIndex) == 0x000008, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus, ButtonIndex) == 0x00000C, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus::ButtonIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_StickerSlot_OnFocus::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizeStickerSlotSelectState.BPC_MachineCustomizeStickerSlotSelectState_C.SetupSlot
// 0x0138 (0x0138 - 0x0000)
struct BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot final
{
public:
	TArray<struct FStickerUIData>                 UIData;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UMachineStickerSlotIcon*>        Stickers;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<struct FUserStickerData>               UserStickerData;                                   // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStickerUIData                         CallFunc_Array_Get_Item;                           // 0x0038(0x0088)()
	class FText                                   CallFunc_GetMachineSurfaceNameById_OutMachineSurfaceName; // 0x00C0(0x0010)()
	struct FLinearColor                           CallFunc_GetMachineColorById_OutMachineColor;      // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMachineStickerSlotIcon*                CallFunc_Array_Get_Item_1;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_StickerTopIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Top_Icon; // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot) == 0x000008, "Wrong alignment on BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot");
static_assert(sizeof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot) == 0x000138, "Wrong size on BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, UIData) == 0x000000, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::UIData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, Stickers) == 0x000010, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::Stickers' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, UserStickerData) == 0x000020, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::UserStickerData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, CallFunc_Array_Get_Item) == 0x000038, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, CallFunc_GetMachineSurfaceNameById_OutMachineSurfaceName) == 0x0000C0, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::CallFunc_GetMachineSurfaceNameById_OutMachineSurfaceName' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, CallFunc_GetMachineColorById_OutMachineColor) == 0x0000D0, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::CallFunc_GetMachineColorById_OutMachineColor' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000E0, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, CallFunc_NotEqual_NameName_ReturnValue) == 0x0000E8, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, K2Node_DynamicCast_As_____2D) == 0x0000F0, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, CallFunc_Array_Get_Item_1) == 0x000100, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Top_Icon) == 0x000110, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Top_Icon' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000120, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, Temp_int_Loop_Counter_Variable) == 0x000128, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, CallFunc_Less_IntInt_ReturnValue) == 0x00012C, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000130, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetupSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizeStickerSlotSelectState.BPC_MachineCustomizeStickerSlotSelectState_C.SetRearMaterial
// 0x00D8 (0x00D8 - 0x0000)
struct BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial final
{
public:
	class UTexture*                               Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMachineBodyMaterialArea                      Temp_byte_Variable;                                // 0x0008(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuRacerBase*                         CallFunc_GetRacer_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerPreview_C*                 K2Node_DynamicCast_AsBP_Menu_Racer_Preview;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachineMaterialData                   CallFunc_Map_Find_Value;                           // 0x0028(0x00A8)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial) == 0x000008, "Wrong alignment on BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial");
static_assert(sizeof(BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial) == 0x0000D8, "Wrong size on BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial, Texture) == 0x000000, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial::Texture' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial, Temp_byte_Variable) == 0x000008, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial, CallFunc_GetRacer_ReturnValue) == 0x000010, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial::CallFunc_GetRacer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial, K2Node_DynamicCast_AsBP_Menu_Racer_Preview) == 0x000018, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial::K2Node_DynamicCast_AsBP_Menu_Racer_Preview' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial, CallFunc_Map_Find_Value) == 0x000028, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial, CallFunc_Map_Find_ReturnValue) == 0x0000D0, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetRearMaterial::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizeStickerSlotSelectState.BPC_MachineCustomizeStickerSlotSelectState_C.SetFrontMaterial
// 0x00D8 (0x00D8 - 0x0000)
struct BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial final
{
public:
	class UTexture*                               Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMachineBodyMaterialArea                      Temp_byte_Variable;                                // 0x0008(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuRacerBase*                         CallFunc_GetRacer_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerPreview_C*                 K2Node_DynamicCast_AsBP_Menu_Racer_Preview;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachineMaterialData                   CallFunc_Map_Find_Value;                           // 0x0028(0x00A8)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial) == 0x000008, "Wrong alignment on BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial");
static_assert(sizeof(BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial) == 0x0000D8, "Wrong size on BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial, Texture) == 0x000000, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial::Texture' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial, Temp_byte_Variable) == 0x000008, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial, CallFunc_GetRacer_ReturnValue) == 0x000010, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial::CallFunc_GetRacer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial, K2Node_DynamicCast_AsBP_Menu_Racer_Preview) == 0x000018, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial::K2Node_DynamicCast_AsBP_Menu_Racer_Preview' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial, CallFunc_Map_Find_Value) == 0x000028, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial, CallFunc_Map_Find_ReturnValue) == 0x0000D0, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_SetFrontMaterial::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizeStickerSlotSelectState.BPC_MachineCustomizeStickerSlotSelectState_C.OnSetupPage
// 0x00C0 (0x00C0 - 0x0000)
struct BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage final
{
public:
	TArray<struct FStickerUIData>                 FrontStickerUIData;                                // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStickerUIData>                 RearStickerUIData;                                 // 0x0010(0x0010)(Edit, BlueprintVisible)
	EMachineId                                    CallFunc_GetSelectedMachineId_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStickerUIData>                 CallFunc_GetMachinePartsStickerUIDataList_OutStickerUIDataList; // 0x0028(0x0010)(ReferenceParm)
	TArray<struct FStickerUIData>                 CallFunc_GetMachinePartsStickerUIDataList_OutStickerUIDataList_1; // 0x0038(0x0010)(ReferenceParm)
	struct FUserMachineCustomizeData              CallFunc_GetSelectedMachineCustomizeData_ReturnValue; // 0x0048(0x0078)()
};
static_assert(alignof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage) == 0x000008, "Wrong alignment on BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage");
static_assert(sizeof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage) == 0x0000C0, "Wrong size on BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage, FrontStickerUIData) == 0x000000, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage::FrontStickerUIData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage, RearStickerUIData) == 0x000010, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage::RearStickerUIData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage, CallFunc_GetSelectedMachineId_ReturnValue) == 0x000020, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage::CallFunc_GetSelectedMachineId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage, CallFunc_GetMachinePartsStickerUIDataList_OutStickerUIDataList) == 0x000028, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage::CallFunc_GetMachinePartsStickerUIDataList_OutStickerUIDataList' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage, CallFunc_GetMachinePartsStickerUIDataList_OutStickerUIDataList_1) == 0x000038, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage::CallFunc_GetMachinePartsStickerUIDataList_OutStickerUIDataList_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage, CallFunc_GetSelectedMachineCustomizeData_ReturnValue) == 0x000048, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_OnSetupPage::CallFunc_GetSelectedMachineCustomizeData_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizeStickerSlotSelectState.BPC_MachineCustomizeStickerSlotSelectState_C.OnSetup
// 0x0028 (0x0028 - 0x0000)
struct BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup final
{
public:
	class UMachineStickerSlotIcon*                CallFunc_Array_Get_Item;                           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMachineCustomTop*                      CallFunc_GetMachineCustomTop_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMachineCustomInfoWindow*               CallFunc_GetMachineInfoWidget_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMachineStickerSlotIcon*                CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup) == 0x000008, "Wrong alignment on BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup");
static_assert(sizeof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup) == 0x000028, "Wrong size on BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup, CallFunc_Array_Get_Item) == 0x000000, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup, CallFunc_GetMachineCustomTop_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup::CallFunc_GetMachineCustomTop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup, CallFunc_GetMachineInfoWidget_ReturnValue) == 0x000010, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup::CallFunc_GetMachineInfoWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'BPC_MachineCustomizeStickerSlotSelectState_C_OnSetup::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function BPC_MachineCustomizeStickerSlotSelectState.BPC_MachineCustomizeStickerSlotSelectState_C.SetProperties
// 0x0098 (0x0098 - 0x0000)
struct BPC_MachineCustomizeStickerSlotSelectState_C_SetProperties final
{
public:
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMachineCustomizeSequence*              K2Node_DynamicCast_AsMachine_Customize_Sequence;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MachineCustomizeSequence_C*         K2Node_DynamicCast_AsBP_Machine_Customize_Sequence; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_GarageData                         CallFunc_GetGarageData_OutGarageData;              // 0x0028(0x0058)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UMachineStickerSlotSelectWindow*        CallFunc_GetStickerTopPage_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_StickerTop_C*    K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Top; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeStickerSlotSelectState_C_SetProperties) == 0x000008, "Wrong alignment on BPC_MachineCustomizeStickerSlotSelectState_C_SetProperties");
static_assert(sizeof(BPC_MachineCustomizeStickerSlotSelectState_C_SetProperties) == 0x000098, "Wrong size on BPC_MachineCustomizeStickerSlotSelectState_C_SetProperties");
