#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MenuSubStateSelectClass

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.DestroyPlayer
// 0x0028 (0x0028 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_DestroyPlayer final
{
public:
	int32                                         NumPlayerControllers;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayerControllers_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_DestroyPlayer) == 0x000008, "Wrong alignment on BPC_MenuSubStateSelectClass_C_DestroyPlayer");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_DestroyPlayer) == 0x000028, "Wrong size on BPC_MenuSubStateSelectClass_C_DestroyPlayer");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_DestroyPlayer, NumPlayerControllers) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_DestroyPlayer::NumPlayerControllers' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_DestroyPlayer, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BPC_MenuSubStateSelectClass_C_DestroyPlayer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_DestroyPlayer, Temp_int_Variable) == 0x000008, "Member 'BPC_MenuSubStateSelectClass_C_DestroyPlayer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_DestroyPlayer, CallFunc_GetNumPlayerControllers_ReturnValue) == 0x00000C, "Member 'BPC_MenuSubStateSelectClass_C_DestroyPlayer::CallFunc_GetNumPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_DestroyPlayer, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000010, "Member 'BPC_MenuSubStateSelectClass_C_DestroyPlayer::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_DestroyPlayer, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'BPC_MenuSubStateSelectClass_C_DestroyPlayer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_DestroyPlayer, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BPC_MenuSubStateSelectClass_C_DestroyPlayer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_DestroyPlayer, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BPC_MenuSubStateSelectClass_C_DestroyPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_DestroyPlayer, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000021, "Member 'BPC_MenuSubStateSelectClass_C_DestroyPlayer::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_DestroyPlayer, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BPC_MenuSubStateSelectClass_C_DestroyPlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.GetLastStateIsClassSelect
// 0x0003 (0x0003 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_GetLastStateIsClassSelect final
{
public:
	bool                                          LClassSelect;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLastStateIsClassSelect_LClassSelect;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_GetLastStateIsClassSelect) == 0x000001, "Wrong alignment on BPC_MenuSubStateSelectClass_C_GetLastStateIsClassSelect");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_GetLastStateIsClassSelect) == 0x000003, "Wrong size on BPC_MenuSubStateSelectClass_C_GetLastStateIsClassSelect");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_GetLastStateIsClassSelect, LClassSelect) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_GetLastStateIsClassSelect::LClassSelect' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_GetLastStateIsClassSelect, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BPC_MenuSubStateSelectClass_C_GetLastStateIsClassSelect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_GetLastStateIsClassSelect, CallFunc_GetLastStateIsClassSelect_LClassSelect) == 0x000002, "Member 'BPC_MenuSubStateSelectClass_C_GetLastStateIsClassSelect::CallFunc_GetLastStateIsClassSelect_LClassSelect' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.ConvertClassIdToIndex
// 0x000C (0x000C - 0x0000)
struct BPC_MenuSubStateSelectClass_C_ConvertClassIdToIndex final
{
public:
	ESpeedClassId                                 ID;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_ConvertClassIdToIndex) == 0x000004, "Wrong alignment on BPC_MenuSubStateSelectClass_C_ConvertClassIdToIndex");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_ConvertClassIdToIndex) == 0x00000C, "Wrong size on BPC_MenuSubStateSelectClass_C_ConvertClassIdToIndex");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_ConvertClassIdToIndex, ID) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_ConvertClassIdToIndex::ID' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_ConvertClassIdToIndex, Index_0) == 0x000004, "Member 'BPC_MenuSubStateSelectClass_C_ConvertClassIdToIndex::Index_0' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_ConvertClassIdToIndex, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'BPC_MenuSubStateSelectClass_C_ConvertClassIdToIndex::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.ConvertIndexToClassId
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             MenuSpeedClass;                                    // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId) == 0x000004, "Wrong alignment on BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId) == 0x000008, "Wrong size on BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId, Index_0) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId::Index_0' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId, MenuSpeedClass) == 0x000004, "Member 'BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId::MenuSpeedClass' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId, CallFunc_Conv_IntToByte_ReturnValue) == 0x000005, "Member 'BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId, CallFunc_GetValidValue_ReturnValue) == 0x000006, "Member 'BPC_MenuSubStateSelectClass_C_ConvertIndexToClassId::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.OnLoaded_34F2760D430D7D602227CAA2E60109C4
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_OnLoaded_34F2760D430D7D602227CAA2E60109C4 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_OnLoaded_34F2760D430D7D602227CAA2E60109C4) == 0x000008, "Wrong alignment on BPC_MenuSubStateSelectClass_C_OnLoaded_34F2760D430D7D602227CAA2E60109C4");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_OnLoaded_34F2760D430D7D602227CAA2E60109C4) == 0x000008, "Wrong size on BPC_MenuSubStateSelectClass_C_OnLoaded_34F2760D430D7D602227CAA2E60109C4");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnLoaded_34F2760D430D7D602227CAA2E60109C4, Loaded) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_OnLoaded_34F2760D430D7D602227CAA2E60109C4::Loaded' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.OnLoaded_C245C939437FB5BD9D84E8966E301E25
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_OnLoaded_C245C939437FB5BD9D84E8966E301E25 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_OnLoaded_C245C939437FB5BD9D84E8966E301E25) == 0x000008, "Wrong alignment on BPC_MenuSubStateSelectClass_C_OnLoaded_C245C939437FB5BD9D84E8966E301E25");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_OnLoaded_C245C939437FB5BD9D84E8966E301E25) == 0x000008, "Wrong size on BPC_MenuSubStateSelectClass_C_OnLoaded_C245C939437FB5BD9D84E8966E301E25");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnLoaded_C245C939437FB5BD9D84E8966E301E25, Loaded) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_OnLoaded_C245C939437FB5BD9D84E8966E301E25::Loaded' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.OnLeftShoulderPressedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_OnLeftShoulderPressedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_OnLeftShoulderPressedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuSubStateSelectClass_C_OnLeftShoulderPressedEvent_Event");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_OnLeftShoulderPressedEvent_Event) == 0x000008, "Wrong size on BPC_MenuSubStateSelectClass_C_OnLeftShoulderPressedEvent_Event");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnLeftShoulderPressedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_OnLeftShoulderPressedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.OnLeftShoulderReleasedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_OnLeftShoulderReleasedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_OnLeftShoulderReleasedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuSubStateSelectClass_C_OnLeftShoulderReleasedEvent_Event");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_OnLeftShoulderReleasedEvent_Event) == 0x000008, "Wrong size on BPC_MenuSubStateSelectClass_C_OnLeftShoulderReleasedEvent_Event");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnLeftShoulderReleasedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_OnLeftShoulderReleasedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C. OnSpecialPressedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuSubStateSelectClass_C__OnSpecialPressedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C__OnSpecialPressedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuSubStateSelectClass_C__OnSpecialPressedEvent_Event");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C__OnSpecialPressedEvent_Event) == 0x000008, "Wrong size on BPC_MenuSubStateSelectClass_C__OnSpecialPressedEvent_Event");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C__OnSpecialPressedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C__OnSpecialPressedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_CustomEvent_0 final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_CustomEvent_0) == 0x000008, "Wrong alignment on BPC_MenuSubStateSelectClass_C_CustomEvent_0");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_CustomEvent_0) == 0x000008, "Wrong size on BPC_MenuSubStateSelectClass_C_CustomEvent_0");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_CustomEvent_0, Object) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_CustomEvent_0::Object' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.OnRightShoulderPressedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_OnRightShoulderPressedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_OnRightShoulderPressedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuSubStateSelectClass_C_OnRightShoulderPressedEvent_Event");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_OnRightShoulderPressedEvent_Event) == 0x000008, "Wrong size on BPC_MenuSubStateSelectClass_C_OnRightShoulderPressedEvent_Event");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnRightShoulderPressedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_OnRightShoulderPressedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.OnRightShoulderReleasedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_OnRightShoulderReleasedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_OnRightShoulderReleasedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuSubStateSelectClass_C_OnRightShoulderReleasedEvent_Event");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_OnRightShoulderReleasedEvent_Event) == 0x000008, "Wrong size on BPC_MenuSubStateSelectClass_C_OnRightShoulderReleasedEvent_Event");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnRightShoulderReleasedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_OnRightShoulderReleasedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.OnDecideClassSelectScene
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_OnDecideClassSelectScene final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_OnDecideClassSelectScene) == 0x000008, "Wrong alignment on BPC_MenuSubStateSelectClass_C_OnDecideClassSelectScene");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_OnDecideClassSelectScene) == 0x000010, "Wrong size on BPC_MenuSubStateSelectClass_C_OnDecideClassSelectScene");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnDecideClassSelectScene, Button) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_OnDecideClassSelectScene::Button' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnDecideClassSelectScene, PanelIndex) == 0x000008, "Member 'BPC_MenuSubStateSelectClass_C_OnDecideClassSelectScene::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnDecideClassSelectScene, ButtonIndex) == 0x00000C, "Member 'BPC_MenuSubStateSelectClass_C_OnDecideClassSelectScene::ButtonIndex' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.OnCancel
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_OnCancel final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_OnCancel) == 0x000008, "Wrong alignment on BPC_MenuSubStateSelectClass_C_OnCancel");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_OnCancel) == 0x000010, "Wrong size on BPC_MenuSubStateSelectClass_C_OnCancel");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnCancel, Button) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_OnCancel::Button' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnCancel, PanelIndex) == 0x000008, "Member 'BPC_MenuSubStateSelectClass_C_OnCancel::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnCancel, ButtonIndex) == 0x00000C, "Member 'BPC_MenuSubStateSelectClass_C_OnCancel::ButtonIndex' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.OnUISceneFocusEvent_Event
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_OnUISceneFocusEvent_Event final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_OnUISceneFocusEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuSubStateSelectClass_C_OnUISceneFocusEvent_Event");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_OnUISceneFocusEvent_Event) == 0x000010, "Wrong size on BPC_MenuSubStateSelectClass_C_OnUISceneFocusEvent_Event");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnUISceneFocusEvent_Event, Button) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_OnUISceneFocusEvent_Event::Button' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnUISceneFocusEvent_Event, PanelIndex) == 0x000008, "Member 'BPC_MenuSubStateSelectClass_C_OnUISceneFocusEvent_Event::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnUISceneFocusEvent_Event, ButtonIndex) == 0x00000C, "Member 'BPC_MenuSubStateSelectClass_C_OnUISceneFocusEvent_Event::ButtonIndex' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_MenuSubStateSelectClass_C_OnUpdateState");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_OnUpdateState) == 0x000004, "Wrong size on BPC_MenuSubStateSelectClass_C_OnUpdateState");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_OnUpdateState::InDeltaTime' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.UIFadeWidget_OnFinishedFade
// 0x0001 (0x0001 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_UIFadeWidget_OnFinishedFade final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuSubStateSelectClass_C_UIFadeWidget_OnFinishedFade) == 0x000001, "Wrong alignment on BPC_MenuSubStateSelectClass_C_UIFadeWidget_OnFinishedFade");
static_assert(sizeof(BPC_MenuSubStateSelectClass_C_UIFadeWidget_OnFinishedFade) == 0x000001, "Wrong size on BPC_MenuSubStateSelectClass_C_UIFadeWidget_OnFinishedFade");
static_assert(offsetof(BPC_MenuSubStateSelectClass_C_UIFadeWidget_OnFinishedFade, FadeDirection) == 0x000000, "Member 'BPC_MenuSubStateSelectClass_C_UIFadeWidget_OnFinishedFade::FadeDirection' has a wrong offset!");

// Function BPC_MenuSubStateSelectClass.BPC_MenuSubStateSelectClass_C.ExecuteUbergraph_BPC_MenuSubStateSelectClass
// 0x03C8 (0x03C8 - 0x0000)
struct BPC_MenuSubStateSelectClass_C_ExecuteUbergraph_BPC_MenuSubStateSelectClass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsCourse_Select_Widget_Base; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCourseSelectWidgetBase*                CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   Temp_byte_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable_1;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable_2;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable_3;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable_4;                              // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable_5;                              // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable_6;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable_7;                              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable_8;                              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable_9;                              // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable_10;                             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable_11;                             // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentTopMenuLevelName_ReturnValue;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         Temp_byte_Variable_12;                             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuLobbyLevelInterface> K2Node_DynamicCast_AsMenu_Lobby_Level_Interface; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CallFunc_GetCameraActor_ReturnValue;               // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         Temp_byte_Variable_13;                             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuSoundSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_5;                       // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_4;                       // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_3;                       // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_2;                       // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_1;                       // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0147(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_2;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_2;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_ConvertIndexToClassId_MenuSpeedClass;     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_1;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_1;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x018C(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0190(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x0194(0x0004)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x01AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetSelectedMenuSpeedClassId_ReturnValue;  // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStaySceneMonkeyTesting_ReturnValue;    // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BF[0x1];                                      // 0x01BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_3; // 0x01C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_4; // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item;                           // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Btn_Class_C*       K2Node_DynamicCast_AsWBP_Class_Select_Sub_Btn_Class; // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_1;                             // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsWBP_Class_Select;        // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDeltaTime;                          // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClassSelect_C*                     CallFunc_Create_ReturnValue_1;                     // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0228(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue;             // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GrandPrixSequence_C*                K2Node_DynamicCast_AsBP_Grand_Prix_Sequence;       // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShippingBuild_ReturnValue_1;            // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0264(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionAssetPreloaderSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_6;            // 0x0280(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionAssetPreloaderSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue_1;               // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x029C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x02AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuInputRecieveObject*                CallFunc_SpawnObject_ReturnValue;                  // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_2;      // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              K2Node_Select_Default;                             // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CB[0x5];                                      // 0x02CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CourseSelect_C*                    K2Node_DynamicCast_AsWBP_Course_Select;            // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_9;            // 0x02DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x02EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate_11;    // 0x02FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         K2Node_CustomEvent_FadeDirection;                  // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuPlayerController*                  K2Node_DynamicCast_AsMenu_Player_Controller;       // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CourseSelect_C*                    K2Node_DynamicCast_AsWBP_Course_Select_1;          // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuPlayerController*                  K2Node_DynamicCast_AsMenu_Player_Controller_1;     // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLastStateIsClassSelect_LClassSelect;   // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLastStateIsClassSelect_LClassSelect_1; // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_Select_Default_1;                           // 0x0353(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLastStateIsClassSelect_LClassSelect_2; // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLastStateIsClassSelect_LClassSelect_3; // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0356(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_357[0x1];                                      // 0x0357(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_12;      // 0x0358(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_13;      // 0x0368(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CourseSelect_C*                    K2Node_DynamicCast_AsWBP_Course_Select_2;          // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetState_ReturnValue;                     // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentState_ReturnValue;              // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_14; // 0x039C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
