#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MenuStatePartyRaceSelectClass

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function BPC_MenuStatePartyRaceSelectClass.BPC_MenuStatePartyRaceSelectClass_C.OnRightShoulderReleasedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderReleasedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderReleasedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderReleasedEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderReleasedEvent_Event) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderReleasedEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderReleasedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderReleasedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectClass.BPC_MenuStatePartyRaceSelectClass_C.OnRightShoulderPressedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderPressedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderPressedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderPressedEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderPressedEvent_Event) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderPressedEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderPressedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnRightShoulderPressedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectClass.BPC_MenuStatePartyRaceSelectClass_C.OnLeftShoulderPressedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderPressedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderPressedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderPressedEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderPressedEvent_Event) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderPressedEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderPressedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderPressedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectClass.BPC_MenuStatePartyRaceSelectClass_C.OnLeftShoulderReleasedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderReleasedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderReleasedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderReleasedEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderReleasedEvent_Event) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderReleasedEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderReleasedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnLeftShoulderReleasedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectClass.BPC_MenuStatePartyRaceSelectClass_C. OnSpecialPressedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectClass_C__OnSpecialPressedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectClass_C__OnSpecialPressedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectClass_C__OnSpecialPressedEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectClass_C__OnSpecialPressedEvent_Event) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectClass_C__OnSpecialPressedEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C__OnSpecialPressedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectClass_C__OnSpecialPressedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectClass.BPC_MenuStatePartyRaceSelectClass_C. OnSpecialReleasedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectClass_C__OnSpecialReleasedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectClass_C__OnSpecialReleasedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectClass_C__OnSpecialReleasedEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectClass_C__OnSpecialReleasedEvent_Event) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectClass_C__OnSpecialReleasedEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C__OnSpecialReleasedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectClass_C__OnSpecialReleasedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectClass.BPC_MenuStatePartyRaceSelectClass_C.OnUISceneCancelEvent_Event
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuStatePartyRaceSelectClass_C_OnUISceneCancelEvent_Event final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneCancelEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectClass_C_OnUISceneCancelEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneCancelEvent_Event) == 0x000010, "Wrong size on BPC_MenuStatePartyRaceSelectClass_C_OnUISceneCancelEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneCancelEvent_Event, Button) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnUISceneCancelEvent_Event::Button' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneCancelEvent_Event, PanelIndex) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnUISceneCancelEvent_Event::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneCancelEvent_Event, ButtonIndex) == 0x00000C, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnUISceneCancelEvent_Event::ButtonIndex' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectClass.BPC_MenuStatePartyRaceSelectClass_C.OnUISceneDecisionEvent_Event
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuStatePartyRaceSelectClass_C_OnUISceneDecisionEvent_Event final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneDecisionEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectClass_C_OnUISceneDecisionEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneDecisionEvent_Event) == 0x000010, "Wrong size on BPC_MenuStatePartyRaceSelectClass_C_OnUISceneDecisionEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneDecisionEvent_Event, Button) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnUISceneDecisionEvent_Event::Button' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneDecisionEvent_Event, PanelIndex) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnUISceneDecisionEvent_Event::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneDecisionEvent_Event, ButtonIndex) == 0x00000C, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnUISceneDecisionEvent_Event::ButtonIndex' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectClass.BPC_MenuStatePartyRaceSelectClass_C.OnUISceneFocusEvent_Event
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuStatePartyRaceSelectClass_C_OnUISceneFocusEvent_Event final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneFocusEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectClass_C_OnUISceneFocusEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneFocusEvent_Event) == 0x000010, "Wrong size on BPC_MenuStatePartyRaceSelectClass_C_OnUISceneFocusEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneFocusEvent_Event, Button) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnUISceneFocusEvent_Event::Button' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneFocusEvent_Event, PanelIndex) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnUISceneFocusEvent_Event::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_OnUISceneFocusEvent_Event, ButtonIndex) == 0x00000C, "Member 'BPC_MenuStatePartyRaceSelectClass_C_OnUISceneFocusEvent_Event::ButtonIndex' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectClass.BPC_MenuStatePartyRaceSelectClass_C.ExecuteUbergraph_BPC_MenuStatePartyRaceSelectClass
// 0x0210 (0x0210 - 0x0000)
struct BPC_MenuStatePartyRaceSelectClass_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectClass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_5;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_4;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_3;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_2;                       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_1;                       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Btn_Class_C*       K2Node_DynamicCast_AsWBP_Class_Select_Sub_Btn_Class; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate;              // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetSelectedMenuSpeedClassId_ReturnValue;  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_2;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_2;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_1;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_1;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClassSelectButtonBase*                 K2Node_DynamicCast_AsClass_Select_Button_Base;     // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpeedClassId                                 CallFunc_GetSpeedClass_ReturnValue;                // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetMenuSpeedClass_ReturnValue;            // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_8; // 0x0164(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_9; // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0194(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0198(0x0004)()
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_10; // 0x01B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x01C0(0x0004)()
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuInputRecieveObject*                CallFunc_SpawnObject_ReturnValue;                  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue;             // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PartyRaceMenuSequence_C*            K2Node_DynamicCast_AsBP_Party_Race_Menu_Sequence;  // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E3[0x1];                                      // 0x01E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ClassSelect_C*                     CallFunc_Create_ReturnValue;                       // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectClass_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectClass) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectClass_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectClass");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectClass_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectClass) == 0x000210, "Wrong size on BPC_MenuStatePartyRaceSelectClass_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectClass");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectClass_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectClass, EntryPoint) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectClass_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectClass::EntryPoint' has a wrong offset!");
