#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MenuStatePartyRaceSelectGroup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function BPC_MenuStatePartyRaceSelectGroup.BPC_MenuStatePartyRaceSelectGroup_C.ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup
// 0x02C8 (0x02C8 - 0x0000)
struct BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSettingGrouping                          CallFunc_GetRaceSettingGrouping_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelect*                           CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGroupSelect*                           CallFunc_Array_Get_Item_1;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGroupSelect*                           Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_In_Decide_Cancel_Time;      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerController_C*             K2Node_DynamicCast_AsBP_Menu_Player_Controller;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MenuPlayerController_C*             K2Node_DynamicCast_AsBP_Menu_Player_Controller_1;  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0088(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x008C(0x0004)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerController_C*             K2Node_DynamicCast_AsBP_Menu_Player_Controller_2;  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue_1;               // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSettingGrouping                          Temp_byte_Variable;                                // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CMN_FinalCheck_2_C*                CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue_1;     // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERaceSettingGrouping                          CallFunc_GetRaceSettingGrouping_ReturnValue_1;     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelect*                           K2Node_Select_Default;                             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_In_Decide_Cancel_Time_1;    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_In_Decide_Cancel_Time_2;    // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_3;        // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_4;        // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupSelect_2Layout_C*             K2Node_DynamicCast_AsWBP_Group_Select_2Layout;     // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UComCharaMachineLottery*                CallFunc_GetComCharaMachineLottery_ReturnValue;    // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EDriverId>                             CallFunc_Lottery_ReturnValue;                      // 0x0150(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlateMoving_ReturnValue;                // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0164(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue_2;               // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GroupSelect_3Layout_C*             K2Node_DynamicCast_AsWBP_Group_Select_3Layout;     // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckRule_ReturnValue;                    // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_CustomEvent_InGroupIndexArray;              // 0x01A0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x01C8(0x0010)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CMN_MessageBar_C*                  CallFunc_Create_ReturnValue_1;                     // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupSelect_2Layout_C*             CallFunc_Create_ReturnValue_2;                     // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GroupSelect_3Layout_C*             CallFunc_Create_ReturnValue_3;                     // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UGroupSelect*>                   K2Node_MakeArray_Array;                            // 0x0220(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UGroupSelect*                           Temp_object_Variable_1;                            // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue;          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B[0x5];                                      // 0x024B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x025B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25E[0x2];                                      // 0x025E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_1;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSettingGrouping                          Temp_byte_Variable_1;                              // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0270(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelect*                           CallFunc_Array_Get_Item_2;                         // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelect*                           CallFunc_Array_Get_Item_3;                         // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGroupSelect*                           K2Node_Select_Default_1;                           // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         K2Node_Event_InDeltaTime;                          // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AF[0x1];                                      // 0x02AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup) == 0x0002C8, "Wrong size on BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, EntryPoint) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetRaceSettingGrouping_ReturnValue) == 0x000004, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetRaceSettingGrouping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Array_Get_Item) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Array_Get_Item_1) == 0x000010, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, Temp_object_Variable) == 0x000018, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsInViewport_ReturnValue) == 0x000020, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetAppPlayerController_ReturnValue) == 0x000028, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_PlayAnimation_In_Decide_Cancel_Time) == 0x000030, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_PlayAnimation_In_Decide_Cancel_Time' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CustomEvent_Button_2) == 0x000040, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CustomEvent_Button_1) == 0x000048, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetPlayerController_ReturnValue_1) == 0x000058, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_DynamicCast_AsBP_Menu_Player_Controller) == 0x000060, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_DynamicCast_AsBP_Menu_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_DynamicCast_AsBP_Menu_Player_Controller_1) == 0x000070, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_DynamicCast_AsBP_Menu_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetPlayerController_ReturnValue_2) == 0x000080, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_SoundPlay_ReturnValue) == 0x000088, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_SoundPlay_ReturnValue_1) == 0x00008C, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetPlayerController_ReturnValue_3) == 0x000090, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_DynamicCast_AsBP_Menu_Player_Controller_2) == 0x000098, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_DynamicCast_AsBP_Menu_Player_Controller_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsInViewport_ReturnValue_1) == 0x0000A1, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsInViewport_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, Temp_byte_Variable) == 0x0000A2, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetPlayerController_ReturnValue_4) == 0x0000A8, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetAppPlayerController_ReturnValue_1) == 0x0000B8, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetAppPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetRaceSettingGrouping_ReturnValue_1) == 0x0000C0, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetRaceSettingGrouping_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_Select_Default) == 0x0000C8, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_PlayAnimation_In_Decide_Cancel_Time_1) == 0x0000D0, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_PlayAnimation_In_Decide_Cancel_Time_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_PlayAnimation_In_Decide_Cancel_Time_2) == 0x0000D4, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_PlayAnimation_In_Decide_Cancel_Time_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CreateDelegate_OutputDelegate) == 0x0000D8, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E8, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F8, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CreateDelegate_OutputDelegate_3) == 0x000108, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CreateDelegate_OutputDelegate_4) == 0x000118, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_DynamicCast_AsWBP_Group_Select_2Layout) == 0x000128, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_DynamicCast_AsWBP_Group_Select_2Layout' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_DynamicCast_bSuccess_3) == 0x000130, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000138, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetComCharaMachineLottery_ReturnValue) == 0x000140, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetComCharaMachineLottery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsValid_ReturnValue) == 0x000148, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Lottery_ReturnValue) == 0x000150, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Lottery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsValid_ReturnValue_1) == 0x000160, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsValid_ReturnValue_2) == 0x000161, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsPlateMoving_ReturnValue) == 0x000162, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsPlateMoving_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CreateDelegate_OutputDelegate_5) == 0x000164, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CustomEvent_Button) == 0x000178, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CustomEvent_PanelIndex) == 0x000180, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CustomEvent_PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CustomEvent_ButtonIndex) == 0x000184, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsValid_ReturnValue_3) == 0x000188, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsInViewport_ReturnValue_2) == 0x000189, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsInViewport_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_DynamicCast_AsWBP_Group_Select_3Layout) == 0x000190, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_DynamicCast_AsWBP_Group_Select_3Layout' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_DynamicCast_bSuccess_4) == 0x000198, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_CheckRule_ReturnValue) == 0x000199, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_CheckRule_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CustomEvent_InGroupIndexArray) == 0x0001A0, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CustomEvent_InGroupIndexArray' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Not_PreBool_ReturnValue) == 0x0001B0, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_BooleanAND_ReturnValue) == 0x0001B1, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001B4, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_MakeLiteralText_ReturnValue) == 0x0001C8, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_MakeLiteralByte_ReturnValue) == 0x0001D8, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001DC, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetValidValue_ReturnValue) == 0x0001EC, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Create_ReturnValue_1) == 0x0001F0, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0001F8, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetPlayerController_ReturnValue_5) == 0x000200, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Create_ReturnValue_2) == 0x000208, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsValid_ReturnValue_4) == 0x000210, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Create_ReturnValue_3) == 0x000218, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_MakeArray_Array) == 0x000220, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, Temp_object_Variable_1) == 0x000230, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000238, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000240, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetIsOnlineGameMode_ReturnValue) == 0x000248, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetIsOnlineGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsValid_ReturnValue_5) == 0x000249, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Not_PreBool_ReturnValue_1) == 0x00024A, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000250, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsValid_ReturnValue_6) == 0x000258, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Not_PreBool_ReturnValue_2) == 0x000259, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Not_PreBool_ReturnValue_3) == 0x00025A, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x00025B, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00025C, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsValid_ReturnValue_7) == 0x00025D, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_MakeLiteralDouble_ReturnValue_1) == 0x000260, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_MakeLiteralDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, Temp_byte_Variable_1) == 0x000268, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000270, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000278, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Subtract_IntInt_ReturnValue) == 0x000280, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsValid_ReturnValue_8) == 0x000284, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Array_Get_Item_2) == 0x000288, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsValid_ReturnValue_9) == 0x000290, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Array_Get_Item_3) == 0x000298, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_Select_Default_1) == 0x0002A0, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, K2Node_Event_InDeltaTime) == 0x0002A8, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_IsValid_ReturnValue_10) == 0x0002AC, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_GetSelectedGameModeId_ReturnValue_1) == 0x0002AD, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_GetSelectedGameModeId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002AE, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0002B0, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_Delay_Duration_ImplicitCast) == 0x0002B8, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0002BC, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x0002C0, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectGroup.BPC_MenuStatePartyRaceSelectGroup_C.ForceUpdateUIComponents
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuStatePartyRaceSelectGroup_C_ForceUpdateUIComponents final
{
public:
	TArray<int32>                                 InGroupIndexArray;                                 // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectGroup_C_ForceUpdateUIComponents) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectGroup_C_ForceUpdateUIComponents");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectGroup_C_ForceUpdateUIComponents) == 0x000010, "Wrong size on BPC_MenuStatePartyRaceSelectGroup_C_ForceUpdateUIComponents");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_ForceUpdateUIComponents, InGroupIndexArray) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_ForceUpdateUIComponents::InGroupIndexArray' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectGroup.BPC_MenuStatePartyRaceSelectGroup_C.OnFinalCheckCencel
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckCencel final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckCencel) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckCencel");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckCencel) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckCencel");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckCencel, Button) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckCencel::Button' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectGroup.BPC_MenuStatePartyRaceSelectGroup_C.OnFinalCheckDecide
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckDecide final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckDecide) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckDecide");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckDecide) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckDecide");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckDecide, Button) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_OnFinalCheckDecide::Button' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectGroup.BPC_MenuStatePartyRaceSelectGroup_C.OnUISceneCancelEvent_Event
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuStatePartyRaceSelectGroup_C_OnUISceneCancelEvent_Event final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectGroup_C_OnUISceneCancelEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectGroup_C_OnUISceneCancelEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectGroup_C_OnUISceneCancelEvent_Event) == 0x000010, "Wrong size on BPC_MenuStatePartyRaceSelectGroup_C_OnUISceneCancelEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectGroup_C_OnUISceneCancelEvent_Event, Button) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectGroup_C_OnUISceneCancelEvent_Event::Button' has a wrong offset!");
