#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceResultRateRank

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_RaceResultRateRank.BPC_RaceResultRateRank_C.ExecuteUbergraph_BPC_RaceResultRateRank
// 0x0038 (0x0038 - 0x0000)
struct BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceResultSequence_C*               K2Node_DynamicCast_AsBP_Race_Result_Sequence;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ResultRate_C*                      CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank) == 0x000008, "Wrong alignment on BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank");
static_assert(sizeof(BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank) == 0x000038, "Wrong size on BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank");
static_assert(offsetof(BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank, EntryPoint) == 0x000000, "Member 'BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank, CallFunc_GetOwnerStateMachine_ReturnValue) == 0x000010, "Member 'BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank::CallFunc_GetOwnerStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank, K2Node_DynamicCast_AsBP_Race_Result_Sequence) == 0x000018, "Member 'BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank::K2Node_DynamicCast_AsBP_Race_Result_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank, K2Node_Event_InDeltaTime) == 0x000030, "Member 'BPC_RaceResultRateRank_C_ExecuteUbergraph_BPC_RaceResultRateRank::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function BPC_RaceResultRateRank.BPC_RaceResultRateRank_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_RaceResultRateRank_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultRateRank_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_RaceResultRateRank_C_OnUpdateState");
static_assert(sizeof(BPC_RaceResultRateRank_C_OnUpdateState) == 0x000004, "Wrong size on BPC_RaceResultRateRank_C_OnUpdateState");
static_assert(offsetof(BPC_RaceResultRateRank_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_RaceResultRateRank_C_OnUpdateState::InDeltaTime' has a wrong offset!");

}

