#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_GadgetCustomize2SelectState

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionLib_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function BPC_GadgetCustomize2SelectState.BPC_GadgetCustomize2SelectState_C.UpdateGadgetDetailWindowFromGadgetPlateLastFocus
// 0x01A0 (0x01A0 - 0x0000)
struct BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus final
{
public:
	int32                                         InPlayerIndex_0;                                   // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempPlayerIndex;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00D8(0x0010)()
	struct FGadgetPlateUIData                     CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData; // 0x00E8(0x0028)()
	TArray<int32>                                 CallFunc_ConvertGadgetPlateUIDataToSlotStates_OutSlotStates; // 0x0110(0x0010)(ReferenceParm)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetGadgetDetailData_OutThumbnailTexture;  // 0x0120(0x0028)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetGadgetDetailData_OutExplanation;       // 0x0148(0x0010)()
	class UGadgetDetailWindow*                    CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGadgetDetailWindowData                K2Node_MakeStruct_GadgetDetailWindowData;          // 0x0160(0x0038)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus) == 0x000008, "Wrong alignment on BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus");
static_assert(sizeof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus) == 0x0001A0, "Wrong size on BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, InPlayerIndex_0) == 0x000000, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::InPlayerIndex_0' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, TempPlayerIndex) == 0x000004, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::TempPlayerIndex' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000010, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, K2Node_MakeArray_Array) == 0x0000A8, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, K2Node_MakeArray_Array_1) == 0x0000B8, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, CallFunc_Format_ReturnValue_1) == 0x0000D8, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData) == 0x0000E8, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, CallFunc_ConvertGadgetPlateUIDataToSlotStates_OutSlotStates) == 0x000110, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::CallFunc_ConvertGadgetPlateUIDataToSlotStates_OutSlotStates' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, CallFunc_GetGadgetDetailData_OutThumbnailTexture) == 0x000120, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::CallFunc_GetGadgetDetailData_OutThumbnailTexture' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, CallFunc_GetGadgetDetailData_OutExplanation) == 0x000148, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::CallFunc_GetGadgetDetailData_OutExplanation' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, CallFunc_Array_Get_Item) == 0x000158, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, K2Node_MakeStruct_GadgetDetailWindowData) == 0x000160, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::K2Node_MakeStruct_GadgetDetailWindowData' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000198, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000199, "Member 'BPC_GadgetCustomize2SelectState_C_UpdateGadgetDetailWindowFromGadgetPlateLastFocus::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");

// Function BPC_GadgetCustomize2SelectState.BPC_GadgetCustomize2SelectState_C.UnbindGadgetPlateDelegate
// 0x00E0 (0x00E0 - 0x0000)
struct BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate final
{
public:
	int32                                         InPlayerIndex_0;                                   // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGadgetPlateWindow*                     TempPlate;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGadgetPlateWindow*                     CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, int32 SlotState, int32 SlotIndex)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, int32 SlotState, int32 SlotIndex)> K2Node_CreateDelegate_OutputDelegate_4; // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate) == 0x000008, "Wrong alignment on BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate");
static_assert(sizeof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate) == 0x0000E0, "Wrong size on BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, InPlayerIndex_0) == 0x000000, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::InPlayerIndex_0' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, TempPlate) == 0x000008, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::TempPlate' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, K2Node_MakeArray_Array) == 0x000060, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, CallFunc_Format_ReturnValue) == 0x000070, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, CallFunc_Array_Get_Item) == 0x000090, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000099, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000BC, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000CC, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindGadgetPlateDelegate::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function BPC_GadgetCustomize2SelectState.BPC_GadgetCustomize2SelectState_C.BindGadgetPlateDelegate
// 0x00E0 (0x00E0 - 0x0000)
struct BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate final
{
public:
	int32                                         InPlayerIndex_0;                                   // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGadgetPlateWindow*                     TempPlate;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
	class UGadgetPlateWindow*                     CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, int32 SlotState, int32 SlotIndex)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, int32 SlotState, int32 SlotIndex)> K2Node_CreateDelegate_OutputDelegate_4; // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate) == 0x000008, "Wrong alignment on BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate");
static_assert(sizeof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate) == 0x0000E0, "Wrong size on BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, InPlayerIndex_0) == 0x000000, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::InPlayerIndex_0' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, TempPlate) == 0x000008, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::TempPlate' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, K2Node_MakeArray_Array) == 0x000060, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, CallFunc_Format_ReturnValue) == 0x000070, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, CallFunc_Array_Get_Item) == 0x000080, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000088, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000BC, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000CC, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetPlateDelegate::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function BPC_GadgetCustomize2SelectState.BPC_GadgetCustomize2SelectState_C.BindGadgetSelectWindowDelegate
// 0x0100 (0x0100 - 0x0000)
struct BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate final
{
public:
	int32                                         InPlayerIndex_0;                                   // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGadgetCustomWindow*                    TempWindow;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class UGadgetCustomWindow*                    CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 PlayerIndex, EGadgetId gadgetId, EGadgetCategory CategoryId, EGadgetState GadgetState)> K2Node_CreateDelegate_OutputDelegate; // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, EGadgetId gadgetId, EGadgetCategory CategoryId, EGadgetState GadgetState)> K2Node_CreateDelegate_OutputDelegate_1; // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, EGadgetId gadgetId, EGadgetCategory CategoryId, EGadgetState GadgetState)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, EGadgetId gadgetId, EGadgetCategory CategoryId, EGadgetState GadgetState)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, EGadgetId gadgetId, EGadgetState GadgetState)> K2Node_CreateDelegate_OutputDelegate_4; // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SelectedPlayerControllerIndex, EGadgetCategory SelectedGadgetCategory, EGadgetId SelectedGadgetId, EGadgetState SelectedGadgetState)> K2Node_CreateDelegate_OutputDelegate_5; // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SelectedPlayerControllerIndex, EGadgetCategory SelectedGadgetCategory, EGadgetId SelectedGadgetId, EGadgetState SelectedGadgetState)> K2Node_CreateDelegate_OutputDelegate_6; // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate) == 0x000008, "Wrong alignment on BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate");
static_assert(sizeof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate) == 0x000100, "Wrong size on BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, InPlayerIndex_0) == 0x000000, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::InPlayerIndex_0' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, TempWindow) == 0x000008, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::TempWindow' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, K2Node_MakeArray_Array) == 0x000060, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, CallFunc_Array_Get_Item) == 0x000070, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, CallFunc_Format_ReturnValue) == 0x000078, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000089, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000BC, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000CC, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000DC, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000EC, "Member 'BPC_GadgetCustomize2SelectState_C_BindGadgetSelectWindowDelegate::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");

// Function BPC_GadgetCustomize2SelectState.BPC_GadgetCustomize2SelectState_C.SetupDummyWidget
// 0x0008 (0x0008 - 0x0000)
struct BPC_GadgetCustomize2SelectState_C_SetupDummyWidget final
{
public:
	class UDummyWidget*                           CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GadgetCustomize2SelectState_C_SetupDummyWidget) == 0x000008, "Wrong alignment on BPC_GadgetCustomize2SelectState_C_SetupDummyWidget");
static_assert(sizeof(BPC_GadgetCustomize2SelectState_C_SetupDummyWidget) == 0x000008, "Wrong size on BPC_GadgetCustomize2SelectState_C_SetupDummyWidget");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupDummyWidget, CallFunc_Create_ReturnValue) == 0x000000, "Member 'BPC_GadgetCustomize2SelectState_C_SetupDummyWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BPC_GadgetCustomize2SelectState.BPC_GadgetCustomize2SelectState_C.ChangeFooterZOrder
// 0x00A0 (0x00A0 - 0x0000)
struct BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_ChangeZOrder_ReturnValue;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0010)()
};
static_assert(alignof(BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder) == 0x000008, "Wrong alignment on BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder");
static_assert(sizeof(BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder) == 0x0000A0, "Wrong size on BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000028, "Member 'BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder, CallFunc_ChangeZOrder_ReturnValue) == 0x000078, "Member 'BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder::CallFunc_ChangeZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder, K2Node_MakeArray_Array) == 0x000080, "Member 'BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder, CallFunc_Format_ReturnValue) == 0x000090, "Member 'BPC_GadgetCustomize2SelectState_C_ChangeFooterZOrder::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BPC_GadgetCustomize2SelectState.BPC_GadgetCustomize2SelectState_C.SetupDonpaTicketBoxWidget
// 0x0008 (0x0008 - 0x0000)
struct BPC_GadgetCustomize2SelectState_C_SetupDonpaTicketBoxWidget final
{
public:
	class UCommonCountNumberWidget*               CallFunc_GetTicketBox_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GadgetCustomize2SelectState_C_SetupDonpaTicketBoxWidget) == 0x000008, "Wrong alignment on BPC_GadgetCustomize2SelectState_C_SetupDonpaTicketBoxWidget");
static_assert(sizeof(BPC_GadgetCustomize2SelectState_C_SetupDonpaTicketBoxWidget) == 0x000008, "Wrong size on BPC_GadgetCustomize2SelectState_C_SetupDonpaTicketBoxWidget");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupDonpaTicketBoxWidget, CallFunc_GetTicketBox_ReturnValue) == 0x000000, "Member 'BPC_GadgetCustomize2SelectState_C_SetupDonpaTicketBoxWidget::CallFunc_GetTicketBox_ReturnValue' has a wrong offset!");

// Function BPC_GadgetCustomize2SelectState.BPC_GadgetCustomize2SelectState_C.SetupMachineParameterWidget
// 0x0040 (0x0040 - 0x0000)
struct BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCharaMachineParamWindow*>       CallFunc_GetmachineParameterWindows_OutMachineParameterWindows; // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCharaMachineParamWindow*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget) == 0x000008, "Wrong alignment on BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget");
static_assert(sizeof(BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget) == 0x000040, "Wrong size on BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget, Temp_bool_Variable) == 0x00000C, "Member 'BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget, CallFunc_GetmachineParameterWindows_OutMachineParameterWindows) == 0x000018, "Member 'BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget::CallFunc_GetmachineParameterWindows_OutMachineParameterWindows' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget, CallFunc_Array_Get_Item) == 0x000028, "Member 'BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget, CallFunc_Array_Add_ReturnValue_1) == 0x000034, "Member 'BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BPC_GadgetCustomize2SelectState_C_SetupMachineParameterWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BPC_GadgetCustomize2SelectState.BPC_GadgetCustomize2SelectState_C.SetupGadgetDetailWidget
// 0x0038 (0x0038 - 0x0000)
struct BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget final
{
public:
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0010(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGadgetDetailWindow*>            CallFunc_GetDetailWindows_OutDetailWindows;        // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget) == 0x000008, "Wrong alignment on BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget");
static_assert(sizeof(BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget) == 0x000038, "Wrong size on BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget, K2Node_MakeArray_Array) == 0x000000, "Member 'BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget, CallFunc_Format_ReturnValue) == 0x000010, "Member 'BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget, CallFunc_GetDetailWindows_OutDetailWindows) == 0x000028, "Member 'BPC_GadgetCustomize2SelectState_C_SetupGadgetDetailWidget::CallFunc_GetDetailWindows_OutDetailWindows' has a wrong offset!");

// Function BPC_GadgetCustomize2SelectState.BPC_GadgetCustomize2SelectState_C.SetupGadgetCustomizeBaseWidget
// 0x0028 (0x0028 - 0x0000)
struct BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget final
{
public:
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFestaSpecialRuleContinuous_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGadgetCustomizeWindowData             K2Node_MakeStruct_GadgetCustomizeWindowData;       // 0x0004(0x0004)(NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGadgetCustomizeWindow*                 CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget) == 0x000008, "Wrong alignment on BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget");
static_assert(sizeof(BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget) == 0x000028, "Wrong size on BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000000, "Member 'BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget, CallFunc_IsFestaSpecialRuleContinuous_ReturnValue) == 0x000001, "Member 'BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget::CallFunc_IsFestaSpecialRuleContinuous_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget, K2Node_MakeStruct_GadgetCustomizeWindowData) == 0x000004, "Member 'BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget::K2Node_MakeStruct_GadgetCustomizeWindowData' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget, CallFunc_Array_Get_Item) == 0x000018, "Member 'BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget, CallFunc_Create_ReturnValue) == 0x000020, "Member 'BPC_GadgetCustomize2SelectState_C_SetupGadgetCustomizeBaseWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BPC_GadgetCustomize2SelectState.BPC_GadgetCustomize2SelectState_C.UnbindsGadgetPlatePresetTabDelegate
// 0x00E8 (0x00E8 - 0x0000)
struct BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate final
{
public:
	class UGadgetCustomTabButton*                 TempTabButton;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGadgetPlateWindow*                     TempPlateWindow;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0048)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGadgetCustomTab*                       CallFunc_GetGadgetCustomTabRef_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGadgetCustomTabButton*>         CallFunc_GetTabButtonArr_ReturnValue;              // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UGadgetCustomTabButton*                 CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGadgetPlateWindow*                     CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate) == 0x000008, "Wrong alignment on BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate");
static_assert(sizeof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate) == 0x0000E8, "Wrong size on BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, TempTabButton) == 0x000000, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::TempTabButton' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, TempPlateWindow) == 0x000008, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::TempPlateWindow' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000018, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, K2Node_MakeArray_Array) == 0x000070, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, Temp_int_Array_Index_Variable_1) == 0x000098, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, CallFunc_IsValid_ReturnValue) == 0x00009C, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, CallFunc_IsValid_ReturnValue_1) == 0x00009D, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate, Temp_int_Loop_Counter_Variable_1) == 0x0000A0, "Member 'BPC_GadgetCustomize2SelectState_C_UnbindsGadgetPlatePresetTabDelegate::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
