#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_GadgetCustomize2State

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_GadgetCustomize2State.BPC_GadgetCustomize2State_C
// 0x0028 (0x0150 - 0x0128)
class UBPC_GadgetCustomize2State_C final : public UGadgetCustomize2State
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         PlayerNum;                                         // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetCustomizeSelectMode                    SelectMode;                                        // 0x0134(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GadgetCustomize2Sequence_C*         Sequence;                                          // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x0140(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMessageBarVisible;                              // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelectedPlateDataChanged;                       // 0x0149(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsExit;                                           // 0x014A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_GadgetCustomize2State(int32 EntryPoint);
	void Exit();
	void Finished_SequenceStart_FadeOut(EUnionUIFadeDirection FadeDirection);
	void MatchingTimeOut(float InTimeOutTime);
	void OnInitState();
	void Sequence_OnBackEvent(bool bIsSelectedPlateDataChanged_0);
	void SetMessageBarVisible(bool bInIsVisible);
	void SetPlayerNum(int32 InPlayerNum);
	void SetSelectMode(EGadgetCustomizeSelectMode InSelectMode);
	void TimerEvent();

	bool IsSelectedPlateDataChanged() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_GadgetCustomize2State_C">();
	}
	static class UBPC_GadgetCustomize2State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_GadgetCustomize2State_C>();
	}
};
static_assert(alignof(UBPC_GadgetCustomize2State_C) == 0x000008, "Wrong alignment on UBPC_GadgetCustomize2State_C");
static_assert(sizeof(UBPC_GadgetCustomize2State_C) == 0x000150, "Wrong size on UBPC_GadgetCustomize2State_C");
static_assert(offsetof(UBPC_GadgetCustomize2State_C, UberGraphFrame) == 0x000128, "Member 'UBPC_GadgetCustomize2State_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_GadgetCustomize2State_C, PlayerNum) == 0x000130, "Member 'UBPC_GadgetCustomize2State_C::PlayerNum' has a wrong offset!");
static_assert(offsetof(UBPC_GadgetCustomize2State_C, SelectMode) == 0x000134, "Member 'UBPC_GadgetCustomize2State_C::SelectMode' has a wrong offset!");
static_assert(offsetof(UBPC_GadgetCustomize2State_C, Sequence) == 0x000138, "Member 'UBPC_GadgetCustomize2State_C::Sequence' has a wrong offset!");
static_assert(offsetof(UBPC_GadgetCustomize2State_C, TimerHandle) == 0x000140, "Member 'UBPC_GadgetCustomize2State_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UBPC_GadgetCustomize2State_C, bIsMessageBarVisible) == 0x000148, "Member 'UBPC_GadgetCustomize2State_C::bIsMessageBarVisible' has a wrong offset!");
static_assert(offsetof(UBPC_GadgetCustomize2State_C, bIsSelectedPlateDataChanged) == 0x000149, "Member 'UBPC_GadgetCustomize2State_C::bIsSelectedPlateDataChanged' has a wrong offset!");
static_assert(offsetof(UBPC_GadgetCustomize2State_C, bIsExit) == 0x00014A, "Member 'UBPC_GadgetCustomize2State_C::bIsExit' has a wrong offset!");

}

