#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MenuStatePartyRaceTutorial

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_MenuStatePartyRaceTutorial.BPC_MenuStatePartyRaceTutorial_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_MenuStatePartyRaceTutorial_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceTutorial_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_MenuStatePartyRaceTutorial_C_OnUpdateState");
static_assert(sizeof(BPC_MenuStatePartyRaceTutorial_C_OnUpdateState) == 0x000004, "Wrong size on BPC_MenuStatePartyRaceTutorial_C_OnUpdateState");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_MenuStatePartyRaceTutorial_C_OnUpdateState::InDeltaTime' has a wrong offset!");

// Function BPC_MenuStatePartyRaceTutorial.BPC_MenuStatePartyRaceTutorial_C.ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial
// 0x00F8 (0x00F8 - 0x0000)
struct BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuSoundSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentTopMenuLevelName_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuLightingLevelInterface> K2Node_DynamicCast_AsMenu_Lighting_Level_Interface; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuLightingLevelInterface> K2Node_DynamicCast_AsMenu_Lighting_Level_Interface_1; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDeltaTime;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue_1;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue_2;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IDialogueEventInterface> K2Node_DynamicCast_AsDialogue_Event_Interface;   // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckMenuMode_MenuMode;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSubLevelNameOfCharaMachineSelect_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is2ndRom_ReturnValue;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue_2;          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue_3;        // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_3;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuLightingLevelInterface> K2Node_DynamicCast_AsMenu_Lighting_Level_Interface_2; // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PartyRaceMenuSequence_C*            K2Node_DynamicCast_AsBP_Party_Race_Menu_Sequence;  // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial");
static_assert(sizeof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial) == 0x0000F8, "Wrong size on BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, EntryPoint) == 0x000000, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000010, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetCurrentTopMenuLevelName_ReturnValue) == 0x000018, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetCurrentTopMenuLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetStreamingLevel_ReturnValue) == 0x000020, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetLevelScriptActor_ReturnValue) == 0x000028, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetLevelScriptActor_ReturnValue_1) == 0x000030, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetLevelScriptActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, K2Node_DynamicCast_AsMenu_Lighting_Level_Interface) == 0x000038, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::K2Node_DynamicCast_AsMenu_Lighting_Level_Interface' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, K2Node_DynamicCast_AsMenu_Lighting_Level_Interface_1) == 0x000050, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::K2Node_DynamicCast_AsMenu_Lighting_Level_Interface_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, K2Node_Event_InDeltaTime) == 0x000064, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetStreamingLevel_ReturnValue_1) == 0x000068, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetStreamingLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetLevelScriptActor_ReturnValue_2) == 0x000070, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetLevelScriptActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, K2Node_DynamicCast_AsDialogue_Event_Interface) == 0x000080, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::K2Node_DynamicCast_AsDialogue_Event_Interface' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_CheckMenuMode_MenuMode) == 0x000091, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_CheckMenuMode_MenuMode' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetWorldSubsystem_ReturnValue_2) == 0x000098, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetWorldSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetSubLevelNameOfCharaMachineSelect_ReturnValue) == 0x0000A0, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetSubLevelNameOfCharaMachineSelect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_Is2ndRom_ReturnValue) == 0x0000A8, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_Is2ndRom_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetStreamingLevel_ReturnValue_2) == 0x0000B0, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetStreamingLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetLevelScriptActor_ReturnValue_3) == 0x0000B8, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetLevelScriptActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetWorldSubsystem_ReturnValue_3) == 0x0000C0, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetWorldSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, K2Node_DynamicCast_AsMenu_Lighting_Level_Interface_2) == 0x0000C8, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::K2Node_DynamicCast_AsMenu_Lighting_Level_Interface_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, K2Node_DynamicCast_bSuccess_3) == 0x0000D8, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_IsValid_ReturnValue_2) == 0x0000D9, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, CallFunc_GetOwnerStateMachine_ReturnValue) == 0x0000E0, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::CallFunc_GetOwnerStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, K2Node_DynamicCast_AsBP_Party_Race_Menu_Sequence) == 0x0000E8, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::K2Node_DynamicCast_AsBP_Party_Race_Menu_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial, K2Node_DynamicCast_bSuccess_4) == 0x0000F0, "Member 'BPC_MenuStatePartyRaceTutorial_C_ExecuteUbergraph_BPC_MenuStatePartyRaceTutorial::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

}

