#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_GarageState

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_GarageState.BPC_GarageState_C
// 0x0018 (0x0140 - 0x0128)
class UBPC_GarageState_C final : public UGarageState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_GarageSequence_C*                   Sequence;                                          // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMessageBarVisible;                              // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelectedCustomizeDataChanged;                   // 0x0139(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_GarageState(int32 EntryPoint);
	void MatchingTimeOut(float InTimeOutTime);
	void OnExitState();
	void OnInitState();
	void Sequence_OnBackEvent(bool bIsSelectedCustomizeDataChanged_0);
	void SetMessageBarVisible(bool bInIsVisible);

	bool IsSelectedCustomizeDataChanged() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_GarageState_C">();
	}
	static class UBPC_GarageState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_GarageState_C>();
	}
};
static_assert(alignof(UBPC_GarageState_C) == 0x000008, "Wrong alignment on UBPC_GarageState_C");
static_assert(sizeof(UBPC_GarageState_C) == 0x000140, "Wrong size on UBPC_GarageState_C");
static_assert(offsetof(UBPC_GarageState_C, UberGraphFrame) == 0x000128, "Member 'UBPC_GarageState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_GarageState_C, Sequence) == 0x000130, "Member 'UBPC_GarageState_C::Sequence' has a wrong offset!");
static_assert(offsetof(UBPC_GarageState_C, bIsMessageBarVisible) == 0x000138, "Member 'UBPC_GarageState_C::bIsMessageBarVisible' has a wrong offset!");
static_assert(offsetof(UBPC_GarageState_C, bIsSelectedCustomizeDataChanged) == 0x000139, "Member 'UBPC_GarageState_C::bIsSelectedCustomizeDataChanged' has a wrong offset!");

}

