#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateResultRival

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UnionUI_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function BPC_RaceSequenceStateResultRival.BPC_RaceSequenceStateResultRival_C.ApplyRivalLevel
// 0x0040 (0x0040 - 0x0000)
struct BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel final
{
public:
	TArray<uint8>                                 CallFunc_GetRaceRivalBaseLevel_ReturnValue;        // 0x0000(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_GetMaxRivalTeamLevel_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_GetRaceRivalLevel_ReturnValue;            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	uint8                                         CallFunc_GetMenuDataBaseRivalLevel_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel");
static_assert(sizeof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel) == 0x000040, "Wrong size on BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel, CallFunc_GetRaceRivalBaseLevel_ReturnValue) == 0x000000, "Member 'BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel::CallFunc_GetRaceRivalBaseLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel, CallFunc_GetMaxRivalTeamLevel_ReturnValue) == 0x000010, "Member 'BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel::CallFunc_GetMaxRivalTeamLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel, CallFunc_GetRaceRivalLevel_ReturnValue) == 0x000018, "Member 'BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel::CallFunc_GetRaceRivalLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel, CallFunc_GetMenuDataBaseRivalLevel_ReturnValue) == 0x000028, "Member 'BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel::CallFunc_GetMenuDataBaseRivalLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00002C, "Member 'BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000030, "Member 'BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000034, "Member 'BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000035, "Member 'BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000036, "Member 'BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel, CallFunc_BooleanOR_ReturnValue) == 0x000037, "Member 'BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'BPC_RaceSequenceStateResultRival_C_ApplyRivalLevel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateResultRival.BPC_RaceSequenceStateResultRival_C.BindFullScreenMouseClick
// 0x0028 (0x0028 - 0x0000)
struct BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick final
{
public:
	TDelegate<void()>                             Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick");
static_assert(sizeof(BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick) == 0x000028, "Wrong size on BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick, Event) == 0x000000, "Member 'BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick::Event' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000018, "Member 'BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BPC_RaceSequenceStateResultRival_C_BindFullScreenMouseClick::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateResultRival.BPC_RaceSequenceStateResultRival_C.CreateRewardGetDisplay
// 0x0001 (0x0001 - 0x0000)
struct BPC_RaceSequenceStateResultRival_C_CreateRewardGetDisplay final
{
public:
	ERewardAchievementType                        InRewardAchievementType;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateResultRival_C_CreateRewardGetDisplay) == 0x000001, "Wrong alignment on BPC_RaceSequenceStateResultRival_C_CreateRewardGetDisplay");
static_assert(sizeof(BPC_RaceSequenceStateResultRival_C_CreateRewardGetDisplay) == 0x000001, "Wrong size on BPC_RaceSequenceStateResultRival_C_CreateRewardGetDisplay");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_CreateRewardGetDisplay, InRewardAchievementType) == 0x000000, "Member 'BPC_RaceSequenceStateResultRival_C_CreateRewardGetDisplay::InRewardAchievementType' has a wrong offset!");

// Function BPC_RaceSequenceStateResultRival.BPC_RaceSequenceStateResultRival_C.ExecuteUbergraph_BPC_RaceSequenceStateResultRival
// 0x0A40 (0x0A40 - 0x0000)
struct BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Movie_Subtitles_C*                 CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinalRace_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackSettings    K2Node_MakeStruct_MovieSceneSequencePlaybackSettings; // 0x001C(0x0028)(NoDestructor)
	bool                                          CallFunc_IsFinalRace_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         K2Node_CustomEvent_FadeDirection;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinalRace_ReturnValue_2;                // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetNextRaceSequenceState_ReturnValue;     // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IDriverVoicePlayer>    CallFunc_ActivateVoice_self_CastInput;             // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FKey& PressedKey)> K2Node_CreateDelegate_OutputDelegate;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASceneInputKeyHandler*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         Temp_object_Variable_1;                            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetNextRaceSequenceState_ReturnValue_1;   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinalRace_ReturnValue_3;                // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARaceSequence*                          CallFunc_GetOwnerRaceSequence_ReturnValue;         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlaySequencerPattern_Result;           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_PressedKey_1;                   // 0x0108(0x0018)(HasGetValueTypeHash)
	EPerformRivalOutcome                          Temp_byte_Variable;                                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0010)()
	class ULevelSequence*                         Temp_object_Variable_2;                            // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0160(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RivalSelect_C*                     CallFunc_Create_ReturnValue_1;                     // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         Temp_object_Variable_3;                            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERewardAchievementType                        K2Node_CustomEvent_InRewardAchievementType;        // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverAnimMontageId                          Temp_byte_Variable_1;                              // 0x0189(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESaveDataStatus                               K2Node_CustomEvent_Status;                         // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverAnimMontageId                          Temp_byte_Variable_2;                              // 0x018B(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAppRaceConfigData                     CallFunc_GetAppRaceConfigData_OutData;             // 0x0190(0x0490)()
	bool                                          CallFunc_CheckDoingResultRivalTeamEliminatedEvent_ReturnValue; // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0621(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDoingResultRivalTeamEliminatedEvent_ReturnValue_1; // 0x0622(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetNextRaceSequenceState_ReturnValue_2;   // 0x0623(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0624(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDoingResultRivalTeamEliminatedEvent_ReturnValue_2; // 0x0625(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_626[0x2];                                      // 0x0626(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverAnimMontageId                          Temp_byte_Variable_3;                              // 0x062C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62D[0x3];                                      // 0x062D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         K2Node_Select_Default;                             // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRewardAchievementData                 CallFunc_MakeResultRivalTeamRewardAchievementData_ReturnValue; // 0x0638(0x0080)()
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor;       // 0x06B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue;    // 0x06C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRewardAchievementData>         K2Node_MakeArray_Array_1;                          // 0x06C8(0x0010)(ConstParm, ReferenceParm)
	class FText                                   CallFunc_GetRivalMessageFromTable_Out_Text;        // 0x06D8(0x0010)()
	bool                                          CallFunc_IsFinalRace_ReturnValue_4;                // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPerformRivalOutcome                          Temp_byte_Variable_4;                              // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA[0x2];                                      // 0x06EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayRivalVoice_ReturnValue;               // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverAnimMontageId                          K2Node_Select_Default_1;                           // 0x06F0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F1[0x7];                                      // 0x06F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IDriverAnimator>       CallFunc_PlayAnimation_self_CastInput;             // 0x06F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERivalTransitionType                          Temp_byte_Variable_5;                              // 0x0708(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x3];                                      // 0x0709(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x070C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x071C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x071D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71E[0x2];                                      // 0x071E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0720(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERivalTransitionType                          Temp_byte_Variable_6;                              // 0x0728(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIRivalTransition*                CallFunc_GetRivalTransitionWidget_ReturnValue;     // 0x0730(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetMenuDataLastChoiceDriverId_ReturnValue; // 0x0738(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERivalTransitionType                          Temp_byte_Variable_7;                              // 0x0739(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERivalType                                    Temp_byte_Variable_8;                              // 0x073A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetGrandPrixLastFocusedMenuSpeedClassId_ReturnValue; // 0x073B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERivalTransitionType                          K2Node_Select_Default_2;                           // 0x073C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73D[0x3];                                      // 0x073D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_GetTopKnockdownRivalLevelArray_ReturnValue; // 0x0740(0x0010)(ReferenceParm)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0750(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0758(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIRivalTransition*                CallFunc_CreateRivalTransitionWidget_ReturnValue;  // 0x0768(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinalRace_ReturnValue_5;                // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_771[0x3];                                      // 0x0771(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate_4;     // 0x0774(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESaveDataStatus Status)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0784(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_794[0x4];                                      // 0x0794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A1[0x3];                                      // 0x07A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x07A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AC[0x4];                                      // 0x07AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRewardAchievementTableRow             CallFunc_GetDataTableRowFromName_OutRow;           // 0x07B0(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppControllerInputManager*             CallFunc_GetWorldSubsystem_ReturnValue;            // 0x07D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_GetPlayerController_ReturnValue;          // 0x07E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EC[0x4];                                      // 0x07EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARacePlayerController*                  K2Node_DynamicCast_AsRace_Player_Controller;       // 0x07F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F9[0x7];                                      // 0x07F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0800(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUISubsystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0808(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppControllerInputManager*             CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0810(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_CreateRewardDisplayWidget_ReturnValue;    // 0x0818(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_GetPlayerController_ReturnValue_1;        // 0x0820(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URewardGetDisplay*                      K2Node_DynamicCast_AsReward_Get_Display;           // 0x0828(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_831[0x7];                                      // 0x0831(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARacePlayerController*                  K2Node_DynamicCast_AsRace_Player_Controller_1;     // 0x0838(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetMenuDataLastChoiceRivalLevel_ReturnValue; // 0x0841(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetMenuDataBaseRivalLevel_ReturnValue;    // 0x0842(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_843[0x5];                                      // 0x0843(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EStageId>                              CallFunc_GetSelectedStageIds_ReturnValue;          // 0x0848(0x0010)(ReferenceParm)
	class UUISubsystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0858(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplySettingsCineCameraAll_OutResult;     // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_861[0x7];                                      // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_PressedKey;                     // 0x0868(0x0018)(HasGetValueTypeHash)
	class ABP_DriverPawn_C*                       K2Node_DynamicCast_AsBP_Driver_Pawn;               // 0x0880(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_889[0x3];                                      // 0x0889(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x088C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetNextRaceSequenceState_ReturnValue_3;   // 0x089C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsRivalSkinExistsGameMode_ReturnValue; // 0x089D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x089E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89F[0x1];                                      // 0x089F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FKey& PressedKey)> K2Node_CreateDelegate_OutputDelegate_7;           // 0x08A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B4[0x4];                                      // 0x08B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRewardAchievementData                 CallFunc_Array_Get_Item;                           // 0x08B8(0x0080)()
	bool                                          CallFunc_IsDisableGrandPrixMilestoneVersion_ReturnValue; // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECaptionVisible                               CallFunc_GetCaptionVisibility_ReturnValue;         // 0x0939(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x093A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x093B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93C[0x4];                                      // 0x093C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0940(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0951(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0952(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_953[0x1];                                      // 0x0953(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0954(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerWin_ReturnValue;                  // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0959(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95A[0x2];                                      // 0x095A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x095C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerWin_ReturnValue_1;                // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerWin_ReturnValue_2;                // 0x0961(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_962[0x2];                                      // 0x0962(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0964(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0974(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0984(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0994(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FKey& PressedKey)> K2Node_CreateDelegate_OutputDelegate_12;          // 0x09A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x09B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C4[0x4];                                      // 0x09C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x09C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x09D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceSequence_C*                     K2Node_DynamicCast_AsBP_Race_Sequence;             // 0x09D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x09E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E1[0x3];                                      // 0x09E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x09E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F4[0x4];                                      // 0x09F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x09F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue_1;       // 0x0A00(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A09[0x7];                                      // 0x0A09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RaceSequence_C*                     K2Node_DynamicCast_AsBP_Race_Sequence_1;           // 0x0A10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0A19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1A[0x6];                                      // 0x0A1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x0A20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0A28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0A30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x0A34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_2;            // 0x0A38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival) == 0x000010, "Wrong alignment on BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival");
static_assert(sizeof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival) == 0x000A40, "Wrong size on BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, EntryPoint) == 0x000000, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, Temp_object_Variable) == 0x000010, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_IsFinalRace_ReturnValue) == 0x000018, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_IsFinalRace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, K2Node_MakeStruct_MovieSceneSequencePlaybackSettings) == 0x00001C, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::K2Node_MakeStruct_MovieSceneSequencePlaybackSettings' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_IsFinalRace_ReturnValue_1) == 0x000044, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_IsFinalRace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, K2Node_Event_InDeltaTime) == 0x000048, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, K2Node_CustomEvent_FadeDirection) == 0x00004C, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::K2Node_CustomEvent_FadeDirection' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_IsFinalRace_ReturnValue_2) == 0x00004D, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_IsFinalRace_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_SetNextRaceSequenceState_ReturnValue) == 0x00004E, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_SetNextRaceSequenceState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_ActivateVoice_self_CastInput) == 0x000050, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_ActivateVoice_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D8, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_Not_PreBool_ReturnValue) == 0x0000E0, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, Temp_object_Variable_1) == 0x0000E8, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_SetNextRaceSequenceState_ReturnValue_1) == 0x0000F1, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_SetNextRaceSequenceState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_IsFinalRace_ReturnValue_3) == 0x0000F2, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_IsFinalRace_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_GetOwnerRaceSequence_ReturnValue) == 0x0000F8, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_GetOwnerRaceSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_GetPlaySequencerPattern_Result) == 0x000100, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_GetPlaySequencerPattern_Result' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, K2Node_CustomEvent_PressedKey_1) == 0x000108, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::K2Node_CustomEvent_PressedKey_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, Temp_byte_Variable) == 0x000120, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, K2Node_MakeArray_Array) == 0x000128, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_Format_ReturnValue) == 0x000138, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, Temp_object_Variable_2) == 0x000148, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, K2Node_CreateDelegate_OutputDelegate_1) == 0x000150, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_MakeLiteralText_ReturnValue) == 0x000160, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_IsValid_ReturnValue_1) == 0x000170, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_Create_ReturnValue_1) == 0x000178, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, Temp_object_Variable_3) == 0x000180, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, K2Node_CustomEvent_InRewardAchievementType) == 0x000188, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::K2Node_CustomEvent_InRewardAchievementType' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, Temp_byte_Variable_1) == 0x000189, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, K2Node_CustomEvent_Status) == 0x00018A, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::K2Node_CustomEvent_Status' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, Temp_byte_Variable_2) == 0x00018B, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_GetAppRaceConfigData_OutData) == 0x000190, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_GetAppRaceConfigData_OutData' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_CheckDoingResultRivalTeamEliminatedEvent_ReturnValue) == 0x000620, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_CheckDoingResultRivalTeamEliminatedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_Greater_IntInt_ReturnValue) == 0x000621, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_CheckDoingResultRivalTeamEliminatedEvent_ReturnValue_1) == 0x000622, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_CheckDoingResultRivalTeamEliminatedEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_SetNextRaceSequenceState_ReturnValue_2) == 0x000623, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_SetNextRaceSequenceState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, Temp_bool_Has_Been_Initd_Variable) == 0x000624, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_CheckDoingResultRivalTeamEliminatedEvent_ReturnValue_2) == 0x000625, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_CheckDoingResultRivalTeamEliminatedEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, Temp_int_Variable) == 0x000628, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, Temp_byte_Variable_3) == 0x00062C, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, K2Node_Select_Default) == 0x000630, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_MakeResultRivalTeamRewardAchievementData_ReturnValue) == 0x000638, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_MakeResultRivalTeamRewardAchievementData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_CreateLevelSequencePlayer_OutActor) == 0x0006B8, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_CreateLevelSequencePlayer_OutActor' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_CreateLevelSequencePlayer_ReturnValue) == 0x0006C0, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_CreateLevelSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, K2Node_MakeArray_Array_1) == 0x0006C8, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_GetRivalMessageFromTable_Out_Text) == 0x0006D8, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_GetRivalMessageFromTable_Out_Text' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_IsFinalRace_ReturnValue_4) == 0x0006E8, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_IsFinalRace_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, Temp_byte_Variable_4) == 0x0006E9, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_PlayRivalVoice_ReturnValue) == 0x0006EC, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_PlayRivalVoice_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, K2Node_Select_Default_1) == 0x0006F0, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival, CallFunc_PlayAnimation_self_CastInput) == 0x0006F8, "Member 'BPC_RaceSequenceStateResultRival_C_ExecuteUbergraph_BPC_RaceSequenceStateResultRival::CallFunc_PlayAnimation_self_CastInput' has a wrong offset!");
