#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateIntroduceCourse

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "InputCore_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "ST_IntroduceCourseSceneData_structs.hpp"
#include "MovieScene_structs.hpp"
#include "UnionUI_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_RaceSequenceStateIntroduceCourse.BPC_RaceSequenceStateIntroduceCourse_C.IsOpenGrandprixFinalTipsWindow
// 0x001C (0x001C - 0x0000)
struct BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow final
{
public:
	EHintId                                       InHintId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableOpenWindow;                                  // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   GrandPrixId;                                       // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadHint_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow) == 0x000004, "Wrong alignment on BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow");
static_assert(sizeof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow) == 0x00001C, "Wrong size on BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, InHintId) == 0x000000, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::InHintId' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, EnableOpenWindow) == 0x000001, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::EnableOpenWindow' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, GrandPrixId) == 0x000002, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::GrandPrixId' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000003, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000008, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_GetIsOnlineGameMode_ReturnValue) == 0x00000C, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_GetIsOnlineGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000D, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x000010, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000014, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_IsReadHint_ReturnValue) == 0x000015, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_IsReadHint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_Not_PreBool_ReturnValue_1) == 0x000016, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_BooleanAND_ReturnValue) == 0x000017, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_BooleanAND_ReturnValue_1) == 0x000018, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow, CallFunc_BooleanAND_ReturnValue_2) == 0x000019, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_IsOpenGrandprixFinalTipsWindow::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function BPC_RaceSequenceStateIntroduceCourse.BPC_RaceSequenceStateIntroduceCourse_C.CreateTipsWindow
// 0x0038 (0x0038 - 0x0000)
struct BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow final
{
public:
	EHintId                                       InHintId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Popup_Window_Hint_C*               CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARacePlayerController*                  K2Node_DynamicCast_AsRace_Player_Controller;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow");
static_assert(sizeof(BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow) == 0x000038, "Wrong size on BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow, InHintId) == 0x000000, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow::InHintId' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow, K2Node_DynamicCast_AsRace_Player_Controller) == 0x000018, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow::K2Node_DynamicCast_AsRace_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow, CallFunc_MakeLiteralByte_ReturnValue) == 0x000021, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000034, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateTipsWindow::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateIntroduceCourse.BPC_RaceSequenceStateIntroduceCourse_C.DebugLoadLevelSequence
// 0x0070 (0x0070 - 0x0000)
struct BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence final
{
public:
	EStageId                                      In_StageId;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         Out_LevelSequence;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_IntroduceCourseSceneData           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         K2Node_DynamicCast_As________;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence");
static_assert(sizeof(BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence) == 0x000070, "Wrong size on BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence, In_StageId) == 0x000000, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence::In_StageId' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence, Out_LevelSequence) == 0x000008, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence::Out_LevelSequence' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence, CallFunc_GetEnumeratorName_ReturnValue) == 0x000010, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000048, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000050, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000058, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence, K2Node_DynamicCast_As________) == 0x000060, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence::K2Node_DynamicCast_As________' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_DebugLoadLevelSequence::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPC_RaceSequenceStateIntroduceCourse.BPC_RaceSequenceStateIntroduceCourse_C.CreateSequncePlayerByStageId
// 0x0090 (0x0090 - 0x0000)
struct BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId final
{
public:
	class ALevelSequenceActor*                    Out_Actor;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   Out_Player;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Out_Result;                                        // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackSettings    K2Node_MakeStruct_MovieSceneSequencePlaybackSettings; // 0x0020(0x0028)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EStageId>                              CallFunc_GetSelectedStageIds_ReturnValue;          // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      CallFunc_Array_Get_Item;                           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         CallFunc_DebugLoadLevelSequence_Out_LevelSequence; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor;       // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMainStage_ReturnValue;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId");
static_assert(sizeof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId) == 0x000090, "Wrong size on BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, Out_Actor) == 0x000000, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::Out_Actor' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, Out_Player) == 0x000008, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::Out_Player' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, Out_Result) == 0x000010, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::Out_Result' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, Temp_bool_True_if_break_was_hit_Variable) == 0x000011, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, K2Node_MakeStruct_MovieSceneSequencePlaybackSettings) == 0x000020, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::K2Node_MakeStruct_MovieSceneSequencePlaybackSettings' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_GetSelectedStageIds_ReturnValue) == 0x000050, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_GetSelectedStageIds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_Array_Get_Item) == 0x000064, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_Less_IntInt_ReturnValue) == 0x000065, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_DebugLoadLevelSequence_Out_LevelSequence) == 0x000068, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_DebugLoadLevelSequence_Out_LevelSequence' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_BooleanAND_ReturnValue) == 0x000070, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_CreateLevelSequencePlayer_OutActor) == 0x000078, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_CreateLevelSequencePlayer_OutActor' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_CreateLevelSequencePlayer_ReturnValue) == 0x000080, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_CreateLevelSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_IsValid_ReturnValue_1) == 0x000089, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId, CallFunc_IsMainStage_ReturnValue) == 0x00008A, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_CreateSequncePlayerByStageId::CallFunc_IsMainStage_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateIntroduceCourse.BPC_RaceSequenceStateIntroduceCourse_C.OnLoaded_68D7799743460276E4D57EAD7AE3E92C
// 0x0008 (0x0008 - 0x0000)
struct BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_68D7799743460276E4D57EAD7AE3E92C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_68D7799743460276E4D57EAD7AE3E92C) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_68D7799743460276E4D57EAD7AE3E92C");
static_assert(sizeof(BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_68D7799743460276E4D57EAD7AE3E92C) == 0x000008, "Wrong size on BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_68D7799743460276E4D57EAD7AE3E92C");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_68D7799743460276E4D57EAD7AE3E92C, Loaded) == 0x000000, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_68D7799743460276E4D57EAD7AE3E92C::Loaded' has a wrong offset!");

// Function BPC_RaceSequenceStateIntroduceCourse.BPC_RaceSequenceStateIntroduceCourse_C.OnLoaded_07CB097840A0285D5C47FF9CB2FE2527
// 0x0008 (0x0008 - 0x0000)
struct BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_07CB097840A0285D5C47FF9CB2FE2527 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_07CB097840A0285D5C47FF9CB2FE2527) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_07CB097840A0285D5C47FF9CB2FE2527");
static_assert(sizeof(BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_07CB097840A0285D5C47FF9CB2FE2527) == 0x000008, "Wrong size on BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_07CB097840A0285D5C47FF9CB2FE2527");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_07CB097840A0285D5C47FF9CB2FE2527, Loaded) == 0x000000, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_OnLoaded_07CB097840A0285D5C47FF9CB2FE2527::Loaded' has a wrong offset!");

// Function BPC_RaceSequenceStateIntroduceCourse.BPC_RaceSequenceStateIntroduceCourse_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_RaceSequenceStateIntroduceCourse_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateIntroduceCourse_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_RaceSequenceStateIntroduceCourse_C_OnUpdateState");
static_assert(sizeof(BPC_RaceSequenceStateIntroduceCourse_C_OnUpdateState) == 0x000004, "Wrong size on BPC_RaceSequenceStateIntroduceCourse_C_OnUpdateState");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_OnUpdateState::InDeltaTime' has a wrong offset!");

// Function BPC_RaceSequenceStateIntroduceCourse.BPC_RaceSequenceStateIntroduceCourse_C.OnFinalRoundSceneSkip
// 0x0018 (0x0018 - 0x0000)
struct BPC_RaceSequenceStateIntroduceCourse_C_OnFinalRoundSceneSkip final
{
public:
	struct FKey                                   PressedKey;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateIntroduceCourse_C_OnFinalRoundSceneSkip) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateIntroduceCourse_C_OnFinalRoundSceneSkip");
static_assert(sizeof(BPC_RaceSequenceStateIntroduceCourse_C_OnFinalRoundSceneSkip) == 0x000018, "Wrong size on BPC_RaceSequenceStateIntroduceCourse_C_OnFinalRoundSceneSkip");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_OnFinalRoundSceneSkip, PressedKey) == 0x000000, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_OnFinalRoundSceneSkip::PressedKey' has a wrong offset!");

// Function BPC_RaceSequenceStateIntroduceCourse.BPC_RaceSequenceStateIntroduceCourse_C.OnFadeEnd
// 0x0001 (0x0001 - 0x0000)
struct BPC_RaceSequenceStateIntroduceCourse_C_OnFadeEnd final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateIntroduceCourse_C_OnFadeEnd) == 0x000001, "Wrong alignment on BPC_RaceSequenceStateIntroduceCourse_C_OnFadeEnd");
static_assert(sizeof(BPC_RaceSequenceStateIntroduceCourse_C_OnFadeEnd) == 0x000001, "Wrong size on BPC_RaceSequenceStateIntroduceCourse_C_OnFadeEnd");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_OnFadeEnd, FadeDirection) == 0x000000, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_OnFadeEnd::FadeDirection' has a wrong offset!");

// Function BPC_RaceSequenceStateIntroduceCourse.BPC_RaceSequenceStateIntroduceCourse_C.OnKeyPressed_Event
// 0x0018 (0x0018 - 0x0000)
struct BPC_RaceSequenceStateIntroduceCourse_C_OnKeyPressed_Event final
{
public:
	struct FKey                                   PressedKey;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateIntroduceCourse_C_OnKeyPressed_Event) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateIntroduceCourse_C_OnKeyPressed_Event");
static_assert(sizeof(BPC_RaceSequenceStateIntroduceCourse_C_OnKeyPressed_Event) == 0x000018, "Wrong size on BPC_RaceSequenceStateIntroduceCourse_C_OnKeyPressed_Event");
static_assert(offsetof(BPC_RaceSequenceStateIntroduceCourse_C_OnKeyPressed_Event, PressedKey) == 0x000000, "Member 'BPC_RaceSequenceStateIntroduceCourse_C_OnKeyPressed_Event::PressedKey' has a wrong offset!");

// Function BPC_RaceSequenceStateIntroduceCourse.BPC_RaceSequenceStateIntroduceCourse_C.ExecuteUbergraph_BPC_RaceSequenceStateIntroduceCourse
// 0x07B0 (0x07B0 - 0x0000)
struct BPC_RaceSequenceStateIntroduceCourse_C_ExecuteUbergraph_BPC_RaceSequenceStateIntroduceCourse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FKey& PressedKey)> K2Node_CreateDelegate_OutputDelegate_1;           // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EStageId>                              CallFunc_GetSelectedStageIds_ReturnValue;          // 0x0038(0x0010)(ReferenceParm)
	class UAppSystemSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreatedVehicles_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStageDataAssetTableRow                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x00E0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture2D*>                     K2Node_MakeArray_Array;                            // 0x0158(0x0010)(ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppSystemSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreatedVehicles_ReturnValue_1;          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDeltaTime;                          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    CallFunc_CreateSequncePlayerByStageId_Out_Actor;   // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateSequncePlayerByStageId_Out_Player;  // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateSequncePlayerByStageId_Out_Result;  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RaceBefore_FinalRound_C*           CallFunc_Create_ReturnValue;                       // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FKey& PressedKey)> K2Node_CreateDelegate_OutputDelegate_3;           // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x01B8(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_PressedKey_1;                   // 0x01D0(0x0018)(HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x2];                                      // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinalRace_ReturnValue;                  // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0200(0x0010)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0218(0x0010)()
	int32                                         CallFunc_GetCurrentRaceCount_ReturnValue;          // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0240(0x0010)()
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate_5;     // 0x0250(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0268(0x0010)()
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0280(0x0010)()
	TArray<EStageId>                              CallFunc_GetSelectedStageIds_ReturnValue_1;        // 0x0290(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x02A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStageDataAssetTableRow                CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x02B8(0x00E0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x039A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B[0x1];                                      // 0x039B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x039C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGrandPrixId                                  CallFunc_GetSelectedGrandPrixId_ReturnValue;       // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinalRace_ReturnValue_1;                // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA[0x2];                                      // 0x03BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_2;          // 0x03BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGrandPrixStages                       CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x03C8(0x0050)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B[0x1];                                      // 0x041B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x0420(0x0010)()
	int32                                         CallFunc_GetMaxRaceCount_ReturnValue;              // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0436(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0437(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x0438(0x0010)()
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGrandPrixId                                  CallFunc_GetSelectedGrandPrixId_ReturnValue_1;     // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_3;          // 0x0454(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGrandPrixStages                       CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0460(0x0050)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_8;            // 0x04B8(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_9;            // 0x04D8(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_10;           // 0x04E8(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_11;           // 0x04F8(0x0010)()
	int32                                         CallFunc_GetCurrentRaceCount_ReturnValue_1;        // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_12;           // 0x0510(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0520(0x0010)(ConstParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARacePlayerController*                  K2Node_DynamicCast_AsRace_Player_Controller;       // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         K2Node_CustomEvent_FadeDirection;                  // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenGrandprixFinalTipsWindow_EnableOpenWindow; // 0x0542(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenGrandprixFinalTipsWindow_EnableOpenWindow_1; // 0x0543(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenGrandprixFinalTipsWindow_EnableOpenWindow_2; // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0545(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0546(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0547(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0580(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x05E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x05E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARaceSequence*                          CallFunc_GetOwnerRaceSequence_ReturnValue;         // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URaceBeforeSharedData*                  CallFunc_GetOrInitializeData_ReturnValue;          // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PrepareRacers_ReturnValue;                // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0608(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARaceSequence*                          CallFunc_GetActorOfClass_ReturnValue;              // 0x0610(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_DynamicCast_As______________2D;             // 0x0618(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0621(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_622[0x2];                                      // 0x0622(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0624(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_635[0x3];                                      // 0x0635(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
