#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateEntryRacer

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "InputCore_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionRun_structs.hpp"
#include "ST_OffsetTransform_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_RaceSequenceStateEntryRacer.BPC_RaceSequenceStateEntryRacer_C.CloseRaceRuleInfoUIForFriendMatch
// 0x0030 (0x0030 - 0x0000)
struct BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch final
{
public:
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARaceSequence*                          CallFunc_GetOwnerRaceSequence_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUnionUISequenceInterface> K2Node_DynamicCast_AsUnion_UISequence_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch");
static_assert(sizeof(BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch) == 0x000030, "Wrong size on BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000000, "Member 'BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch, CallFunc_GetOwnerRaceSequence_ReturnValue) == 0x000008, "Member 'BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch::CallFunc_GetOwnerRaceSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch, K2Node_DynamicCast_AsUnion_UISequence_Interface) == 0x000018, "Member 'BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch::K2Node_DynamicCast_AsUnion_UISequence_Interface' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00002A, "Member 'BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch, CallFunc_BooleanOR_ReturnValue) == 0x00002B, "Member 'BPC_RaceSequenceStateEntryRacer_C_CloseRaceRuleInfoUIForFriendMatch::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateEntryRacer.BPC_RaceSequenceStateEntryRacer_C.GetOffsetTransformByStageId
// 0x02B0 (0x02B0 - 0x0000)
struct BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId final
{
public:
	EStageId                                      In_StageId;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             In_Transform;                                      // 0x0010(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Out_Transform;                                     // 0x0070(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_OffsetTransform                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0110(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0xF];                                      // 0x0171(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0180(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_OffsetTransform                    CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x01E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0xF];                                      // 0x0241(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_1;          // 0x0250(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId) == 0x000010, "Wrong alignment on BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId");
static_assert(sizeof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId) == 0x0002B0, "Wrong size on BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, In_StageId) == 0x000000, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::In_StageId' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, In_Transform) == 0x000010, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::In_Transform' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, Out_Transform) == 0x000070, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::Out_Transform' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, CallFunc_GetEnumeratorName_ReturnValue) == 0x0000D0, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, CallFunc_GetEnumeratorName_ReturnValue_1) == 0x0000D8, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::CallFunc_GetEnumeratorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, CallFunc_Conv_NameToString_ReturnValue) == 0x0000E0, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, CallFunc_Replace_ReturnValue) == 0x0000F0, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, CallFunc_Conv_StringToName_ReturnValue) == 0x000100, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, CallFunc_GetDataTableRowFromName_OutRow) == 0x000110, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000170, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, CallFunc_ComposeTransforms_ReturnValue) == 0x000180, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0001E0, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000240, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId, CallFunc_ComposeTransforms_ReturnValue_1) == 0x000250, "Member 'BPC_RaceSequenceStateEntryRacer_C_GetOffsetTransformByStageId::CallFunc_ComposeTransforms_ReturnValue_1' has a wrong offset!");

// Function BPC_RaceSequenceStateEntryRacer.BPC_RaceSequenceStateEntryRacer_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_RaceSequenceStateEntryRacer_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateEntryRacer_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_RaceSequenceStateEntryRacer_C_OnUpdateState");
static_assert(sizeof(BPC_RaceSequenceStateEntryRacer_C_OnUpdateState) == 0x000004, "Wrong size on BPC_RaceSequenceStateEntryRacer_C_OnUpdateState");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_RaceSequenceStateEntryRacer_C_OnUpdateState::InDeltaTime' has a wrong offset!");

// Function BPC_RaceSequenceStateEntryRacer.BPC_RaceSequenceStateEntryRacer_C.OnKeyPressed_Event
// 0x0018 (0x0018 - 0x0000)
struct BPC_RaceSequenceStateEntryRacer_C_OnKeyPressed_Event final
{
public:
	struct FKey                                   PressedKey;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateEntryRacer_C_OnKeyPressed_Event) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateEntryRacer_C_OnKeyPressed_Event");
static_assert(sizeof(BPC_RaceSequenceStateEntryRacer_C_OnKeyPressed_Event) == 0x000018, "Wrong size on BPC_RaceSequenceStateEntryRacer_C_OnKeyPressed_Event");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_OnKeyPressed_Event, PressedKey) == 0x000000, "Member 'BPC_RaceSequenceStateEntryRacer_C_OnKeyPressed_Event::PressedKey' has a wrong offset!");

// Function BPC_RaceSequenceStateEntryRacer.BPC_RaceSequenceStateEntryRacer_C.ExecuteUbergraph_BPC_RaceSequenceStateEntryRacer
// 0x0240 (0x0240 - 0x0000)
struct BPC_RaceSequenceStateEntryRacer_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRacer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceSequence_C*                     K2Node_DynamicCast_AsBP_Race_Sequence;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetMovieSkipDelaySeconds_Seconds;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRacerCount_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RaceBefore_RuleExplanation_C*      CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              CallFunc_ApplyAuraToRacers_Out_Effects;            // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_PressedKey;                     // 0x0058(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_EntryRacers_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRacerCount_ReturnValue_1;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceLoadTestMode                             CallFunc_GetRaceLoadTestMode_ReturnValue;          // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAppRaceStageSetting                   CallFunc_GetSelectedStageSetting_ReturnValue;      // 0x00F8(0x0004)(NoDestructor)
	int32                                         CallFunc_Array_Random_OutItem;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0xC];                                      // 0x0104(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetOffsetTransformByStageId_Out_Transform; // 0x0110(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARaceSequence*                          CallFunc_GetOwnerRaceSequence_ReturnValue;         // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeZOrder_ReturnValue;                 // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGroupRaceRule                                CallFunc_GetGroupRaceRuleSetting_ReturnValue;      // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasRaceRival_ReturnValue;                 // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0186(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0187(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanProceedSequence_ReturnValue;           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FKey& PressedKey)> K2Node_CreateDelegate_OutputDelegate_3;           // 0x01DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0228(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSkipSequence_ReturnValue;              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateEntryRacer_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRacer) == 0x000010, "Wrong alignment on BPC_RaceSequenceStateEntryRacer_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRacer");
static_assert(sizeof(BPC_RaceSequenceStateEntryRacer_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRacer) == 0x000240, "Wrong size on BPC_RaceSequenceStateEntryRacer_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRacer");
static_assert(offsetof(BPC_RaceSequenceStateEntryRacer_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRacer, EntryPoint) == 0x000000, "Member 'BPC_RaceSequenceStateEntryRacer_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRacer::EntryPoint' has a wrong offset!");
