#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_FriendList

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_FriendList.BPC_FriendList_C
// 0x0020 (0x0168 - 0x0148)
class UBPC_FriendList_C final : public UFriendListState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0148(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_MenuSequence_C*                     MenuSequence;                                      // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bLobbySequence;                                    // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LobbySquadParentActor;                             // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CREATEDELEGATE_PROXYFUNCTION_0(const struct FLobbyId& TargetLobbyId);
	void ExecuteUbergraph_BPC_FriendList(int32 EntryPoint);
	void OnAppNetSendInvitationComplete(bool bInSuccess, const struct FLobbyOperationResult& InResult);
	void OnCreateShortLobbyId(const class FString& ShortLobbyId);
	void OnCreateSquadComplete(bool Successful);
	void OnDestroyFriendListWidget();
	void OnExitState();
	void OnFriendListLobbyIdGet();
	void OnFriendListLobbyIdSearchDecide(const class FString& TargetShortLobbyId);
	void OnFriendListLobbyInvitationAccept(class ULobbyJoinInfo* InLobbyJoinInfo);
	void OnFriendListLobbyInvitationDecide(const class FString& TargetUserId);
	void OnFriendListWidgetDisplayEnd();
	void OnInitState();
	void OnJoinLobbyByLobbyIdSearch(const struct FLobbyId& InLobbyId);
	void OnSearchSquadComplete(bool Successful, const struct FSearchLobbyResult& SearchResult);
	void SetFriendListLobbyIdSearchResult(class UCommonLobbyContext* InLobbyContext, bool bInSuccessful, const struct FSearchLobbyResult& InSearchLobbyResult);
	void SetMenuSequence();
	void SetNextMenuSequenceSubState(EMenuSequenceSubState InState);
	void SetupFooter();
	void SetupFriendListWidget(int32 InZOrder);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_FriendList_C">();
	}
	static class UBPC_FriendList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_FriendList_C>();
	}
};
static_assert(alignof(UBPC_FriendList_C) == 0x000008, "Wrong alignment on UBPC_FriendList_C");
static_assert(sizeof(UBPC_FriendList_C) == 0x000168, "Wrong size on UBPC_FriendList_C");
static_assert(offsetof(UBPC_FriendList_C, UberGraphFrame) == 0x000148, "Member 'UBPC_FriendList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_FriendList_C, MenuSequence) == 0x000150, "Member 'UBPC_FriendList_C::MenuSequence' has a wrong offset!");
static_assert(offsetof(UBPC_FriendList_C, bLobbySequence) == 0x000158, "Member 'UBPC_FriendList_C::bLobbySequence' has a wrong offset!");
static_assert(offsetof(UBPC_FriendList_C, LobbySquadParentActor) == 0x000160, "Member 'UBPC_FriendList_C::LobbySquadParentActor' has a wrong offset!");

}

