#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateResult

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function BPC_RaceSequenceStateResult.BPC_RaceSequenceStateResult_C.ExecuteUbergraph_BPC_RaceSequenceStateResult
// 0x0180 (0x0180 - 0x0000)
struct BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSequenceState                            Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSequenceState                            Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppRaceEventManager*                   CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppRaceEventManager*                   CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSequenceState                            Temp_byte_Variable_2;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacers*                           CallFunc_GetRacersRef_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARaceSequence*                          CallFunc_GetOwnerRaceSequence_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceSequence_C*                     K2Node_DynamicCast_AsBP_Race_Sequence;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHierarchicalStateMachine*              CallFunc_GetChildStateMachine_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceResultSequence_C*               K2Node_DynamicCast_AsBP_Race_Result_Sequence;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSequenceState                            Temp_byte_Variable_3;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRaceUI*                           CallFunc_GetRaceHUDRef_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   Temp_byte_Variable_4;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDoingResultRivalTeamEliminatedEvent_ReturnValue; // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetNextRaceSequenceState_ReturnValue;     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_2;      // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerTotalRaceCount_ReturnValue;      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsRivalSkinExistsGameMode_ReturnValue; // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetPlateId                                CallFunc_GetGadgetPlateId_ReturnValue;             // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGadgetPlateData                       CallFunc_GetGadgetPlateData_OutGadgetPlateData;    // 0x0090(0x0030)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetTargetWidget_WidgetBluePrint;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRewardUpdateNeeded_ReturnValue;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetNextRaceSequenceState_ReturnValue_1;   // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSequenceState                            Temp_byte_Variable_5;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRacers*                           CallFunc_GetRacersRef_ReturnValue_1;               // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHierarchicalStateMachine*              CallFunc_GetChildStateMachine_ReturnValue_1;       // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceResultSequence_C*               K2Node_DynamicCast_AsBP_Race_Result_Sequence_1;    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSequenceState                            Temp_byte_Variable_6;                              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSequenceState                            Temp_byte_Variable_7;                              // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSequenceState                            Temp_byte_Variable_8;                              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_RewardAchievementManager_C*         CallFunc_SpawnObject_ReturnValue;                  // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERaceSequenceState                            Temp_byte_Variable_9;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSequenceState                            Temp_byte_Variable_10;                             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSequenceState                            Temp_byte_Variable_11;                             // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFestaIdUtil_ReturnValue;               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSequenceState                            K2Node_Select_Default;                             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetNextRaceSequenceState_ReturnValue_2;   // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGroupRace_ReturnValue;                  // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupResult_C*                     CallFunc_Create_ReturnValue_1;                     // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0168(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult");
static_assert(sizeof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult) == 0x000180, "Wrong size on BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, EntryPoint) == 0x000000, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, Temp_byte_Variable) == 0x000004, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, Temp_byte_Variable_1) == 0x000005, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_MakeLiteralByte_ReturnValue) == 0x000006, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_IsValid_ReturnValue) == 0x000007, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_IsInViewport_ReturnValue) == 0x00000C, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000010, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000018, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, Temp_byte_Variable_2) == 0x000021, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetRacersRef_ReturnValue) == 0x000028, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetRacersRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetOwnerRaceSequence_ReturnValue) == 0x000030, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetOwnerRaceSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_DynamicCast_AsBP_Race_Sequence) == 0x000038, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_DynamicCast_AsBP_Race_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_IsValid_ReturnValue_2) == 0x000041, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_IsShippingBuild_ReturnValue) == 0x000042, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_IsShippingBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetChildStateMachine_ReturnValue) == 0x000048, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetChildStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_DynamicCast_AsBP_Race_Result_Sequence) == 0x000050, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_DynamicCast_AsBP_Race_Result_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, Temp_byte_Variable_3) == 0x000059, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetRaceHUDRef_ReturnValue) == 0x000060, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetRaceHUDRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, Temp_byte_Variable_4) == 0x000068, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000069, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetPlayerControllerID_ReturnValue) == 0x00007C, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetPlayerControllerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetSelectedGameModeId_ReturnValue_1) == 0x000080, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetSelectedGameModeId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_IsValid_ReturnValue_3) == 0x000081, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_SwitchEnum_CmpSuccess_1) == 0x000082, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_CheckDoingResultRivalTeamEliminatedEvent_ReturnValue) == 0x000083, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_CheckDoingResultRivalTeamEliminatedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_SetNextRaceSequenceState_ReturnValue) == 0x000084, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_SetNextRaceSequenceState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetSelectedGameModeId_ReturnValue_2) == 0x000085, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetSelectedGameModeId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetPlayerTotalRaceCount_ReturnValue) == 0x000088, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetPlayerTotalRaceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetIsRivalSkinExistsGameMode_ReturnValue) == 0x00008C, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetIsRivalSkinExistsGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetGadgetPlateId_ReturnValue) == 0x00008D, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetGadgetPlateId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetGadgetPlateData_OutGadgetPlateData) == 0x000090, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetGadgetPlateData_OutGadgetPlateData' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000C0, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0000C8, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetTargetWidget_WidgetBluePrint) == 0x0000D0, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetTargetWidget_WidgetBluePrint' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_Create_ReturnValue) == 0x0000D8, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_IsRewardUpdateNeeded_ReturnValue) == 0x0000E0, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_IsRewardUpdateNeeded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_SetNextRaceSequenceState_ReturnValue_1) == 0x0000E1, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_SetNextRaceSequenceState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_MakeLiteralDouble_ReturnValue) == 0x0000E8, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, Temp_byte_Variable_5) == 0x0000F0, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_CreateDelegate_OutputDelegate) == 0x0000F4, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000108, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_CreateDelegate_OutputDelegate_1) == 0x000110, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetRacersRef_ReturnValue_1) == 0x000120, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetRacersRef_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetChildStateMachine_ReturnValue_1) == 0x000128, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetChildStateMachine_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_DynamicCast_AsBP_Race_Result_Sequence_1) == 0x000130, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_DynamicCast_AsBP_Race_Result_Sequence_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_DynamicCast_bSuccess_2) == 0x000138, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, Temp_byte_Variable_6) == 0x000139, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_IsValid_ReturnValue_4) == 0x00013A, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, Temp_byte_Variable_7) == 0x00013B, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, Temp_byte_Variable_8) == 0x00013C, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_SpawnObject_ReturnValue) == 0x000140, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, Temp_byte_Variable_9) == 0x000148, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, Temp_byte_Variable_10) == 0x000149, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, Temp_byte_Variable_11) == 0x00014A, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetFestaIdUtil_ReturnValue) == 0x00014C, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetFestaIdUtil_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_Select_Default) == 0x000150, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_SetNextRaceSequenceState_ReturnValue_2) == 0x000151, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_SetNextRaceSequenceState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_IsGroupRace_ReturnValue) == 0x000152, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_IsGroupRace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_GetPlayerController_ReturnValue_2) == 0x000158, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_Create_ReturnValue_1) == 0x000160, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_CreateDelegate_OutputDelegate_2) == 0x000168, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, K2Node_Event_EndPlayReason) == 0x000178, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x00017C, "Member 'BPC_RaceSequenceStateResult_C_ExecuteUbergraph_BPC_RaceSequenceStateResult::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BPC_RaceSequenceStateResult.BPC_RaceSequenceStateResult_C.GetAddTicket
// 0x00A0 (0x00A0 - 0x0000)
struct BPC_RaceSequenceStateResult_C_GetAddTicket final
{
public:
	int32                                         AddTickets;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Point;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ERewardRedStarRingType>                CallFunc_GetRewardRedStarRingTypeList_OutRewardRedStarRingTypes; // 0x0018(0x0010)(ReferenceParm)
	TArray<struct FHonorCommendationData>         CallFunc_GetRewardRedStarRingTypeList_OutRSRHonorList; // 0x0028(0x0010)(ReferenceParm)
	struct FPlayerLevelInfo                       CallFunc_SaveResult_OutPlayerLevelInfo;            // 0x0038(0x0014)(NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRewardRedStarRingData>         CallFunc_SaveResult_OutRedStarRingData;            // 0x0050(0x0010)(ReferenceParm)
	TArray<struct FResultRewardItemInfo>          CallFunc_MakeResultRewardItemInfos_Output;         // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResultRewardItemInfo                  CallFunc_Array_Get_Item;                           // 0x0078(0x0020)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateResult_C_GetAddTicket) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateResult_C_GetAddTicket");
static_assert(sizeof(BPC_RaceSequenceStateResult_C_GetAddTicket) == 0x0000A0, "Wrong size on BPC_RaceSequenceStateResult_C_GetAddTicket");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, AddTickets) == 0x000000, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::AddTickets' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, Point) == 0x000004, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::Point' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, CallFunc_GetRewardRedStarRingTypeList_OutRewardRedStarRingTypes) == 0x000018, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::CallFunc_GetRewardRedStarRingTypeList_OutRewardRedStarRingTypes' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, CallFunc_GetRewardRedStarRingTypeList_OutRSRHonorList) == 0x000028, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::CallFunc_GetRewardRedStarRingTypeList_OutRSRHonorList' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, CallFunc_SaveResult_OutPlayerLevelInfo) == 0x000038, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::CallFunc_SaveResult_OutPlayerLevelInfo' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, CallFunc_SaveResult_OutRedStarRingData) == 0x000050, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::CallFunc_SaveResult_OutRedStarRingData' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, CallFunc_MakeResultRewardItemInfos_Output) == 0x000060, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::CallFunc_MakeResultRewardItemInfos_Output' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, CallFunc_Array_Get_Item) == 0x000078, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetAddTicket, CallFunc_Add_IntInt_ReturnValue_1) == 0x00009C, "Member 'BPC_RaceSequenceStateResult_C_GetAddTicket::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BPC_RaceSequenceStateResult.BPC_RaceSequenceStateResult_C.GetTargetWidget
// 0x0058 (0x0058 - 0x0000)
struct BPC_RaceSequenceStateResult_C_GetTargetWidget final
{
public:
	class UClass*                                 WidgetBlueprint;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Widget;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_2;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default_1;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateResult_C_GetTargetWidget) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateResult_C_GetTargetWidget");
static_assert(sizeof(BPC_RaceSequenceStateResult_C_GetTargetWidget) == 0x000058, "Wrong size on BPC_RaceSequenceStateResult_C_GetTargetWidget");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, WidgetBlueprint) == 0x000000, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::WidgetBlueprint' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, Widget) == 0x000008, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::Widget' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, Temp_bool_Variable) == 0x000010, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, Temp_class_Variable) == 0x000018, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, Temp_class_Variable_1) == 0x000020, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, Temp_bool_Variable_1) == 0x000028, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, Temp_class_Variable_2) == 0x000030, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000038, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x00003C, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, K2Node_Select_Default) == 0x000048, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_GetTargetWidget, K2Node_Select_Default_1) == 0x000050, "Member 'BPC_RaceSequenceStateResult_C_GetTargetWidget::K2Node_Select_Default_1' has a wrong offset!");

// Function BPC_RaceSequenceStateResult.BPC_RaceSequenceStateResult_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BPC_RaceSequenceStateResult_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateResult_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BPC_RaceSequenceStateResult_C_ReceiveEndPlay");
static_assert(sizeof(BPC_RaceSequenceStateResult_C_ReceiveEndPlay) == 0x000001, "Wrong size on BPC_RaceSequenceStateResult_C_ReceiveEndPlay");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BPC_RaceSequenceStateResult_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BPC_RaceSequenceStateResult.BPC_RaceSequenceStateResult_C.SaveDonpaTicket
// 0x000C (0x000C - 0x0000)
struct BPC_RaceSequenceStateResult_C_SaveDonpaTicket final
{
public:
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAddTicket_AddTickets;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateResult_C_SaveDonpaTicket) == 0x000004, "Wrong alignment on BPC_RaceSequenceStateResult_C_SaveDonpaTicket");
static_assert(sizeof(BPC_RaceSequenceStateResult_C_SaveDonpaTicket) == 0x00000C, "Wrong size on BPC_RaceSequenceStateResult_C_SaveDonpaTicket");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_SaveDonpaTicket, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000000, "Member 'BPC_RaceSequenceStateResult_C_SaveDonpaTicket::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateResult_C_SaveDonpaTicket, CallFunc_GetAddTicket_AddTickets) == 0x000004, "Member 'BPC_RaceSequenceStateResult_C_SaveDonpaTicket::CallFunc_GetAddTicket_AddTickets' has a wrong offset!");
