#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RivalSelectState

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_RivalSelectState.BPC_RivalSelectState_C.CreateTipsWindow
// 0x0010 (0x0010 - 0x0000)
struct BPC_RivalSelectState_C_CreateTipsWindow final
{
public:
	class UHintPopupWindow*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Popup_Window_Hint_C*               CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RivalSelectState_C_CreateTipsWindow) == 0x000008, "Wrong alignment on BPC_RivalSelectState_C_CreateTipsWindow");
static_assert(sizeof(BPC_RivalSelectState_C_CreateTipsWindow) == 0x000010, "Wrong size on BPC_RivalSelectState_C_CreateTipsWindow");
static_assert(offsetof(BPC_RivalSelectState_C_CreateTipsWindow, ReturnValue) == 0x000000, "Member 'BPC_RivalSelectState_C_CreateTipsWindow::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RivalSelectState_C_CreateTipsWindow, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BPC_RivalSelectState_C_CreateTipsWindow::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BPC_RivalSelectState.BPC_RivalSelectState_C.ExecuteUbergraph_BPC_RivalSelectState
// 0x0018 (0x0018 - 0x0000)
struct BPC_RivalSelectState_C_ExecuteUbergraph_BPC_RivalSelectState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RivalSelectState_C_ExecuteUbergraph_BPC_RivalSelectState) == 0x000008, "Wrong alignment on BPC_RivalSelectState_C_ExecuteUbergraph_BPC_RivalSelectState");
static_assert(sizeof(BPC_RivalSelectState_C_ExecuteUbergraph_BPC_RivalSelectState) == 0x000018, "Wrong size on BPC_RivalSelectState_C_ExecuteUbergraph_BPC_RivalSelectState");
static_assert(offsetof(BPC_RivalSelectState_C_ExecuteUbergraph_BPC_RivalSelectState, EntryPoint) == 0x000000, "Member 'BPC_RivalSelectState_C_ExecuteUbergraph_BPC_RivalSelectState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_RivalSelectState_C_ExecuteUbergraph_BPC_RivalSelectState, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BPC_RivalSelectState_C_ExecuteUbergraph_BPC_RivalSelectState::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RivalSelectState_C_ExecuteUbergraph_BPC_RivalSelectState, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BPC_RivalSelectState_C_ExecuteUbergraph_BPC_RivalSelectState::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

