#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_TimeTrialSelectCourse

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionLib_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_TimeTrialSelectCourse.BPC_TimeTrialSelectCourse_C
// 0x0110 (0x02E0 - 0x01D0)
class UBPC_TimeTrialSelectCourse_C final : public UTimeTrialSelectCourseState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonMenuFooterMenu*                  Footer;                                            // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CourseSelectWidgetClassRef;                        // 0x01E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bSelected;                                         // 0x0208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            LastRegisterd;                                     // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        LastRegisterdSubMenus;                             // 0x0218(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_TimeTrial_Sub_ModeSelect_C*        TimeTrialSubModeSelect;                            // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bGoToClassSelect;                                  // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TimeTrial_Sub_Online_C*            OnlineReadyWidget;                                 // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_Offline_C*           OfflineReadyWidget;                                // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CMN_FinalCheck_2_C*                NormalReadyWidget;                                 // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuInputRecieveObject*                SubInputReciever;                                  // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bStartPressed;                                     // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRightShoulderPressed;                             // 0x0259(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLeftShoulderPressed;                              // 0x025A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B[0x1];                                      // 0x025B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentDebugLevel;                                 // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, double>                           Level_Persent;                                     // 0x0260(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_TimeTrialSequence_C*                TimeTrialSequence;                                 // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                TargetTimePerStageSuperSonicSpeedDataTarble;       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                TargetTimePerStageSonicSpeedDataTarble_0;          // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                RankRatioDataTarble;                               // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_Popup_Window_Hint_C*               TipsWindow;                                        // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHintId                                       OpenTipsId;                                        // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _OnSpecialPressedEvent_Event(class UObject* Object);
	void ExecuteUbergraph_BPC_TimeTrialSelectCourse(int32 EntryPoint);
	void FocusMenu();
	void InitSubCommand();
	void OnCourseSelectBackToClassSelect(class UCourseSelectSubCategoryIcon* SelectedGrandprixButton);
	void OnCourseSelectGadgetCustomSelected(class UCourseSelectSubCategoryIcon* SelectedGrandprixButton);
	void OnCourseSelectGrandprixCancel(class UCourseSelectSubCategoryIcon* SelectedGrandprixButton);
	void OnDecideGrandprixId(EGrandPrixId SelectedGrandprixId_0, EStageId FirstCourseStageId);
	void OnDecideStageId(EStageId SelectedCourseStageId);
	void OnExitState();
	void OnInitState();
	void OnLeftShoulderPressedEvent_Event(class UObject* Object);
	void OnLeftShoulderReleasedEvent_Event(class UObject* Object);
	void OnLoaded_2818D6214851B5A07B8199A904D33989(TSubclassOf<class UObject> Loaded);
	void OnRightShoulderPressedEvent_Event(class UObject* Object);
	void OnRightShoulderReleasedEvent_Event(class UObject* Object);
	void OnSpecialReleasedEvent(class UObject* Object);
	void OnStoreDialogCompletedBP();
	void OnStoreRequested(bool GrandPrixSelecting);
	void SetupBindEvent();
	void SetupFooter();
	void ShoulderButtonCheck();
	void ShowTipsWindow(EHintId InHintId);
	void StartSelectCourse();
	void TipsWindow_CloseEndDelegate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_TimeTrialSelectCourse_C">();
	}
	static class UBPC_TimeTrialSelectCourse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_TimeTrialSelectCourse_C>();
	}
};
static_assert(alignof(UBPC_TimeTrialSelectCourse_C) == 0x000008, "Wrong alignment on UBPC_TimeTrialSelectCourse_C");
static_assert(sizeof(UBPC_TimeTrialSelectCourse_C) == 0x0002E0, "Wrong size on UBPC_TimeTrialSelectCourse_C");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, UberGraphFrame) == 0x0001D0, "Member 'UBPC_TimeTrialSelectCourse_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, Footer) == 0x0001D8, "Member 'UBPC_TimeTrialSelectCourse_C::Footer' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, CourseSelectWidgetClassRef) == 0x0001E0, "Member 'UBPC_TimeTrialSelectCourse_C::CourseSelectWidgetClassRef' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, bSelected) == 0x000208, "Member 'UBPC_TimeTrialSelectCourse_C::bSelected' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, LastRegisterd) == 0x000210, "Member 'UBPC_TimeTrialSelectCourse_C::LastRegisterd' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, LastRegisterdSubMenus) == 0x000218, "Member 'UBPC_TimeTrialSelectCourse_C::LastRegisterdSubMenus' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, TimeTrialSubModeSelect) == 0x000228, "Member 'UBPC_TimeTrialSelectCourse_C::TimeTrialSubModeSelect' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, bGoToClassSelect) == 0x000230, "Member 'UBPC_TimeTrialSelectCourse_C::bGoToClassSelect' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, OnlineReadyWidget) == 0x000238, "Member 'UBPC_TimeTrialSelectCourse_C::OnlineReadyWidget' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, OfflineReadyWidget) == 0x000240, "Member 'UBPC_TimeTrialSelectCourse_C::OfflineReadyWidget' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, NormalReadyWidget) == 0x000248, "Member 'UBPC_TimeTrialSelectCourse_C::NormalReadyWidget' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, SubInputReciever) == 0x000250, "Member 'UBPC_TimeTrialSelectCourse_C::SubInputReciever' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, bStartPressed) == 0x000258, "Member 'UBPC_TimeTrialSelectCourse_C::bStartPressed' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, bRightShoulderPressed) == 0x000259, "Member 'UBPC_TimeTrialSelectCourse_C::bRightShoulderPressed' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, bLeftShoulderPressed) == 0x00025A, "Member 'UBPC_TimeTrialSelectCourse_C::bLeftShoulderPressed' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, CurrentDebugLevel) == 0x00025C, "Member 'UBPC_TimeTrialSelectCourse_C::CurrentDebugLevel' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, Level_Persent) == 0x000260, "Member 'UBPC_TimeTrialSelectCourse_C::Level_Persent' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, TimeTrialSequence) == 0x0002B0, "Member 'UBPC_TimeTrialSelectCourse_C::TimeTrialSequence' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, TargetTimePerStageSuperSonicSpeedDataTarble) == 0x0002B8, "Member 'UBPC_TimeTrialSelectCourse_C::TargetTimePerStageSuperSonicSpeedDataTarble' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, TargetTimePerStageSonicSpeedDataTarble_0) == 0x0002C0, "Member 'UBPC_TimeTrialSelectCourse_C::TargetTimePerStageSonicSpeedDataTarble_0' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, RankRatioDataTarble) == 0x0002C8, "Member 'UBPC_TimeTrialSelectCourse_C::RankRatioDataTarble' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, TipsWindow) == 0x0002D0, "Member 'UBPC_TimeTrialSelectCourse_C::TipsWindow' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialSelectCourse_C, OpenTipsId) == 0x0002D8, "Member 'UBPC_TimeTrialSelectCourse_C::OpenTipsId' has a wrong offset!");

}

