#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceResultReward

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function BPC_RaceResultReward.BPC_RaceResultReward_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_RaceResultReward_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultReward_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_RaceResultReward_C_OnUpdateState");
static_assert(sizeof(BPC_RaceResultReward_C_OnUpdateState) == 0x000004, "Wrong size on BPC_RaceResultReward_C_OnUpdateState");
static_assert(offsetof(BPC_RaceResultReward_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_RaceResultReward_C_OnUpdateState::InDeltaTime' has a wrong offset!");

// Function BPC_RaceResultReward.BPC_RaceResultReward_C.ExecuteUbergraph_BPC_RaceResultReward
// 0x0078 (0x0078 - 0x0000)
struct BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGroupRaceFestaColor_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGroupRaceFestaColor_ReturnValue_1;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGroupRace_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGroupRace_ReturnValue_1;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_2;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RaceResultSequence_C*               K2Node_DynamicCast_AsBP_Race_Result_Sequence;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyRaceRivalExists_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetResultRivalTeamEliminated_ReturnValue; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResultRivalTeamPlayerWin_ReturnValue;   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsRivalSkinExistsGameMode_ReturnValue; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResultRivalTeamPlayerWin_ReturnValue_1; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FestaResult_PointReward_C*         CallFunc_SpawnObject_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARaceSequence*                          CallFunc_GetOwnerRaceSequence_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLimitRewardInRaceParkMilestoneVersion_ReturnValue; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward) == 0x000008, "Wrong alignment on BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward");
static_assert(sizeof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward) == 0x000078, "Wrong size on BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, EntryPoint) == 0x000000, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_IsGroupRaceFestaColor_ReturnValue) == 0x000004, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_IsGroupRaceFestaColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_IsGroupRaceFestaColor_ReturnValue_1) == 0x000005, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_IsGroupRaceFestaColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_IsGroupRace_ReturnValue) == 0x000006, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_IsGroupRace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_IsGroupRace_ReturnValue_1) == 0x000007, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_IsGroupRace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000008, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_GetSelectedGameModeId_ReturnValue_1) == 0x000009, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_GetSelectedGameModeId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, K2Node_SwitchEnum_CmpSuccess_1) == 0x00000B, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_GetSelectedGameModeId_ReturnValue_2) == 0x00000C, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_GetSelectedGameModeId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, K2Node_SwitchEnum_CmpSuccess_2) == 0x00000D, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_GetOwnerStateMachine_ReturnValue) == 0x000010, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_GetOwnerStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_MakeLiteralByte_ReturnValue) == 0x000018, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, K2Node_DynamicCast_AsBP_Race_Result_Sequence) == 0x000020, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::K2Node_DynamicCast_AsBP_Race_Result_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00002C, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_IsPartyRaceRivalExists_ReturnValue) == 0x000030, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_IsPartyRaceRivalExists_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_GetResultRivalTeamEliminated_ReturnValue) == 0x000031, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_GetResultRivalTeamEliminated_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000032, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_Not_PreBool_ReturnValue) == 0x000033, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000034, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000038, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_IsResultRivalTeamPlayerWin_ReturnValue) == 0x000039, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_IsResultRivalTeamPlayerWin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x00003C, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000040, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_GetIsRivalSkinExistsGameMode_ReturnValue) == 0x000041, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_GetIsRivalSkinExistsGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000044, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_IsResultRivalTeamPlayerWin_ReturnValue_1) == 0x000048, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_IsResultRivalTeamPlayerWin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_SpawnObject_ReturnValue) == 0x000050, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000058, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00005C, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, K2Node_Event_InDeltaTime) == 0x000060, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_GetOwnerRaceSequence_ReturnValue) == 0x000068, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_GetOwnerRaceSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_IsLimitRewardInRaceParkMilestoneVersion_ReturnValue) == 0x000070, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_IsLimitRewardInRaceParkMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000071, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000074, "Member 'BPC_RaceResultReward_C_ExecuteUbergraph_BPC_RaceResultReward::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");

}

