#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateEntryRacer

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_RaceSequenceStateEntryRacer.BPC_RaceSequenceStateEntryRacer_C
// 0x0028 (0x0148 - 0x0120)
class UBPC_RaceSequenceStateEntryRacer_C final : public URaceSequenceStateEntryRacer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0120(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UNiagaraComponent*>              Out_Effects;                                       // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ABP_EntryRacers_C*                      PlayerObject;                                      // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CameraOffsetDataTable;                             // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CloseRaceRuleInfoUIForFriendMatch();
	void GetOffsetTransformByStageId(EStageId In_StageId, const struct FTransform& In_Transform, struct FTransform* Out_Transform);
	void OnInitState();
	void OnUpdateState(float InDeltaTime);
	void OnExitState();
	void OnFinishedPlay_Sequence();
	void OnChangeSequence();
	void OnKeyPressed_Event(const struct FKey& PressedKey);
	void OnScenePlayerFinishedUI();
	void OnFullScreenMouseClick();
	void OnEnabledSkip();
	void ExecuteUbergraph_BPC_RaceSequenceStateEntryRacer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_RaceSequenceStateEntryRacer_C">();
	}
	static class UBPC_RaceSequenceStateEntryRacer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_RaceSequenceStateEntryRacer_C>();
	}
};
static_assert(alignof(UBPC_RaceSequenceStateEntryRacer_C) == 0x000008, "Wrong alignment on UBPC_RaceSequenceStateEntryRacer_C");
static_assert(sizeof(UBPC_RaceSequenceStateEntryRacer_C) == 0x000148, "Wrong size on UBPC_RaceSequenceStateEntryRacer_C");
static_assert(offsetof(UBPC_RaceSequenceStateEntryRacer_C, UberGraphFrame) == 0x000120, "Member 'UBPC_RaceSequenceStateEntryRacer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateEntryRacer_C, Out_Effects) == 0x000128, "Member 'UBPC_RaceSequenceStateEntryRacer_C::Out_Effects' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateEntryRacer_C, PlayerObject) == 0x000138, "Member 'UBPC_RaceSequenceStateEntryRacer_C::PlayerObject' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateEntryRacer_C, CameraOffsetDataTable) == 0x000140, "Member 'UBPC_RaceSequenceStateEntryRacer_C::CameraOffsetDataTable' has a wrong offset!");

}

