#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MachineCustomizeStickerSelectState

#include "Basic.hpp"

#include "ST_StickerPresetPageData_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_StickerPresetPageItemData_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_MachineCustomizeStickerSelectState.BPC_MachineCustomizeStickerSelectState_C
// 0x0180 (0x0280 - 0x0100)
class UBPC_MachineCustomizeStickerSelectState_C final : public UMachineCustomizeStickerSelectState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_MachineCustom_Sub_StickerSelect_C* StickerSelectWindow;                               // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_MachineCustomizeSequence_C*         Sequence;                                          // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerPreview_C*                 Racer;                                             // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_StickerMasterSystem_C*              Sticker_Master_System;                             // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LastFocusScale;                                    // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_DonpaTicketApp_C*                  RewardDialog;                                      // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FST_StickerPresetPageItemData          LastItemData;                                      // 0x0140(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector2D                              TempScale;                                         // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUnionStickerBase*                      SelectedSticker;                                   // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPurchaseWindowOpen;                              // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnlockWindowOpen;                                // 0x01A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCanceled;                                       // 0x01AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x1];                                      // 0x01AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserStickerData                       SelectedUserStickerData;                           // 0x01AC(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GarageCamera_C*                     GarageCamera;                                      // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_Turntable_C*                        Turntable;                                         // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialize;                                     // 0x01E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x01E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_StickerPresetPageData              Sticker_Page_Data;                                 // 0x01F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector2D                              AdjustScale;                                       // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHintPopupWindow*                       TipsWindow;                                        // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuInputRecieveObject*                Input_Receiver;                                    // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharaMachineParamWindow*               Param_Window;                                      // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowBase*                PopupWindow_OverrideWarning;                       // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FST_StickerPresetPageItemData          InitialStickerItem;                                // 0x0230(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Bind();
	void CreateDialog();
	void DeleteDialog();
	void ExecuteUbergraph_BPC_MachineCustomizeStickerSelectState(int32 EntryPoint);
	void HideFooter();
	void HidePopupWindow();
	void LeftShoulderEvent(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnExitState();
	void OnFocusedEvent(const struct FST_StickerPresetPageItemData& ItemData, int32 InPlayerIndex, int32 ButtonIndex);
	void OnInitState();
	void OpenTipsWindow(EHintId InHintId);
	void OverrideStickers(TArray<class AActor*>& OverlapStickers, bool IsRear);
	void PopupWindow_OnDecision(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void RewardDialog_Purchase_OnResult(EDialogResult Result);
	void RewardDialog_Unlock_OnResult(EDialogResult Result);
	void RightShoulderEvent(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void SetActiveAuraEffect(bool IsActive_0);
	void SetExtraSticker(bool IsExtra, bool IsRear, EExtraStickerPattern Pattern);
	void SetFrontMaterial(class UTexture* Texture);
	void SetRearMaterial(class UTexture* Texture);
	void SetStickerColor(bool IsColorChangeable, class AUnionStickerBase* Sticker);
	void SettingStickersScale(TArray<struct FUserStickerData>& Array);
	void SetupFooter();
	void SetupRewardDialogPurchase();
	void SetupRewardDialogUnlock();
	void SetupStickerMasterSystem();
	void SetupStickerSelect();
	void ShowPopupWindow();
	void ShowTips();
	void StartOpenTipsWindow();
	void StickerSelectPage_OnCancel(int32 InPlayerIndex);
	void StickerSelectPage_OnItemSelected(const struct FST_StickerPresetPageItemData& ItemData, int32 InPlayerIndex);
	void StickerSelectPage_OnPurchaseAnimFinished();
	void TipsWindow_CloseTipsWindow();
	void TurnStickerFrameVisible(class AUnionStickerBase* Sticker, bool IsVisible);
	void Unbind();

	void IsOpenTabControlTipsWindow(bool* bEnableOpenWindow) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_MachineCustomizeStickerSelectState_C">();
	}
	static class UBPC_MachineCustomizeStickerSelectState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_MachineCustomizeStickerSelectState_C>();
	}
};
static_assert(alignof(UBPC_MachineCustomizeStickerSelectState_C) == 0x000008, "Wrong alignment on UBPC_MachineCustomizeStickerSelectState_C");
static_assert(sizeof(UBPC_MachineCustomizeStickerSelectState_C) == 0x000280, "Wrong size on UBPC_MachineCustomizeStickerSelectState_C");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, UberGraphFrame) == 0x000100, "Member 'UBPC_MachineCustomizeStickerSelectState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, StickerSelectWindow) == 0x000108, "Member 'UBPC_MachineCustomizeStickerSelectState_C::StickerSelectWindow' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, Sequence) == 0x000110, "Member 'UBPC_MachineCustomizeStickerSelectState_C::Sequence' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, Racer) == 0x000118, "Member 'UBPC_MachineCustomizeStickerSelectState_C::Racer' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, Sticker_Master_System) == 0x000120, "Member 'UBPC_MachineCustomizeStickerSelectState_C::Sticker_Master_System' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, LastFocusScale) == 0x000128, "Member 'UBPC_MachineCustomizeStickerSelectState_C::LastFocusScale' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, RewardDialog) == 0x000138, "Member 'UBPC_MachineCustomizeStickerSelectState_C::RewardDialog' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, LastItemData) == 0x000140, "Member 'UBPC_MachineCustomizeStickerSelectState_C::LastItemData' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, TempScale) == 0x000190, "Member 'UBPC_MachineCustomizeStickerSelectState_C::TempScale' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, SelectedSticker) == 0x0001A0, "Member 'UBPC_MachineCustomizeStickerSelectState_C::SelectedSticker' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, IsPurchaseWindowOpen) == 0x0001A8, "Member 'UBPC_MachineCustomizeStickerSelectState_C::IsPurchaseWindowOpen' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, IsUnlockWindowOpen) == 0x0001A9, "Member 'UBPC_MachineCustomizeStickerSelectState_C::IsUnlockWindowOpen' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, bIsCanceled) == 0x0001AA, "Member 'UBPC_MachineCustomizeStickerSelectState_C::bIsCanceled' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, SelectedUserStickerData) == 0x0001AC, "Member 'UBPC_MachineCustomizeStickerSelectState_C::SelectedUserStickerData' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, GarageCamera) == 0x0001D8, "Member 'UBPC_MachineCustomizeStickerSelectState_C::GarageCamera' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, Turntable) == 0x0001E0, "Member 'UBPC_MachineCustomizeStickerSelectState_C::Turntable' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, bIsInitialize) == 0x0001E8, "Member 'UBPC_MachineCustomizeStickerSelectState_C::bIsInitialize' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, NewVar) == 0x0001E9, "Member 'UBPC_MachineCustomizeStickerSelectState_C::NewVar' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, Sticker_Page_Data) == 0x0001F0, "Member 'UBPC_MachineCustomizeStickerSelectState_C::Sticker_Page_Data' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, AdjustScale) == 0x000200, "Member 'UBPC_MachineCustomizeStickerSelectState_C::AdjustScale' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, TipsWindow) == 0x000210, "Member 'UBPC_MachineCustomizeStickerSelectState_C::TipsWindow' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, Input_Receiver) == 0x000218, "Member 'UBPC_MachineCustomizeStickerSelectState_C::Input_Receiver' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, Param_Window) == 0x000220, "Member 'UBPC_MachineCustomizeStickerSelectState_C::Param_Window' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, PopupWindow_OverrideWarning) == 0x000228, "Member 'UBPC_MachineCustomizeStickerSelectState_C::PopupWindow_OverrideWarning' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerSelectState_C, InitialStickerItem) == 0x000230, "Member 'UBPC_MachineCustomizeStickerSelectState_C::InitialStickerItem' has a wrong offset!");

}

