#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_CharaSelectState

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UnionLib_structs.hpp"


namespace SDK::Params
{

// Function BPC_CharaSelectState.BPC_CharaSelectState_C.ExecuteUbergraph_BPC_CharaSelectState
// 0x0038 (0x0038 - 0x0000)
struct BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaMachineSelectSequence*            CallFunc_GetSequence_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelLoaded_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppSequenceLogManagerSubsystem*        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharaMachineSelectSequence*            CallFunc_GetSequence_ReturnValue_1;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetSelectedDriverId_OutId;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOutputExecsPin_SuccessFailed                 CallFunc_GetSelectedDriverId_OutExecsPin;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState) == 0x000008, "Wrong alignment on BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState");
static_assert(sizeof(BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState) == 0x000038, "Wrong size on BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState");
static_assert(offsetof(BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState, EntryPoint) == 0x000000, "Member 'BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState, CallFunc_GetSequence_ReturnValue) == 0x000008, "Member 'BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState::CallFunc_GetSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState, CallFunc_IsLevelLoaded_ReturnValue) == 0x000010, "Member 'BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState::CallFunc_IsLevelLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState, CallFunc_GetSequence_ReturnValue_1) == 0x000020, "Member 'BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState::CallFunc_GetSequence_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState, CallFunc_MakeLiteralInt_ReturnValue) == 0x000028, "Member 'BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState, CallFunc_GetSelectedDriverId_OutId) == 0x00002C, "Member 'BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState::CallFunc_GetSelectedDriverId_OutId' has a wrong offset!");
static_assert(offsetof(BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState, CallFunc_GetSelectedDriverId_OutExecsPin) == 0x00002D, "Member 'BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState::CallFunc_GetSelectedDriverId_OutExecsPin' has a wrong offset!");
static_assert(offsetof(BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState, K2Node_SwitchEnum_CmpSuccess) == 0x00002E, "Member 'BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState, CallFunc_Delay_Duration_ImplicitCast) == 0x000030, "Member 'BPC_CharaSelectState_C_ExecuteUbergraph_BPC_CharaSelectState::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

