#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceResultStats

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_RaceResultStats.BPC_RaceResultStats_C
// 0x0028 (0x0130 - 0x0108)
class UBPC_RaceResultStats_C final : public URaceResultSequenceStateRaceStats
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_RaceResultSequence_C*               OwnerSeq;                                          // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_WinLose_C*           TimeTrialWinLoseWidget;                            // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETimeTrialWinLoseDispId                       TimeTrialWinLoseEnum;                              // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           UnloadEventHandle;                                 // 0x0128(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DispRaceResult();
	void ExecuteUbergraph_BPC_RaceResultStats(int32 EntryPoint);
	void Finished_615A47C04CDE41C13318319FBABF5AAC();
	void OnAcceptKeyPressedEvent_Event(class UObject* Object);
	void OnExitState();
	void OnFinishedResultAnim(const int32& FinishedResultStateId);
	void OnFinishedResultDisplay();
	void OnInitState();
	void OnRaceHUDOutFinished();
	void OnUpdateState(float InDeltaTime);
	void PlayTimeTrialWinLoseAnim();
	void UnloadLevel();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_RaceResultStats_C">();
	}
	static class UBPC_RaceResultStats_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_RaceResultStats_C>();
	}
};
static_assert(alignof(UBPC_RaceResultStats_C) == 0x000008, "Wrong alignment on UBPC_RaceResultStats_C");
static_assert(sizeof(UBPC_RaceResultStats_C) == 0x000130, "Wrong size on UBPC_RaceResultStats_C");
static_assert(offsetof(UBPC_RaceResultStats_C, UberGraphFrame) == 0x000108, "Member 'UBPC_RaceResultStats_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_RaceResultStats_C, OwnerSeq) == 0x000110, "Member 'UBPC_RaceResultStats_C::OwnerSeq' has a wrong offset!");
static_assert(offsetof(UBPC_RaceResultStats_C, TimeTrialWinLoseWidget) == 0x000118, "Member 'UBPC_RaceResultStats_C::TimeTrialWinLoseWidget' has a wrong offset!");
static_assert(offsetof(UBPC_RaceResultStats_C, TimeTrialWinLoseEnum) == 0x000120, "Member 'UBPC_RaceResultStats_C::TimeTrialWinLoseEnum' has a wrong offset!");
static_assert(offsetof(UBPC_RaceResultStats_C, UnloadEventHandle) == 0x000128, "Member 'UBPC_RaceResultStats_C::UnloadEventHandle' has a wrong offset!");

}

