#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_TimeTrialClassSelectSubState

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_TimeTrialClassSelectSubState.BPC_TimeTrialClassSelectSubState_C
// 0x0090 (0x01B8 - 0x0128)
class UBPC_TimeTrialClassSelectSubState_C final : public UMenuSequenceSubStateBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_TimeTrialSequence_C*                OwnerTimeTrialSequence;                            // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Course_Select_Widget_Class_Ref;                    // 0x0138(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UCourseSelectWidgetBase*                CourseSelectWidget;                                // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClassSelect_TimeTrial_C*           SelectClassWidget;                                 // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   SelectClassWidgetClassRef;                         // 0x0170(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMenuInputRecieveObject*                SubInputReciever;                                  // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bFirstFocus;                                       // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Popup_Window_Hint_C*               TipsWindow;                                        // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHintId                                       OpenTipsId;                                        // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CloseSubCommand();
	void ConvertIndexToClassId(int32 Index_0, EMenuSpeedClassId* newParam);
	void ExecuteUbergraph_BPC_TimeTrialClassSelectSubState(int32 EntryPoint);
	void GetLastStateIsClassSelect(bool* LClassSelect);
	void InitSubCommand();
	void OnClassSelectIn();
	void OnExitState();
	void OnFinishedFade_UIFadeWidget(EUnionUIFadeDirection FadeDirection);
	void OnInitState();
	void OnLoaded_2818D6214851B5A07B8199A904D33989(TSubclassOf<class UObject> Loaded);
	void OnLoaded_DD1A3ABF48F72B256692DBB7C6BF81DB(TSubclassOf<class UObject> Loaded);
	void OnNextSequence();
	void OnOutFinished_PrevSequence();
	void OnOutFinished_SelectClassWidget();
	void OnPrevSequence();
	void OnUISceneCancel_SelectClassWidget(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnUISceneDecision_SelectClassWidget(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnUISceneFocusEvent_SelectClassWidget(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void ShowTipsWindow(EHintId InHintId);
	void StartSelectClassState();
	void TipsWindow_CloseEndDelegate();
	void UnbindAllEvents();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_TimeTrialClassSelectSubState_C">();
	}
	static class UBPC_TimeTrialClassSelectSubState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_TimeTrialClassSelectSubState_C>();
	}
};
static_assert(alignof(UBPC_TimeTrialClassSelectSubState_C) == 0x000008, "Wrong alignment on UBPC_TimeTrialClassSelectSubState_C");
static_assert(sizeof(UBPC_TimeTrialClassSelectSubState_C) == 0x0001B8, "Wrong size on UBPC_TimeTrialClassSelectSubState_C");
static_assert(offsetof(UBPC_TimeTrialClassSelectSubState_C, UberGraphFrame) == 0x000128, "Member 'UBPC_TimeTrialClassSelectSubState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialClassSelectSubState_C, OwnerTimeTrialSequence) == 0x000130, "Member 'UBPC_TimeTrialClassSelectSubState_C::OwnerTimeTrialSequence' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialClassSelectSubState_C, Course_Select_Widget_Class_Ref) == 0x000138, "Member 'UBPC_TimeTrialClassSelectSubState_C::Course_Select_Widget_Class_Ref' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialClassSelectSubState_C, CourseSelectWidget) == 0x000160, "Member 'UBPC_TimeTrialClassSelectSubState_C::CourseSelectWidget' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialClassSelectSubState_C, SelectClassWidget) == 0x000168, "Member 'UBPC_TimeTrialClassSelectSubState_C::SelectClassWidget' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialClassSelectSubState_C, SelectClassWidgetClassRef) == 0x000170, "Member 'UBPC_TimeTrialClassSelectSubState_C::SelectClassWidgetClassRef' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialClassSelectSubState_C, SubInputReciever) == 0x000198, "Member 'UBPC_TimeTrialClassSelectSubState_C::SubInputReciever' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialClassSelectSubState_C, bFirstFocus) == 0x0001A0, "Member 'UBPC_TimeTrialClassSelectSubState_C::bFirstFocus' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialClassSelectSubState_C, TipsWindow) == 0x0001A8, "Member 'UBPC_TimeTrialClassSelectSubState_C::TipsWindow' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialClassSelectSubState_C, OpenTipsId) == 0x0001B0, "Member 'UBPC_TimeTrialClassSelectSubState_C::OpenTipsId' has a wrong offset!");

}

