#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceResultStats

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UnionRun_structs.hpp"


namespace SDK::Params
{

// Function BPC_RaceResultStats.BPC_RaceResultStats_C.ExecuteUbergraph_BPC_RaceResultStats
// 0x0180 (0x0180 - 0x0000)
struct BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeTrialWinLoseDispId                       Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USquadContext*                          CallFunc_GetPrivateLobbyContextByClass_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLobbyHostLocalMember_ReturnValue;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSettingGrouping                          CallFunc_GetRaceSettingGrouping_ReturnValue;       // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDeltaTime;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_FinishedResultStateId;          // 0x0048(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x004C(0x0004)()
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceStandings_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceLoadTestMode                             CallFunc_GetRaceLoadTestMode_ReturnValue;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TimeTrial_Sub_WinLose_C*           CallFunc_Create_ReturnValue;                       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPredictTestEnabled_ReturnValue;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolFromConfig_ConfigValue;            // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolFromConfig_ReturnValue;            // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyRaceRivalExists_ReturnValue;       // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGroupRace_ReturnValue;                  // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_2;      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeTrialWinLoseDispId                       CallFunc_GetTimeTrialLastResultId_ReturnValue;     // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RaceResultSequence_C*               K2Node_DynamicCast_AsBP_Race_Result_Sequence;      // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats) == 0x000010, "Wrong alignment on BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats");
static_assert(sizeof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats) == 0x000180, "Wrong size on BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, EntryPoint) == 0x000000, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000008, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, Temp_byte_Variable) == 0x000010, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_GetPrivateLobbyContextByClass_ReturnValue) == 0x000020, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_GetPrivateLobbyContextByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_MakeLiteralByte_ReturnValue) == 0x000028, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_IsLobbyHostLocalMember_ReturnValue) == 0x000029, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_IsLobbyHostLocalMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00002A, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00002C, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000031, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_SwitchEnum_CmpSuccess) == 0x000032, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_GetRaceSettingGrouping_ReturnValue) == 0x000033, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_GetRaceSettingGrouping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_SwitchEnum_CmpSuccess_1) == 0x000034, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_Event_InDeltaTime) == 0x000038, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_CustomEvent_Object) == 0x000040, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_CustomEvent_Object' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_CustomEvent_FinishedResultStateId) == 0x000048, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_CustomEvent_FinishedResultStateId' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_SoundPlay_ReturnValue) == 0x00004C, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B0, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B8, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_GetRaceLoadTestMode_ReturnValue) == 0x0000C1, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_GetRaceLoadTestMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C2, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_CreateDelegate_OutputDelegate) == 0x0000C4, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_Create_ReturnValue) == 0x0000D8, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_IsPredictTestEnabled_ReturnValue) == 0x0000E0, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_IsPredictTestEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_IsShippingBuild_ReturnValue) == 0x0000E1, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_IsShippingBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_GetBoolFromConfig_ConfigValue) == 0x0000E2, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_GetBoolFromConfig_ConfigValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_GetBoolFromConfig_ReturnValue) == 0x0000E3, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_GetBoolFromConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_IsPartyRaceRivalExists_ReturnValue) == 0x0000E4, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_IsPartyRaceRivalExists_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_BooleanAND_ReturnValue) == 0x0000E5, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_IsGroupRace_ReturnValue) == 0x0000E6, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_IsGroupRace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_GetSelectedGameModeId_ReturnValue_1) == 0x0000E7, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_GetSelectedGameModeId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000E8, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_Select_Default) == 0x0000F0, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000F8, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000100, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_IsValid_ReturnValue_2) == 0x000108, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_SwitchEnum_CmpSuccess_2) == 0x000109, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00010A, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00010B, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x00010C, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000110, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000114, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_GetSelectedGameModeId_ReturnValue_2) == 0x000118, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_GetSelectedGameModeId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000119, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_SwitchEnum_CmpSuccess_3) == 0x00011A, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_GetTimeTrialLastResultId_ReturnValue) == 0x00011B, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_GetTimeTrialLastResultId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_CreateDelegate_OutputDelegate_1) == 0x00011C, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_IsValid_ReturnValue_3) == 0x00012C, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_IsInViewport_ReturnValue) == 0x00012D, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_GetOwnerStateMachine_ReturnValue) == 0x000130, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_GetOwnerStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000138, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_DynamicCast_AsBP_Race_Result_Sequence) == 0x000140, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_DynamicCast_AsBP_Race_Result_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00014C, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_CreateDelegate_OutputDelegate_2) == 0x000150, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, K2Node_CreateDelegate_OutputDelegate_3) == 0x000160, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000170, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000178, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x00017C, "Member 'BPC_RaceResultStats_C_ExecuteUbergraph_BPC_RaceResultStats::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BPC_RaceResultStats.BPC_RaceResultStats_C.OnAcceptKeyPressedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_RaceResultStats_C_OnAcceptKeyPressedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultStats_C_OnAcceptKeyPressedEvent_Event) == 0x000008, "Wrong alignment on BPC_RaceResultStats_C_OnAcceptKeyPressedEvent_Event");
static_assert(sizeof(BPC_RaceResultStats_C_OnAcceptKeyPressedEvent_Event) == 0x000008, "Wrong size on BPC_RaceResultStats_C_OnAcceptKeyPressedEvent_Event");
static_assert(offsetof(BPC_RaceResultStats_C_OnAcceptKeyPressedEvent_Event, Object) == 0x000000, "Member 'BPC_RaceResultStats_C_OnAcceptKeyPressedEvent_Event::Object' has a wrong offset!");

// Function BPC_RaceResultStats.BPC_RaceResultStats_C.OnFinishedResultAnim
// 0x0004 (0x0004 - 0x0000)
struct BPC_RaceResultStats_C_OnFinishedResultAnim final
{
public:
	int32                                         FinishedResultStateId;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultStats_C_OnFinishedResultAnim) == 0x000004, "Wrong alignment on BPC_RaceResultStats_C_OnFinishedResultAnim");
static_assert(sizeof(BPC_RaceResultStats_C_OnFinishedResultAnim) == 0x000004, "Wrong size on BPC_RaceResultStats_C_OnFinishedResultAnim");
static_assert(offsetof(BPC_RaceResultStats_C_OnFinishedResultAnim, FinishedResultStateId) == 0x000000, "Member 'BPC_RaceResultStats_C_OnFinishedResultAnim::FinishedResultStateId' has a wrong offset!");

// Function BPC_RaceResultStats.BPC_RaceResultStats_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_RaceResultStats_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultStats_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_RaceResultStats_C_OnUpdateState");
static_assert(sizeof(BPC_RaceResultStats_C_OnUpdateState) == 0x000004, "Wrong size on BPC_RaceResultStats_C_OnUpdateState");
static_assert(offsetof(BPC_RaceResultStats_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_RaceResultStats_C_OnUpdateState::InDeltaTime' has a wrong offset!");

}

