#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MachineCustomizeStickerApplyState

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_MachineCustomizeStickerApplyState.BPC_MachineCustomizeStickerApplyState_C
// 0x0040 (0x0140 - 0x0100)
class UBPC_MachineCustomizeStickerApplyState_C final : public UMachineCustomizeStickerApplyState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AMachineCustomizeSequence*              Sequence;                                          // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_GarageCamera_C*                     GarageCamera;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMenuInputRecieveObject*                Manu_Input_Receiver;                               // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_StickerMasterSystem_C*              Sticker_Master_System;                             // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowBase*                PopupWindow_OverrideWarning;                       // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerPreview_C*                 Racer;                                             // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDecided;                                         // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void HidePopupWindow();
	void ShowPopupWindow();
	void OverrideStickers(TArray<class AActor*>& OverlapStickers, bool IsRear);
	void SetRearMaterial(class UTexture* Texture);
	void SetFrontMaterial(class UTexture* Texture);
	void ExitStickerApply();
	void SetupStickerApply();
	void StickerMasterSystem_OnColorPickerStateChanged(bool bIsOpened);
	void OnFinishMoveEditSticker();
	void OnExitState();
	void StickerApply_OnDecision(class UObject* Objcet);
	void ToStickerEdit();
	void PopupWindow_OnDecision(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void StickerApply_OnCancel(class UObject* Objcet);
	void OnInitState();
	void SetActiveAuraEffect(bool IsActive_0);
	void ExecuteUbergraph_BPC_MachineCustomizeStickerApplyState(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_MachineCustomizeStickerApplyState_C">();
	}
	static class UBPC_MachineCustomizeStickerApplyState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_MachineCustomizeStickerApplyState_C>();
	}
};
static_assert(alignof(UBPC_MachineCustomizeStickerApplyState_C) == 0x000008, "Wrong alignment on UBPC_MachineCustomizeStickerApplyState_C");
static_assert(sizeof(UBPC_MachineCustomizeStickerApplyState_C) == 0x000140, "Wrong size on UBPC_MachineCustomizeStickerApplyState_C");
static_assert(offsetof(UBPC_MachineCustomizeStickerApplyState_C, UberGraphFrame) == 0x000100, "Member 'UBPC_MachineCustomizeStickerApplyState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerApplyState_C, Sequence) == 0x000108, "Member 'UBPC_MachineCustomizeStickerApplyState_C::Sequence' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerApplyState_C, GarageCamera) == 0x000110, "Member 'UBPC_MachineCustomizeStickerApplyState_C::GarageCamera' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerApplyState_C, Manu_Input_Receiver) == 0x000118, "Member 'UBPC_MachineCustomizeStickerApplyState_C::Manu_Input_Receiver' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerApplyState_C, Sticker_Master_System) == 0x000120, "Member 'UBPC_MachineCustomizeStickerApplyState_C::Sticker_Master_System' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerApplyState_C, PopupWindow_OverrideWarning) == 0x000128, "Member 'UBPC_MachineCustomizeStickerApplyState_C::PopupWindow_OverrideWarning' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerApplyState_C, Racer) == 0x000130, "Member 'UBPC_MachineCustomizeStickerApplyState_C::Racer' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeStickerApplyState_C, IsDecided) == 0x000138, "Member 'UBPC_MachineCustomizeStickerApplyState_C::IsDecided' has a wrong offset!");

}

