#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_FriendList

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function BPC_FriendList.BPC_FriendList_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0010 (0x0010 - 0x0000)
struct BPC_FriendList_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	struct FLobbyId                               TargetLobbyId;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPC_FriendList_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on BPC_FriendList_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(BPC_FriendList_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000010, "Wrong size on BPC_FriendList_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(BPC_FriendList_C_CREATEDELEGATE_PROXYFUNCTION_0, TargetLobbyId) == 0x000000, "Member 'BPC_FriendList_C_CREATEDELEGATE_PROXYFUNCTION_0::TargetLobbyId' has a wrong offset!");

// Function BPC_FriendList.BPC_FriendList_C.ExecuteUbergraph_BPC_FriendList
// 0x0450 (0x0450 - 0x0000)
struct BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_TargetUserId;                   // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& TargetUserId)> K2Node_CreateDelegate_OutputDelegate;         // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_TopMenuSequence_C*                  K2Node_DynamicCast_AsBP_Top_Menu_Sequence;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuSequenceUIInterface> CallFunc_GetOwnerMenuSequence_self_CastInput;   // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOwnerMenuSequence_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuSequence_C*                     K2Node_DynamicCast_AsBP_Menu_Sequence;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Successful_1;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInSuccess;                     // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLobbyOperationResult                  K2Node_CustomEvent_InResult;                       // 0x0098(0x0068)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyJoinInfo*                         K2Node_CustomEvent_InLobbyJoinInfo;                // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULobbyJoinInfo* TargetLobbyJoinInfo)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InZOrder;                       // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_Event_InState;                              // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ShortLobbyId;                   // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ShortLobbyId)> K2Node_CreateDelegate_OutputDelegate_3;       // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& ShortLobbyId)> K2Node_CreateDelegate_OutputDelegate_4;       // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& TargetShortLobbyId)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0168(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_TargetShortLobbyId;             // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPrivateLobbyContext_ReturnValue;       // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPrivateLobbyContext_ReturnValue_1;     // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SquadContext_C*                     K2Node_DynamicCast_AsBP_Squad_Context;             // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SquadContext_C*                     K2Node_DynamicCast_AsBP_Squad_Context_1;           // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJoining_ReturnValue;                    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Successful;                     // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSearchLobbyResult                     K2Node_CustomEvent_SearchResult;                   // 0x01C8(0x0078)()
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue;        // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFriendMatchLobbyContext*               K2Node_DynamicCast_AsFriend_Match_Lobby_Context;   // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJoining_ReturnValue_1;                  // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLobbyId                               K2Node_CustomEvent_InLobbyId;                      // 0x0270(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0280(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FLobbyId& TargetLobbyId)> K2Node_CreateDelegate_OutputDelegate_7;    // 0x0294(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Successful, const struct FSearchLobbyResult& SearchResult)> K2Node_CreateDelegate_OutputDelegate_8; // 0x02A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonLobbyContext*                    K2Node_CustomEvent_InLobbyContext;                 // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInSuccessful;                  // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSearchLobbyResult                     K2Node_CustomEvent_InSearchLobbyResult;            // 0x02C8(0x0078)()
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetLobbyTypeByLobbyId_OutLobbyType;       // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLobbyTypeByLobbyId_ReturnValue;        // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetHostUserIdStringByLobbyId_OutHostUserId; // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHostUserIdStringByLobbyId_ReturnValue; // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_Int64ToByte_ReturnValue;             // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x036B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bInSuccess, const struct FLobbyOperationResult& InResult)> K2Node_CreateDelegate_OutputDelegate_9; // 0x0370(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Successful)>              K2Node_CreateDelegate_OutputDelegate_10;           // 0x0384(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue_1;           // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALobbyFriendMatchSequence2*             K2Node_DynamicCast_AsLobby_Friend_Match_Sequence_2; // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_ListTop_C*                  CallFunc_Create_ReturnValue;                       // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ALobbySquadSequence2*                   K2Node_DynamicCast_AsLobby_Squad_Sequence_2;       // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue_2;           // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_OnlineSequence_C*                   K2Node_DynamicCast_AsBP_Online_Sequence;           // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuSequenceUIInterface> CallFunc_GetOwnerMenuSequence_self_CastInput_1; // 0x03F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOwnerMenuSequence_ReturnValue_1;       // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ShortLobbyId)> K2Node_CreateDelegate_OutputDelegate_11;      // 0x0410(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuSequence_C*                     K2Node_DynamicCast_AsBP_Menu_Sequence_1;           // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue;           // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x042A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42B[0x5];                                      // 0x042B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList) == 0x000008, "Wrong alignment on BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList");
static_assert(sizeof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList) == 0x000450, "Wrong size on BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, EntryPoint) == 0x000000, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetAppPlayerController_ReturnValue) == 0x000008, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_TargetUserId) == 0x000010, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_TargetUserId' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetOwnerSequence_ReturnValue) == 0x000038, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetOwnerSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_AsBP_Top_Menu_Sequence) == 0x000040, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_AsBP_Top_Menu_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetOwnerMenuSequence_self_CastInput) == 0x000050, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetOwnerMenuSequence_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetOwnerMenuSequence_ReturnValue) == 0x000060, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetOwnerMenuSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_AsBP_Menu_Sequence) == 0x000068, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_AsBP_Menu_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000078, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_Successful_1) == 0x000080, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_Successful_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsValid_ReturnValue_1) == 0x000081, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000084, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsValid_ReturnValue_2) == 0x000094, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_bInSuccess) == 0x000095, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_bInSuccess' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_InResult) == 0x000098, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_InResult' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsValid_ReturnValue_3) == 0x000100, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_InLobbyJoinInfo) == 0x000108, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_InLobbyJoinInfo' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CreateDelegate_OutputDelegate_2) == 0x000110, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetPlayerController_ReturnValue) == 0x000120, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_InZOrder) == 0x000128, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_InZOrder' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_Event_InState) == 0x00012C, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_ShortLobbyId) == 0x000130, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_ShortLobbyId' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CreateDelegate_OutputDelegate_3) == 0x000140, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsEmpty_ReturnValue) == 0x000150, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CreateDelegate_OutputDelegate_4) == 0x000154, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_Not_PreBool_ReturnValue) == 0x000164, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CreateDelegate_OutputDelegate_5) == 0x000168, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_TargetShortLobbyId) == 0x000178, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_TargetShortLobbyId' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000188, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000190, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetPrivateLobbyContext_ReturnValue) == 0x000198, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetPrivateLobbyContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetPrivateLobbyContext_ReturnValue_1) == 0x0001A0, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetPrivateLobbyContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_AsBP_Squad_Context) == 0x0001A8, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_AsBP_Squad_Context' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_bSuccess_2) == 0x0001B0, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_AsBP_Squad_Context_1) == 0x0001B8, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_AsBP_Squad_Context_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_bSuccess_3) == 0x0001C0, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsJoining_ReturnValue) == 0x0001C1, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsJoining_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_Successful) == 0x0001C2, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_Successful' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_SearchResult) == 0x0001C8, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_SearchResult' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000240, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_MakeLiteralByte_ReturnValue) == 0x000248, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetPublicLobbyContext_ReturnValue) == 0x000250, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetPublicLobbyContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_AsFriend_Match_Lobby_Context) == 0x000258, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_AsFriend_Match_Lobby_Context' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_bSuccess_4) == 0x000260, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000264, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsJoining_ReturnValue_1) == 0x000268, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsJoining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_InLobbyId) == 0x000270, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_InLobbyId' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CreateDelegate_OutputDelegate_6) == 0x000280, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsValid_ReturnValue_4) == 0x000290, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CreateDelegate_OutputDelegate_7) == 0x000294, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CreateDelegate_OutputDelegate_8) == 0x0002A4, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_InLobbyContext) == 0x0002B8, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_InLobbyContext' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_bInSuccessful) == 0x0002C0, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_bInSuccessful' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CustomEvent_InSearchLobbyResult) == 0x0002C8, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CustomEvent_InSearchLobbyResult' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsValid_ReturnValue_5) == 0x000340, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000341, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetLobbyTypeByLobbyId_OutLobbyType) == 0x000348, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetLobbyTypeByLobbyId_OutLobbyType' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetLobbyTypeByLobbyId_ReturnValue) == 0x000350, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetLobbyTypeByLobbyId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetHostUserIdStringByLobbyId_OutHostUserId) == 0x000358, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetHostUserIdStringByLobbyId_OutHostUserId' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetHostUserIdStringByLobbyId_ReturnValue) == 0x000368, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetHostUserIdStringByLobbyId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_Conv_Int64ToByte_ReturnValue) == 0x000369, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_Conv_Int64ToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetValidValue_ReturnValue) == 0x00036A, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsValid_ReturnValue_6) == 0x00036B, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsValid_ReturnValue_7) == 0x00036C, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CreateDelegate_OutputDelegate_9) == 0x000370, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsValid_ReturnValue_8) == 0x000380, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CreateDelegate_OutputDelegate_10) == 0x000384, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsValid_ReturnValue_9) == 0x000394, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetOwnerSequence_ReturnValue_1) == 0x000398, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetOwnerSequence_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetPlayerController_ReturnValue_1) == 0x0003A0, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_AsLobby_Friend_Match_Sequence_2) == 0x0003A8, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_AsLobby_Friend_Match_Sequence_2' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_bSuccess_5) == 0x0003B0, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_Create_ReturnValue) == 0x0003B8, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_AsLobby_Squad_Sequence_2) == 0x0003C0, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_AsLobby_Squad_Sequence_2' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_bSuccess_6) == 0x0003C8, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetOwnerSequence_ReturnValue_2) == 0x0003D0, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetOwnerSequence_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetParentActor_ReturnValue) == 0x0003D8, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003E0, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_AsBP_Online_Sequence) == 0x0003E8, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_AsBP_Online_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_bSuccess_7) == 0x0003F0, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetOwnerMenuSequence_self_CastInput_1) == 0x0003F8, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetOwnerMenuSequence_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetOwnerMenuSequence_ReturnValue_1) == 0x000408, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetOwnerMenuSequence_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_CreateDelegate_OutputDelegate_11) == 0x000410, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_AsBP_Menu_Sequence_1) == 0x000420, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_AsBP_Menu_Sequence_1' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_bSuccess_8) == 0x000428, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_UnregisterMainMenu_ReturnValue) == 0x000429, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_UnregisterMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsValid_ReturnValue_10) == 0x00042A, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_GetPlayerController_ReturnValue_2) == 0x000430, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, CallFunc_IsValid_ReturnValue_11) == 0x000438, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000440, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList, K2Node_DynamicCast_bSuccess_9) == 0x000448, "Member 'BPC_FriendList_C_ExecuteUbergraph_BPC_FriendList::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");

// Function BPC_FriendList.BPC_FriendList_C.OnAppNetSendInvitationComplete
// 0x0070 (0x0070 - 0x0000)
struct BPC_FriendList_C_OnAppNetSendInvitationComplete final
{
public:
	bool                                          bInSuccess;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLobbyOperationResult                  InResult;                                          // 0x0008(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPC_FriendList_C_OnAppNetSendInvitationComplete) == 0x000008, "Wrong alignment on BPC_FriendList_C_OnAppNetSendInvitationComplete");
static_assert(sizeof(BPC_FriendList_C_OnAppNetSendInvitationComplete) == 0x000070, "Wrong size on BPC_FriendList_C_OnAppNetSendInvitationComplete");
static_assert(offsetof(BPC_FriendList_C_OnAppNetSendInvitationComplete, bInSuccess) == 0x000000, "Member 'BPC_FriendList_C_OnAppNetSendInvitationComplete::bInSuccess' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_OnAppNetSendInvitationComplete, InResult) == 0x000008, "Member 'BPC_FriendList_C_OnAppNetSendInvitationComplete::InResult' has a wrong offset!");

// Function BPC_FriendList.BPC_FriendList_C.OnCreateShortLobbyId
// 0x0010 (0x0010 - 0x0000)
struct BPC_FriendList_C_OnCreateShortLobbyId final
{
public:
	class FString                                 ShortLobbyId;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_FriendList_C_OnCreateShortLobbyId) == 0x000008, "Wrong alignment on BPC_FriendList_C_OnCreateShortLobbyId");
static_assert(sizeof(BPC_FriendList_C_OnCreateShortLobbyId) == 0x000010, "Wrong size on BPC_FriendList_C_OnCreateShortLobbyId");
static_assert(offsetof(BPC_FriendList_C_OnCreateShortLobbyId, ShortLobbyId) == 0x000000, "Member 'BPC_FriendList_C_OnCreateShortLobbyId::ShortLobbyId' has a wrong offset!");

// Function BPC_FriendList.BPC_FriendList_C.OnCreateSquadComplete
// 0x0001 (0x0001 - 0x0000)
struct BPC_FriendList_C_OnCreateSquadComplete final
{
public:
	bool                                          Successful;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_FriendList_C_OnCreateSquadComplete) == 0x000001, "Wrong alignment on BPC_FriendList_C_OnCreateSquadComplete");
static_assert(sizeof(BPC_FriendList_C_OnCreateSquadComplete) == 0x000001, "Wrong size on BPC_FriendList_C_OnCreateSquadComplete");
static_assert(offsetof(BPC_FriendList_C_OnCreateSquadComplete, Successful) == 0x000000, "Member 'BPC_FriendList_C_OnCreateSquadComplete::Successful' has a wrong offset!");

// Function BPC_FriendList.BPC_FriendList_C.OnFriendListLobbyIdSearchDecide
// 0x0010 (0x0010 - 0x0000)
struct BPC_FriendList_C_OnFriendListLobbyIdSearchDecide final
{
public:
	class FString                                 TargetShortLobbyId;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_FriendList_C_OnFriendListLobbyIdSearchDecide) == 0x000008, "Wrong alignment on BPC_FriendList_C_OnFriendListLobbyIdSearchDecide");
static_assert(sizeof(BPC_FriendList_C_OnFriendListLobbyIdSearchDecide) == 0x000010, "Wrong size on BPC_FriendList_C_OnFriendListLobbyIdSearchDecide");
static_assert(offsetof(BPC_FriendList_C_OnFriendListLobbyIdSearchDecide, TargetShortLobbyId) == 0x000000, "Member 'BPC_FriendList_C_OnFriendListLobbyIdSearchDecide::TargetShortLobbyId' has a wrong offset!");

// Function BPC_FriendList.BPC_FriendList_C.OnFriendListLobbyInvitationAccept
// 0x0008 (0x0008 - 0x0000)
struct BPC_FriendList_C_OnFriendListLobbyInvitationAccept final
{
public:
	class ULobbyJoinInfo*                         InLobbyJoinInfo;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_FriendList_C_OnFriendListLobbyInvitationAccept) == 0x000008, "Wrong alignment on BPC_FriendList_C_OnFriendListLobbyInvitationAccept");
static_assert(sizeof(BPC_FriendList_C_OnFriendListLobbyInvitationAccept) == 0x000008, "Wrong size on BPC_FriendList_C_OnFriendListLobbyInvitationAccept");
static_assert(offsetof(BPC_FriendList_C_OnFriendListLobbyInvitationAccept, InLobbyJoinInfo) == 0x000000, "Member 'BPC_FriendList_C_OnFriendListLobbyInvitationAccept::InLobbyJoinInfo' has a wrong offset!");

// Function BPC_FriendList.BPC_FriendList_C.OnFriendListLobbyInvitationDecide
// 0x0010 (0x0010 - 0x0000)
struct BPC_FriendList_C_OnFriendListLobbyInvitationDecide final
{
public:
	class FString                                 TargetUserId;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_FriendList_C_OnFriendListLobbyInvitationDecide) == 0x000008, "Wrong alignment on BPC_FriendList_C_OnFriendListLobbyInvitationDecide");
static_assert(sizeof(BPC_FriendList_C_OnFriendListLobbyInvitationDecide) == 0x000010, "Wrong size on BPC_FriendList_C_OnFriendListLobbyInvitationDecide");
static_assert(offsetof(BPC_FriendList_C_OnFriendListLobbyInvitationDecide, TargetUserId) == 0x000000, "Member 'BPC_FriendList_C_OnFriendListLobbyInvitationDecide::TargetUserId' has a wrong offset!");

// Function BPC_FriendList.BPC_FriendList_C.OnJoinLobbyByLobbyIdSearch
// 0x0010 (0x0010 - 0x0000)
struct BPC_FriendList_C_OnJoinLobbyByLobbyIdSearch final
{
public:
	struct FLobbyId                               InLobbyId;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPC_FriendList_C_OnJoinLobbyByLobbyIdSearch) == 0x000008, "Wrong alignment on BPC_FriendList_C_OnJoinLobbyByLobbyIdSearch");
static_assert(sizeof(BPC_FriendList_C_OnJoinLobbyByLobbyIdSearch) == 0x000010, "Wrong size on BPC_FriendList_C_OnJoinLobbyByLobbyIdSearch");
static_assert(offsetof(BPC_FriendList_C_OnJoinLobbyByLobbyIdSearch, InLobbyId) == 0x000000, "Member 'BPC_FriendList_C_OnJoinLobbyByLobbyIdSearch::InLobbyId' has a wrong offset!");

// Function BPC_FriendList.BPC_FriendList_C.OnSearchSquadComplete
// 0x0080 (0x0080 - 0x0000)
struct BPC_FriendList_C_OnSearchSquadComplete final
{
public:
	bool                                          Successful;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSearchLobbyResult                     SearchResult;                                      // 0x0008(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPC_FriendList_C_OnSearchSquadComplete) == 0x000008, "Wrong alignment on BPC_FriendList_C_OnSearchSquadComplete");
static_assert(sizeof(BPC_FriendList_C_OnSearchSquadComplete) == 0x000080, "Wrong size on BPC_FriendList_C_OnSearchSquadComplete");
static_assert(offsetof(BPC_FriendList_C_OnSearchSquadComplete, Successful) == 0x000000, "Member 'BPC_FriendList_C_OnSearchSquadComplete::Successful' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_OnSearchSquadComplete, SearchResult) == 0x000008, "Member 'BPC_FriendList_C_OnSearchSquadComplete::SearchResult' has a wrong offset!");

// Function BPC_FriendList.BPC_FriendList_C.SetFriendListLobbyIdSearchResult
// 0x0088 (0x0088 - 0x0000)
struct BPC_FriendList_C_SetFriendListLobbyIdSearchResult final
{
public:
	class UCommonLobbyContext*                    InLobbyContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bInSuccessful;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSearchLobbyResult                     InSearchLobbyResult;                               // 0x0010(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPC_FriendList_C_SetFriendListLobbyIdSearchResult) == 0x000008, "Wrong alignment on BPC_FriendList_C_SetFriendListLobbyIdSearchResult");
static_assert(sizeof(BPC_FriendList_C_SetFriendListLobbyIdSearchResult) == 0x000088, "Wrong size on BPC_FriendList_C_SetFriendListLobbyIdSearchResult");
static_assert(offsetof(BPC_FriendList_C_SetFriendListLobbyIdSearchResult, InLobbyContext) == 0x000000, "Member 'BPC_FriendList_C_SetFriendListLobbyIdSearchResult::InLobbyContext' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_SetFriendListLobbyIdSearchResult, bInSuccessful) == 0x000008, "Member 'BPC_FriendList_C_SetFriendListLobbyIdSearchResult::bInSuccessful' has a wrong offset!");
static_assert(offsetof(BPC_FriendList_C_SetFriendListLobbyIdSearchResult, InSearchLobbyResult) == 0x000010, "Member 'BPC_FriendList_C_SetFriendListLobbyIdSearchResult::InSearchLobbyResult' has a wrong offset!");

// Function BPC_FriendList.BPC_FriendList_C.SetNextMenuSequenceSubState
// 0x0001 (0x0001 - 0x0000)
struct BPC_FriendList_C_SetNextMenuSequenceSubState final
{
public:
	EMenuSequenceSubState                         InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_FriendList_C_SetNextMenuSequenceSubState) == 0x000001, "Wrong alignment on BPC_FriendList_C_SetNextMenuSequenceSubState");
static_assert(sizeof(BPC_FriendList_C_SetNextMenuSequenceSubState) == 0x000001, "Wrong size on BPC_FriendList_C_SetNextMenuSequenceSubState");
static_assert(offsetof(BPC_FriendList_C_SetNextMenuSequenceSubState, InState) == 0x000000, "Member 'BPC_FriendList_C_SetNextMenuSequenceSubState::InState' has a wrong offset!");

// Function BPC_FriendList.BPC_FriendList_C.SetupFriendListWidget
// 0x0004 (0x0004 - 0x0000)
struct BPC_FriendList_C_SetupFriendListWidget final
{
public:
	int32                                         InZOrder;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_FriendList_C_SetupFriendListWidget) == 0x000004, "Wrong alignment on BPC_FriendList_C_SetupFriendListWidget");
static_assert(sizeof(BPC_FriendList_C_SetupFriendListWidget) == 0x000004, "Wrong size on BPC_FriendList_C_SetupFriendListWidget");
static_assert(offsetof(BPC_FriendList_C_SetupFriendListWidget, InZOrder) == 0x000000, "Member 'BPC_FriendList_C_SetupFriendListWidget::InZOrder' has a wrong offset!");

}

