#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MachineCustomizeColorPresetSelectState

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_MachineCustomizeColorPresetSelectState.BPC_MachineCustomizeColorPresetSelectState_C
// 0x0020 (0x0118 - 0x00F8)
class UBPC_MachineCustomizeColorPresetSelectState_C final : public UMachineCustomizeColorPresetSelectState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AMachineCustomizeSequence*              Sequence;                                          // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerPreview_C*                 Racer;                                             // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_PresetPaint_C*   ColorPresetSelectPage;                             // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void EventCancel(int32 InPlayerIndex);
	void EventColorPresetSelectPage_OnItemSelected(const struct FST_ColorPresetSelectPageItemData& newParam, int32 InPlayerIndex);
	void EventColorPresetSelectPage_OnItemFocused(const struct FST_ColorPresetSelectPageItemData& ItemData, int32 InPlayerIndex, int32 ButtonIndex);
	void OnSetupPage();
	void SetProperties();
	void BindTab();
	void UnbindTab();
	void BindPage();
	void UnbindPage();
	void OnInitState();
	void ExecuteUbergraph_BPC_MachineCustomizeColorPresetSelectState(int32 EntryPoint);

	class AGarageCamera* GetCamera() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_MachineCustomizeColorPresetSelectState_C">();
	}
	static class UBPC_MachineCustomizeColorPresetSelectState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_MachineCustomizeColorPresetSelectState_C>();
	}
};
static_assert(alignof(UBPC_MachineCustomizeColorPresetSelectState_C) == 0x000008, "Wrong alignment on UBPC_MachineCustomizeColorPresetSelectState_C");
static_assert(sizeof(UBPC_MachineCustomizeColorPresetSelectState_C) == 0x000118, "Wrong size on UBPC_MachineCustomizeColorPresetSelectState_C");
static_assert(offsetof(UBPC_MachineCustomizeColorPresetSelectState_C, UberGraphFrame) == 0x0000F8, "Member 'UBPC_MachineCustomizeColorPresetSelectState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeColorPresetSelectState_C, Sequence) == 0x000100, "Member 'UBPC_MachineCustomizeColorPresetSelectState_C::Sequence' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeColorPresetSelectState_C, Racer) == 0x000108, "Member 'UBPC_MachineCustomizeColorPresetSelectState_C::Racer' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeColorPresetSelectState_C, ColorPresetSelectPage) == 0x000110, "Member 'UBPC_MachineCustomizeColorPresetSelectState_C::ColorPresetSelectPage' has a wrong offset!");

}

