#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateReady

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UnionRun_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_RaceSequenceStateReady.BPC_RaceSequenceStateReady_C.CheckTipsFirstTimeTrialMode
// 0x0006 (0x0006 - 0x0000)
struct BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode final
{
public:
	bool                                          OutShowTips;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadHint_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode) == 0x000001, "Wrong alignment on BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode");
static_assert(sizeof(BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode) == 0x000006, "Wrong size on BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode, OutShowTips) == 0x000000, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode::OutShowTips' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode, CallFunc_IsReadHint_ReturnValue) == 0x000001, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode::CallFunc_IsReadHint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000002, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsFirstTimeTrialMode::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateReady.BPC_RaceSequenceStateReady_C.CreateInfoWidget
// 0x0030 (0x0030 - 0x0000)
struct BPC_RaceSequenceStateReady_C_CreateInfoWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	class UWBP_RaceBefore_RuleExplanation_C*      CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckGrandPrixRankEarnPointBonusExists_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RaceBefore_MessageInfo_C*          CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateReady_C_CreateInfoWidget) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateReady_C_CreateInfoWidget");
static_assert(sizeof(BPC_RaceSequenceStateReady_C_CreateInfoWidget) == 0x000030, "Wrong size on BPC_RaceSequenceStateReady_C_CreateInfoWidget");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CreateInfoWidget, ReturnValue) == 0x000000, "Member 'BPC_RaceSequenceStateReady_C_CreateInfoWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CreateInfoWidget, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'BPC_RaceSequenceStateReady_C_CreateInfoWidget::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CreateInfoWidget, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BPC_RaceSequenceStateReady_C_CreateInfoWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CreateInfoWidget, CallFunc_CheckGrandPrixRankEarnPointBonusExists_ReturnValue) == 0x000020, "Member 'BPC_RaceSequenceStateReady_C_CreateInfoWidget::CallFunc_CheckGrandPrixRankEarnPointBonusExists_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CreateInfoWidget, CallFunc_Create_ReturnValue_1) == 0x000028, "Member 'BPC_RaceSequenceStateReady_C_CreateInfoWidget::CallFunc_Create_ReturnValue_1' has a wrong offset!");

// Function BPC_RaceSequenceStateReady.BPC_RaceSequenceStateReady_C.IsPartyRaceMissionExists
// 0x0001 (0x0001 - 0x0000)
struct BPC_RaceSequenceStateReady_C_IsPartyRaceMissionExists final
{
public:
	bool                                          Exists;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateReady_C_IsPartyRaceMissionExists) == 0x000001, "Wrong alignment on BPC_RaceSequenceStateReady_C_IsPartyRaceMissionExists");
static_assert(sizeof(BPC_RaceSequenceStateReady_C_IsPartyRaceMissionExists) == 0x000001, "Wrong size on BPC_RaceSequenceStateReady_C_IsPartyRaceMissionExists");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_IsPartyRaceMissionExists, Exists) == 0x000000, "Member 'BPC_RaceSequenceStateReady_C_IsPartyRaceMissionExists::Exists' has a wrong offset!");

// Function BPC_RaceSequenceStateReady.BPC_RaceSequenceStateReady_C.CheckTipsGrandPrixRound
// 0x000C (0x000C - 0x0000)
struct BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound final
{
public:
	EHintId                                       OutHintId;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHintId                                       LocalHintId;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadHint_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentRaceCount_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound) == 0x000004, "Wrong alignment on BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound");
static_assert(sizeof(BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound) == 0x00000C, "Wrong size on BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound, OutHintId) == 0x000000, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound::OutHintId' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound, LocalHintId) == 0x000001, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound::LocalHintId' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound, CallFunc_IsReadHint_ReturnValue) == 0x000002, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound::CallFunc_IsReadHint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound, CallFunc_GetCurrentRaceCount_ReturnValue) == 0x000004, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound::CallFunc_GetCurrentRaceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000008, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound, K2Node_SwitchInteger_CmpSuccess) == 0x000009, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsGrandPrixRound::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateReady.BPC_RaceSequenceStateReady_C.CheckTipsFirstRaceControl
// 0x0004 (0x0004 - 0x0000)
struct BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl final
{
public:
	bool                                          OutShowTips;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadHint_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl) == 0x000001, "Wrong alignment on BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl");
static_assert(sizeof(BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl) == 0x000004, "Wrong size on BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl, OutShowTips) == 0x000000, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl::OutShowTips' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl, CallFunc_IsReadHint_ReturnValue) == 0x000001, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl::CallFunc_IsReadHint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000002, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl, K2Node_SwitchEnum_CmpSuccess) == 0x000003, "Member 'BPC_RaceSequenceStateReady_C_CheckTipsFirstRaceControl::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPC_RaceSequenceStateReady.BPC_RaceSequenceStateReady_C.CheckTips
// 0x0010 (0x0010 - 0x0000)
struct BPC_RaceSequenceStateReady_C_CheckTips final
{
public:
	EHintId                                       OutHintId;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckTipsFirstTimeTrialMode_OutShowTips;  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHintId                                       CallFunc_CheckTipsGrandPrixRound_OutHintId;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckTipsFirstRaceControl_OutShowTips;    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateReady_C_CheckTips) == 0x000004, "Wrong alignment on BPC_RaceSequenceStateReady_C_CheckTips");
static_assert(sizeof(BPC_RaceSequenceStateReady_C_CheckTips) == 0x000010, "Wrong size on BPC_RaceSequenceStateReady_C_CheckTips");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTips, OutHintId) == 0x000000, "Member 'BPC_RaceSequenceStateReady_C_CheckTips::OutHintId' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTips, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x000004, "Member 'BPC_RaceSequenceStateReady_C_CheckTips::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTips, CallFunc_CheckTipsFirstTimeTrialMode_OutShowTips) == 0x000008, "Member 'BPC_RaceSequenceStateReady_C_CheckTips::CallFunc_CheckTipsFirstTimeTrialMode_OutShowTips' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTips, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000009, "Member 'BPC_RaceSequenceStateReady_C_CheckTips::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTips, CallFunc_CheckTipsGrandPrixRound_OutHintId) == 0x00000A, "Member 'BPC_RaceSequenceStateReady_C_CheckTips::CallFunc_CheckTipsGrandPrixRound_OutHintId' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTips, CallFunc_CheckTipsFirstRaceControl_OutShowTips) == 0x00000B, "Member 'BPC_RaceSequenceStateReady_C_CheckTips::CallFunc_CheckTipsFirstRaceControl_OutShowTips' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTips, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'BPC_RaceSequenceStateReady_C_CheckTips::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTips, CallFunc_GetIsOnlineGameMode_ReturnValue) == 0x00000D, "Member 'BPC_RaceSequenceStateReady_C_CheckTips::CallFunc_GetIsOnlineGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTips, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'BPC_RaceSequenceStateReady_C_CheckTips::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CheckTips, CallFunc_BooleanAND_ReturnValue) == 0x00000F, "Member 'BPC_RaceSequenceStateReady_C_CheckTips::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateReady.BPC_RaceSequenceStateReady_C.NoticeChangeRaceStateEvent
// 0x0002 (0x0002 - 0x0000)
struct BPC_RaceSequenceStateReady_C_NoticeChangeRaceStateEvent final
{
public:
	ERaceInfoStateType                            InNewState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceInfoStateType                            InOldState;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateReady_C_NoticeChangeRaceStateEvent) == 0x000001, "Wrong alignment on BPC_RaceSequenceStateReady_C_NoticeChangeRaceStateEvent");
static_assert(sizeof(BPC_RaceSequenceStateReady_C_NoticeChangeRaceStateEvent) == 0x000002, "Wrong size on BPC_RaceSequenceStateReady_C_NoticeChangeRaceStateEvent");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_NoticeChangeRaceStateEvent, InNewState) == 0x000000, "Member 'BPC_RaceSequenceStateReady_C_NoticeChangeRaceStateEvent::InNewState' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_NoticeChangeRaceStateEvent, InOldState) == 0x000001, "Member 'BPC_RaceSequenceStateReady_C_NoticeChangeRaceStateEvent::InOldState' has a wrong offset!");

// Function BPC_RaceSequenceStateReady.BPC_RaceSequenceStateReady_C.CreateTipsWindow
// 0x0001 (0x0001 - 0x0000)
struct BPC_RaceSequenceStateReady_C_CreateTipsWindow final
{
public:
	EHintId                                       InHintId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateReady_C_CreateTipsWindow) == 0x000001, "Wrong alignment on BPC_RaceSequenceStateReady_C_CreateTipsWindow");
static_assert(sizeof(BPC_RaceSequenceStateReady_C_CreateTipsWindow) == 0x000001, "Wrong size on BPC_RaceSequenceStateReady_C_CreateTipsWindow");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_CreateTipsWindow, InHintId) == 0x000000, "Member 'BPC_RaceSequenceStateReady_C_CreateTipsWindow::InHintId' has a wrong offset!");

// Function BPC_RaceSequenceStateReady.BPC_RaceSequenceStateReady_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_RaceSequenceStateReady_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateReady_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_RaceSequenceStateReady_C_OnUpdateState");
static_assert(sizeof(BPC_RaceSequenceStateReady_C_OnUpdateState) == 0x000004, "Wrong size on BPC_RaceSequenceStateReady_C_OnUpdateState");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_RaceSequenceStateReady_C_OnUpdateState::InDeltaTime' has a wrong offset!");

// Function BPC_RaceSequenceStateReady.BPC_RaceSequenceStateReady_C.Begin_StartRace
// 0x0004 (0x0004 - 0x0000)
struct BPC_RaceSequenceStateReady_C_Begin_StartRace final
{
public:
	int32                                         InRaceStartTimeSec;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateReady_C_Begin_StartRace) == 0x000004, "Wrong alignment on BPC_RaceSequenceStateReady_C_Begin_StartRace");
static_assert(sizeof(BPC_RaceSequenceStateReady_C_Begin_StartRace) == 0x000004, "Wrong size on BPC_RaceSequenceStateReady_C_Begin_StartRace");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_Begin_StartRace, InRaceStartTimeSec) == 0x000000, "Member 'BPC_RaceSequenceStateReady_C_Begin_StartRace::InRaceStartTimeSec' has a wrong offset!");

// Function BPC_RaceSequenceStateReady.BPC_RaceSequenceStateReady_C.NoticeChangeCountDownEvent
// 0x0008 (0x0008 - 0x0000)
struct BPC_RaceSequenceStateReady_C_NoticeChangeCountDownEvent final
{
public:
	int32                                         InNewValue;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InOldValue;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateReady_C_NoticeChangeCountDownEvent) == 0x000004, "Wrong alignment on BPC_RaceSequenceStateReady_C_NoticeChangeCountDownEvent");
static_assert(sizeof(BPC_RaceSequenceStateReady_C_NoticeChangeCountDownEvent) == 0x000008, "Wrong size on BPC_RaceSequenceStateReady_C_NoticeChangeCountDownEvent");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_NoticeChangeCountDownEvent, InNewValue) == 0x000000, "Member 'BPC_RaceSequenceStateReady_C_NoticeChangeCountDownEvent::InNewValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateReady_C_NoticeChangeCountDownEvent, InOldValue) == 0x000004, "Member 'BPC_RaceSequenceStateReady_C_NoticeChangeCountDownEvent::InOldValue' has a wrong offset!");

// Function BPC_RaceSequenceStateReady.BPC_RaceSequenceStateReady_C.ExecuteUbergraph_BPC_RaceSequenceStateReady
// 0x0530 (0x0530 - 0x0000)
struct BPC_RaceSequenceStateReady_C_ExecuteUbergraph_BPC_RaceSequenceStateReady final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartRace_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGroupRaceRule                                CallFunc_GetGroupRaceRuleSetting_ReturnValue;      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARaceSequence*                          CallFunc_GetOwnerRaceSequence_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceSequence_C*                     K2Node_DynamicCast_AsBP_Race_Sequence;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARaceSequence*                          CallFunc_GetOwnerRaceSequence_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGroupRaceRule                                CallFunc_GetGroupRaceRuleSetting_ReturnValue_1;    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_1;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue_1;        // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHintId                                       CallFunc_CheckTips_OutHintId;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0058(0x0010)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARaceSequence*                          CallFunc_GetOwnerRaceSequence_ReturnValue_2;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckGrandPrixRankEarnPointBonusExists_ReturnValue; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUnionUISequenceInterface> K2Node_DynamicCast_AsUnion_UISequence_Interface; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUnionUISequenceInterface> K2Node_DynamicCast_AsUnion_UISequence_Interface_1; // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RaceBefore_RuleExplanation_C*      K2Node_DynamicCast_AsWBP_Race_Before_Rule_Explanation; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_CreateInfoWidget_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CMN_MessageBar_C*                  CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetNextRaceSequenceState_ReturnValue;     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceInfoStateType                            K2Node_Event_InNewState;                           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceInfoStateType                            K2Node_Event_InOldState;                           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_VehicleObjectRef_C> K2Node_DynamicCast_AsBPI_Vehicle_Object_Ref;     // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetRaceUIObjRef_RaceUI;                   // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolFromConfig_ConfigValue;            // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolFromConfig_ReturnValue;            // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIntFromConfig_ConfigValue;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIntFromConfig_ReturnValue;             // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_137[0x1];                                      // 0x0137(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartTravelRings_ReturnValue;             // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E[0x2];                                      // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReadyRace_ReturnValue;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionRacers*                           CallFunc_GetRacersRef_ReturnValue;                 // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceUI*                           CallFunc_GetRaceHUDRef_ReturnValue;                // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionRacers*                           CallFunc_GetRacersRef_ReturnValue_1;               // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceLapInfo*                      CallFunc_SpawnObject_ReturnValue;                  // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceUI*                           CallFunc_GetRaceHUDRef_ReturnValue_1;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionRacers*                           CallFunc_GetRacersRef_ReturnValue_2;               // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IUnionRaceUIInterface> K2Node_DynamicCast_AsUnion_Race_UIInterface;       // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRacers*                           CallFunc_GetRacersRef_ReturnValue_3;               // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceSequence_C*                     K2Node_DynamicCast_AsBP_Race_Sequence_1;           // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRaceUI*                           CallFunc_GetRaceHUDRef_ReturnValue_2;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ARaceSequence*                          CallFunc_GetOwnerRaceSequence_ReturnValue_3;       // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceSequence_C*                     K2Node_DynamicCast_AsBP_Race_Sequence_2;           // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetRaceBGMLabel_Label;                    // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHintId                                       K2Node_CustomEvent_InHintId;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARaceSequence*                          CallFunc_GetOwnerRaceSequence_ReturnValue_4;       // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceSequence_C*                     K2Node_DynamicCast_AsBP_Race_Sequence_3;           // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARacePlayerController*                  K2Node_DynamicCast_AsRace_Player_Controller;       // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHintId                                       CallFunc_GetHintId_ReturnValue;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARacePlayerController*                  K2Node_DynamicCast_AsRace_Player_Controller_1;     // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDeltaTime;                          // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacers*                           CallFunc_GetRacersRef_ReturnValue_4;               // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRacerStatusObject*                CallFunc_GetRacerStatusObject_ReturnValue;         // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceUI*                           CallFunc_GetRaceHUDRef_ReturnValue_3;              // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRivalRacerIndex_OutRacerIndex;         // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacerStatusObject*                CallFunc_GetRacerStatusObject_ReturnValue_1;       // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URaceUISubPlayerName*                   CallFunc_Array_Get_Item_1;                         // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUnionRaceUIInterface> CallFunc_SetRivalStartUI_self_CastInput;           // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAutoUnrealInsightsMode_ReturnValue;     // 0x02FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FE[0x2];                                      // 0x02FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0308(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAutoCsvProfileMode_ReturnValue;         // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Popup_Window_Hint_C*               CallFunc_Create_ReturnValue_1;                     // 0x0328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_2;      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332[0x2];                                      // 0x0332(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetStartDashButtonObject_ReturnValue;     // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_VehicleObjectRef_C> K2Node_DynamicCast_AsBPI_Vehicle_Object_Ref_1;   // 0x0358(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0380(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_3;              // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IUnionVehicleRaceObjectInterface> K2Node_DynamicCast_AsUnion_Vehicle_Race_Object_Interface; // 0x0430(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0460(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_StartingLights_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARaceSequence*                          CallFunc_GetOwnerRaceSequence_ReturnValue_5;       // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUnionUISequenceInterface> K2Node_DynamicCast_AsUnion_UISequence_Interface_2; // 0x04F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x3];                                      // 0x0509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InRaceStartTimeSec;             // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartRace_ReturnValue;                    // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceLoadTestMode                             CallFunc_GetRaceLoadTestMode_ReturnValue;          // 0x0512(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_513[0x1];                                      // 0x0513(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
