#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PreNotice

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_PreNotice.BPC_PreNotice_C
// 0x0040 (0x0250 - 0x0210)
class UBPC_PreNotice_C final : public UPreNoticeState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         LastFestaId;                                       // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastFestaPoint;                                    // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Popup_Window_Tutorial_C*           TutorialPopup;                                     // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowBase*                PopupWindow;                                       // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPC_DodonpaEventState_C*               DodonpaEventState;                                 // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowBase*                StreamingInstallPopup;                             // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              DonpaPrevBGM;                                      // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CommonConnectingUI_C*               CommonConnectingUI;                                // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void PlayStoredBgm();
	void StorePrevBgmID();
	void IsFestaForceStart(bool* isForceStart);
	void CallDodonpaEvent(class FName EventName, EGrandPrixEventFlag SaveDataFlagId, EMenuSequenceBGM BGM_ID);
	void SetSubMenuVisibility(ESlateVisibility Visibility);
	void AttachMainCamera();
	void DelayOpenWindow();
	void DoCompensationNext();
	void OnExitStateTutorialVideo();
	void OnInitStateTutorialVideo();
	void EndTutorialPopup(ESlateVisibility InVisibility);
	void OnFinishedFade(EUnionUIFadeDirection FadeDirection);
	void OnInitState();
	void OnExitState();
	void OnInitializeFlow_final();
	void OnDodonpaEventEnd_GrandPrixCleard(EMenuSequenceSubState State);
	void Call_DodonpaEvent_GrandPrixCleard();
	void OnDodonpaEvent_FestaIntro(EMenuSequenceSubState State);
	void Call_DodonpaEvent_FestaIntro();
	void OnReceiveCheckCompensation(const class FString& ApiName, const class FString& RequestData, const class FString& ResponseData, bool Error);
	void OnEndFade_FestaIntro(EUnionUIFadeDirection FadeDirection);
	void OnInitializeFlow_DLC_Freecontents();
	void OnEndFade_GrandPrixCleard(EUnionUIFadeDirection FadeDirection);
	void OpenNoticePopup();
	void OnFinishedFade_TutorialPopup(EUnionUIFadeDirection FadeDirection);
	void DebugSkip();
	void OnDecisionStreamingInstall(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnInitializeFlow_NoticePopup();
	void OnInitializeFlow_FestaEndReward();
	void OnInitializeFlow_StreamingInstallCheck();
	void ReturnTutorialVideo();
	void OnInitializeFlow_ClearGrandPrix();
	void OnInitializeFlow_TutorialCheck();
	void OnInitializeFlow_Compensation();
	void OnReceiveCheckFestaReward(const class FString& ApiName, const class FString& RequestData, const class FString& ResponseData, bool Error);
	void OnErrorPopupWindowClose(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnAttentionPopupWindowDecision(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void ExecuteUbergraph_BPC_PreNotice(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_PreNotice_C">();
	}
	static class UBPC_PreNotice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_PreNotice_C>();
	}
};
static_assert(alignof(UBPC_PreNotice_C) == 0x000008, "Wrong alignment on UBPC_PreNotice_C");
static_assert(sizeof(UBPC_PreNotice_C) == 0x000250, "Wrong size on UBPC_PreNotice_C");
static_assert(offsetof(UBPC_PreNotice_C, UberGraphFrame) == 0x000210, "Member 'UBPC_PreNotice_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_PreNotice_C, LastFestaId) == 0x000218, "Member 'UBPC_PreNotice_C::LastFestaId' has a wrong offset!");
static_assert(offsetof(UBPC_PreNotice_C, LastFestaPoint) == 0x00021C, "Member 'UBPC_PreNotice_C::LastFestaPoint' has a wrong offset!");
static_assert(offsetof(UBPC_PreNotice_C, TutorialPopup) == 0x000220, "Member 'UBPC_PreNotice_C::TutorialPopup' has a wrong offset!");
static_assert(offsetof(UBPC_PreNotice_C, PopupWindow) == 0x000228, "Member 'UBPC_PreNotice_C::PopupWindow' has a wrong offset!");
static_assert(offsetof(UBPC_PreNotice_C, DodonpaEventState) == 0x000230, "Member 'UBPC_PreNotice_C::DodonpaEventState' has a wrong offset!");
static_assert(offsetof(UBPC_PreNotice_C, StreamingInstallPopup) == 0x000238, "Member 'UBPC_PreNotice_C::StreamingInstallPopup' has a wrong offset!");
static_assert(offsetof(UBPC_PreNotice_C, DonpaPrevBGM) == 0x000240, "Member 'UBPC_PreNotice_C::DonpaPrevBGM' has a wrong offset!");
static_assert(offsetof(UBPC_PreNotice_C, CommonConnectingUI) == 0x000248, "Member 'UBPC_PreNotice_C::CommonConnectingUI' has a wrong offset!");

}

