#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_TimeTrialGhostConfirmationState

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function BPC_TimeTrialGhostConfirmationState.BPC_TimeTrialGhostConfirmationState_C.CreateErrorWindow
// 0x00B8 (0x00B8 - 0x0000)
struct BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow final
{
public:
	class FText                                   InMessage;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIPopupWindowBase*                CallFunc_CreatePopupWindow_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0048(0x0010)()
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow) == 0x000008, "Wrong alignment on BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow");
static_assert(sizeof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow) == 0x0000B8, "Wrong size on BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, InMessage) == 0x000000, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::InMessage' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, CallFunc_MakeLiteralByte_ReturnValue) == 0x000020, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000038, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, CallFunc_CreatePopupWindow_ReturnValue) == 0x000040, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::CallFunc_CreatePopupWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, CallFunc_MakeLiteralText_ReturnValue) == 0x000048, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface) == 0x000058, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1) == 0x000070, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2) == 0x000088, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3) == 0x0000A0, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'BPC_TimeTrialGhostConfirmationState_C_CreateErrorWindow::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BPC_TimeTrialGhostConfirmationState.BPC_TimeTrialGhostConfirmationState_C.OnFaceButtonTopPressedEvent
// 0x0008 (0x0008 - 0x0000)
struct BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonTopPressedEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonTopPressedEvent) == 0x000008, "Wrong alignment on BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonTopPressedEvent");
static_assert(sizeof(BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonTopPressedEvent) == 0x000008, "Wrong size on BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonTopPressedEvent");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonTopPressedEvent, Object) == 0x000000, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonTopPressedEvent::Object' has a wrong offset!");

// Function BPC_TimeTrialGhostConfirmationState.BPC_TimeTrialGhostConfirmationState_C.OnFaceButtonLeftPressedEvent
// 0x0008 (0x0008 - 0x0000)
struct BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonLeftPressedEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonLeftPressedEvent) == 0x000008, "Wrong alignment on BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonLeftPressedEvent");
static_assert(sizeof(BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonLeftPressedEvent) == 0x000008, "Wrong size on BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonLeftPressedEvent");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonLeftPressedEvent, Object) == 0x000000, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnFaceButtonLeftPressedEvent::Object' has a wrong offset!");

// Function BPC_TimeTrialGhostConfirmationState.BPC_TimeTrialGhostConfirmationState_C.OnDecideReadyGhostOffline
// 0x0010 (0x0010 - 0x0000)
struct BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOffline final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOffline) == 0x000008, "Wrong alignment on BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOffline");
static_assert(sizeof(BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOffline) == 0x000010, "Wrong size on BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOffline");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOffline, Button) == 0x000000, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOffline::Button' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOffline, PanelIndex) == 0x000008, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOffline::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOffline, ButtonIndex) == 0x00000C, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOffline::ButtonIndex' has a wrong offset!");

// Function BPC_TimeTrialGhostConfirmationState.BPC_TimeTrialGhostConfirmationState_C.OnCancelReadyGhostOffline
// 0x0010 (0x0010 - 0x0000)
struct BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOffline final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOffline) == 0x000008, "Wrong alignment on BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOffline");
static_assert(sizeof(BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOffline) == 0x000010, "Wrong size on BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOffline");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOffline, Button) == 0x000000, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOffline::Button' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOffline, PanelIndex) == 0x000008, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOffline::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOffline, ButtonIndex) == 0x00000C, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOffline::ButtonIndex' has a wrong offset!");

// Function BPC_TimeTrialGhostConfirmationState.BPC_TimeTrialGhostConfirmationState_C.OnDecideReadyGhostOnline
// 0x0010 (0x0010 - 0x0000)
struct BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOnline final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOnline) == 0x000008, "Wrong alignment on BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOnline");
static_assert(sizeof(BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOnline) == 0x000010, "Wrong size on BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOnline");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOnline, Button) == 0x000000, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOnline::Button' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOnline, PanelIndex) == 0x000008, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOnline::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOnline, ButtonIndex) == 0x00000C, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnDecideReadyGhostOnline::ButtonIndex' has a wrong offset!");

// Function BPC_TimeTrialGhostConfirmationState.BPC_TimeTrialGhostConfirmationState_C.OnCancelReadyGhostOnline
// 0x0010 (0x0010 - 0x0000)
struct BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOnline final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOnline) == 0x000008, "Wrong alignment on BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOnline");
static_assert(sizeof(BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOnline) == 0x000010, "Wrong size on BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOnline");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOnline, Button) == 0x000000, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOnline::Button' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOnline, PanelIndex) == 0x000008, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOnline::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOnline, ButtonIndex) == 0x00000C, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnCancelReadyGhostOnline::ButtonIndex' has a wrong offset!");

// Function BPC_TimeTrialGhostConfirmationState.BPC_TimeTrialGhostConfirmationState_C.ReplayWindow_OnDecide
// 0x0010 (0x0010 - 0x0000)
struct BPC_TimeTrialGhostConfirmationState_C_ReplayWindow_OnDecide final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialGhostConfirmationState_C_ReplayWindow_OnDecide) == 0x000008, "Wrong alignment on BPC_TimeTrialGhostConfirmationState_C_ReplayWindow_OnDecide");
static_assert(sizeof(BPC_TimeTrialGhostConfirmationState_C_ReplayWindow_OnDecide) == 0x000010, "Wrong size on BPC_TimeTrialGhostConfirmationState_C_ReplayWindow_OnDecide");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_ReplayWindow_OnDecide, Button) == 0x000000, "Member 'BPC_TimeTrialGhostConfirmationState_C_ReplayWindow_OnDecide::Button' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_ReplayWindow_OnDecide, PanelIndex) == 0x000008, "Member 'BPC_TimeTrialGhostConfirmationState_C_ReplayWindow_OnDecide::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_ReplayWindow_OnDecide, ButtonIndex) == 0x00000C, "Member 'BPC_TimeTrialGhostConfirmationState_C_ReplayWindow_OnDecide::ButtonIndex' has a wrong offset!");

// Function BPC_TimeTrialGhostConfirmationState.BPC_TimeTrialGhostConfirmationState_C.HashErrorWindow_OnDecide
// 0x0010 (0x0010 - 0x0000)
struct BPC_TimeTrialGhostConfirmationState_C_HashErrorWindow_OnDecide final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialGhostConfirmationState_C_HashErrorWindow_OnDecide) == 0x000008, "Wrong alignment on BPC_TimeTrialGhostConfirmationState_C_HashErrorWindow_OnDecide");
static_assert(sizeof(BPC_TimeTrialGhostConfirmationState_C_HashErrorWindow_OnDecide) == 0x000010, "Wrong size on BPC_TimeTrialGhostConfirmationState_C_HashErrorWindow_OnDecide");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_HashErrorWindow_OnDecide, Button) == 0x000000, "Member 'BPC_TimeTrialGhostConfirmationState_C_HashErrorWindow_OnDecide::Button' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_HashErrorWindow_OnDecide, PanelIndex) == 0x000008, "Member 'BPC_TimeTrialGhostConfirmationState_C_HashErrorWindow_OnDecide::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_HashErrorWindow_OnDecide, ButtonIndex) == 0x00000C, "Member 'BPC_TimeTrialGhostConfirmationState_C_HashErrorWindow_OnDecide::ButtonIndex' has a wrong offset!");

// Function BPC_TimeTrialGhostConfirmationState.BPC_TimeTrialGhostConfirmationState_C.OnGhostHashCheckCompleted
// 0x0001 (0x0001 - 0x0000)
struct BPC_TimeTrialGhostConfirmationState_C_OnGhostHashCheckCompleted final
{
public:
	bool                                          bIsGhostHashOK;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialGhostConfirmationState_C_OnGhostHashCheckCompleted) == 0x000001, "Wrong alignment on BPC_TimeTrialGhostConfirmationState_C_OnGhostHashCheckCompleted");
static_assert(sizeof(BPC_TimeTrialGhostConfirmationState_C_OnGhostHashCheckCompleted) == 0x000001, "Wrong size on BPC_TimeTrialGhostConfirmationState_C_OnGhostHashCheckCompleted");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_OnGhostHashCheckCompleted, bIsGhostHashOK) == 0x000000, "Member 'BPC_TimeTrialGhostConfirmationState_C_OnGhostHashCheckCompleted::bIsGhostHashOK' has a wrong offset!");

// Function BPC_TimeTrialGhostConfirmationState.BPC_TimeTrialGhostConfirmationState_C.SetInputEnable
// 0x0001 (0x0001 - 0x0000)
struct BPC_TimeTrialGhostConfirmationState_C_SetInputEnable final
{
public:
	bool                                          InInputEnable;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialGhostConfirmationState_C_SetInputEnable) == 0x000001, "Wrong alignment on BPC_TimeTrialGhostConfirmationState_C_SetInputEnable");
static_assert(sizeof(BPC_TimeTrialGhostConfirmationState_C_SetInputEnable) == 0x000001, "Wrong size on BPC_TimeTrialGhostConfirmationState_C_SetInputEnable");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_SetInputEnable, InInputEnable) == 0x000000, "Member 'BPC_TimeTrialGhostConfirmationState_C_SetInputEnable::InInputEnable' has a wrong offset!");

// Function BPC_TimeTrialGhostConfirmationState.BPC_TimeTrialGhostConfirmationState_C.ExecuteUbergraph_BPC_TimeTrialGhostConfirmationState
// 0x0490 (0x0490 - 0x0000)
struct BPC_TimeTrialGhostConfirmationState_C_ExecuteUbergraph_BPC_TimeTrialGhostConfirmationState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowBase*                CallFunc_CreatePopupWindow_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         Temp_byte_Variable;                                // 0x0098(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         Temp_byte_Variable_1;                              // 0x0099(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_1;                       // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGhostMachineDisable_ReturnValue;        // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDataOnline_ReturnValue;           // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLineGuideDisable_ReturnValue;           // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDataOnline_ReturnValue_1;         // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TimeTrial_Sub_Offline_C*           CallFunc_Create_ReturnValue;                       // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDataOnline_ReturnValue_2;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x012C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDataOnline_ReturnValue_3;         // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDataOnline_ReturnValue_4;         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDataOnline_ReturnValue_5;         // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0168(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     K2Node_Select_Default;                             // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_5;                       // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_5;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_5;                  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_4;                       // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_4;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_4;                  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_3;                       // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_3;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_3;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_223[0x5];                                      // 0x0223(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_2;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_2;                  // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0240(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_11; // 0x025C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     K2Node_Select_Default_1;                           // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_12; // 0x0278(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_13; // 0x0288(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_14; // 0x0298(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x02A8(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x02AC(0x0004)()
	ESpeedClassId                                 CallFunc_GetSelectedClassId_ReturnValue;           // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x02B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x02C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     K2Node_Select_Default_2;                           // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x02E8(0x0010)()
	bool                                          Temp_bool_Variable_4;                              // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     K2Node_Select_Default_3;                           // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UReadyOption*                           K2Node_Select_Default_4;                           // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0310(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0320(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0338(0x0010)(ConstParm, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0348(0x0010)()
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_17; // 0x0358(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_1;                   // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_1;                  // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_18; // 0x037C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuInputRecieveObject*                CallFunc_SpawnObject_ReturnValue;                  // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerController_C*             K2Node_DynamicCast_AsBP_Menu_Player_Controller;    // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDataOnline_ReturnValue_6;         // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue;             // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_TimeTrialSequence_C*                K2Node_DynamicCast_AsBP_Time_Trial_Sequence;       // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      CallFunc_GetSelectedStageId_Selected_Stage_Id_Single; // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsValidGhost_ReturnValue;              // 0x03CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDataOnline_ReturnValue_7;         // 0x03CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      CallFunc_GetSelectedStageId_Selected_Stage_Id_Single_1; // 0x03CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         CallFunc_GetBackMenuState_ReturnValue;             // 0x03CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      CallFunc_GetSelectedStageId_Selected_Stage_Id_Single_2; // 0x03CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_19; // 0x03D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_20; // 0x03E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_21; // 0x03F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_22; // 0x0400(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_412[0x6];                                      // 0x0412(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UReadyOption*                           K2Node_Select_Default_5;                           // 0x0418(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuSequenceUIInterface> CallFunc_SetNextSubMenuSequenceState_self_CastInput; // 0x0420(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuSequenceUIInterface> CallFunc_SetNextSubMenuSequenceState_self_CastInput_1; // 0x0430(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpeedClassId                                 CallFunc_GetSelectedClassId_ReturnValue_1;         // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_Select_Default_6;                           // 0x0441(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      CallFunc_GetSelectedStageId_Selected_Stage_Id_Single_3; // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_443[0x5];                                      // 0x0443(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0448(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0458(0x0010)()
	ESpeedClassId                                 CallFunc_GetSelectedClassId_ReturnValue_2;         // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsGhostHashOK;                       // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      CallFunc_GetSelectedStageId_Selected_Stage_Id_Single_4; // 0x046A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46B[0x5];                                      // 0x046B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformUserId_ReturnValue;            // 0x0470(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InInputEnable;                  // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDataOnline_ReturnValue_8;         // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_482[0x6];                                      // 0x0482(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TimeTrial_Sub_Online_C*            CallFunc_Create_ReturnValue_1;                     // 0x0488(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialGhostConfirmationState_C_ExecuteUbergraph_BPC_TimeTrialGhostConfirmationState) == 0x000008, "Wrong alignment on BPC_TimeTrialGhostConfirmationState_C_ExecuteUbergraph_BPC_TimeTrialGhostConfirmationState");
static_assert(sizeof(BPC_TimeTrialGhostConfirmationState_C_ExecuteUbergraph_BPC_TimeTrialGhostConfirmationState) == 0x000490, "Wrong size on BPC_TimeTrialGhostConfirmationState_C_ExecuteUbergraph_BPC_TimeTrialGhostConfirmationState");
static_assert(offsetof(BPC_TimeTrialGhostConfirmationState_C_ExecuteUbergraph_BPC_TimeTrialGhostConfirmationState, EntryPoint) == 0x000000, "Member 'BPC_TimeTrialGhostConfirmationState_C_ExecuteUbergraph_BPC_TimeTrialGhostConfirmationState::EntryPoint' has a wrong offset!");
