#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_TimeTrialClassSelectSubState

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function BPC_TimeTrialClassSelectSubState.BPC_TimeTrialClassSelectSubState_C.ConvertIndexToClassId
// 0x0008 (0x0008 - 0x0000)
struct BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             newParam;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId) == 0x000004, "Wrong alignment on BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId");
static_assert(sizeof(BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId) == 0x000008, "Wrong size on BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId, Index_0) == 0x000000, "Member 'BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId::Index_0' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId, newParam) == 0x000004, "Member 'BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId::newParam' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId, CallFunc_Conv_IntToByte_ReturnValue) == 0x000005, "Member 'BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId, CallFunc_GetValidValue_ReturnValue) == 0x000006, "Member 'BPC_TimeTrialClassSelectSubState_C_ConvertIndexToClassId::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function BPC_TimeTrialClassSelectSubState.BPC_TimeTrialClassSelectSubState_C.ExecuteUbergraph_BPC_TimeTrialClassSelectSubState
// 0x0318 (0x0318 - 0x0000)
struct BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;         // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         Temp_byte_Variable;                                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             Temp_byte_Variable_2;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             Temp_byte_Variable_3;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuSoundSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsCourse_Select_Widget_Base; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCourseSelectWidgetBase*                CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadHint_ReturnValue;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadHint_ReturnValue_1;                 // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNeedInitFadeOut_ReturnValue;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TimeTrialSequence_C*                K2Node_DynamicCast_AsBP_Time_Trial_Sequence;       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuInputRecieveObject*                CallFunc_SpawnObject_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CourseSelect_TimeTrial_C*          K2Node_DynamicCast_AsWBP_Course_Select_Time_Trial; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHintId                                       Temp_byte_Variable_4;                              // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue_1;               // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentTopMenuLevelName_ReturnValue;   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue_2;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuLobbyLevelInterface> K2Node_DynamicCast_AsMenu_Lobby_Level_Interface; // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CallFunc_GetCameraActor_ReturnValue;               // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x014C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetSelectedMenuSpeedClassId_ReturnValue;  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_2; // 0x016C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_3; // 0x017C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_4; // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_2;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_2;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_1;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_1;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             Temp_byte_Variable_5;                              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             K2Node_Select_Default;                             // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             Temp_byte_Variable_6;                              // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x01DC(0x0004)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CourseSelect_TimeTrial_C*          K2Node_DynamicCast_AsWBP_Course_Select_Time_Trial_1; // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CourseSelect_TimeTrial_C*          K2Node_DynamicCast_AsWBP_Course_Select_Time_Trial_2; // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuSequenceUIInterface> CallFunc_SetNextSubMenuSequenceState_self_CastInput; // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHintId                                       Temp_byte_Variable_7;                              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x023C(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x0240(0x0004)()
	bool                                          Temp_bool_Variable_1;                              // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             K2Node_Select_Default_1;                           // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_246[0x2];                                      // 0x0246(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMenuPlayerController*                  K2Node_DynamicCast_AsMenu_Player_Controller;       // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLastStateIsClassSelect_LClassSelect;   // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate_7;     // 0x025C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         K2Node_CustomEvent_FadeDirection;                  // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMenuPlayerController*                  K2Node_DynamicCast_AsMenu_Player_Controller_1;     // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLastStateIsClassSelect_LClassSelect_1; // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_283[0x5];                                      // 0x0283(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0290(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x02A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetState_ReturnValue;                     // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentState_ReturnValue;              // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLastStateIsClassSelect_LClassSelect_2; // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_Select_Default_2;                           // 0x02C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x02C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHintId                                       K2Node_Select_Default_3;                           // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHintId                                       Temp_byte_Variable_8;                              // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x02CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHintId                                       K2Node_Select_Default_4;                           // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CE[0x2];                                      // 0x02CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_1;                             // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsWBP_Class_Select_Time_Trial; // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ClassSelect_TimeTrial_C*           CallFunc_Create_ReturnValue_1;                     // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_10;      // 0x0304(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState) == 0x000008, "Wrong alignment on BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState");
static_assert(sizeof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState) == 0x000318, "Wrong size on BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, EntryPoint) == 0x000000, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_bool_Variable) == 0x000016, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_byte_Variable) == 0x000017, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_byte_Variable_1) == 0x000018, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_int_Variable) == 0x00001C, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_byte_Variable_2) == 0x000020, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_byte_Variable_3) == 0x000021, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000038, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000040, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CustomEvent_Loaded) == 0x000048, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsValid_ReturnValue_3) == 0x000050, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_class_Variable) == 0x000058, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_ClassDynamicCast_AsCourse_Select_Widget_Base) == 0x000060, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_ClassDynamicCast_AsCourse_Select_Widget_Base' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_ClassDynamicCast_bSuccess) == 0x000068, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_Create_ReturnValue) == 0x000070, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_bool_IsClosed_Variable) == 0x000078, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsReadHint_ReturnValue) == 0x000079, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsReadHint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsReadHint_ReturnValue_1) == 0x00007A, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsReadHint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_Not_PreBool_ReturnValue) == 0x00007B, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_BooleanAND_ReturnValue) == 0x00007C, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_Not_PreBool_ReturnValue_1) == 0x00007D, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsValid_ReturnValue_4) == 0x00007E, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_Not_PreBool_ReturnValue_2) == 0x00007F, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetPlayerController_ReturnValue) == 0x000080, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000088, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetPlayerController_ReturnValue_1) == 0x000098, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x0000A0, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_UnregisterSingleSubMenu_ReturnValue) == 0x0000A9, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_UnregisterSingleSubMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetOwnerSequence_ReturnValue) == 0x0000B0, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetOwnerSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetNeedInitFadeOut_ReturnValue) == 0x0000B8, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetNeedInitFadeOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_AsBP_Time_Trial_Sequence) == 0x0000C0, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_AsBP_Time_Trial_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_SpawnObject_ReturnValue) == 0x0000D0, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsValid_ReturnValue_5) == 0x0000D8, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000E0, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsInViewport_ReturnValue) == 0x0000E8, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_AsWBP_Course_Select_Time_Trial) == 0x0000F0, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_AsWBP_Course_Select_Time_Trial' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsValid_ReturnValue_6) == 0x0000F9, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_byte_Variable_4) == 0x0000FA, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsValid_ReturnValue_7) == 0x0000FB, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsInViewport_ReturnValue_1) == 0x0000FC, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsInViewport_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetWorldSubsystem_ReturnValue_2) == 0x000100, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetWorldSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetCurrentTopMenuLevelName_ReturnValue) == 0x000108, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetCurrentTopMenuLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsInViewport_ReturnValue_2) == 0x000110, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsInViewport_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetStreamingLevel_ReturnValue) == 0x000118, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetLevelScriptActor_ReturnValue) == 0x000120, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_AsMenu_Lobby_Level_Interface) == 0x000128, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_AsMenu_Lobby_Level_Interface' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_bSuccess_4) == 0x000138, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetCameraActor_ReturnValue) == 0x000140, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetCameraActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_IsValid_ReturnValue_8) == 0x000148, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CreateDelegate_OutputDelegate_1) == 0x00014C, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetPlayerController_ReturnValue_2) == 0x000160, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetSelectedMenuSpeedClassId_ReturnValue) == 0x000168, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetSelectedMenuSpeedClassId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000169, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CreateDelegate_OutputDelegate_2) == 0x00016C, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CreateDelegate_OutputDelegate_3) == 0x00017C, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CreateDelegate_OutputDelegate_4) == 0x00018C, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CustomEvent_Button_2) == 0x0001A0, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CustomEvent_PanelIndex_2) == 0x0001A8, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CustomEvent_PanelIndex_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CustomEvent_ButtonIndex_2) == 0x0001AC, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CustomEvent_ButtonIndex_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001B0, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CustomEvent_Button_1) == 0x0001B8, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CustomEvent_PanelIndex_1) == 0x0001C0, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CustomEvent_PanelIndex_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CustomEvent_ButtonIndex_1) == 0x0001C4, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CustomEvent_ButtonIndex_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CustomEvent_Button) == 0x0001C8, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CustomEvent_PanelIndex) == 0x0001D0, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CustomEvent_PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CustomEvent_ButtonIndex) == 0x0001D4, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_byte_Variable_5) == 0x0001D8, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_Select_Default) == 0x0001D9, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001DA, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_byte_Variable_6) == 0x0001DB, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_SoundPlay_ReturnValue) == 0x0001DC, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001E0, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_AsWBP_Course_Select_Time_Trial_1) == 0x0001F0, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_AsWBP_Course_Select_Time_Trial_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_bSuccess_5) == 0x0001F8, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001FC, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_AsWBP_Course_Select_Time_Trial_2) == 0x000210, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_AsWBP_Course_Select_Time_Trial_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, K2Node_DynamicCast_bSuccess_6) == 0x000218, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_SetNextSubMenuSequenceState_self_CastInput) == 0x000220, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_SetNextSubMenuSequenceState_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_GetPlayerController_ReturnValue_3) == 0x000230, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_byte_Variable_7) == 0x000238, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_SoundPlay_ReturnValue_1) == 0x00023C, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, CallFunc_SoundPlay_ReturnValue_2) == 0x000240, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState, Temp_bool_Variable_1) == 0x000244, "Member 'BPC_TimeTrialClassSelectSubState_C_ExecuteUbergraph_BPC_TimeTrialClassSelectSubState::Temp_bool_Variable_1' has a wrong offset!");
