#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MachineCustomizeColorDetailState

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_MachineCustomizeColorDetailState.BPC_MachineCustomizeColorDetailState_C
// 0x0020 (0x0118 - 0x00F8)
class UBPC_MachineCustomizeColorDetailState_C final : public UMachineCustomizeColorDetailState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AMachineCustomizeSequence*              Sequence;                                          // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerPreview_C*                 Racer;                                             // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_C*   ColorDetailWindow;                                 // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BindPage();
	void BindTab();
	void ColorDetailWindow_OnColorItemFocused(const struct FST_ColorDetailWindowColorItemData& InItemData);
	void ColorDetailWindow_OnColorItemSelected(const struct FST_ColorDetailWindowColorItemData& InItemData);
	void ColorDetailWindow_OnSurfaceItemFocused(const struct FST_PullDownMenuItemData& InItemData);
	void ColorDetailWindow_OnSurfaceItemSelected(const struct FST_PullDownMenuItemData& InItemData);
	void ExecuteUbergraph_BPC_MachineCustomizeColorDetailState(int32 EntryPoint);
	void GetColor(const struct FUserMachineCustomizeData& InCustomizeData, EMachineColorAreaUIId InColorAreaId, int32* OutColorId);
	void GetSurface(const struct FUserMachineCustomizeData& InCustomizeData, EMachineColorAreaUIId InColorAreaId, int32* OutSurfaceId);
	void OnInitState();
	void OnSetupPage();
	void SetColor(const struct FUserMachineCustomizeData& InCustomizeData, EMachineColorAreaUIId InColorAreaId, int32 InColorId, struct FUserMachineCustomizeData* OutCustomizeData);
	void SetProperties();
	void SetSurface(const struct FUserMachineCustomizeData& InCustomizeData, EMachineColorAreaUIId InColorAreaId, int32 InSurfaceId, struct FUserMachineCustomizeData* OutCustomizeData);
	void UnbindPage();
	void UnbindTab();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_MachineCustomizeColorDetailState_C">();
	}
	static class UBPC_MachineCustomizeColorDetailState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_MachineCustomizeColorDetailState_C>();
	}
};
static_assert(alignof(UBPC_MachineCustomizeColorDetailState_C) == 0x000008, "Wrong alignment on UBPC_MachineCustomizeColorDetailState_C");
static_assert(sizeof(UBPC_MachineCustomizeColorDetailState_C) == 0x000118, "Wrong size on UBPC_MachineCustomizeColorDetailState_C");
static_assert(offsetof(UBPC_MachineCustomizeColorDetailState_C, UberGraphFrame) == 0x0000F8, "Member 'UBPC_MachineCustomizeColorDetailState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeColorDetailState_C, Sequence) == 0x000100, "Member 'UBPC_MachineCustomizeColorDetailState_C::Sequence' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeColorDetailState_C, Racer) == 0x000108, "Member 'UBPC_MachineCustomizeColorDetailState_C::Racer' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizeColorDetailState_C, ColorDetailWindow) == 0x000110, "Member 'UBPC_MachineCustomizeColorDetailState_C::ColorDetailWindow' has a wrong offset!");

}

