#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceResultGhostEnd

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_RaceResultGhostEnd.BPC_RaceResultGhostEnd_C.Create Upload Select Window
// 0x00F8 (0x00F8 - 0x0000)
struct BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window final
{
public:
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0010(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0028(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0038(0x0010)()
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ConstParm, ReferenceParm)
	class UUnionUIPopupWindowBase*                CallFunc_CreatePopupWindow_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0068(0x0010)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1; // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2; // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3; // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4; // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window) == 0x000008, "Wrong alignment on BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window");
static_assert(sizeof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window) == 0x0000F8, "Wrong size on BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, CallFunc_MakeLiteralText_ReturnValue) == 0x000010, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000028, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000038, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000048, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, K2Node_MakeArray_Array) == 0x000050, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, CallFunc_CreatePopupWindow_ReturnValue) == 0x000060, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::CallFunc_CreatePopupWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000068, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, CallFunc_MakeLiteralByte_ReturnValue) == 0x000078, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, K2Node_DynamicCast_AsMenu_Popup_Window_Interface) == 0x000080, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::K2Node_DynamicCast_AsMenu_Popup_Window_Interface' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000094, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1) == 0x000098, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2) == 0x0000B0, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3) == 0x0000C8, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, K2Node_DynamicCast_bSuccess_3) == 0x0000D8, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4) == 0x0000E0, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window, K2Node_DynamicCast_bSuccess_4) == 0x0000F0, "Member 'BPC_RaceResultGhostEnd_C_Create_Upload_Select_Window::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function BPC_RaceResultGhostEnd.BPC_RaceResultGhostEnd_C.CreateErrorWindow
// 0x00B8 (0x00B8 - 0x0000)
struct BPC_RaceResultGhostEnd_C_CreateErrorWindow final
{
public:
	class FText                                   MessageText;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIPopupWindowBase*                CallFunc_CreatePopupWindow_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0048(0x0010)()
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultGhostEnd_C_CreateErrorWindow) == 0x000008, "Wrong alignment on BPC_RaceResultGhostEnd_C_CreateErrorWindow");
static_assert(sizeof(BPC_RaceResultGhostEnd_C_CreateErrorWindow) == 0x0000B8, "Wrong size on BPC_RaceResultGhostEnd_C_CreateErrorWindow");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, MessageText) == 0x000000, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::MessageText' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, CallFunc_MakeLiteralByte_ReturnValue) == 0x000020, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000038, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, CallFunc_CreatePopupWindow_ReturnValue) == 0x000040, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::CallFunc_CreatePopupWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, CallFunc_MakeLiteralText_ReturnValue) == 0x000048, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface) == 0x000058, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1) == 0x000070, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2) == 0x000088, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3) == 0x0000A0, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_CreateErrorWindow, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'BPC_RaceResultGhostEnd_C_CreateErrorWindow::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BPC_RaceResultGhostEnd.BPC_RaceResultGhostEnd_C.ExecuteUbergraph_BPC_RaceResultGhostEnd
// 0x0150 (0x0150 - 0x0000)
struct BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GhostResultUploadActor_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoggedIn_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGhostSubSystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGhostRequestFailed_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_1;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESpeedClassId                                 CallFunc_GetSelectedClassId_ReturnValue;           // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EStageId>                              CallFunc_GetSelectedStageIds_ReturnValue;          // 0x00D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetTimeTrialRaceData_bOutIsGhostValid;    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserTimeTrialRaceData                 CallFunc_GetTimeTrialRaceData_ReturnValue;         // 0x00F0(0x0050)()
	bool                                          CallFunc_IsTimeTrialRankCleared_ReturnValue;       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeTrialWinLoseDispId                       CallFunc_GetTimeTrialLastResultId_ReturnValue;     // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDeltaTime;                          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpeedClassId                                 CallFunc_GetSelectedClassId_ReturnValue_1;         // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsViewGhostReplay_ReturnValue;            // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x014E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd) == 0x000010, "Wrong alignment on BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd");
static_assert(sizeof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd) == 0x000150, "Wrong size on BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, EntryPoint) == 0x000000, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000078, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_IsLoggedIn_ReturnValue) == 0x000088, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_IsLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000090, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_IsGhostRequestFailed_ReturnValue) == 0x000098, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_IsGhostRequestFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000099, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_Not_PreBool_ReturnValue) == 0x00009A, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00009B, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_BooleanAND_ReturnValue) == 0x00009C, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00009D, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, K2Node_CustomEvent_Button_1) == 0x0000A0, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, K2Node_CustomEvent_PanelIndex_1) == 0x0000A8, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::K2Node_CustomEvent_PanelIndex_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, K2Node_CustomEvent_ButtonIndex_1) == 0x0000AC, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::K2Node_CustomEvent_ButtonIndex_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, K2Node_CustomEvent_Button) == 0x0000B0, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, K2Node_CustomEvent_PanelIndex) == 0x0000B8, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::K2Node_CustomEvent_PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, K2Node_CustomEvent_ButtonIndex) == 0x0000BC, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C0, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, K2Node_CreateDelegate_OutputDelegate) == 0x0000C4, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_GetSelectedClassId_ReturnValue) == 0x0000D4, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_GetSelectedClassId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_GetSelectedStageIds_ReturnValue) == 0x0000D8, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_GetSelectedStageIds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_GetTimeTrialRaceData_bOutIsGhostValid) == 0x0000E8, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_GetTimeTrialRaceData_bOutIsGhostValid' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_GetTimeTrialRaceData_ReturnValue) == 0x0000F0, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_GetTimeTrialRaceData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_IsTimeTrialRankCleared_ReturnValue) == 0x000140, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_IsTimeTrialRankCleared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_Not_PreBool_ReturnValue_1) == 0x000141, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_GetTimeTrialLastResultId_ReturnValue) == 0x000142, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_GetTimeTrialLastResultId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_BooleanAND_ReturnValue_1) == 0x000143, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000144, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_BooleanAND_ReturnValue_2) == 0x000145, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, K2Node_Event_InDeltaTime) == 0x000148, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_GetSelectedClassId_ReturnValue_1) == 0x00014C, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_GetSelectedClassId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_IsViewGhostReplay_ReturnValue) == 0x00014D, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_IsViewGhostReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd, CallFunc_Not_PreBool_ReturnValue_2) == 0x00014E, "Member 'BPC_RaceResultGhostEnd_C_ExecuteUbergraph_BPC_RaceResultGhostEnd::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function BPC_RaceResultGhostEnd.BPC_RaceResultGhostEnd_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_RaceResultGhostEnd_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultGhostEnd_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_RaceResultGhostEnd_C_OnUpdateState");
static_assert(sizeof(BPC_RaceResultGhostEnd_C_OnUpdateState) == 0x000004, "Wrong size on BPC_RaceResultGhostEnd_C_OnUpdateState");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_RaceResultGhostEnd_C_OnUpdateState::InDeltaTime' has a wrong offset!");

// Function BPC_RaceResultGhostEnd.BPC_RaceResultGhostEnd_C.TimeTrialErrorWindow_OnDecide
// 0x0010 (0x0010 - 0x0000)
struct BPC_RaceResultGhostEnd_C_TimeTrialErrorWindow_OnDecide final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultGhostEnd_C_TimeTrialErrorWindow_OnDecide) == 0x000008, "Wrong alignment on BPC_RaceResultGhostEnd_C_TimeTrialErrorWindow_OnDecide");
static_assert(sizeof(BPC_RaceResultGhostEnd_C_TimeTrialErrorWindow_OnDecide) == 0x000010, "Wrong size on BPC_RaceResultGhostEnd_C_TimeTrialErrorWindow_OnDecide");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_TimeTrialErrorWindow_OnDecide, Button) == 0x000000, "Member 'BPC_RaceResultGhostEnd_C_TimeTrialErrorWindow_OnDecide::Button' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_TimeTrialErrorWindow_OnDecide, PanelIndex) == 0x000008, "Member 'BPC_RaceResultGhostEnd_C_TimeTrialErrorWindow_OnDecide::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_TimeTrialErrorWindow_OnDecide, ButtonIndex) == 0x00000C, "Member 'BPC_RaceResultGhostEnd_C_TimeTrialErrorWindow_OnDecide::ButtonIndex' has a wrong offset!");

// Function BPC_RaceResultGhostEnd.BPC_RaceResultGhostEnd_C.TimeTrialUploadSelect_OnDecide
// 0x0010 (0x0010 - 0x0000)
struct BPC_RaceResultGhostEnd_C_TimeTrialUploadSelect_OnDecide final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceResultGhostEnd_C_TimeTrialUploadSelect_OnDecide) == 0x000008, "Wrong alignment on BPC_RaceResultGhostEnd_C_TimeTrialUploadSelect_OnDecide");
static_assert(sizeof(BPC_RaceResultGhostEnd_C_TimeTrialUploadSelect_OnDecide) == 0x000010, "Wrong size on BPC_RaceResultGhostEnd_C_TimeTrialUploadSelect_OnDecide");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_TimeTrialUploadSelect_OnDecide, Button) == 0x000000, "Member 'BPC_RaceResultGhostEnd_C_TimeTrialUploadSelect_OnDecide::Button' has a wrong offset!");
static_assert(offsetof(BPC_RaceResultGhostEnd_C_TimeTrialUploadSelect_OnDecide, PanelIndex) == 0x000008, "Member 'BPC_RaceResultGhostEnd_C_TimeTrialUploadSelect_OnDecide::PanelIndex' has a wrong offset!");
