#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MenuStatePartyRaceSelectPreset

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionLib_structs.hpp"


namespace SDK::Params
{

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnCutinStartEvent
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnCutinStartEvent final
{
public:
	class UMenuSoundSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnCutinStartEvent) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnCutinStartEvent");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnCutinStartEvent) == 0x000010, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnCutinStartEvent");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnCutinStartEvent, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnCutinStartEvent::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnCutinStartEvent, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnCutinStartEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.RivalTeamSettingByRule
// 0x002C (0x002C - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRacePreset                              Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyRaceRivalExists_ReturnValue;       // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_2;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule) == 0x000004, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule) == 0x00002C, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule, Temp_int_Variable) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule, Temp_int_Variable_1) == 0x000004, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule, Temp_int_Variable_2) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule, Temp_int_Variable_3) == 0x00000C, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule, Temp_int_Variable_4) == 0x000010, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule, Temp_byte_Variable) == 0x000014, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule, CallFunc_IsPartyRaceRivalExists_ReturnValue) == 0x000015, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule::CallFunc_IsPartyRaceRivalExists_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule, CallFunc_MakeLiteralInt_ReturnValue) == 0x000018, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000020, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule, CallFunc_MakeLiteralInt_ReturnValue_2) == 0x000024, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule::CallFunc_MakeLiteralInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule, K2Node_Select_Default) == 0x000028, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalTeamSettingByRule::K2Node_Select_Default' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.GetDiaglogueEventManager
// 0x0048 (0x0048 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager final
{
public:
	class ABP_DialogueEventManager_C*             EventManager;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IDialogueEventInterface> K2Node_DynamicCast_AsDialogue_Event_Interface;   // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADialogueEventManagerBase*              CallFunc_GetDialogueEventManager_Manager;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DialogueEventManager_C*             K2Node_DynamicCast_AsBP_Dialogue_Event_Manager;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager) == 0x000048, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager, EventManager) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager::EventManager' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager, CallFunc_GetStreamingLevel_ReturnValue) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager, CallFunc_GetLevelScriptActor_ReturnValue) == 0x000010, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager, K2Node_DynamicCast_AsDialogue_Event_Interface) == 0x000018, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager::K2Node_DynamicCast_AsDialogue_Event_Interface' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager, CallFunc_GetDialogueEventManager_Manager) == 0x000030, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager::CallFunc_GetDialogueEventManager_Manager' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager, K2Node_DynamicCast_AsBP_Dialogue_Event_Manager) == 0x000038, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager::K2Node_DynamicCast_AsBP_Dialogue_Event_Manager' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_GetDiaglogueEventManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.SetVisibleFooterSubButton
// 0x0018 (0x0018 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton final
{
public:
	ESlateVisibility                              InputPin;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton) == 0x000018, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton, InputPin) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton::InputPin' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton, Temp_bool_Variable) == 0x000001, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton, Temp_bool_Variable_1) == 0x000002, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton, Temp_bool_Variable_2) == 0x000003, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton, Temp_bool_Variable_3) == 0x000010, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton, Temp_bool_Variable_4) == 0x000012, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton, Temp_byte_Variable) == 0x000013, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton, K2Node_Select_Default) == 0x000014, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetVisibleFooterSubButton::K2Node_Select_Default' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.SetMessage
// 0x0040 (0x0040 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_SetMessage final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IDialogueEventInterface> K2Node_DynamicCast_AsDialogue_Event_Interface;   // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_SetMessage) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_SetMessage");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_SetMessage) == 0x000040, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_SetMessage");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetMessage, Text) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetMessage::Text' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetMessage, CallFunc_GetStreamingLevel_ReturnValue) == 0x000010, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetMessage::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetMessage, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetMessage, CallFunc_GetLevelScriptActor_ReturnValue) == 0x000020, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetMessage::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetMessage, K2Node_DynamicCast_AsDialogue_Event_Interface) == 0x000028, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetMessage::K2Node_DynamicCast_AsDialogue_Event_Interface' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_SetMessage, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_SetMessage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.DialogueEventEnd
// 0x0030 (0x0030 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd final
{
public:
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IDialogueEventInterface> K2Node_DynamicCast_AsDialogue_Event_Interface;   // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd) == 0x000030, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd, CallFunc_GetStreamingLevel_ReturnValue) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd, CallFunc_GetLevelScriptActor_ReturnValue) == 0x000010, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd, K2Node_DynamicCast_AsDialogue_Event_Interface) == 0x000018, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd::K2Node_DynamicCast_AsDialogue_Event_Interface' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_DialogueEventEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnLoaded_3BD75519491A4C8C784C55A871EB6AD7
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_3BD75519491A4C8C784C55A871EB6AD7 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_3BD75519491A4C8C784C55A871EB6AD7) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_3BD75519491A4C8C784C55A871EB6AD7");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_3BD75519491A4C8C784C55A871EB6AD7) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_3BD75519491A4C8C784C55A871EB6AD7");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_3BD75519491A4C8C784C55A871EB6AD7, Loaded) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_3BD75519491A4C8C784C55A871EB6AD7::Loaded' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnLoaded_BB94DABC468B84B69BDA01963A247995
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_BB94DABC468B84B69BDA01963A247995 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_BB94DABC468B84B69BDA01963A247995) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_BB94DABC468B84B69BDA01963A247995");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_BB94DABC468B84B69BDA01963A247995) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_BB94DABC468B84B69BDA01963A247995");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_BB94DABC468B84B69BDA01963A247995, Loaded) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnLoaded_BB94DABC468B84B69BDA01963A247995::Loaded' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnRightShoulderReleasedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderReleasedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderReleasedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderReleasedEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderReleasedEvent_Event) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderReleasedEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderReleasedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderReleasedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnRightShoulderPressedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnLeftShoulderPressedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnLeftShoulderReleasedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderReleasedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderReleasedEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderReleasedEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderReleasedEvent_Event) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderReleasedEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderReleasedEvent_Event, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderReleasedEvent_Event::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnRightShoulderPressedEvent_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event_0 final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event_0) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event_0");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event_0) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event_0");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event_0, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnRightShoulderPressedEvent_Event_0::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnLeftShoulderPressedEvent_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event_0 final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event_0) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event_0");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event_0) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event_0");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event_0, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnLeftShoulderPressedEvent_Event_0::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnFaceButtonLeftPressedEvent_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnFaceButtonLeftPressedEvent_Event_0 final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnFaceButtonLeftPressedEvent_Event_0) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnFaceButtonLeftPressedEvent_Event_0");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnFaceButtonLeftPressedEvent_Event_0) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnFaceButtonLeftPressedEvent_Event_0");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnFaceButtonLeftPressedEvent_Event_0, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnFaceButtonLeftPressedEvent_Event_0::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.RivalONOFF
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFF final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFF) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFF");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFF) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFF");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFF, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFF::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.RivalONOFFCheck
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFFCheck final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFFCheck) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFFCheck");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFFCheck) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFFCheck");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFFCheck, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_RivalONOFFCheck::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.DecisionRivalONOFF
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_DecisionRivalONOFF final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_DecisionRivalONOFF) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_DecisionRivalONOFF");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_DecisionRivalONOFF) == 0x000010, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_DecisionRivalONOFF");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_DecisionRivalONOFF, Button) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_DecisionRivalONOFF::Button' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_DecisionRivalONOFF, PanelIndex) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_DecisionRivalONOFF::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_DecisionRivalONOFF, ButtonIndex) == 0x00000C, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_DecisionRivalONOFF::ButtonIndex' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnButtonDecision
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnButtonDecision final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnButtonDecision) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnButtonDecision");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnButtonDecision) == 0x000010, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnButtonDecision");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnButtonDecision, Button) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnButtonDecision::Button' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnButtonDecision, PanelIndex) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnButtonDecision::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnButtonDecision, ButtonIndex) == 0x00000C, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnButtonDecision::ButtonIndex' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnUISceneCancelEvent_Event
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneCancelEvent_Event final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneCancelEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneCancelEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneCancelEvent_Event) == 0x000010, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneCancelEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneCancelEvent_Event, Button) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneCancelEvent_Event::Button' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneCancelEvent_Event, PanelIndex) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneCancelEvent_Event::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneCancelEvent_Event, ButtonIndex) == 0x00000C, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneCancelEvent_Event::ButtonIndex' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnUISceneFocusEvent_Event
// 0x0010 (0x0010 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneFocusEvent_Event final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneFocusEvent_Event) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneFocusEvent_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneFocusEvent_Event) == 0x000010, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneFocusEvent_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneFocusEvent_Event, Button) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneFocusEvent_Event::Button' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneFocusEvent_Event, PanelIndex) == 0x000008, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneFocusEvent_Event::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneFocusEvent_Event, ButtonIndex) == 0x00000C, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnUISceneFocusEvent_Event::ButtonIndex' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnStartCustomButtonPressed_Event
// 0x0001 (0x0001 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnStartCustomButtonPressed_Event final
{
public:
	EPartyRacePreset                              Preset;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnStartCustomButtonPressed_Event) == 0x000001, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnStartCustomButtonPressed_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnStartCustomButtonPressed_Event) == 0x000001, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnStartCustomButtonPressed_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnStartCustomButtonPressed_Event, Preset) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnStartCustomButtonPressed_Event::Preset' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.PlayOut
// 0x0001 (0x0001 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_PlayOut final
{
public:
	bool                                          NeedFade;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_PlayOut) == 0x000001, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_PlayOut");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_PlayOut) == 0x000001, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_PlayOut");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_PlayOut, NeedFade) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_PlayOut::NeedFade' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnRivalCutinAcceptKeyPressed
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnRivalCutinAcceptKeyPressed final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnRivalCutinAcceptKeyPressed) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnRivalCutinAcceptKeyPressed");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnRivalCutinAcceptKeyPressed) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnRivalCutinAcceptKeyPressed");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnRivalCutinAcceptKeyPressed, Object) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnRivalCutinAcceptKeyPressed::Object' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnFinishedFade_Event
// 0x0001 (0x0001 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnFinishedFade_Event final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnFinishedFade_Event) == 0x000001, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnFinishedFade_Event");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnFinishedFade_Event) == 0x000001, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnFinishedFade_Event");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnFinishedFade_Event, FadeDirection) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnFinishedFade_Event::FadeDirection' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnFinalCheckCencel
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckCencel final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckCencel) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckCencel");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckCencel) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckCencel");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckCencel, Button) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckCencel::Button' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.OnFinalCheckDecide
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckDecide final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckDecide) == 0x000008, "Wrong alignment on BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckDecide");
static_assert(sizeof(BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckDecide) == 0x000008, "Wrong size on BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckDecide");
static_assert(offsetof(BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckDecide, Button) == 0x000000, "Member 'BPC_MenuStatePartyRaceSelectPreset_C_OnFinalCheckDecide::Button' has a wrong offset!");

// Function BPC_MenuStatePartyRaceSelectPreset.BPC_MenuStatePartyRaceSelectPreset_C.ExecuteUbergraph_BPC_MenuStatePartyRaceSelectPreset
// 0x2BB8 (0x2BB8 - 0x0000)
struct BPC_MenuStatePartyRaceSelectPreset_C_ExecuteUbergraph_BPC_MenuStatePartyRaceSelectPreset final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGroupRaceSpeedClass_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetSelectedMenuSpeedClassId_ReturnValue;  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetSelectedMenuSpeedClassId_ReturnValue_1; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableDecisionInRaceParkMilestoneVersion_ReturnValue; // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableDecisionInRaceParkMilestoneVersion_ReturnValue_1; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAppItemSwitchPattern                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAppItemSwitchPattern                  CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0050(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemSwitchSettingSingle               K2Node_MakeStruct_ItemSwitchSettingSingle;         // 0x0080(0x0058)()
	struct FItemSwitchSettingSingle               K2Node_MakeStruct_ItemSwitchSettingSingle_1;       // 0x00D8(0x0058)()
	class UPartyRacePresetSelect*                 CallFunc_GetPartyRacePresetSelectScene_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPartyRacePresetSelect*                 CallFunc_GetPartyRacePresetSelectScene_ReturnValue_1; // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FItemSwitchSetting                     CallFunc_GetItemSwitchSettingBP_OutItemSwitchSetting; // 0x0150(0x0018)()
	int32                                         Temp_int_Variable_1;                               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPartyRacePresetSetting                CallFunc_Map_Find_Value;                           // 0x0170(0x00B8)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22B[0x1];                                      // 0x022B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_2;          // 0x022C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPartyRacePresetSetting                CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0238(0x00B8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpeedClassId                                 CallFunc_GetRaceSettingSpeedClass_ReturnValue;     // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomRaceSetting                     CallFunc_GetCustomRaceSettingBP_OutCustomRaceSetting; // 0x0300(0x0120)()
	bool                                          CallFunc_IsGroupRaceSpeedClass_ReturnValue_1;      // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             K2Node_Select_Default;                             // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPartyRacePresetSetting                CallFunc_GetRaceParkCustomRaceSetting_OutSetting;  // 0x0428(0x00B8)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetSelectedMenuSpeedClassId_ReturnValue_2; // 0x04E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E3[0x5];                                      // 0x04E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemSwitchSetting                     CallFunc_GetItemSwitchSetting_ReturnValue;         // 0x04E8(0x0018)()
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_3;          // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_1;     // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAppItemSwitchPattern                  CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0510(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0539(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A[0x6];                                      // 0x053A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
