#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MenuStatePartyRaceSelectGroup

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_MenuStatePartyRaceSelectGroup.BPC_MenuStatePartyRaceSelectGroup_C
// 0x0040 (0x01C0 - 0x0180)
class UBPC_MenuStatePartyRaceSelectGroup_C final : public UPartyRaceMenuSelectGroupState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0180(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UGroupSelect*>                   GroupSelectList;                                   // 0x0188(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UCommonMenuFooterMenu*                  Footer;                                            // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CMN_FinalCheck_2_C*                ReadyWidget;                                       // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MessageBarTimerHandle;                             // 0x01A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_CMN_MessageBar_C*                  MessageBarWidget;                                  // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           WatchPlateAnimationTimerHandle;                    // 0x01B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckRuleEvent();
	void CreateMessageBarWidget();
	void ExecuteUbergraph_BPC_MenuStatePartyRaceSelectGroup(int32 EntryPoint);
	void FinishMessageBarInfo();
	void ForceFixGroupSettings();
	void ForceUpdateUIComponents(const TArray<int32>& InGroupIndexArray);
	void OnExitState();
	void OnFinalCheckCencel(class UUnionUIButtonBase* Button);
	void OnFinalCheckDecide(class UUnionUIButtonBase* Button);
	void OnInitState();
	void OnUISceneCancelEvent_Event(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnUpdateState(float InDeltaTime);
	void PlayOutMessageBar();
	void SetCompletedGroupIndex();
	void StartReadyConfirmWB();
	void UIEnd_Event();
	void UpdateUIComponents();
	void WatchPlateMoveFinishHost();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_MenuStatePartyRaceSelectGroup_C">();
	}
	static class UBPC_MenuStatePartyRaceSelectGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_MenuStatePartyRaceSelectGroup_C>();
	}
};
static_assert(alignof(UBPC_MenuStatePartyRaceSelectGroup_C) == 0x000008, "Wrong alignment on UBPC_MenuStatePartyRaceSelectGroup_C");
static_assert(sizeof(UBPC_MenuStatePartyRaceSelectGroup_C) == 0x0001C0, "Wrong size on UBPC_MenuStatePartyRaceSelectGroup_C");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectGroup_C, UberGraphFrame) == 0x000180, "Member 'UBPC_MenuStatePartyRaceSelectGroup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectGroup_C, GroupSelectList) == 0x000188, "Member 'UBPC_MenuStatePartyRaceSelectGroup_C::GroupSelectList' has a wrong offset!");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectGroup_C, Footer) == 0x000198, "Member 'UBPC_MenuStatePartyRaceSelectGroup_C::Footer' has a wrong offset!");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectGroup_C, ReadyWidget) == 0x0001A0, "Member 'UBPC_MenuStatePartyRaceSelectGroup_C::ReadyWidget' has a wrong offset!");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectGroup_C, MessageBarTimerHandle) == 0x0001A8, "Member 'UBPC_MenuStatePartyRaceSelectGroup_C::MessageBarTimerHandle' has a wrong offset!");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectGroup_C, MessageBarWidget) == 0x0001B0, "Member 'UBPC_MenuStatePartyRaceSelectGroup_C::MessageBarWidget' has a wrong offset!");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectGroup_C, WatchPlateAnimationTimerHandle) == 0x0001B8, "Member 'UBPC_MenuStatePartyRaceSelectGroup_C::WatchPlateAnimationTimerHandle' has a wrong offset!");

}

