#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MachineCustomizeColorAreaSelectState

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function BPC_MachineCustomizeColorAreaSelectState.BPC_MachineCustomizeColorAreaSelectState_C.EventColorAreaSelectWindow_OnColorAreaSelected
// 0x0040 (0x0040 - 0x0000)
struct BPC_MachineCustomizeColorAreaSelectState_C_EventColorAreaSelectWindow_OnColorAreaSelected final
{
public:
	struct FMachineColorAreaUIData                ItemData;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPC_MachineCustomizeColorAreaSelectState_C_EventColorAreaSelectWindow_OnColorAreaSelected) == 0x000008, "Wrong alignment on BPC_MachineCustomizeColorAreaSelectState_C_EventColorAreaSelectWindow_OnColorAreaSelected");
static_assert(sizeof(BPC_MachineCustomizeColorAreaSelectState_C_EventColorAreaSelectWindow_OnColorAreaSelected) == 0x000040, "Wrong size on BPC_MachineCustomizeColorAreaSelectState_C_EventColorAreaSelectWindow_OnColorAreaSelected");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_EventColorAreaSelectWindow_OnColorAreaSelected, ItemData) == 0x000000, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_EventColorAreaSelectWindow_OnColorAreaSelected::ItemData' has a wrong offset!");

// Function BPC_MachineCustomizeColorAreaSelectState.BPC_MachineCustomizeColorAreaSelectState_C.ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState
// 0x00E8 (0x00E8 - 0x0000)
struct BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FMachineColorAreaUIData& ItemData)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMachineCustomTab*                      CallFunc_GetTab_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMachineCustomTab*                      CallFunc_GetTab_ReturnValue_1;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EMachineCustomizeTabID InTabID)> K2Node_CreateDelegate_OutputDelegate_3;          // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUserMachineCustomizeData              CallFunc_GetSelectedMachineCustomizeData_ReturnValue; // 0x0058(0x0078)()
	class FString                                 CallFunc_GetMachineCustomizeDataDebugStr_OutDebugStr; // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState) == 0x000008, "Wrong alignment on BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState");
static_assert(sizeof(BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState) == 0x0000E8, "Wrong size on BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState, EntryPoint) == 0x000000, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState, CallFunc_GetTab_ReturnValue) == 0x000038, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState::CallFunc_GetTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState, CallFunc_GetTab_ReturnValue_1) == 0x000040, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState::CallFunc_GetTab_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState, CallFunc_GetSelectedMachineCustomizeData_ReturnValue) == 0x000058, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState::CallFunc_GetSelectedMachineCustomizeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState, CallFunc_GetMachineCustomizeDataDebugStr_OutDebugStr) == 0x0000D0, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState::CallFunc_GetMachineCustomizeDataDebugStr_OutDebugStr' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState, K2Node_Event_InDeltaTime) == 0x0000E0, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_ExecuteUbergraph_BPC_MachineCustomizeColorAreaSelectState::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function BPC_MachineCustomizeColorAreaSelectState.BPC_MachineCustomizeColorAreaSelectState_C.HideFooter
// 0x0010 (0x0010 - 0x0000)
struct BPC_MachineCustomizeColorAreaSelectState_C_HideFooter final
{
public:
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeColorAreaSelectState_C_HideFooter) == 0x000008, "Wrong alignment on BPC_MachineCustomizeColorAreaSelectState_C_HideFooter");
static_assert(sizeof(BPC_MachineCustomizeColorAreaSelectState_C_HideFooter) == 0x000010, "Wrong size on BPC_MachineCustomizeColorAreaSelectState_C_HideFooter");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_HideFooter, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_HideFooter::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_HideFooter, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_HideFooter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizeColorAreaSelectState.BPC_MachineCustomizeColorAreaSelectState_C.HidePopupWindow
// 0x0001 (0x0001 - 0x0000)
struct BPC_MachineCustomizeColorAreaSelectState_C_HidePopupWindow final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeColorAreaSelectState_C_HidePopupWindow) == 0x000001, "Wrong alignment on BPC_MachineCustomizeColorAreaSelectState_C_HidePopupWindow");
static_assert(sizeof(BPC_MachineCustomizeColorAreaSelectState_C_HidePopupWindow) == 0x000001, "Wrong size on BPC_MachineCustomizeColorAreaSelectState_C_HidePopupWindow");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_HidePopupWindow, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_HidePopupWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizeColorAreaSelectState.BPC_MachineCustomizeColorAreaSelectState_C.OnSetupPage
// 0x03D0 (0x03D0 - 0x0000)
struct BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage final
{
public:
	bool                                          InDefault;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachineColorAreaTextUIData            K2Node_MakeStruct_MachineColorAreaTextUIData;      // 0x0008(0x0070)()
	EMachineColorAreaUIId                         CallFunc_GetSelectedMachineColorAreaId_ReturnValue; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue_1;     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUserMachineCustomizeData              CallFunc_GetSelectedMachineCustomizeData_ReturnValue; // 0x0090(0x0078)()
	struct FMachineColorAreaSettingUIData         CallFunc_GetMachineColorAreaSettingUIData_OutUIData; // 0x0108(0x02C8)()
};
static_assert(alignof(BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage) == 0x000008, "Wrong alignment on BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage");
static_assert(sizeof(BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage) == 0x0003D0, "Wrong size on BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage, InDefault) == 0x000000, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage::InDefault' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage, K2Node_MakeStruct_MachineColorAreaTextUIData) == 0x000008, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage::K2Node_MakeStruct_MachineColorAreaTextUIData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage, CallFunc_GetSelectedMachineColorAreaId_ReturnValue) == 0x000078, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage::CallFunc_GetSelectedMachineColorAreaId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage, CallFunc_GetAppPlayerController_ReturnValue) == 0x000080, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage, CallFunc_GetAppPlayerController_ReturnValue_1) == 0x000088, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage::CallFunc_GetAppPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage, CallFunc_GetSelectedMachineCustomizeData_ReturnValue) == 0x000090, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage::CallFunc_GetSelectedMachineCustomizeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage, CallFunc_GetMachineColorAreaSettingUIData_OutUIData) == 0x000108, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_OnSetupPage::CallFunc_GetMachineColorAreaSettingUIData_OutUIData' has a wrong offset!");

// Function BPC_MachineCustomizeColorAreaSelectState.BPC_MachineCustomizeColorAreaSelectState_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_MachineCustomizeColorAreaSelectState_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeColorAreaSelectState_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_MachineCustomizeColorAreaSelectState_C_OnUpdateState");
static_assert(sizeof(BPC_MachineCustomizeColorAreaSelectState_C_OnUpdateState) == 0x000004, "Wrong size on BPC_MachineCustomizeColorAreaSelectState_C_OnUpdateState");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_OnUpdateState::InDeltaTime' has a wrong offset!");

// Function BPC_MachineCustomizeColorAreaSelectState.BPC_MachineCustomizeColorAreaSelectState_C.PopupWindow_OnDecision
// 0x0108 (0x0108 - 0x0000)
struct BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_GetSelectedMachineCustomizeData_ReturnValue; // 0x0018(0x0078)()
	struct FUserMachineCustomizeData              CallFunc_SetAllMachineColorsAsDefault_ReturnValue; // 0x0090(0x0078)()
};
static_assert(alignof(BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision) == 0x000008, "Wrong alignment on BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision");
static_assert(sizeof(BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision) == 0x000108, "Wrong size on BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision, Button) == 0x000000, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision::Button' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision, PanelIndex) == 0x000008, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision, ButtonIndex) == 0x00000C, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision::ButtonIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision, CallFunc_GetSelectedMachineCustomizeData_ReturnValue) == 0x000018, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision::CallFunc_GetSelectedMachineCustomizeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision, CallFunc_SetAllMachineColorsAsDefault_ReturnValue) == 0x000090, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_PopupWindow_OnDecision::CallFunc_SetAllMachineColorsAsDefault_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizeColorAreaSelectState.BPC_MachineCustomizeColorAreaSelectState_C.SetProperties
// 0x0030 (0x0030 - 0x0000)
struct BPC_MachineCustomizeColorAreaSelectState_C_SetProperties final
{
public:
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUISceneBase*                      CallFunc_GetColorAreaSelectPage_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AMachineCustomizeSequence*              K2Node_DynamicCast_AsMachine_Customize_Sequence;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_CustomPaint_C*   K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeColorAreaSelectState_C_SetProperties) == 0x000008, "Wrong alignment on BPC_MachineCustomizeColorAreaSelectState_C_SetProperties");
static_assert(sizeof(BPC_MachineCustomizeColorAreaSelectState_C_SetProperties) == 0x000030, "Wrong size on BPC_MachineCustomizeColorAreaSelectState_C_SetProperties");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_SetProperties, CallFunc_GetOwnerStateMachine_ReturnValue) == 0x000000, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_SetProperties::CallFunc_GetOwnerStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_SetProperties, CallFunc_GetColorAreaSelectPage_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_SetProperties::CallFunc_GetColorAreaSelectPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_SetProperties, K2Node_DynamicCast_AsMachine_Customize_Sequence) == 0x000010, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_SetProperties::K2Node_DynamicCast_AsMachine_Customize_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_SetProperties, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_SetProperties::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_SetProperties, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint) == 0x000020, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_SetProperties::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_SetProperties, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_SetProperties::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BPC_MachineCustomizeColorAreaSelectState.BPC_MachineCustomizeColorAreaSelectState_C.ShowPopupWindow
// 0x00D8 (0x00D8 - 0x0000)
struct BPC_MachineCustomizeColorAreaSelectState_C_ShowPopupWindow final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0030(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0040(0x0010)()
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowBase*                CallFunc_CreatePopupWindow_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3; // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4; // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizeColorAreaSelectState_C_ShowPopupWindow) == 0x000008, "Wrong alignment on BPC_MachineCustomizeColorAreaSelectState_C_ShowPopupWindow");
static_assert(sizeof(BPC_MachineCustomizeColorAreaSelectState_C_ShowPopupWindow) == 0x0000D8, "Wrong size on BPC_MachineCustomizeColorAreaSelectState_C_ShowPopupWindow");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_ShowPopupWindow, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_ShowPopupWindow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizeColorAreaSelectState_C_ShowPopupWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPC_MachineCustomizeColorAreaSelectState_C_ShowPopupWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
