#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MachineState

#include "Basic.hpp"

#include "ST_ColorPresetSelectPageData_structs.hpp"
#include "ST_ColorPresetSelectPageItemData_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionLib_structs.hpp"
#include "UnionRun_structs.hpp"


namespace SDK::Params
{

// Function BPC_MachineState.BPC_MachineState_C.BindCharaMachineSelectWindow
// 0x0008 (0x0008 - 0x0000)
struct BPC_MachineState_C_BindCharaMachineSelectWindow final
{
public:
	class UCharaMachineSelectBase*                InWindow;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineState_C_BindCharaMachineSelectWindow) == 0x000008, "Wrong alignment on BPC_MachineState_C_BindCharaMachineSelectWindow");
static_assert(sizeof(BPC_MachineState_C_BindCharaMachineSelectWindow) == 0x000008, "Wrong size on BPC_MachineState_C_BindCharaMachineSelectWindow");
static_assert(offsetof(BPC_MachineState_C_BindCharaMachineSelectWindow, InWindow) == 0x000000, "Member 'BPC_MachineState_C_BindCharaMachineSelectWindow::InWindow' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.BindColorWindow
// 0x0008 (0x0008 - 0x0000)
struct BPC_MachineState_C_BindColorWindow final
{
public:
	class UWBP_MachineCustom_Sub_PresetPaint_C*   InColorWindow;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineState_C_BindColorWindow) == 0x000008, "Wrong alignment on BPC_MachineState_C_BindColorWindow");
static_assert(sizeof(BPC_MachineState_C_BindColorWindow) == 0x000008, "Wrong size on BPC_MachineState_C_BindColorWindow");
static_assert(offsetof(BPC_MachineState_C_BindColorWindow, InColorWindow) == 0x000000, "Member 'BPC_MachineState_C_BindColorWindow::InColorWindow' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.BindMachineTypeSelectWindow
// 0x0008 (0x0008 - 0x0000)
struct BPC_MachineState_C_BindMachineTypeSelectWindow final
{
public:
	class UMachineTypeScrollControl*              InMachineTypeSelectWindow;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineState_C_BindMachineTypeSelectWindow) == 0x000008, "Wrong alignment on BPC_MachineState_C_BindMachineTypeSelectWindow");
static_assert(sizeof(BPC_MachineState_C_BindMachineTypeSelectWindow) == 0x000008, "Wrong size on BPC_MachineState_C_BindMachineTypeSelectWindow");
static_assert(offsetof(BPC_MachineState_C_BindMachineTypeSelectWindow, InMachineTypeSelectWindow) == 0x000000, "Member 'BPC_MachineState_C_BindMachineTypeSelectWindow::InMachineTypeSelectWindow' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.CharaMachineSelect_ColorDecisionButtonFocusEvent
// 0x00B8 (0x00B8 - 0x0000)
struct BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent final
{
public:
	int32                                         InPlayerIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMachineColorSelectWindow*              CallFunc_GetMachineColorSelectWindow_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AMenuRacerBase*                         CallFunc_GetMenuRacer_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_ColorWindow_C*   K2Node_DynamicCast_AsWBP_Machine_Select_Sub_Color_Window; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MenuRacerPreview_C*                 K2Node_DynamicCast_AsBP_Menu_Racer_Preview;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetSelectedMachineId_ReturnValue;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData; // 0x0040(0x0078)()
};
static_assert(alignof(BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent) == 0x000008, "Wrong alignment on BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent");
static_assert(sizeof(BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent) == 0x0000B8, "Wrong size on BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent, InPlayerIndex) == 0x000000, "Member 'BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent::InPlayerIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent, CallFunc_GetMachineColorSelectWindow_ReturnValue) == 0x000010, "Member 'BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent::CallFunc_GetMachineColorSelectWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent, CallFunc_GetMenuRacer_ReturnValue) == 0x000018, "Member 'BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent::CallFunc_GetMenuRacer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent, K2Node_DynamicCast_AsWBP_Machine_Select_Sub_Color_Window) == 0x000020, "Member 'BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent::K2Node_DynamicCast_AsWBP_Machine_Select_Sub_Color_Window' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent, K2Node_DynamicCast_AsBP_Menu_Racer_Preview) == 0x000030, "Member 'BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent::K2Node_DynamicCast_AsBP_Menu_Racer_Preview' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent, CallFunc_GetSelectedMachineId_ReturnValue) == 0x000039, "Member 'BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent::CallFunc_GetSelectedMachineId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent, CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData) == 0x000040, "Member 'BPC_MachineState_C_CharaMachineSelect_ColorDecisionButtonFocusEvent::CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.CharaMachineSelect_OnMachineColorCancelEvent
// 0x0060 (0x0060 - 0x0000)
struct BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent final
{
public:
	int32                                         InPlayerIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMachineColorSelectWindow*              MachineColorSelectWindow;                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineSelectControlState                    Temp_byte_Variable;                                // 0x0014(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineSelect_Sub_Ready_C*         K2Node_DynamicCast_AsWBP_Machine_Select_Sub_Ready; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMachineColorSelectWindow*              CallFunc_GetMachineColorSelectWindow_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaMachineSelectSequence*            CallFunc_GetSequence_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMachineSelectControlState                    Temp_byte_Variable_1;                              // 0x0040(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaMachineSelectBase*                CallFunc_GetCharaMachineSubWindow_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharaMachineSelectBase*                CallFunc_GetCharaMachineSubWindow_ReturnValue_1;   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAllPlayerSelected_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineSelectControlState                    CallFunc_Array_Get_Item;                           // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent) == 0x000008, "Wrong alignment on BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent");
static_assert(sizeof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent) == 0x000060, "Wrong size on BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, InPlayerIndex) == 0x000000, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::InPlayerIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, MachineColorSelectWindow) == 0x000008, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::MachineColorSelectWindow' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, PlayerIndex) == 0x000010, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, Temp_byte_Variable) == 0x000014, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, CallFunc_MakeLiteralByte_ReturnValue) == 0x000015, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, K2Node_DynamicCast_AsWBP_Machine_Select_Sub_Ready) == 0x000018, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::K2Node_DynamicCast_AsWBP_Machine_Select_Sub_Ready' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, CallFunc_GetMachineColorSelectWindow_ReturnValue) == 0x000028, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::CallFunc_GetMachineColorSelectWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000030, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, CallFunc_GetSequence_ReturnValue) == 0x000038, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::CallFunc_GetSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, Temp_byte_Variable_1) == 0x000040, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, CallFunc_GetCharaMachineSubWindow_ReturnValue) == 0x000048, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::CallFunc_GetCharaMachineSubWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, CallFunc_GetCharaMachineSubWindow_ReturnValue_1) == 0x000050, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::CallFunc_GetCharaMachineSubWindow_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, CallFunc_IsAllPlayerSelected_ReturnValue) == 0x000058, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::CallFunc_IsAllPlayerSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, CallFunc_Array_Get_Item) == 0x00005A, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005B, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorCancelEvent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.CharaMachineSelect_OnMachineColorDecisionEvent
// 0x01A8 (0x01A8 - 0x0000)
struct BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent final
{
public:
	int32                                         InPlayerIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetSelectedMachineId_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetSelectedMachineId_ReturnValue_1;       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData; // 0x0008(0x0078)()
	EMachineId                                    CallFunc_GetSelectedMachineId_ReturnValue_2;       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData_1; // 0x0088(0x0078)()
	struct FUserMachineCustomizeData              K2Node_SetFieldsInStruct_StructOut;                // 0x0100(0x0078)()
	class UMachineColorSelectWindow*              CallFunc_GetMachineColorSelectWindow_ReturnValue;  // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGadgetPlateUIData                     CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData; // 0x0180(0x0028)()
};
static_assert(alignof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent) == 0x000008, "Wrong alignment on BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent");
static_assert(sizeof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent) == 0x0001A8, "Wrong size on BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent, InPlayerIndex) == 0x000000, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent::InPlayerIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent, CallFunc_GetSelectedMachineId_ReturnValue) == 0x000004, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent::CallFunc_GetSelectedMachineId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent, CallFunc_GetSelectedMachineId_ReturnValue_1) == 0x000005, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent::CallFunc_GetSelectedMachineId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent, CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData) == 0x000008, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent::CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent, CallFunc_GetSelectedMachineId_ReturnValue_2) == 0x000080, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent::CallFunc_GetSelectedMachineId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent, CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData_1) == 0x000088, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent::CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent, K2Node_SetFieldsInStruct_StructOut) == 0x000100, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent, CallFunc_GetMachineColorSelectWindow_ReturnValue) == 0x000178, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent::CallFunc_GetMachineColorSelectWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent, CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData) == 0x000180, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorDecisionEvent::CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.CharaMachineSelect_OnMachineColorFocusEvent
// 0x0208 (0x0208 - 0x0000)
struct BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent final
{
public:
	struct FST_ColorPresetSelectPageItemData      ColorPreset;                                       // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x005C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMenuRacerBase*                         CallFunc_GetMenuRacer_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMachineColorSelectWindow*              CallFunc_GetMachineColorSelectWindow_ReturnValue;  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerPreview_C*                 K2Node_DynamicCast_AsBP_Menu_Racer_Preview;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineSelect_Sub_ColorWindow_C*   K2Node_DynamicCast_AsWBP_Machine_Select_Sub_Color_Window; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_Get_Customize_Data_OutCustomizeData;      // 0x0098(0x0078)()
	struct FUserMachineCustomizeData              K2Node_SetFieldsInStruct_StructOut;                // 0x0110(0x0078)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_SetAllMachineColorsAsPreset_ReturnValue;  // 0x0190(0x0078)()
};
static_assert(alignof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent) == 0x000008, "Wrong alignment on BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent");
static_assert(sizeof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent) == 0x000208, "Wrong size on BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, ColorPreset) == 0x000000, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::ColorPreset' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, PlayerIndex) == 0x000058, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, ButtonIndex) == 0x00005C, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::ButtonIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000060, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, CallFunc_GetMenuRacer_ReturnValue) == 0x000068, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::CallFunc_GetMenuRacer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, CallFunc_GetMachineColorSelectWindow_ReturnValue) == 0x000070, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::CallFunc_GetMachineColorSelectWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, K2Node_DynamicCast_AsBP_Menu_Racer_Preview) == 0x000078, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::K2Node_DynamicCast_AsBP_Menu_Racer_Preview' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, K2Node_DynamicCast_AsWBP_Machine_Select_Sub_Color_Window) == 0x000088, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::K2Node_DynamicCast_AsWBP_Machine_Select_Sub_Color_Window' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, CallFunc_Get_Customize_Data_OutCustomizeData) == 0x000098, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::CallFunc_Get_Customize_Data_OutCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, K2Node_SetFieldsInStruct_StructOut) == 0x000110, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, K2Node_SwitchEnum_CmpSuccess) == 0x000188, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent, CallFunc_SetAllMachineColorsAsPreset_ReturnValue) == 0x000190, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorFocusEvent::CallFunc_SetAllMachineColorsAsPreset_ReturnValue' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.CharaMachineSelect_OnMachineColorSelectEvent
// 0x0150 (0x0150 - 0x0000)
struct BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent final
{
public:
	struct FST_ColorPresetSelectPageItemData      ColorPreset;                                       // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetSelectedMachineId_ReturnValue;         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData; // 0x0060(0x0078)()
	struct FUserMachineCustomizeData              K2Node_SetFieldsInStruct_StructOut;                // 0x00D8(0x0078)()
};
static_assert(alignof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent) == 0x000008, "Wrong alignment on BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent");
static_assert(sizeof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent) == 0x000150, "Wrong size on BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent, ColorPreset) == 0x000000, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent::ColorPreset' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent, PlayerIndex) == 0x000058, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent, CallFunc_GetSelectedMachineId_ReturnValue) == 0x00005C, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent::CallFunc_GetSelectedMachineId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent, K2Node_SwitchEnum_CmpSuccess) == 0x00005D, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent, CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData) == 0x000060, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent::CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent, K2Node_SetFieldsInStruct_StructOut) == 0x0000D8, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineColorSelectEvent::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.CharaMachineSelect_OnMachinePartsCancelEvent
// 0x0018 (0x0018 - 0x0000)
struct BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent final
{
public:
	int32                                         InPlayerIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetSelectedMachineId_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaMachineSelectBase*                CallFunc_GetCharaMachineSubWindow_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EMachineSelectControlState                    Temp_byte_Variable;                                // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAllPlayerSelected_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineSelectControlState                    Temp_byte_Variable_1;                              // 0x0013(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineSelectControlState                    CallFunc_Array_Get_Item;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent) == 0x000008, "Wrong alignment on BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent");
static_assert(sizeof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent) == 0x000018, "Wrong size on BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent, InPlayerIndex) == 0x000000, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent::InPlayerIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent, CallFunc_GetSelectedMachineId_ReturnValue) == 0x000004, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent::CallFunc_GetSelectedMachineId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent, CallFunc_GetCharaMachineSubWindow_ReturnValue) == 0x000008, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent::CallFunc_GetCharaMachineSubWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent, Temp_byte_Variable) == 0x000010, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent, CallFunc_IsAllPlayerSelected_ReturnValue) == 0x000011, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent::CallFunc_IsAllPlayerSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent, Temp_byte_Variable_1) == 0x000013, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent, CallFunc_Array_Get_Item) == 0x000014, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000015, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsCancelEvent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.CharaMachineSelect_OnMachinePartsDecisionEvent
// 0x0090 (0x0090 - 0x0000)
struct BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent final
{
public:
	int32                                         InPlayerIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0004(0x0004)()
	class UCharaMachineSelectBase*                CallFunc_GetCharaMachineSubWindow_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetSelectedMachineId_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData; // 0x0018(0x0078)()
};
static_assert(alignof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent) == 0x000008, "Wrong alignment on BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent");
static_assert(sizeof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent) == 0x000090, "Wrong size on BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent, InPlayerIndex) == 0x000000, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent::InPlayerIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent, CallFunc_SoundPlay_ReturnValue) == 0x000004, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent, CallFunc_GetCharaMachineSubWindow_ReturnValue) == 0x000008, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent::CallFunc_GetCharaMachineSubWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent, CallFunc_GetSelectedMachineId_ReturnValue) == 0x000010, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent::CallFunc_GetSelectedMachineId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent, CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData) == 0x000018, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsDecisionEvent::CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.CharaMachineSelect_OnMachinePartsFocusEvent
// 0x0008 (0x0008 - 0x0000)
struct BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    FrontPartsId;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    RearPartsId;                                       // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    TirePartsId;                                       // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent) == 0x000004, "Wrong alignment on BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent");
static_assert(sizeof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent) == 0x000008, "Wrong size on BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent, PlayerIndex) == 0x000000, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent, FrontPartsId) == 0x000004, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent::FrontPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent, RearPartsId) == 0x000005, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent::RearPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent, TirePartsId) == 0x000006, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsFocusEvent::TirePartsId' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.CharaMachineSelect_OnMachinePartsSelectEvent
// 0x0008 (0x0008 - 0x0000)
struct BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    FrontPartsId;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    RearPartsId;                                       // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    TirePartsId;                                       // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent) == 0x000004, "Wrong alignment on BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent");
static_assert(sizeof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent) == 0x000008, "Wrong size on BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent, PlayerIndex) == 0x000000, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent, FrontPartsId) == 0x000004, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent::FrontPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent, RearPartsId) == 0x000005, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent::RearPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent, TirePartsId) == 0x000006, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachinePartsSelectEvent::TirePartsId' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.CharaMachineSelect_OnMachineSelectModeChanged
// 0x0008 (0x0008 - 0x0000)
struct BPC_MachineState_C_CharaMachineSelect_OnMachineSelectModeChanged final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UNION::EMachineSelectMode                     Mode;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineState_C_CharaMachineSelect_OnMachineSelectModeChanged) == 0x000004, "Wrong alignment on BPC_MachineState_C_CharaMachineSelect_OnMachineSelectModeChanged");
static_assert(sizeof(BPC_MachineState_C_CharaMachineSelect_OnMachineSelectModeChanged) == 0x000008, "Wrong size on BPC_MachineState_C_CharaMachineSelect_OnMachineSelectModeChanged");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineSelectModeChanged, PlayerIndex) == 0x000000, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineSelectModeChanged::PlayerIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_CharaMachineSelect_OnMachineSelectModeChanged, Mode) == 0x000004, "Member 'BPC_MachineState_C_CharaMachineSelect_OnMachineSelectModeChanged::Mode' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.DecideMachine
// 0x0004 (0x0004 - 0x0000)
struct BPC_MachineState_C_DecideMachine final
{
public:
	int32                                         InPlayerIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineState_C_DecideMachine) == 0x000004, "Wrong alignment on BPC_MachineState_C_DecideMachine");
static_assert(sizeof(BPC_MachineState_C_DecideMachine) == 0x000004, "Wrong size on BPC_MachineState_C_DecideMachine");
static_assert(offsetof(BPC_MachineState_C_DecideMachine, InPlayerIndex) == 0x000000, "Member 'BPC_MachineState_C_DecideMachine::InPlayerIndex' has a wrong offset!");

// Function BPC_MachineState.BPC_MachineState_C.ExecuteUbergraph_BPC_MachineState
// 0x01A0 (0x01A0 - 0x0000)
struct BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InPlayerIndex)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InPlayerIndex)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InPlayerIndex)>          K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InPlayerIndex)>          K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, UNION::EMachineSelectMode Mode)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, EMachineId FrontPartsId, EMachineId RearPartsId, EMachineId TirePartsId)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex, EMachineId FrontPartsId, EMachineId RearPartsId, EMachineId TirePartsId)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InPlayerIndex)>          K2Node_CreateDelegate_OutputDelegate_7;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_PresetPaint_C*   K2Node_CustomEvent_InColorWindow_1;                // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InPlayerIndex)>          K2Node_CreateDelegate_OutputDelegate_8;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FST_ColorPresetSelectPageItemData& ItemData, int32 InPlayerIndex)> K2Node_CreateDelegate_OutputDelegate_9; // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FST_ColorPresetSelectPageItemData& ItemData, int32 InPlayerIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_10; // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_PresetPaint_C*   K2Node_CustomEvent_InColorWindow;                  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMachineTypeScrollControl*              K2Node_Event_InMachineTypeSelectWindow_1;          // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SelectedPlayerControllerIndex, ECarStatusType SelectedMachineType, EMachineId SelectedBaseMachineId)> K2Node_CreateDelegate_OutputDelegate_11; // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_12;       // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SelectedPlayerControllerIndex)> K2Node_CreateDelegate_OutputDelegate_13;    // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SelectedPlayerControllerIndex, ECarStatusType SelectedMachineType, EMachineId SelectedBaseMachineId)> K2Node_CreateDelegate_OutputDelegate_14; // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCharaMachineSelectBase*                K2Node_Event_InWindow_1;                           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharaMachineSelectBase*                K2Node_Event_InWindow;                             // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMachineTypeScrollControl*              K2Node_Event_InMachineTypeSelectWindow;            // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHintId                                       CallFunc_GetHintId_ReturnValue;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMachineTypeScrollControl*              CallFunc_GetMachineTypeSelectWindow_ReturnValue;   // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InPlayerIndex;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetSelectedMachineId_ReturnValue;         // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                CallFunc_GetSelectedMachineType_ReturnValue;       // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAllPlayerSelected_ReturnValue;          // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0148(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x014C(0x0004)()
	int32                                         Temp_int_Variable;                                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateRemainTime_Result;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineSelectControlState                    Temp_byte_Variable;                                // 0x0170(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharaMachineSelectSequence*            CallFunc_GetSequence_ReturnValue;                  // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaMachineSequence_C*             K2Node_DynamicCast_AsBP_Chara_Machine_Sequence;    // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateRemainTime_InDeltaTime_ImplicitCast; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState) == 0x000008, "Wrong alignment on BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState");
static_assert(sizeof(BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState) == 0x0001A0, "Wrong size on BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState");
static_assert(offsetof(BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState, EntryPoint) == 0x000000, "Member 'BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'BPC_MachineState_C_ExecuteUbergraph_BPC_MachineState::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
