#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MenuStateOnline

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_MenuStateOnline.BPC_MenuStateOnline_C.ExecuteUbergraph_BPC_MenuStateOnline
// 0x0008 (0x0008 - 0x0000)
struct BPC_MenuStateOnline_C_ExecuteUbergraph_BPC_MenuStateOnline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStateOnline_C_ExecuteUbergraph_BPC_MenuStateOnline) == 0x000004, "Wrong alignment on BPC_MenuStateOnline_C_ExecuteUbergraph_BPC_MenuStateOnline");
static_assert(sizeof(BPC_MenuStateOnline_C_ExecuteUbergraph_BPC_MenuStateOnline) == 0x000008, "Wrong size on BPC_MenuStateOnline_C_ExecuteUbergraph_BPC_MenuStateOnline");
static_assert(offsetof(BPC_MenuStateOnline_C_ExecuteUbergraph_BPC_MenuStateOnline, EntryPoint) == 0x000000, "Member 'BPC_MenuStateOnline_C_ExecuteUbergraph_BPC_MenuStateOnline::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_MenuStateOnline_C_ExecuteUbergraph_BPC_MenuStateOnline, K2Node_Event_InDeltaTime) == 0x000004, "Member 'BPC_MenuStateOnline_C_ExecuteUbergraph_BPC_MenuStateOnline::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function BPC_MenuStateOnline.BPC_MenuStateOnline_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_MenuStateOnline_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MenuStateOnline_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_MenuStateOnline_C_OnUpdateState");
static_assert(sizeof(BPC_MenuStateOnline_C_OnUpdateState) == 0x000004, "Wrong size on BPC_MenuStateOnline_C_OnUpdateState");
static_assert(offsetof(BPC_MenuStateOnline_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_MenuStateOnline_C_OnUpdateState::InDeltaTime' has a wrong offset!");

}

