#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MenuStatePartyRaceSelectClass

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_MenuStatePartyRaceSelectClass.BPC_MenuStatePartyRaceSelectClass_C
// 0x0020 (0x0148 - 0x0128)
class UBPC_MenuStatePartyRaceSelectClass_C final : public UPartyRaceMenuSelectClassState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ClassSelect_C*                     ClassSelectWidget;                                 // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          InputEnabled;                                      // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRightShoulderPressed;                             // 0x0139(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLeftShoulderPressed;                              // 0x013A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStartPressed;                                     // 0x013B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuInputRecieveObject*                SubInputReciever;                                  // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void InitSubCommand();
	void OnRightShoulderReleasedEvent_Event(class UObject* Object);
	void OnRightShoulderPressedEvent_Event(class UObject* Object);
	void OnLeftShoulderPressedEvent_Event(class UObject* Object);
	void OnLeftShoulderReleasedEvent_Event(class UObject* Object);
	void ShoulderButtonCheck();
	void _OnSpecialPressedEvent_Event(class UObject* Object);
	void _OnSpecialReleasedEvent_Event(class UObject* Object);
	void CloseSubCommand();
	void OnInitState();
	void OnExitState();
	void OnUISceneCancelEvent_Event(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnUISceneDecisionEvent_Event(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnInFinished_Event();
	void OnOutFinished_Event();
	void OnUISceneFocusEvent_Event(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void ResetFirstFocusSoundSkip();
	void ExecuteUbergraph_BPC_MenuStatePartyRaceSelectClass(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_MenuStatePartyRaceSelectClass_C">();
	}
	static class UBPC_MenuStatePartyRaceSelectClass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_MenuStatePartyRaceSelectClass_C>();
	}
};
static_assert(alignof(UBPC_MenuStatePartyRaceSelectClass_C) == 0x000008, "Wrong alignment on UBPC_MenuStatePartyRaceSelectClass_C");
static_assert(sizeof(UBPC_MenuStatePartyRaceSelectClass_C) == 0x000148, "Wrong size on UBPC_MenuStatePartyRaceSelectClass_C");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectClass_C, UberGraphFrame) == 0x000128, "Member 'UBPC_MenuStatePartyRaceSelectClass_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectClass_C, ClassSelectWidget) == 0x000130, "Member 'UBPC_MenuStatePartyRaceSelectClass_C::ClassSelectWidget' has a wrong offset!");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectClass_C, InputEnabled) == 0x000138, "Member 'UBPC_MenuStatePartyRaceSelectClass_C::InputEnabled' has a wrong offset!");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectClass_C, bRightShoulderPressed) == 0x000139, "Member 'UBPC_MenuStatePartyRaceSelectClass_C::bRightShoulderPressed' has a wrong offset!");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectClass_C, bLeftShoulderPressed) == 0x00013A, "Member 'UBPC_MenuStatePartyRaceSelectClass_C::bLeftShoulderPressed' has a wrong offset!");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectClass_C, bStartPressed) == 0x00013B, "Member 'UBPC_MenuStatePartyRaceSelectClass_C::bStartPressed' has a wrong offset!");
static_assert(offsetof(UBPC_MenuStatePartyRaceSelectClass_C, SubInputReciever) == 0x000140, "Member 'UBPC_MenuStatePartyRaceSelectClass_C::SubInputReciever' has a wrong offset!");

}

