#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_AppNet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_AppNet.BPC_AppNet_C.CallSendInvitationFailed
// 0x0068 (0x0068 - 0x0000)
struct BPC_AppNet_C_CallSendInvitationFailed final
{
public:
	struct FLobbyOperationResult                  CallFunc_MakeLobbyOperationResultByLobbyErrorType_OutResult; // 0x0000(0x0068)()
};
static_assert(alignof(BPC_AppNet_C_CallSendInvitationFailed) == 0x000008, "Wrong alignment on BPC_AppNet_C_CallSendInvitationFailed");
static_assert(sizeof(BPC_AppNet_C_CallSendInvitationFailed) == 0x000068, "Wrong size on BPC_AppNet_C_CallSendInvitationFailed");
static_assert(offsetof(BPC_AppNet_C_CallSendInvitationFailed, CallFunc_MakeLobbyOperationResultByLobbyErrorType_OutResult) == 0x000000, "Member 'BPC_AppNet_C_CallSendInvitationFailed::CallFunc_MakeLobbyOperationResultByLobbyErrorType_OutResult' has a wrong offset!");

// Function BPC_AppNet.BPC_AppNet_C.CheckInvitationNoticeDisplay
// 0x0010 (0x0010 - 0x0000)
struct BPC_AppNet_C_CheckInvitationNoticeDisplay final
{
public:
	class ULobbyJoinInfo*                         InLobbyJoinInfo;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bOutDisplay;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInvitationAvailable_IsAvailable;     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_AppNet_C_CheckInvitationNoticeDisplay) == 0x000008, "Wrong alignment on BPC_AppNet_C_CheckInvitationNoticeDisplay");
static_assert(sizeof(BPC_AppNet_C_CheckInvitationNoticeDisplay) == 0x000010, "Wrong size on BPC_AppNet_C_CheckInvitationNoticeDisplay");
static_assert(offsetof(BPC_AppNet_C_CheckInvitationNoticeDisplay, InLobbyJoinInfo) == 0x000000, "Member 'BPC_AppNet_C_CheckInvitationNoticeDisplay::InLobbyJoinInfo' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_CheckInvitationNoticeDisplay, bOutDisplay) == 0x000008, "Member 'BPC_AppNet_C_CheckInvitationNoticeDisplay::bOutDisplay' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_CheckInvitationNoticeDisplay, CallFunc_CheckInvitationAvailable_IsAvailable) == 0x000009, "Member 'BPC_AppNet_C_CheckInvitationNoticeDisplay::CallFunc_CheckInvitationAvailable_IsAvailable' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_CheckInvitationNoticeDisplay, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'BPC_AppNet_C_CheckInvitationNoticeDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPC_AppNet.BPC_AppNet_C.ExecuteUbergraph_BPC_AppNet
// 0x0B50 (0x0B50 - 0x0000)
struct BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldCreateSquad_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_LobbyNotice_C*              CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bAccept;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ApiName;                        // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_RequestData;                    // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ResponseData;                   // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Error;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Parse_UserGetUserSearch_ResCode;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUserGetUserSearchResponse             CallFunc_Parse_UserGetUserSearch_Response;         // 0x0070(0x0010)()
	struct FLobbyId                               CallFunc_GetLobbyId_ReturnValue;                   // 0x0080(0x0010)()
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EResponseCodeAbstract                         CallFunc_ValidateResCode_ResCodeAbstract;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateResCode_ReturnValue;              // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLobbyInvitationNoticeInfo             K2Node_MakeStruct_LobbyInvitationNoticeInfo;       // 0x0098(0x0090)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrossplayPlatform                            CallFunc_GetPlatformTypeByStringData_ReturnValue;  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCrossPlay_ReturnValue;               // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bResultYes;                     // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B[0x5];                                      // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonLobbyContext*                    CallFunc_GetCurrentInviteLobbyContext_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccessful;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLobbyOperationResult                  K2Node_CustomEvent_Result;                         // 0x0150(0x0068)(ConstParm)
	struct FUniqueNetIdRepl                       CallFunc_CreateUniquePlayerId_ReturnValue;         // 0x01B8(0x0030)(HasGetValueTypeHash)
	TDelegate<void(bool bSuccessful, const struct FLobbyOperationResult& Result)> K2Node_CreateDelegate_OutputDelegate_1; // 0x01E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccessful, const struct FLobbyOperationResult& Result)> K2Node_CreateDelegate_OutputDelegate_2; // 0x01F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_CreateUniquePlayerId_ReturnValue_1;       // 0x0208(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_SendSessionInvite_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate_3;            // 0x023C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResultYes)>              K2Node_CreateDelegate_OutputDelegate_5;            // 0x025C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bAccept)>                 K2Node_CreateDelegate_OutputDelegate_6;            // 0x026C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& UserId, class ULobbyJoinInfo* Invite)> K2Node_CreateDelegate_OutputDelegate_7; // 0x027C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetPrevRegisteredMenu_ReturnValue;        // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_DynamicCast_As______;                       // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ApiName, const class FString& RequestData, const class FString& ResponseData, bool Error)> K2Node_CreateDelegate_OutputDelegate_9; // 0x02B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x02C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResultYes)>              K2Node_CreateDelegate_OutputDelegate_11;           // 0x02D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bAccept)>                 K2Node_CreateDelegate_OutputDelegate_12;           // 0x02E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStartedStreamingInstall_ReturnValue;    // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenMenuByConditions_ReturnValue;       // 0x02F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccessful_1;                  // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLobbyOperationResult                  K2Node_CustomEvent_Result_1;                       // 0x0300(0x0068)(ConstParm)
	bool                                          K2Node_Event_ResultIsYes;                          // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue_1;     // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetSourceUserId_ReturnValue;              // 0x0380(0x0030)(HasGetValueTypeHash)
	class FString                                 CallFunc_ConvertUserIdToString_OutUserIdString;    // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FUserGetUserSearchRequest_TargetId     K2Node_MakeStruct_UserGetUserSearchRequest_TargetId; // 0x03C0(0x0020)()
	TArray<struct FUserGetUserSearchRequest_TargetId> K2Node_MakeArray_Array;                        // 0x03E0(0x0010)(ReferenceParm)
	struct FUserGetUserSearchRequest              K2Node_MakeStruct_UserGetUserSearchRequest;        // 0x03F0(0x0018)()
	TDelegate<void(bool Successful)>              K2Node_CreateDelegate_OutputDelegate_13;           // 0x0408(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAppUserBaseData                       CallFunc_GetCachedAppUserBaseData_ReturnValue;     // 0x0420(0x0078)(ConstParm)
	class UFriendSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasSuccessful, const TArray<struct FCommon_UserSearchData>& SearchDatas, EResponseCodeAbstract ResCodeAbstract)> K2Node_CreateDelegate_OutputDelegate_14; // 0x04A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x04B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x04C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFriendSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHoldInputCountState_ReturnValue;       // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA[0x2];                                      // 0x04DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPopupWindowType CreatedWindowType)> K2Node_CreateDelegate_OutputDelegate_16;     // 0x04DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x04EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ED[0x3];                                      // 0x04ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x04F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPopupWindowType CreatedWindowType)> K2Node_CreateDelegate_OutputDelegate_18;     // 0x0500(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x0514(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x0524(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPopupWindowType CreatedWindowType)> K2Node_CreateDelegate_OutputDelegate_21;     // 0x0534(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPopupWindowType CreatedWindowType)> K2Node_CreateDelegate_OutputDelegate_22;     // 0x0544(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_555[0x3];                                      // 0x0555(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_23;           // 0x0558(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPopupWindowType                              K2Node_CustomEvent_CreatedWindowType;              // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x056A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x056B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_24;           // 0x056C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPopupWindowType CreatedWindowType)> K2Node_CreateDelegate_OutputDelegate_25;     // 0x057C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_26;           // 0x0590(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSourceDisplayName_ReturnValue;         // 0x05A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLobbyId                               CallFunc_GetLobbyId_ReturnValue_1;                 // 0x05B8(0x0010)()
	struct FUniqueNetIdRepl                       CallFunc_GetSourceUserId_ReturnValue_1;            // 0x05C8(0x0030)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_27;           // 0x05F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ConvertUserIdToString_OutUserIdString_1;  // 0x0608(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLobbyInvitationNoticeInfo             K2Node_MakeStruct_LobbyInvitationNoticeInfo_1;     // 0x0618(0x0090)()
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x06B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x06B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLastFadeDirectionIn_ReturnValue;        // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingFade_ReturnValue;                // 0x06C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x06C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x06C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x06C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C5[0x3];                                      // 0x06C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_28;           // 0x06C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_29;           // 0x06D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_Event_UserId;                               // 0x06E8(0x0030)(ConstParm, HasGetValueTypeHash)
	class ULobbyJoinInfo*                         K2Node_Event_Invite;                               // 0x0718(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ELobbyType                                    CallFunc_GetLobbyTypeFromJoinInfo_ReturnValue;     // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ToString_ReturnValue;                     // 0x0728(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0738(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0748(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInvitationNoticeDisplay_bOutDisplay; // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_759[0x7];                                      // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0760(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0770(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0780(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_789[0x7];                                      // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0790(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_30;           // 0x0798(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_31;           // 0x07A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x07B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x07C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue_9;   // 0x07C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue_3;          // 0x07D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FLobbyInvitationNoticeInfo& LobbyInvitationNoticeInfo, class ULobbyJoinInfo* LobbyInfo)> K2Node_CreateDelegate_OutputDelegate_32; // 0x07D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLobbyInvitationNoticeInfo             K2Node_CustomEvent_LobbyInvitationNoticeInfo;      // 0x07E8(0x0090)()
	class ULobbyJoinInfo*                         K2Node_CustomEvent_LobbyInfo;                      // 0x0878(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue_10;  // 0x0880(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_889[0x7];                                      // 0x0889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue_4;          // 0x0890(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_899[0x7];                                      // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue_11;  // 0x08A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_33;           // 0x08A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlreadyPopupWindowExist_ReturnValue;    // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x08B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x08BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BB[0x5];                                      // 0x08BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x08C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0920(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AProcessLobbyInvitationObject*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0928(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccessful, const struct FLobbyOperationResult& Result)> K2Node_CreateDelegate_OutputDelegate_34; // 0x0930(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0941(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_942[0x2];                                      // 0x0942(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0944(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ShortLobbyId;                   // 0x0948(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_959[0x7];                                      // 0x0959(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonLobbyContext*                    CallFunc_GetCurrentInviteLobbyContext_ReturnValue_1; // 0x0960(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0968(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0969(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96A[0x2];                                      // 0x096A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_35;           // 0x096C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_36;           // 0x097C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98C[0x4];                                      // 0x098C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonLobbyContext*                    CallFunc_GetCurrentInviteLobbyContext_ReturnValue_2; // 0x0990(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateSession_ReturnValue;                // 0x0998(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0999(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSession_ReturnValue;                   // 0x099A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x099B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x099C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99D[0x3];                                      // 0x099D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue_5;          // 0x09A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x09A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELobbySequenceAvailabilityType                CallFunc_GetCurrentLobbySequenceType_ReturnValue;  // 0x09AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x09AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x09AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9AF[0x1];                                      // 0x09AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x09B0(0x0010)(ReferenceParm)
	class ULobbySubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_12;  // 0x09C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasSuccessful;                 // 0x09C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C9[0x7];                                      // 0x09C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCommon_UserSearchData>         K2Node_CustomEvent_SearchDatas;                    // 0x09D0(0x0010)(ConstParm, ReferenceParm)
	EResponseCodeAbstract                         K2Node_CustomEvent_ResCodeAbstract;                // 0x09E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E1[0x7];                                      // 0x09E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array_2;                          // 0x09E8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_TerraGetUserSearchRequest_ReturnValue;    // 0x09F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F9[0x7];                                      // 0x09F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0A00(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0A10(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0A20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A21[0x7];                                      // 0x0A21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineActivitySubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_13;  // 0x0A28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue_6;          // 0x0A30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbySubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_14;  // 0x0A38(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x0A40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A41[0x7];                                      // 0x0A41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCommon_UserSearchData                 CallFunc_GetUserSearchDataByProductUserId_OutUserSearchData; // 0x0A48(0x00D8)()
	bool                                          CallFunc_GetUserSearchDataByProductUserId_ReturnValue; // 0x0B20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B21[0x7];                                      // 0x0B21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCommon_UserSearchData>         K2Node_MakeArray_Array_3;                          // 0x0B28(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_ShouldSendSessionInvitePlatform_ReturnValue; // 0x0B38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x0B39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Successful;                     // 0x0B3A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_21;                   // 0x0B3B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3C[0x4];                                      // 0x0B3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SquadContext_C*                     CallFunc_GetSqueadContext_SquadContext;            // 0x0B40(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJoining_ReturnValue;                    // 0x0B48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet) == 0x000010, "Wrong alignment on BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet");
static_assert(sizeof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet) == 0x000B50, "Wrong size on BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, EntryPoint) == 0x000000, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_ShouldCreateSquad_ReturnValue) == 0x000004, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_ShouldCreateSquad_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetAppPlayerController_ReturnValue) == 0x000010, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CustomEvent_bAccept) == 0x000018, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CustomEvent_bAccept' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CustomEvent_ApiName) == 0x000038, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CustomEvent_ApiName' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CustomEvent_RequestData) == 0x000048, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CustomEvent_RequestData' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CustomEvent_ResponseData) == 0x000058, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CustomEvent_ResponseData' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CustomEvent_Error) == 0x000068, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CustomEvent_Error' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_Parse_UserGetUserSearch_ResCode) == 0x00006C, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_Parse_UserGetUserSearch_ResCode' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_Parse_UserGetUserSearch_Response) == 0x000070, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_Parse_UserGetUserSearch_Response' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetLobbyId_ReturnValue) == 0x000080, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetLobbyId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000090, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_ValidateResCode_ResCodeAbstract) == 0x000091, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_ValidateResCode_ResCodeAbstract' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_ValidateResCode_ReturnValue) == 0x000092, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_ValidateResCode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_MakeStruct_LobbyInvitationNoticeInfo) == 0x000098, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_MakeStruct_LobbyInvitationNoticeInfo' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_BooleanAND_ReturnValue) == 0x000128, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetPlatformTypeByStringData_ReturnValue) == 0x000129, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetPlatformTypeByStringData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_CheckCrossPlay_ReturnValue) == 0x00012A, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_CheckCrossPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CustomEvent_bResultYes) == 0x00012B, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CustomEvent_bResultYes' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000130, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CustomEvent_bSuccess) == 0x000138, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_IsEmpty_ReturnValue) == 0x000139, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_Not_PreBool_ReturnValue) == 0x00013A, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetCurrentInviteLobbyContext_ReturnValue) == 0x000140, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetCurrentInviteLobbyContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_IsValid_ReturnValue) == 0x000148, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CustomEvent_bSuccessful) == 0x000149, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CustomEvent_bSuccessful' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CustomEvent_Result) == 0x000150, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_CreateUniquePlayerId_ReturnValue) == 0x0001B8, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_CreateUniquePlayerId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001E8, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001F8, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_CreateUniquePlayerId_ReturnValue_1) == 0x000208, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_CreateUniquePlayerId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_SendSessionInvite_ReturnValue) == 0x000238, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_SendSessionInvite_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_3) == 0x00023C, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_4) == 0x00024C, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_5) == 0x00025C, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_6) == 0x00026C, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_7) == 0x00027C, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetPrevRegisteredMenu_ReturnValue) == 0x000290, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetPrevRegisteredMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_DynamicCast_As______) == 0x000298, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_DynamicCast_As______' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_DynamicCast_bSuccess) == 0x0002A0, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_IsValid_ReturnValue_1) == 0x0002A1, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_8) == 0x0002A4, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_9) == 0x0002B4, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_10) == 0x0002C4, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_11) == 0x0002D4, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_12) == 0x0002E4, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_IsStartedStreamingInstall_ReturnValue) == 0x0002F4, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_IsStartedStreamingInstall_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002F5, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_Not_PreBool_ReturnValue_2) == 0x0002F6, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_IsOpenMenuByConditions_ReturnValue) == 0x0002F7, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_IsOpenMenuByConditions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CustomEvent_bSuccessful_1) == 0x0002F8, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CustomEvent_bSuccessful_1' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CustomEvent_Result_1) == 0x000300, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_Event_ResultIsYes) == 0x000368, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_Event_ResultIsYes' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetAppPlayerController_ReturnValue_1) == 0x000370, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetAppPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_IsValid_ReturnValue_2) == 0x000378, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_IsValid_ReturnValue_3) == 0x000379, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetSourceUserId_ReturnValue) == 0x000380, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetSourceUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_ConvertUserIdToString_OutUserIdString) == 0x0003B0, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_ConvertUserIdToString_OutUserIdString' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_MakeStruct_UserGetUserSearchRequest_TargetId) == 0x0003C0, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_MakeStruct_UserGetUserSearchRequest_TargetId' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_MakeArray_Array) == 0x0003E0, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_MakeStruct_UserGetUserSearchRequest) == 0x0003F0, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_MakeStruct_UserGetUserSearchRequest' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_13) == 0x000408, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000418, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetCachedAppUserBaseData_ReturnValue) == 0x000420, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetCachedAppUserBaseData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000498, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_14) == 0x0004A0, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_Array_Get_Item) == 0x0004B0, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_15) == 0x0004C0, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0004D0, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_IsValid_ReturnValue_4) == 0x0004D8, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_GetHoldInputCountState_ReturnValue) == 0x0004D9, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_GetHoldInputCountState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_16) == 0x0004DC, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, CallFunc_Not_PreBool_ReturnValue_3) == 0x0004EC, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet, K2Node_CreateDelegate_OutputDelegate_17) == 0x0004F0, "Member 'BPC_AppNet_C_ExecuteUbergraph_BPC_AppNet::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
