#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateResult

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_RaceSequenceStateResult.BPC_RaceSequenceStateResult_C
// 0x0038 (0x0160 - 0x0128)
class UBPC_RaceSequenceStateResult_C final : public URaceSequenceStateResult
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_RaceResultSequence_C*               ResultSequence;                                    // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceSequence_C*                     Owner_BP;                                          // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_RewardAchievementManager_C*         RewardAchievementManager;                          // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            RusultWidget;                                      // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupResult_C*                     GroupResultWidget;                                 // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_EndMenu_GudgetLv_Window_C*         ResultGadgetPlateWidget;                           // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_RaceSequenceStateResult(int32 EntryPoint);
	void GetAddTicket(int32* AddTickets);
	void GetTargetWidget(class UClass** WidgetBlueprint);
	void NextEndMenu_TimerEvent();
	void OnEnd();
	void OnInitState();
	void RaceHudOutAnimEnd();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SaveDonpaTicket();
	void SetRewardAchievement();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_RaceSequenceStateResult_C">();
	}
	static class UBPC_RaceSequenceStateResult_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_RaceSequenceStateResult_C>();
	}
};
static_assert(alignof(UBPC_RaceSequenceStateResult_C) == 0x000008, "Wrong alignment on UBPC_RaceSequenceStateResult_C");
static_assert(sizeof(UBPC_RaceSequenceStateResult_C) == 0x000160, "Wrong size on UBPC_RaceSequenceStateResult_C");
static_assert(offsetof(UBPC_RaceSequenceStateResult_C, UberGraphFrame) == 0x000128, "Member 'UBPC_RaceSequenceStateResult_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateResult_C, ResultSequence) == 0x000130, "Member 'UBPC_RaceSequenceStateResult_C::ResultSequence' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateResult_C, Owner_BP) == 0x000138, "Member 'UBPC_RaceSequenceStateResult_C::Owner_BP' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateResult_C, RewardAchievementManager) == 0x000140, "Member 'UBPC_RaceSequenceStateResult_C::RewardAchievementManager' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateResult_C, RusultWidget) == 0x000148, "Member 'UBPC_RaceSequenceStateResult_C::RusultWidget' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateResult_C, GroupResultWidget) == 0x000150, "Member 'UBPC_RaceSequenceStateResult_C::GroupResultWidget' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateResult_C, ResultGadgetPlateWidget) == 0x000158, "Member 'UBPC_RaceSequenceStateResult_C::ResultGadgetPlateWidget' has a wrong offset!");

}

