#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_TimeTrialLoginState

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_TimeTrialLoginState.BPC_TimeTrialLoginState_C
// 0x0018 (0x0148 - 0x0130)
class UBPC_TimeTrialLoginState_C final : public UTimeTrialLoginState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0130(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUnionUISceneBase*                      PopupWindow;                                       // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_LoginProcessor_C*                   LoginProcessor;                                    // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CreateErrorPopup(const class FText& MessegeText);
	void CreateTryLoginPopup();
	void ExecuteUbergraph_BPC_TimeTrialLoginState(int32 EntryPoint);
	void OnDecideError(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnExitState();
	void OnInitState();
	void OnLogin();
	void OnLoginResult_Event(bool IsSuccess, bool bIsEnableOnlinePlay, bool IsRequestedSequenceBlock);
	void TryLoginOnDecide_Event(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_TimeTrialLoginState_C">();
	}
	static class UBPC_TimeTrialLoginState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_TimeTrialLoginState_C>();
	}
};
static_assert(alignof(UBPC_TimeTrialLoginState_C) == 0x000008, "Wrong alignment on UBPC_TimeTrialLoginState_C");
static_assert(sizeof(UBPC_TimeTrialLoginState_C) == 0x000148, "Wrong size on UBPC_TimeTrialLoginState_C");
static_assert(offsetof(UBPC_TimeTrialLoginState_C, UberGraphFrame) == 0x000130, "Member 'UBPC_TimeTrialLoginState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialLoginState_C, PopupWindow) == 0x000138, "Member 'UBPC_TimeTrialLoginState_C::PopupWindow' has a wrong offset!");
static_assert(offsetof(UBPC_TimeTrialLoginState_C, LoginProcessor) == 0x000140, "Member 'UBPC_TimeTrialLoginState_C::LoginProcessor' has a wrong offset!");

}

