#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_GhostSelect

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_GhostSelect.BPC_GhostSelect_C
// 0x0060 (0x01B0 - 0x0150)
class UBPC_GhostSelect_C final : public UGhostSelectState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0150(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_TimeTrialSequence_C*                OwnerTimeTrialSequence;                            // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   SelectGhostClass;                                  // 0x0160(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_ModeSelect_C*        SelectGhost;                                       // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuInputRecieveObject*                SubInputReciever;                                  // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUploadEnable;                                    // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture2D*>                     StageIconTextureArray;                             // 0x01A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BindGhostSelectEvent();
	void CreateGhostWidget();
	void ExecuteUbergraph_BPC_GhostSelect(int32 EntryPoint);
	void FinalizeSubCommand();
	void GhostSelectToCourseSelect();
	void GhostSelectToReady();
	void InitializeSubCommand();
	void OnCancelGhostSelectEvent(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnDecideGhostSelectEvent(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnExitState();
	void OnGhostUploadFooterClicked();
	void OnInitState();
	void OnLeftShoulderPressedEvent(class UObject* Object);
	void OnLoaded_307172AF4F7E28861F563BA26C397D31(class UObject* Loaded);
	void OnLoaded_58AE36EB44E34CAB87C7BFB602F2F257(TSubclassOf<class UObject> Loaded);
	void ReceiveBeginPlay();
	void ShoulderPressedEventBind();
	void ShoulderPressedEventUnbind();
	void UnbindGhostSelectEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_GhostSelect_C">();
	}
	static class UBPC_GhostSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_GhostSelect_C>();
	}
};
static_assert(alignof(UBPC_GhostSelect_C) == 0x000008, "Wrong alignment on UBPC_GhostSelect_C");
static_assert(sizeof(UBPC_GhostSelect_C) == 0x0001B0, "Wrong size on UBPC_GhostSelect_C");
static_assert(offsetof(UBPC_GhostSelect_C, UberGraphFrame) == 0x000150, "Member 'UBPC_GhostSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_GhostSelect_C, OwnerTimeTrialSequence) == 0x000158, "Member 'UBPC_GhostSelect_C::OwnerTimeTrialSequence' has a wrong offset!");
static_assert(offsetof(UBPC_GhostSelect_C, SelectGhostClass) == 0x000160, "Member 'UBPC_GhostSelect_C::SelectGhostClass' has a wrong offset!");
static_assert(offsetof(UBPC_GhostSelect_C, SelectGhost) == 0x000188, "Member 'UBPC_GhostSelect_C::SelectGhost' has a wrong offset!");
static_assert(offsetof(UBPC_GhostSelect_C, SubInputReciever) == 0x000190, "Member 'UBPC_GhostSelect_C::SubInputReciever' has a wrong offset!");
static_assert(offsetof(UBPC_GhostSelect_C, IsUploadEnable) == 0x000198, "Member 'UBPC_GhostSelect_C::IsUploadEnable' has a wrong offset!");
static_assert(offsetof(UBPC_GhostSelect_C, StageIconTextureArray) == 0x0001A0, "Member 'UBPC_GhostSelect_C::StageIconTextureArray' has a wrong offset!");

}

