#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MachineCustomizePartsSelectState

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C
// 0x0048 (0x0150 - 0x0108)
class UBPC_MachineCustomizePartsSelectState_C final : public UMachineCustomizePartsSelectState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AMachineCustomizeSequence*              Sequence;                                          // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerPreview_C*                 Racer;                                             // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharaMachineParamWindow*               ParamWindow;                                       // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUserStickerCustomizeData              StickerCustomizeData;                              // 0x0128(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UHintPopupWindow*                       TipsWindow;                                        // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void TipsWindow_CloseTipsWindow();
	void OpenTipsWindow(EHintId InHintId);
	void UpdateCustomizeData(const struct FUserMachineCustomizeData& InCustomizeData, struct FUserMachineCustomizeData* OutCustomizeData);
	void OnPartsSelected(EMachinePartsType InPartsType, EMachineId InPartsId);
	void OnPartsFocused(EMachinePartsType InPartsType, EMachineId InPartsId);
	void SetCustomizeModelView();
	void OnExit();
	void OnSetup();
	void OnSetupPage();
	void SetProperties();
	void BindTab();
	void UnbindTab();
	void StartOpenTipsWindow();
	void ShowTips();
	void ExecuteUbergraph_BPC_MachineCustomizePartsSelectState(int32 EntryPoint);

	class AGarageCamera* GetCamera() const;
	void GetCurrentPartsIds(EMachineId* OutFrontPartsId, EMachineId* OutRearPartsId, EMachineId* OutTirePartsId) const;
	void IsOpenTabControlTipsWindow(bool* bEnableOpenWindow) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_MachineCustomizePartsSelectState_C">();
	}
	static class UBPC_MachineCustomizePartsSelectState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_MachineCustomizePartsSelectState_C>();
	}
};
static_assert(alignof(UBPC_MachineCustomizePartsSelectState_C) == 0x000008, "Wrong alignment on UBPC_MachineCustomizePartsSelectState_C");
static_assert(sizeof(UBPC_MachineCustomizePartsSelectState_C) == 0x000150, "Wrong size on UBPC_MachineCustomizePartsSelectState_C");
static_assert(offsetof(UBPC_MachineCustomizePartsSelectState_C, UberGraphFrame) == 0x000108, "Member 'UBPC_MachineCustomizePartsSelectState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizePartsSelectState_C, Sequence) == 0x000110, "Member 'UBPC_MachineCustomizePartsSelectState_C::Sequence' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizePartsSelectState_C, Racer) == 0x000118, "Member 'UBPC_MachineCustomizePartsSelectState_C::Racer' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizePartsSelectState_C, ParamWindow) == 0x000120, "Member 'UBPC_MachineCustomizePartsSelectState_C::ParamWindow' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizePartsSelectState_C, StickerCustomizeData) == 0x000128, "Member 'UBPC_MachineCustomizePartsSelectState_C::StickerCustomizeData' has a wrong offset!");
static_assert(offsetof(UBPC_MachineCustomizePartsSelectState_C, TipsWindow) == 0x000148, "Member 'UBPC_MachineCustomizePartsSelectState_C::TipsWindow' has a wrong offset!");

}

