#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_GhostUpload

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_GhostUpload.BPC_GhostUpload_C
// 0x0030 (0x01B8 - 0x0188)
class UBPC_GhostUpload_C final : public UGhostUploadState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0188(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUnionUISceneBase*                      PopupWindow;                                       // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         UploadIndex;                                       // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsUploadCancel;                                   // 0x019C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PrivateMatch_Popup_C*              LoadingWidget;                                     // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_GhostResultUploadActor_C*           GhostResultUploadActor;                            // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_TimeTrialSequence_C*                OwnerTimeTrialSequence;                            // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CreateUploadConfirmationPopup();
	void ExecuteUbergraph_BPC_GhostUpload(int32 EntryPoint);
	void NextState();
	void OnExitState();
	void OnGhostLoadCompleted();
	void OnInitState();
	void UploadConfirmationOnDecide_Event(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_GhostUpload_C">();
	}
	static class UBPC_GhostUpload_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_GhostUpload_C>();
	}
};
static_assert(alignof(UBPC_GhostUpload_C) == 0x000008, "Wrong alignment on UBPC_GhostUpload_C");
static_assert(sizeof(UBPC_GhostUpload_C) == 0x0001B8, "Wrong size on UBPC_GhostUpload_C");
static_assert(offsetof(UBPC_GhostUpload_C, UberGraphFrame) == 0x000188, "Member 'UBPC_GhostUpload_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_GhostUpload_C, PopupWindow) == 0x000190, "Member 'UBPC_GhostUpload_C::PopupWindow' has a wrong offset!");
static_assert(offsetof(UBPC_GhostUpload_C, UploadIndex) == 0x000198, "Member 'UBPC_GhostUpload_C::UploadIndex' has a wrong offset!");
static_assert(offsetof(UBPC_GhostUpload_C, bIsUploadCancel) == 0x00019C, "Member 'UBPC_GhostUpload_C::bIsUploadCancel' has a wrong offset!");
static_assert(offsetof(UBPC_GhostUpload_C, LoadingWidget) == 0x0001A0, "Member 'UBPC_GhostUpload_C::LoadingWidget' has a wrong offset!");
static_assert(offsetof(UBPC_GhostUpload_C, GhostResultUploadActor) == 0x0001A8, "Member 'UBPC_GhostUpload_C::GhostResultUploadActor' has a wrong offset!");
static_assert(offsetof(UBPC_GhostUpload_C, OwnerTimeTrialSequence) == 0x0001B0, "Member 'UBPC_GhostUpload_C::OwnerTimeTrialSequence' has a wrong offset!");

}

