#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_TimeTrialRanking

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_TimeTrialRanking.BPC_TimeTrialRanking_C.SettingGhostGadgetPreset
// 0x0158 (0x0158 - 0x0000)
struct BPC_TimeTrialRanking_C_SettingGhostGadgetPreset final
{
public:
	class UGhostSubSystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReplaySaveInfo                        CallFunc_GetDownloadGhostData_OutGhostData;        // 0x0010(0x0140)()
	bool                                          CallFunc_GetDownloadGhostData_ReturnValue;         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialRanking_C_SettingGhostGadgetPreset) == 0x000008, "Wrong alignment on BPC_TimeTrialRanking_C_SettingGhostGadgetPreset");
static_assert(sizeof(BPC_TimeTrialRanking_C_SettingGhostGadgetPreset) == 0x000158, "Wrong size on BPC_TimeTrialRanking_C_SettingGhostGadgetPreset");
static_assert(offsetof(BPC_TimeTrialRanking_C_SettingGhostGadgetPreset, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'BPC_TimeTrialRanking_C_SettingGhostGadgetPreset::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_SettingGhostGadgetPreset, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BPC_TimeTrialRanking_C_SettingGhostGadgetPreset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_SettingGhostGadgetPreset, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'BPC_TimeTrialRanking_C_SettingGhostGadgetPreset::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_SettingGhostGadgetPreset, CallFunc_GetDownloadGhostData_OutGhostData) == 0x000010, "Member 'BPC_TimeTrialRanking_C_SettingGhostGadgetPreset::CallFunc_GetDownloadGhostData_OutGhostData' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_SettingGhostGadgetPreset, CallFunc_GetDownloadGhostData_ReturnValue) == 0x000150, "Member 'BPC_TimeTrialRanking_C_SettingGhostGadgetPreset::CallFunc_GetDownloadGhostData_ReturnValue' has a wrong offset!");

// Function BPC_TimeTrialRanking.BPC_TimeTrialRanking_C.CreateServerErrorWindow
// 0x00C0 (0x00C0 - 0x0000)
struct BPC_TimeTrialRanking_C_CreateServerErrorWindow final
{
public:
	EResponseCodeAbstract                         ResponseCode;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetServerErrorTitleText_ReturnValue;      // 0x0008(0x0010)(ConstParm)
	class FText                                   CallFunc_GetServerErrorBodyText_ReturnValue;       // 0x0018(0x0010)()
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIPopupWindowBase*                CallFunc_CreatePopupWindow_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3; // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialRanking_C_CreateServerErrorWindow) == 0x000008, "Wrong alignment on BPC_TimeTrialRanking_C_CreateServerErrorWindow");
static_assert(sizeof(BPC_TimeTrialRanking_C_CreateServerErrorWindow) == 0x0000C0, "Wrong size on BPC_TimeTrialRanking_C_CreateServerErrorWindow");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, ResponseCode) == 0x000000, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::ResponseCode' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, CallFunc_GetServerErrorTitleText_ReturnValue) == 0x000008, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::CallFunc_GetServerErrorTitleText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, CallFunc_GetServerErrorBodyText_ReturnValue) == 0x000018, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::CallFunc_GetServerErrorBodyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, CallFunc_MakeLiteralByte_ReturnValue) == 0x000038, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000048, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000050, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, CallFunc_CreatePopupWindow_ReturnValue) == 0x000058, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::CallFunc_CreatePopupWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface) == 0x000060, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1) == 0x000078, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2) == 0x000090, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3) == 0x0000A8, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateServerErrorWindow, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'BPC_TimeTrialRanking_C_CreateServerErrorWindow::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BPC_TimeTrialRanking.BPC_TimeTrialRanking_C.CreateErrorWindow
// 0x00B8 (0x00B8 - 0x0000)
struct BPC_TimeTrialRanking_C_CreateErrorWindow final
{
public:
	class FText                                   MessageText;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIPopupWindowBase*                CallFunc_CreatePopupWindow_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0048(0x0010)()
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialRanking_C_CreateErrorWindow) == 0x000008, "Wrong alignment on BPC_TimeTrialRanking_C_CreateErrorWindow");
static_assert(sizeof(BPC_TimeTrialRanking_C_CreateErrorWindow) == 0x0000B8, "Wrong size on BPC_TimeTrialRanking_C_CreateErrorWindow");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, MessageText) == 0x000000, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::MessageText' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, CallFunc_MakeLiteralByte_ReturnValue) == 0x000020, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000038, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, CallFunc_CreatePopupWindow_ReturnValue) == 0x000040, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::CallFunc_CreatePopupWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, CallFunc_MakeLiteralText_ReturnValue) == 0x000048, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface) == 0x000058, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1) == 0x000070, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2) == 0x000088, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3) == 0x0000A0, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_CreateErrorWindow, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'BPC_TimeTrialRanking_C_CreateErrorWindow::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BPC_TimeTrialRanking.BPC_TimeTrialRanking_C.OnDecideEvent
// 0x0008 (0x0008 - 0x0000)
struct BPC_TimeTrialRanking_C_OnDecideEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialRanking_C_OnDecideEvent) == 0x000008, "Wrong alignment on BPC_TimeTrialRanking_C_OnDecideEvent");
static_assert(sizeof(BPC_TimeTrialRanking_C_OnDecideEvent) == 0x000008, "Wrong size on BPC_TimeTrialRanking_C_OnDecideEvent");
static_assert(offsetof(BPC_TimeTrialRanking_C_OnDecideEvent, Object) == 0x000000, "Member 'BPC_TimeTrialRanking_C_OnDecideEvent::Object' has a wrong offset!");

// Function BPC_TimeTrialRanking.BPC_TimeTrialRanking_C.OnCancelEvent
// 0x0008 (0x0008 - 0x0000)
struct BPC_TimeTrialRanking_C_OnCancelEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialRanking_C_OnCancelEvent) == 0x000008, "Wrong alignment on BPC_TimeTrialRanking_C_OnCancelEvent");
static_assert(sizeof(BPC_TimeTrialRanking_C_OnCancelEvent) == 0x000008, "Wrong size on BPC_TimeTrialRanking_C_OnCancelEvent");
static_assert(offsetof(BPC_TimeTrialRanking_C_OnCancelEvent, Object) == 0x000000, "Member 'BPC_TimeTrialRanking_C_OnCancelEvent::Object' has a wrong offset!");

// Function BPC_TimeTrialRanking.BPC_TimeTrialRanking_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_TimeTrialRanking_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialRanking_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_TimeTrialRanking_C_OnUpdateState");
static_assert(sizeof(BPC_TimeTrialRanking_C_OnUpdateState) == 0x000004, "Wrong size on BPC_TimeTrialRanking_C_OnUpdateState");
static_assert(offsetof(BPC_TimeTrialRanking_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_TimeTrialRanking_C_OnUpdateState::InDeltaTime' has a wrong offset!");

// Function BPC_TimeTrialRanking.BPC_TimeTrialRanking_C.FinishDownloadEvent
// 0x0001 (0x0001 - 0x0000)
struct BPC_TimeTrialRanking_C_FinishDownloadEvent final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialRanking_C_FinishDownloadEvent) == 0x000001, "Wrong alignment on BPC_TimeTrialRanking_C_FinishDownloadEvent");
static_assert(sizeof(BPC_TimeTrialRanking_C_FinishDownloadEvent) == 0x000001, "Wrong size on BPC_TimeTrialRanking_C_FinishDownloadEvent");
static_assert(offsetof(BPC_TimeTrialRanking_C_FinishDownloadEvent, Success) == 0x000000, "Member 'BPC_TimeTrialRanking_C_FinishDownloadEvent::Success' has a wrong offset!");

// Function BPC_TimeTrialRanking.BPC_TimeTrialRanking_C.Window_OnDecide
// 0x0010 (0x0010 - 0x0000)
struct BPC_TimeTrialRanking_C_Window_OnDecide final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialRanking_C_Window_OnDecide) == 0x000008, "Wrong alignment on BPC_TimeTrialRanking_C_Window_OnDecide");
static_assert(sizeof(BPC_TimeTrialRanking_C_Window_OnDecide) == 0x000010, "Wrong size on BPC_TimeTrialRanking_C_Window_OnDecide");
static_assert(offsetof(BPC_TimeTrialRanking_C_Window_OnDecide, Button) == 0x000000, "Member 'BPC_TimeTrialRanking_C_Window_OnDecide::Button' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_Window_OnDecide, PanelIndex) == 0x000008, "Member 'BPC_TimeTrialRanking_C_Window_OnDecide::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_Window_OnDecide, ButtonIndex) == 0x00000C, "Member 'BPC_TimeTrialRanking_C_Window_OnDecide::ButtonIndex' has a wrong offset!");

// Function BPC_TimeTrialRanking.BPC_TimeTrialRanking_C.SetupFooter
// 0x0001 (0x0001 - 0x0000)
struct BPC_TimeTrialRanking_C_SetupFooter final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialRanking_C_SetupFooter) == 0x000001, "Wrong alignment on BPC_TimeTrialRanking_C_SetupFooter");
static_assert(sizeof(BPC_TimeTrialRanking_C_SetupFooter) == 0x000001, "Wrong size on BPC_TimeTrialRanking_C_SetupFooter");
static_assert(offsetof(BPC_TimeTrialRanking_C_SetupFooter, IsVisible) == 0x000000, "Member 'BPC_TimeTrialRanking_C_SetupFooter::IsVisible' has a wrong offset!");

// Function BPC_TimeTrialRanking.BPC_TimeTrialRanking_C.OnMyBestButtonPressed
// 0x0008 (0x0008 - 0x0000)
struct BPC_TimeTrialRanking_C_OnMyBestButtonPressed final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialRanking_C_OnMyBestButtonPressed) == 0x000008, "Wrong alignment on BPC_TimeTrialRanking_C_OnMyBestButtonPressed");
static_assert(sizeof(BPC_TimeTrialRanking_C_OnMyBestButtonPressed) == 0x000008, "Wrong size on BPC_TimeTrialRanking_C_OnMyBestButtonPressed");
static_assert(offsetof(BPC_TimeTrialRanking_C_OnMyBestButtonPressed, Object) == 0x000000, "Member 'BPC_TimeTrialRanking_C_OnMyBestButtonPressed::Object' has a wrong offset!");

// Function BPC_TimeTrialRanking.BPC_TimeTrialRanking_C.ExecuteUbergraph_BPC_TimeTrialRanking
// 0x03D0 (0x03D0 - 0x0000)
struct BPC_TimeTrialRanking_C_ExecuteUbergraph_BPC_TimeTrialRanking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TimeTrial_Sub_Ranking_C*           CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_TimeTrialSequence_C*                K2Node_DynamicCast_AsBP_Time_Trial_Sequence;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_1; // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_2;                       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_1;                       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_2;      // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue_1;         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_3;      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      CallFunc_GetSelectedStageId_Selected_Stage_Id_Single; // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x1];                                       // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentIndex_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMenuRankingLineData                   CallFunc_Array_Get_Item;                           // 0x00C0(0x0038)()
	float                                         K2Node_Event_InDeltaTime;                          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x012C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESpeedClassId                                 CallFunc_GetSelectedClassId_ReturnValue;           // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuSequenceUIInterface> CallFunc_SetNextSubMenuSequenceState_self_CastInput; // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuSequenceUIInterface> CallFunc_SetNextSubMenuSequenceState_self_CastInput_1; // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0178(0x0004)()
	int32                                         CallFunc_GetCurrentIndex_ReturnValue_1;            // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0180(0x0004)()
	bool                                          CallFunc_GetRankingTimeTrialData_OutIsValid;       // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRankingDataTimeTrial                  CallFunc_GetRankingTimeTrialData_ReturnValue;      // 0x0188(0x00D0)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate_6;            // 0x025C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x026C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsVisible;                      // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0280(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GhostDownloadActor_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuInputRecieveObject*                CallFunc_SpawnObject_ReturnValue;                  // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInputEnable_input;                     // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpeedClassId                                 CallFunc_GetSelectedClassId_ReturnValue_1;         // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      CallFunc_GetSelectedStageId_Selected_Stage_Id_Single_1; // 0x0305(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0306(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTimeTrialRaceData_bOutIsGhostValid;    // 0x0307(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUserTimeTrialRaceData                 CallFunc_GetTimeTrialRaceData_ReturnValue;         // 0x0308(0x0050)()
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x0358(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_9;            // 0x0370(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_4;      // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue_2;         // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392[0x2];                                      // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0394(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuSequenceUIInterface> CallFunc_SetNextSubMenuSequenceState_self_CastInput_2; // 0x03A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x03B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_TimeTrialRanking_C_ExecuteUbergraph_BPC_TimeTrialRanking) == 0x000010, "Wrong alignment on BPC_TimeTrialRanking_C_ExecuteUbergraph_BPC_TimeTrialRanking");
static_assert(sizeof(BPC_TimeTrialRanking_C_ExecuteUbergraph_BPC_TimeTrialRanking) == 0x0003D0, "Wrong size on BPC_TimeTrialRanking_C_ExecuteUbergraph_BPC_TimeTrialRanking");
static_assert(offsetof(BPC_TimeTrialRanking_C_ExecuteUbergraph_BPC_TimeTrialRanking, EntryPoint) == 0x000000, "Member 'BPC_TimeTrialRanking_C_ExecuteUbergraph_BPC_TimeTrialRanking::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_TimeTrialRanking_C_ExecuteUbergraph_BPC_TimeTrialRanking, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BPC_TimeTrialRanking_C_ExecuteUbergraph_BPC_TimeTrialRanking::CallFunc_Create_ReturnValue' has a wrong offset!");
