#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_GetDLCFreeContent

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function BPC_GetDLCFreeContent.BPC_GetDLCFreeContent_C.ExecuteUbergraph_BPC_GetDLCFreeContent
// 0x01A8 (0x01A8 - 0x0000)
struct BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EDriverId>                             CallFunc_CheckUnlockCutscenCharacter_CutsceneCharacterList; // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_CheckUnlockCutscenCharacter_ReturnValue;  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetForceOpenCollabo_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0068(0x0010)()
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESaveDataStatus Status)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemGet_Window_C*                  CallFunc_OpenRewardDialog_RewardDialogWidget;      // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_OpenRewardDialog_ZOrder;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00D8(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EDriverId>                             CallFunc_CheckUnlockCutscenCharacter_CutsceneCharacterList_1; // 0x0128(0x0010)(ReferenceParm)
	bool                                          CallFunc_CheckUnlockCutscenCharacter_ReturnValue_1; // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate_4;     // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ItemGet_Window_C*                  CallFunc_OpenRewardDialog_RewardDialogWidget_1;    // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_OpenRewardDialog_ZOrder_1;                // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AddCharacterInfo_C*                CallFunc_Create_ReturnValue;                       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         K2Node_CustomEvent_FadeDirection;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AddCharacterInfo_C*                CallFunc_Create_ReturnValue_1;                     // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESaveDataStatus                               K2Node_CustomEvent_Status;                         // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18B[0x1];                                      // 0x018B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent) == 0x000008, "Wrong alignment on BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent");
static_assert(sizeof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent) == 0x0001A8, "Wrong size on BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, EntryPoint) == 0x000000, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_CheckUnlockCutscenCharacter_CutsceneCharacterList) == 0x000020, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_CheckUnlockCutscenCharacter_CutsceneCharacterList' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_CheckUnlockCutscenCharacter_ReturnValue) == 0x000030, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_CheckUnlockCutscenCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, Temp_int_Variable) == 0x000038, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000048, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_GetForceOpenCollabo_ReturnValue) == 0x000050, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_GetForceOpenCollabo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_MakeLiteralText_ReturnValue) == 0x000068, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000078, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_OpenRewardDialog_RewardDialogWidget) == 0x000090, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_OpenRewardDialog_RewardDialogWidget' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_OpenRewardDialog_ZOrder) == 0x000098, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_OpenRewardDialog_ZOrder' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_GetPlayerController_ReturnValue) == 0x0000A0, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0000A8, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, K2Node_DynamicCast_AsApp_Player_Controller) == 0x0000B0, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0000BC, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, Temp_int_Variable_1) == 0x0000C0, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C4, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000D8, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000E8, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x0000F0, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000100, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000108, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x00010C, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000110, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Array_Length_ReturnValue_1) == 0x000114, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000118, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Less_IntInt_ReturnValue_1) == 0x000120, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_CheckUnlockCutscenCharacter_CutsceneCharacterList_1) == 0x000128, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_CheckUnlockCutscenCharacter_CutsceneCharacterList_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_CheckUnlockCutscenCharacter_ReturnValue_1) == 0x000138, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_CheckUnlockCutscenCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, K2Node_CreateDelegate_OutputDelegate_4) == 0x00013C, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_OpenRewardDialog_RewardDialogWidget_1) == 0x000150, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_OpenRewardDialog_RewardDialogWidget_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_OpenRewardDialog_ZOrder_1) == 0x000158, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_OpenRewardDialog_ZOrder_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Create_ReturnValue) == 0x000160, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000168, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, K2Node_CustomEvent_FadeDirection) == 0x000170, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::K2Node_CustomEvent_FadeDirection' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000171, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Create_ReturnValue_1) == 0x000178, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000180, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Array_Length_ReturnValue_2) == 0x000184, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Greater_IntInt_ReturnValue) == 0x000188, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_IsValid_ReturnValue_1) == 0x000189, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, K2Node_CustomEvent_Status) == 0x00018A, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::K2Node_CustomEvent_Status' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Array_Length_ReturnValue_3) == 0x00018C, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, K2Node_CreateDelegate_OutputDelegate_5) == 0x000190, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001A0, "Member 'BPC_GetDLCFreeContent_C_ExecuteUbergraph_BPC_GetDLCFreeContent::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function BPC_GetDLCFreeContent.BPC_GetDLCFreeContent_C.OnComplete_Save
// 0x0001 (0x0001 - 0x0000)
struct BPC_GetDLCFreeContent_C_OnComplete_Save final
{
public:
	ESaveDataStatus                               Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GetDLCFreeContent_C_OnComplete_Save) == 0x000001, "Wrong alignment on BPC_GetDLCFreeContent_C_OnComplete_Save");
static_assert(sizeof(BPC_GetDLCFreeContent_C_OnComplete_Save) == 0x000001, "Wrong size on BPC_GetDLCFreeContent_C_OnComplete_Save");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OnComplete_Save, Status) == 0x000000, "Member 'BPC_GetDLCFreeContent_C_OnComplete_Save::Status' has a wrong offset!");

// Function BPC_GetDLCFreeContent.BPC_GetDLCFreeContent_C.OnFinishedFade
// 0x0001 (0x0001 - 0x0000)
struct BPC_GetDLCFreeContent_C_OnFinishedFade final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GetDLCFreeContent_C_OnFinishedFade) == 0x000001, "Wrong alignment on BPC_GetDLCFreeContent_C_OnFinishedFade");
static_assert(sizeof(BPC_GetDLCFreeContent_C_OnFinishedFade) == 0x000001, "Wrong size on BPC_GetDLCFreeContent_C_OnFinishedFade");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OnFinishedFade, FadeDirection) == 0x000000, "Member 'BPC_GetDLCFreeContent_C_OnFinishedFade::FadeDirection' has a wrong offset!");

// Function BPC_GetDLCFreeContent.BPC_GetDLCFreeContent_C.OpenRewardWindow
// 0x0038 (0x0038 - 0x0000)
struct BPC_GetDLCFreeContent_C_OpenRewardWindow final
{
public:
	TArray<struct FRewardGetWindowParam>          rewardList;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Title;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_ItemGet_Window_C*                  newParam;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemGet_Window_C*                  CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GetDLCFreeContent_C_OpenRewardWindow) == 0x000008, "Wrong alignment on BPC_GetDLCFreeContent_C_OpenRewardWindow");
static_assert(sizeof(BPC_GetDLCFreeContent_C_OpenRewardWindow) == 0x000038, "Wrong size on BPC_GetDLCFreeContent_C_OpenRewardWindow");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenRewardWindow, rewardList) == 0x000000, "Member 'BPC_GetDLCFreeContent_C_OpenRewardWindow::rewardList' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenRewardWindow, Title) == 0x000010, "Member 'BPC_GetDLCFreeContent_C_OpenRewardWindow::Title' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenRewardWindow, newParam) == 0x000020, "Member 'BPC_GetDLCFreeContent_C_OpenRewardWindow::newParam' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenRewardWindow, CallFunc_Create_ReturnValue) == 0x000028, "Member 'BPC_GetDLCFreeContent_C_OpenRewardWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenRewardWindow, CallFunc_MakeLiteralByte_ReturnValue) == 0x000030, "Member 'BPC_GetDLCFreeContent_C_OpenRewardWindow::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenRewardWindow, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000034, "Member 'BPC_GetDLCFreeContent_C_OpenRewardWindow::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function BPC_GetDLCFreeContent.BPC_GetDLCFreeContent_C.OpenUnlockCharacter
// 0x0130 (0x0130 - 0x0000)
struct BPC_GetDLCFreeContent_C_OpenUnlockCharacter final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00B8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter) == 0x000008, "Wrong alignment on BPC_GetDLCFreeContent_C_OpenUnlockCharacter");
static_assert(sizeof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter) == 0x000130, "Wrong size on BPC_GetDLCFreeContent_C_OpenUnlockCharacter");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'BPC_GetDLCFreeContent_C_OpenUnlockCharacter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'BPC_GetDLCFreeContent_C_OpenUnlockCharacter::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000010, "Member 'BPC_GetDLCFreeContent_C_OpenUnlockCharacter::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BPC_GetDLCFreeContent_C_OpenUnlockCharacter::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'BPC_GetDLCFreeContent_C_OpenUnlockCharacter::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000A8, "Member 'BPC_GetDLCFreeContent_C_OpenUnlockCharacter::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0000B0, "Member 'BPC_GetDLCFreeContent_C_OpenUnlockCharacter::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000B8, "Member 'BPC_GetDLCFreeContent_C_OpenUnlockCharacter::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter, K2Node_MakeArray_Array) == 0x000100, "Member 'BPC_GetDLCFreeContent_C_OpenUnlockCharacter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter, CallFunc_Format_ReturnValue) == 0x000110, "Member 'BPC_GetDLCFreeContent_C_OpenUnlockCharacter::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_OpenUnlockCharacter, CallFunc_Conv_TextToString_ReturnValue) == 0x000120, "Member 'BPC_GetDLCFreeContent_C_OpenUnlockCharacter::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BPC_GetDLCFreeContent.BPC_GetDLCFreeContent_C.Set Footer Visibility
// 0x0018 (0x0018 - 0x0000)
struct BPC_GetDLCFreeContent_C_Set_Footer_Visibility final
{
public:
	bool                                          IsVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_GetDLCFreeContent_C_Set_Footer_Visibility) == 0x000008, "Wrong alignment on BPC_GetDLCFreeContent_C_Set_Footer_Visibility");
static_assert(sizeof(BPC_GetDLCFreeContent_C_Set_Footer_Visibility) == 0x000018, "Wrong size on BPC_GetDLCFreeContent_C_Set_Footer_Visibility");
static_assert(offsetof(BPC_GetDLCFreeContent_C_Set_Footer_Visibility, IsVisible) == 0x000000, "Member 'BPC_GetDLCFreeContent_C_Set_Footer_Visibility::IsVisible' has a wrong offset!");
static_assert(offsetof(BPC_GetDLCFreeContent_C_Set_Footer_Visibility, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BPC_GetDLCFreeContent_C_Set_Footer_Visibility::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
