#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceResultRateRank

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_RaceResultRateRank.BPC_RaceResultRateRank_C
// 0x0018 (0x0120 - 0x0108)
class UBPC_RaceResultRateRank_C final : public URaceResultSequenceStateRateRank
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_RaceResultSequence_C*               OwnerSeq;                                          // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_ResultRate_C*                      ResultRate;                                        // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_RaceResultRateRank(int32 EntryPoint);
	void OnInitState();
	void OnUpdateState(float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_RaceResultRateRank_C">();
	}
	static class UBPC_RaceResultRateRank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_RaceResultRateRank_C>();
	}
};
static_assert(alignof(UBPC_RaceResultRateRank_C) == 0x000008, "Wrong alignment on UBPC_RaceResultRateRank_C");
static_assert(sizeof(UBPC_RaceResultRateRank_C) == 0x000120, "Wrong size on UBPC_RaceResultRateRank_C");
static_assert(offsetof(UBPC_RaceResultRateRank_C, UberGraphFrame) == 0x000108, "Member 'UBPC_RaceResultRateRank_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_RaceResultRateRank_C, OwnerSeq) == 0x000110, "Member 'UBPC_RaceResultRateRank_C::OwnerSeq' has a wrong offset!");
static_assert(offsetof(UBPC_RaceResultRateRank_C, ResultRate) == 0x000118, "Member 'UBPC_RaceResultRateRank_C::ResultRate' has a wrong offset!");

}

