#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateSendRaceEnd

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionLib_structs.hpp"
#include "UnionRun_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_RaceSequenceStateSendRaceEnd.BPC_RaceSequenceStateSendRaceEnd_C.ConvertStickerData
// 0x0178 (0x0178 - 0x0000)
struct BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData final
{
public:
	struct FUserStickerData                       UserStickerData;                                   // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FCommon_MachineStickerData             Common_MachineStickerData;                         // 0x0028(0x0068)(Parm, OutParm)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_2;        // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_3;        // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_4;        // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FCommon_MachineStickerData             K2Node_MakeStruct_Common_MachineStickerData;       // 0x00E8(0x0068)()
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_2; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_3; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_4; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData");
static_assert(sizeof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData) == 0x000178, "Wrong size on BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, UserStickerData) == 0x000000, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::UserStickerData' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, Common_MachineStickerData) == 0x000028, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::Common_MachineStickerData' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000090, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000A0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x0000A8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, CallFunc_Conv_DoubleToString_ReturnValue_2) == 0x0000B8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::CallFunc_Conv_DoubleToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, CallFunc_Conv_DoubleToString_ReturnValue_3) == 0x0000C8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::CallFunc_Conv_DoubleToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, CallFunc_Conv_DoubleToString_ReturnValue_4) == 0x0000D8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::CallFunc_Conv_DoubleToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, K2Node_MakeStruct_Common_MachineStickerData) == 0x0000E8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::K2Node_MakeStruct_Common_MachineStickerData' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000150, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1) == 0x000158, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_2) == 0x000160, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_3) == 0x000168, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_4) == 0x000170, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_4' has a wrong offset!");

// Function BPC_RaceSequenceStateSendRaceEnd.BPC_RaceSequenceStateSendRaceEnd_C.EndPlatformGameMatch
// 0x00D0 (0x00D0 - 0x0000)
struct BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch final
{
public:
	TArray<struct FCommon_UserOrderData>          LocalUserOrder;                                    // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCommon_UserOrderData                  CallFunc_Array_Get_Item;                           // 0x0020(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonLobbyContext*                    K2Node_DynamicCast_AsCommon_Lobby_Context;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULobbyMemberContextBase*>        CallFunc_GetAllMembers_OutResult;                  // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyMemberContextBase*                CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUserIdString_OutResult;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FCommon_UserOrderData                  K2Node_MakeStruct_Common_UserOrderData;            // 0x00A0(0x0018)()
	class FString                                 CallFunc_GetInternalUserId_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch");
static_assert(sizeof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch) == 0x0000D0, "Wrong size on BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, LocalUserOrder) == 0x000000, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::LocalUserOrder' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_Array_Get_Item) == 0x000020, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000048, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_GetPublicLobbyContext_ReturnValue) == 0x000050, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_GetPublicLobbyContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, K2Node_DynamicCast_AsCommon_Lobby_Context) == 0x000058, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::K2Node_DynamicCast_AsCommon_Lobby_Context' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_GetAllMembers_OutResult) == 0x000068, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_GetAllMembers_OutResult' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_Less_IntInt_ReturnValue_1) == 0x000088, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_GetUserIdString_OutResult) == 0x000090, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_GetUserIdString_OutResult' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, K2Node_MakeStruct_Common_UserOrderData) == 0x0000A0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::K2Node_MakeStruct_Common_UserOrderData' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_GetInternalUserId_ReturnValue) == 0x0000B8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_GetInternalUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_Array_Add_ReturnValue) == 0x0000C8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x0000CC, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateSendRaceEnd.BPC_RaceSequenceStateSendRaceEnd_C.ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd
// 0x0EA8 (0x0EA8 - 0x0000)
struct BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResultSaveFestaResultRequest          CallFunc_GetResultSaveFestaResultRequest_Request;  // 0x0008(0x0418)()
	bool                                          CallFunc_GetResultSaveFestaResultRequest_IsSuccess; // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResultSaveRankMatchResultRequest      CallFunc_GetResultSaveRankMatchResultRequest_Request; // 0x0428(0x03F8)()
	bool                                          CallFunc_GetResultSaveRankMatchResultRequest_IsSuccess; // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_821[0x7];                                      // 0x0821(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_DispStr;                        // 0x0828(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bError;                         // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0840(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0850(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0898(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x08A8(0x0048)(HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F1[0x7];                                      // 0x08F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineMatchSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x08F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0900(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableOnlineSinglePlay_ReturnValue;     // 0x0910(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_911[0x7];                                      // 0x0911(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0918(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0928(0x0048)(HasGetValueTypeHash)
	class UOnlineMatchSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0970(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0978(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsEnableOnlineSinglePlay_ReturnValue_1;   // 0x0988(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_989[0x7];                                      // 0x0989(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0990(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x09A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ApiName, const class FString& RequestData, const class FString& ResponseData, bool Error)> K2Node_CreateDelegate_OutputDelegate; // 0x09B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ApiName, const class FString& RequestData, const class FString& ResponseData, bool Error)> K2Node_CreateDelegate_OutputDelegate_1; // 0x09C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x09D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue;        // 0x09D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x09E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E1[0x7];                                      // 0x09E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppSequenceLogManagerSubsystem*        CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x09E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppSequenceLogManagerSubsystem*        CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x09F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESequenceSubType                              CallFunc_GetSequenceSubType_ReturnValue;           // 0x09F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceMainType                             CallFunc_GetSequenceMainType_ReturnValue;          // 0x09F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9FA[0x6];                                      // 0x09FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ApiName_2;                      // 0x0A00(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_RequestData_2;                  // 0x0A10(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ResponseData_2;                 // 0x0A20(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Error_2;                        // 0x0A30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EResponseCodeAbstract                         CallFunc_ValidateResCode_ResCodeAbstract;          // 0x0A31(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateResCode_ReturnValue;              // 0x0A32(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A33[0x1];                                      // 0x0A33(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Parse_ResultSaveLegendCompeResult_ResCode; // 0x0A34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FResultSaveLegendCompeResultResponse   CallFunc_Parse_ResultSaveLegendCompeResult_Response; // 0x0A38(0x00F8)()
	class UAppSequenceLogManagerSubsystem*        CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0B30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0B38(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue_1;      // 0x0B40(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0B48(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonLobbyContext*                    K2Node_DynamicCast_AsCommon_Lobby_Context;         // 0x0B50(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0B58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B59[0x7];                                      // 0x0B59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue_2;      // 0x0B60(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEntryRaceId_ReturnValue;               // 0x0B68(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0B78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B79[0x7];                                      // 0x0B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonLobbyContext*                    K2Node_DynamicCast_AsCommon_Lobby_Context_1;       // 0x0B80(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0B88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B89[0x7];                                      // 0x0B89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyMemberContextBase*                CallFunc_GetHostMember_ReturnValue;                // 0x0B90(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRaceHostLocalUser_ReturnValue;          // 0x0B98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B99[0x7];                                      // 0x0B99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetLocalUserId_OutUserId;                 // 0x0BA0(0x0030)(HasGetValueTypeHash)
	class ULobbyMemberContextBase*                CallFunc_GetMember_ReturnValue;                    // 0x0BD0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0BD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD9[0x7];                                      // 0x0BD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ApiName_1;                      // 0x0BE0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_RequestData_1;                  // 0x0BF0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ResponseData_1;                 // 0x0C00(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Error_1;                        // 0x0C10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C11[0x3];                                      // 0x0C11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Parse_ResultSaveFestaResult_ResCode;      // 0x0C14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FResultSaveFestaResultResponse         CallFunc_Parse_ResultSaveFestaResult_Response;     // 0x0C18(0x0158)()
	class FString                                 K2Node_CustomEvent_ApiName;                        // 0x0D70(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_RequestData;                    // 0x0D80(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ResponseData;                   // 0x0D90(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Error;                          // 0x0DA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EResponseCodeAbstract                         CallFunc_ValidateResCode_ResCodeAbstract_1;        // 0x0DA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateResCode_ReturnValue_1;            // 0x0DA2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetResultFestaData_bSuccess;              // 0x0DA3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Parse_ResultSaveRankMatchResult_ResCode;  // 0x0DA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FResultSaveRankMatchResultResponse     CallFunc_Parse_ResultSaveRankMatchResult_Response; // 0x0DA8(0x00F8)()
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x0EA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EResponseCodeAbstract                         CallFunc_ValidateResCode_ResCodeAbstract_2;        // 0x0EA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateResCode_ReturnValue_2;            // 0x0EA2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0EA3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSkipCurrentState_ReturnValue;        // 0x0EA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd");
static_assert(sizeof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd) == 0x000EA8, "Wrong size on BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, EntryPoint) == 0x000000, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetResultSaveFestaResultRequest_Request) == 0x000008, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetResultSaveFestaResultRequest_Request' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetResultSaveFestaResultRequest_IsSuccess) == 0x000420, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetResultSaveFestaResultRequest_IsSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetResultSaveRankMatchResultRequest_Request) == 0x000428, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetResultSaveRankMatchResultRequest_Request' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetResultSaveRankMatchResultRequest_IsSuccess) == 0x000820, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetResultSaveRankMatchResultRequest_IsSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_DispStr) == 0x000828, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_DispStr' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_bError) == 0x000838, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_bError' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_Conv_BoolToText_ReturnValue) == 0x000840, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_MakeStruct_FormatArgumentData) == 0x000850, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_Conv_StringToText_ReturnValue) == 0x000898, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_MakeStruct_FormatArgumentData_1) == 0x0008A8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x0008F0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0008F8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000900, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_IsEnableOnlineSinglePlay_ReturnValue) == 0x000910, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_IsEnableOnlineSinglePlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000918, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_MakeStruct_FormatArgumentData_2) == 0x000928, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000970, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_MakeArray_Array) == 0x000978, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_IsEnableOnlineSinglePlay_ReturnValue_1) == 0x000988, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_IsEnableOnlineSinglePlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_Format_ReturnValue) == 0x000990, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_Conv_TextToString_ReturnValue) == 0x0009A0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CreateDelegate_OutputDelegate) == 0x0009B0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CreateDelegate_OutputDelegate_1) == 0x0009C0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0009D0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetPublicLobbyContext_ReturnValue) == 0x0009D8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetPublicLobbyContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_IsValid_ReturnValue) == 0x0009E0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0009E8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0009F0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetSequenceSubType_ReturnValue) == 0x0009F8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetSequenceSubType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetSequenceMainType_ReturnValue) == 0x0009F9, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetSequenceMainType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_ApiName_2) == 0x000A00, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_ApiName_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_RequestData_2) == 0x000A10, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_RequestData_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_ResponseData_2) == 0x000A20, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_ResponseData_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_Error_2) == 0x000A30, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_Error_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_ValidateResCode_ResCodeAbstract) == 0x000A31, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_ValidateResCode_ResCodeAbstract' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_ValidateResCode_ReturnValue) == 0x000A32, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_ValidateResCode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_Parse_ResultSaveLegendCompeResult_ResCode) == 0x000A34, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_Parse_ResultSaveLegendCompeResult_ResCode' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_Parse_ResultSaveLegendCompeResult_Response) == 0x000A38, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_Parse_ResultSaveLegendCompeResult_Response' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000B30, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x000B38, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetPublicLobbyContext_ReturnValue_1) == 0x000B40, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetPublicLobbyContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue_7) == 0x000B48, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_DynamicCast_AsCommon_Lobby_Context) == 0x000B50, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_DynamicCast_AsCommon_Lobby_Context' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_DynamicCast_bSuccess) == 0x000B58, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetPublicLobbyContext_ReturnValue_2) == 0x000B60, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetPublicLobbyContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetEntryRaceId_ReturnValue) == 0x000B68, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetEntryRaceId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_IsValid_ReturnValue_1) == 0x000B78, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_DynamicCast_AsCommon_Lobby_Context_1) == 0x000B80, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_DynamicCast_AsCommon_Lobby_Context_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_DynamicCast_bSuccess_1) == 0x000B88, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetHostMember_ReturnValue) == 0x000B90, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetHostMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_IsRaceHostLocalUser_ReturnValue) == 0x000B98, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_IsRaceHostLocalUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetLocalUserId_OutUserId) == 0x000BA0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetLocalUserId_OutUserId' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetMember_ReturnValue) == 0x000BD0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000BD8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_ApiName_1) == 0x000BE0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_ApiName_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_RequestData_1) == 0x000BF0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_RequestData_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_ResponseData_1) == 0x000C00, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_ResponseData_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_Error_1) == 0x000C10, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_Error_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_Parse_ResultSaveFestaResult_ResCode) == 0x000C14, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_Parse_ResultSaveFestaResult_ResCode' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_Parse_ResultSaveFestaResult_Response) == 0x000C18, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_Parse_ResultSaveFestaResult_Response' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_ApiName) == 0x000D70, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_ApiName' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_RequestData) == 0x000D80, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_RequestData' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_ResponseData) == 0x000D90, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_ResponseData' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_CustomEvent_Error) == 0x000DA0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_CustomEvent_Error' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_ValidateResCode_ResCodeAbstract_1) == 0x000DA1, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_ValidateResCode_ResCodeAbstract_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_ValidateResCode_ReturnValue_1) == 0x000DA2, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_ValidateResCode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_SetResultFestaData_bSuccess) == 0x000DA3, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_SetResultFestaData_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_Parse_ResultSaveRankMatchResult_ResCode) == 0x000DA4, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_Parse_ResultSaveRankMatchResult_ResCode' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_Parse_ResultSaveRankMatchResult_Response) == 0x000DA8, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_Parse_ResultSaveRankMatchResult_Response' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_GetSelectedGameModeId_ReturnValue_1) == 0x000EA0, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_GetSelectedGameModeId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_ValidateResCode_ResCodeAbstract_2) == 0x000EA1, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_ValidateResCode_ResCodeAbstract_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_ValidateResCode_ReturnValue_2) == 0x000EA2, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_ValidateResCode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, K2Node_SwitchEnum_CmpSuccess) == 0x000EA3, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd, CallFunc_CheckSkipCurrentState_ReturnValue) == 0x000EA4, "Member 'BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd::CallFunc_CheckSkipCurrentState_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateSendRaceEnd.BPC_RaceSequenceStateSendRaceEnd_C.GetHistoryData
// 0x00E0 (0x00E0 - 0x0000)
struct BPC_RaceSequenceStateSendRaceEnd_C_GetHistoryData final
{
public:
	class UCommonLobbyMemberContext*              MemberContext;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCommon_HistoryData                    Common_HistoryData;                                // 0x0008(0x0020)(Parm, OutParm)
	ECarStatusType                                SelectedMachineType;                               // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MyPlayerRacerIndex;                                // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCommon_HistoryData_MachineTypeUsage> LocalUsageMachine;                           // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<struct FCommon_HistoryData_CharacterUsage> LocalUsageChara;                               // 0x0040(0x0010)(Edit, BlueprintVisible)
	class UUnionStatsManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetSelectedDriverId_OutId;                // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
