#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_SelectCourse

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UnionLib_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_SelectCourse.BPC_SelectCourse_C.StartNotification
// 0x0018 (0x0018 - 0x0000)
struct BPC_SelectCourse_C_StartNotification final
{
public:
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIncompleteCollaboGPVictoryPopupRequired_ReturnValue; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_StartNotification) == 0x000004, "Wrong alignment on BPC_SelectCourse_C_StartNotification");
static_assert(sizeof(BPC_SelectCourse_C_StartNotification) == 0x000018, "Wrong size on BPC_SelectCourse_C_StartNotification");
static_assert(offsetof(BPC_SelectCourse_C_StartNotification, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000000, "Member 'BPC_SelectCourse_C_StartNotification::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_StartNotification, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BPC_SelectCourse_C_StartNotification::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_StartNotification, CallFunc_IsIncompleteCollaboGPVictoryPopupRequired_ReturnValue) == 0x000002, "Member 'BPC_SelectCourse_C_StartNotification::CallFunc_IsIncompleteCollaboGPVictoryPopupRequired_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_StartNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BPC_SelectCourse_C_StartNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_StartNotification, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'BPC_SelectCourse_C_StartNotification::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnStoreRequested
// 0x0003 (0x0003 - 0x0000)
struct BPC_SelectCourse_C_OnStoreRequested final
{
public:
	bool                                          GrandPrixSelecting;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartStore_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnStoreRequested) == 0x000001, "Wrong alignment on BPC_SelectCourse_C_OnStoreRequested");
static_assert(sizeof(BPC_SelectCourse_C_OnStoreRequested) == 0x000003, "Wrong size on BPC_SelectCourse_C_OnStoreRequested");
static_assert(offsetof(BPC_SelectCourse_C_OnStoreRequested, GrandPrixSelecting) == 0x000000, "Member 'BPC_SelectCourse_C_OnStoreRequested::GrandPrixSelecting' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_OnStoreRequested, CallFunc_StartStore_ReturnValue) == 0x000001, "Member 'BPC_SelectCourse_C_OnStoreRequested::CallFunc_StartStore_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_OnStoreRequested, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BPC_SelectCourse_C_OnStoreRequested::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.GetSelectedAndLotResultStageIds
// 0x0040 (0x0040 - 0x0000)
struct BPC_SelectCourse_C_GetSelectedAndLotResultStageIds final
{
public:
	EStageId                                      SelectedStageId;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EStageId>                              ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	TArray<EStageId>                              Result;                                            // 0x0018(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EStageId>                              CallFunc_GetLotteryResultsStageIds_OutStageIds;    // 0x0030(0x0010)(ReferenceParm)
};
static_assert(alignof(BPC_SelectCourse_C_GetSelectedAndLotResultStageIds) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_GetSelectedAndLotResultStageIds");
static_assert(sizeof(BPC_SelectCourse_C_GetSelectedAndLotResultStageIds) == 0x000040, "Wrong size on BPC_SelectCourse_C_GetSelectedAndLotResultStageIds");
static_assert(offsetof(BPC_SelectCourse_C_GetSelectedAndLotResultStageIds, SelectedStageId) == 0x000000, "Member 'BPC_SelectCourse_C_GetSelectedAndLotResultStageIds::SelectedStageId' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_GetSelectedAndLotResultStageIds, ReturnValue) == 0x000008, "Member 'BPC_SelectCourse_C_GetSelectedAndLotResultStageIds::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_GetSelectedAndLotResultStageIds, Result) == 0x000018, "Member 'BPC_SelectCourse_C_GetSelectedAndLotResultStageIds::Result' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_GetSelectedAndLotResultStageIds, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BPC_SelectCourse_C_GetSelectedAndLotResultStageIds::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_GetSelectedAndLotResultStageIds, CallFunc_Array_Add_ReturnValue) == 0x00002C, "Member 'BPC_SelectCourse_C_GetSelectedAndLotResultStageIds::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_GetSelectedAndLotResultStageIds, CallFunc_GetLotteryResultsStageIds_OutStageIds) == 0x000030, "Member 'BPC_SelectCourse_C_GetSelectedAndLotResultStageIds::CallFunc_GetLotteryResultsStageIds_OutStageIds' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.FooterParkCourseRandomVisible
// 0x0004 (0x0004 - 0x0000)
struct BPC_SelectCourse_C_FooterParkCourseRandomVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_FooterParkCourseRandomVisible) == 0x000001, "Wrong alignment on BPC_SelectCourse_C_FooterParkCourseRandomVisible");
static_assert(sizeof(BPC_SelectCourse_C_FooterParkCourseRandomVisible) == 0x000004, "Wrong size on BPC_SelectCourse_C_FooterParkCourseRandomVisible");
static_assert(offsetof(BPC_SelectCourse_C_FooterParkCourseRandomVisible, Visible) == 0x000000, "Member 'BPC_SelectCourse_C_FooterParkCourseRandomVisible::Visible' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_FooterParkCourseRandomVisible, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000001, "Member 'BPC_SelectCourse_C_FooterParkCourseRandomVisible::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_FooterParkCourseRandomVisible, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BPC_SelectCourse_C_FooterParkCourseRandomVisible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_FooterParkCourseRandomVisible, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'BPC_SelectCourse_C_FooterParkCourseRandomVisible::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.IsOpenGadgetPlateTipsWindow
// 0x001C (0x001C - 0x0000)
struct BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow final
{
public:
	bool                                          bEnableOpenWindow;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   GrandPrixId;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGrandPrixLeast1Play_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadHint_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow) == 0x000004, "Wrong alignment on BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow");
static_assert(sizeof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow) == 0x00001C, "Wrong size on BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, bEnableOpenWindow) == 0x000000, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::bEnableOpenWindow' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, GrandPrixId) == 0x000001, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::GrandPrixId' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_IsGrandPrixLeast1Play_ReturnValue) == 0x000002, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_IsGrandPrixLeast1Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000003, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000008, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_GetIsOnlineGameMode_ReturnValue) == 0x00000C, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_GetIsOnlineGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000D, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x000010, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_IsReadHint_ReturnValue) == 0x000014, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_IsReadHint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000015, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_Not_PreBool_ReturnValue_1) == 0x000016, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_BooleanAND_ReturnValue) == 0x000017, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_BooleanAND_ReturnValue_1) == 0x000018, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_BooleanAND_ReturnValue_2) == 0x000019, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow, CallFunc_BooleanAND_ReturnValue_3) == 0x00001A, "Member 'BPC_SelectCourse_C_IsOpenGadgetPlateTipsWindow::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.ShowTipsWindow
// 0x0038 (0x0038 - 0x0000)
struct BPC_SelectCourse_C_ShowTipsWindow final
{
public:
	EHintId                                       InHintId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Popup_Window_Hint_C*               CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_ShowTipsWindow) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_ShowTipsWindow");
static_assert(sizeof(BPC_SelectCourse_C_ShowTipsWindow) == 0x000038, "Wrong size on BPC_SelectCourse_C_ShowTipsWindow");
static_assert(offsetof(BPC_SelectCourse_C_ShowTipsWindow, InHintId) == 0x000000, "Member 'BPC_SelectCourse_C_ShowTipsWindow::InHintId' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_ShowTipsWindow, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BPC_SelectCourse_C_ShowTipsWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_ShowTipsWindow, CallFunc_MakeLiteralByte_ReturnValue) == 0x000010, "Member 'BPC_SelectCourse_C_ShowTipsWindow::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_ShowTipsWindow, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BPC_SelectCourse_C_ShowTipsWindow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_ShowTipsWindow, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000020, "Member 'BPC_SelectCourse_C_ShowTipsWindow::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_ShowTipsWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BPC_SelectCourse_C_ShowTipsWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.SetupRivalUIData
// 0x0048 (0x0048 - 0x0000)
struct BPC_SelectCourse_C_SetupRivalUIData final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetBlankIconHiddenCount_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ERivalType>                            CallFunc_GetRivalTypes_ReturnValue;                // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERivalType                                    CallFunc_Array_Get_Item;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EDriverId>                             CallFunc_GetRaceRivalDriverIds_ReturnValue;        // 0x0030(0x0010)(ConstParm, ReferenceParm)
	EDriverId                                     CallFunc_Array_Get_Item_1;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_SetupRivalUIData) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_SetupRivalUIData");
static_assert(sizeof(BPC_SelectCourse_C_SetupRivalUIData) == 0x000048, "Wrong size on BPC_SelectCourse_C_SetupRivalUIData");
static_assert(offsetof(BPC_SelectCourse_C_SetupRivalUIData, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BPC_SelectCourse_C_SetupRivalUIData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupRivalUIData, CallFunc_GetBlankIconHiddenCount_ReturnValue) == 0x000004, "Member 'BPC_SelectCourse_C_SetupRivalUIData::CallFunc_GetBlankIconHiddenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupRivalUIData, CallFunc_GetRivalTypes_ReturnValue) == 0x000008, "Member 'BPC_SelectCourse_C_SetupRivalUIData::CallFunc_GetRivalTypes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupRivalUIData, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'BPC_SelectCourse_C_SetupRivalUIData::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupRivalUIData, CallFunc_Array_Get_Item) == 0x00001C, "Member 'BPC_SelectCourse_C_SetupRivalUIData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupRivalUIData, K2Node_SwitchEnum_CmpSuccess) == 0x00001D, "Member 'BPC_SelectCourse_C_SetupRivalUIData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupRivalUIData, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BPC_SelectCourse_C_SetupRivalUIData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupRivalUIData, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BPC_SelectCourse_C_SetupRivalUIData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupRivalUIData, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'BPC_SelectCourse_C_SetupRivalUIData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupRivalUIData, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BPC_SelectCourse_C_SetupRivalUIData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupRivalUIData, CallFunc_GetRaceRivalDriverIds_ReturnValue) == 0x000030, "Member 'BPC_SelectCourse_C_SetupRivalUIData::CallFunc_GetRaceRivalDriverIds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupRivalUIData, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'BPC_SelectCourse_C_SetupRivalUIData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.StartSelectCourse
// 0x0010 (0x0010 - 0x0000)
struct BPC_SelectCourse_C_StartSelectCourse final
{
public:
	class UWBP_CourseSelect_C*                    K2Node_DynamicCast_AsWBP_Course_Select;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_StartSelectCourse) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_StartSelectCourse");
static_assert(sizeof(BPC_SelectCourse_C_StartSelectCourse) == 0x000010, "Wrong size on BPC_SelectCourse_C_StartSelectCourse");
static_assert(offsetof(BPC_SelectCourse_C_StartSelectCourse, K2Node_DynamicCast_AsWBP_Course_Select) == 0x000000, "Member 'BPC_SelectCourse_C_StartSelectCourse::K2Node_DynamicCast_AsWBP_Course_Select' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_StartSelectCourse, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'BPC_SelectCourse_C_StartSelectCourse::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_StartSelectCourse, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000009, "Member 'BPC_SelectCourse_C_StartSelectCourse::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_StartSelectCourse, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'BPC_SelectCourse_C_StartSelectCourse::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.SetupFooter
// 0x0010 (0x0010 - 0x0000)
struct BPC_SelectCourse_C_SetupFooter final
{
public:
	int32                                         CallFunc_GetMaxRaceCount_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentRaceCount_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_SetupFooter) == 0x000004, "Wrong alignment on BPC_SelectCourse_C_SetupFooter");
static_assert(sizeof(BPC_SelectCourse_C_SetupFooter) == 0x000010, "Wrong size on BPC_SelectCourse_C_SetupFooter");
static_assert(offsetof(BPC_SelectCourse_C_SetupFooter, CallFunc_GetMaxRaceCount_ReturnValue) == 0x000000, "Member 'BPC_SelectCourse_C_SetupFooter::CallFunc_GetMaxRaceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupFooter, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000004, "Member 'BPC_SelectCourse_C_SetupFooter::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupFooter, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000005, "Member 'BPC_SelectCourse_C_SetupFooter::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupFooter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'BPC_SelectCourse_C_SetupFooter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupFooter, CallFunc_GetCurrentRaceCount_ReturnValue) == 0x000008, "Member 'BPC_SelectCourse_C_SetupFooter::CallFunc_GetCurrentRaceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupFooter, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00000C, "Member 'BPC_SelectCourse_C_SetupFooter::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupFooter, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'BPC_SelectCourse_C_SetupFooter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_SetupFooter, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'BPC_SelectCourse_C_SetupFooter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.FocusMenu
// 0x0010 (0x0010 - 0x0000)
struct BPC_SelectCourse_C_FocusMenu final
{
public:
	class UWBP_CourseSelect_C*                    K2Node_DynamicCast_AsWBP_Course_Select;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_FocusMenu) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_FocusMenu");
static_assert(sizeof(BPC_SelectCourse_C_FocusMenu) == 0x000010, "Wrong size on BPC_SelectCourse_C_FocusMenu");
static_assert(offsetof(BPC_SelectCourse_C_FocusMenu, K2Node_DynamicCast_AsWBP_Course_Select) == 0x000000, "Member 'BPC_SelectCourse_C_FocusMenu::K2Node_DynamicCast_AsWBP_Course_Select' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_FocusMenu, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'BPC_SelectCourse_C_FocusMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnLoaded_99724AAD4EFC2C7FB829649C42872529
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C_OnLoaded_99724AAD4EFC2C7FB829649C42872529 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnLoaded_99724AAD4EFC2C7FB829649C42872529) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_OnLoaded_99724AAD4EFC2C7FB829649C42872529");
static_assert(sizeof(BPC_SelectCourse_C_OnLoaded_99724AAD4EFC2C7FB829649C42872529) == 0x000008, "Wrong size on BPC_SelectCourse_C_OnLoaded_99724AAD4EFC2C7FB829649C42872529");
static_assert(offsetof(BPC_SelectCourse_C_OnLoaded_99724AAD4EFC2C7FB829649C42872529, Loaded) == 0x000000, "Member 'BPC_SelectCourse_C_OnLoaded_99724AAD4EFC2C7FB829649C42872529::Loaded' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnLoaded_82463C994F26B013C01679803F739D82
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C_OnLoaded_82463C994F26B013C01679803F739D82 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnLoaded_82463C994F26B013C01679803F739D82) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_OnLoaded_82463C994F26B013C01679803F739D82");
static_assert(sizeof(BPC_SelectCourse_C_OnLoaded_82463C994F26B013C01679803F739D82) == 0x000008, "Wrong size on BPC_SelectCourse_C_OnLoaded_82463C994F26B013C01679803F739D82");
static_assert(offsetof(BPC_SelectCourse_C_OnLoaded_82463C994F26B013C01679803F739D82, Loaded) == 0x000000, "Member 'BPC_SelectCourse_C_OnLoaded_82463C994F26B013C01679803F739D82::Loaded' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnLoaded_13BB227F48EE9660C7C676A641A62861
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C_OnLoaded_13BB227F48EE9660C7C676A641A62861 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnLoaded_13BB227F48EE9660C7C676A641A62861) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_OnLoaded_13BB227F48EE9660C7C676A641A62861");
static_assert(sizeof(BPC_SelectCourse_C_OnLoaded_13BB227F48EE9660C7C676A641A62861) == 0x000008, "Wrong size on BPC_SelectCourse_C_OnLoaded_13BB227F48EE9660C7C676A641A62861");
static_assert(offsetof(BPC_SelectCourse_C_OnLoaded_13BB227F48EE9660C7C676A641A62861, Loaded) == 0x000000, "Member 'BPC_SelectCourse_C_OnLoaded_13BB227F48EE9660C7C676A641A62861::Loaded' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnRightShoulderReleasedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C_OnRightShoulderReleasedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnRightShoulderReleasedEvent_Event) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_OnRightShoulderReleasedEvent_Event");
static_assert(sizeof(BPC_SelectCourse_C_OnRightShoulderReleasedEvent_Event) == 0x000008, "Wrong size on BPC_SelectCourse_C_OnRightShoulderReleasedEvent_Event");
static_assert(offsetof(BPC_SelectCourse_C_OnRightShoulderReleasedEvent_Event, Object) == 0x000000, "Member 'BPC_SelectCourse_C_OnRightShoulderReleasedEvent_Event::Object' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnRightShoulderPressedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C_OnRightShoulderPressedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnRightShoulderPressedEvent_Event) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_OnRightShoulderPressedEvent_Event");
static_assert(sizeof(BPC_SelectCourse_C_OnRightShoulderPressedEvent_Event) == 0x000008, "Wrong size on BPC_SelectCourse_C_OnRightShoulderPressedEvent_Event");
static_assert(offsetof(BPC_SelectCourse_C_OnRightShoulderPressedEvent_Event, Object) == 0x000000, "Member 'BPC_SelectCourse_C_OnRightShoulderPressedEvent_Event::Object' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnLeftShoulderPressedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C_OnLeftShoulderPressedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnLeftShoulderPressedEvent_Event) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_OnLeftShoulderPressedEvent_Event");
static_assert(sizeof(BPC_SelectCourse_C_OnLeftShoulderPressedEvent_Event) == 0x000008, "Wrong size on BPC_SelectCourse_C_OnLeftShoulderPressedEvent_Event");
static_assert(offsetof(BPC_SelectCourse_C_OnLeftShoulderPressedEvent_Event, Object) == 0x000000, "Member 'BPC_SelectCourse_C_OnLeftShoulderPressedEvent_Event::Object' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnLeftShoulderReleasedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C_OnLeftShoulderReleasedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnLeftShoulderReleasedEvent_Event) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_OnLeftShoulderReleasedEvent_Event");
static_assert(sizeof(BPC_SelectCourse_C_OnLeftShoulderReleasedEvent_Event) == 0x000008, "Wrong size on BPC_SelectCourse_C_OnLeftShoulderReleasedEvent_Event");
static_assert(offsetof(BPC_SelectCourse_C_OnLeftShoulderReleasedEvent_Event, Object) == 0x000000, "Member 'BPC_SelectCourse_C_OnLeftShoulderReleasedEvent_Event::Object' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C. OnSpecialPressedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C__OnSpecialPressedEvent_Event final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C__OnSpecialPressedEvent_Event) == 0x000008, "Wrong alignment on BPC_SelectCourse_C__OnSpecialPressedEvent_Event");
static_assert(sizeof(BPC_SelectCourse_C__OnSpecialPressedEvent_Event) == 0x000008, "Wrong size on BPC_SelectCourse_C__OnSpecialPressedEvent_Event");
static_assert(offsetof(BPC_SelectCourse_C__OnSpecialPressedEvent_Event, Object) == 0x000000, "Member 'BPC_SelectCourse_C__OnSpecialPressedEvent_Event::Object' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C_CustomEvent_0 final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_CustomEvent_0) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_CustomEvent_0");
static_assert(sizeof(BPC_SelectCourse_C_CustomEvent_0) == 0x000008, "Wrong size on BPC_SelectCourse_C_CustomEvent_0");
static_assert(offsetof(BPC_SelectCourse_C_CustomEvent_0, Object) == 0x000000, "Member 'BPC_SelectCourse_C_CustomEvent_0::Object' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnDecideStageId_Event_0
// 0x0001 (0x0001 - 0x0000)
struct BPC_SelectCourse_C_OnDecideStageId_Event_0 final
{
public:
	EStageId                                      SelectedCourseStageId;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnDecideStageId_Event_0) == 0x000001, "Wrong alignment on BPC_SelectCourse_C_OnDecideStageId_Event_0");
static_assert(sizeof(BPC_SelectCourse_C_OnDecideStageId_Event_0) == 0x000001, "Wrong size on BPC_SelectCourse_C_OnDecideStageId_Event_0");
static_assert(offsetof(BPC_SelectCourse_C_OnDecideStageId_Event_0, SelectedCourseStageId) == 0x000000, "Member 'BPC_SelectCourse_C_OnDecideStageId_Event_0::SelectedCourseStageId' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnDecideGrandprixId_Event_0
// 0x0002 (0x0002 - 0x0000)
struct BPC_SelectCourse_C_OnDecideGrandprixId_Event_0 final
{
public:
	EGrandPrixId                                  SelectedGrandprixId_0;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      FirstCourseStageId;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnDecideGrandprixId_Event_0) == 0x000001, "Wrong alignment on BPC_SelectCourse_C_OnDecideGrandprixId_Event_0");
static_assert(sizeof(BPC_SelectCourse_C_OnDecideGrandprixId_Event_0) == 0x000002, "Wrong size on BPC_SelectCourse_C_OnDecideGrandprixId_Event_0");
static_assert(offsetof(BPC_SelectCourse_C_OnDecideGrandprixId_Event_0, SelectedGrandprixId_0) == 0x000000, "Member 'BPC_SelectCourse_C_OnDecideGrandprixId_Event_0::SelectedGrandprixId_0' has a wrong offset!");
static_assert(offsetof(BPC_SelectCourse_C_OnDecideGrandprixId_Event_0, FirstCourseStageId) == 0x000001, "Member 'BPC_SelectCourse_C_OnDecideGrandprixId_Event_0::FirstCourseStageId' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnCourseSelectGrandprixCancel_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C_OnCourseSelectGrandprixCancel_Event_0 final
{
public:
	class UCourseSelectSubCategoryIcon*           SelectedGrandprixButton;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnCourseSelectGrandprixCancel_Event_0) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_OnCourseSelectGrandprixCancel_Event_0");
static_assert(sizeof(BPC_SelectCourse_C_OnCourseSelectGrandprixCancel_Event_0) == 0x000008, "Wrong size on BPC_SelectCourse_C_OnCourseSelectGrandprixCancel_Event_0");
static_assert(offsetof(BPC_SelectCourse_C_OnCourseSelectGrandprixCancel_Event_0, SelectedGrandprixButton) == 0x000000, "Member 'BPC_SelectCourse_C_OnCourseSelectGrandprixCancel_Event_0::SelectedGrandprixButton' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnCourseSelectBackToClassSelect_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C_OnCourseSelectBackToClassSelect_Event final
{
public:
	class UCourseSelectSubCategoryIcon*           SelectedGrandprixButton;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnCourseSelectBackToClassSelect_Event) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_OnCourseSelectBackToClassSelect_Event");
static_assert(sizeof(BPC_SelectCourse_C_OnCourseSelectBackToClassSelect_Event) == 0x000008, "Wrong size on BPC_SelectCourse_C_OnCourseSelectBackToClassSelect_Event");
static_assert(offsetof(BPC_SelectCourse_C_OnCourseSelectBackToClassSelect_Event, SelectedGrandprixButton) == 0x000000, "Member 'BPC_SelectCourse_C_OnCourseSelectBackToClassSelect_Event::SelectedGrandprixButton' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnCourseSelectGadgetCustomSelected
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C_OnCourseSelectGadgetCustomSelected final
{
public:
	class UCourseSelectSubCategoryIcon*           SelectedGrandprixButton;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnCourseSelectGadgetCustomSelected) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_OnCourseSelectGadgetCustomSelected");
static_assert(sizeof(BPC_SelectCourse_C_OnCourseSelectGadgetCustomSelected) == 0x000008, "Wrong size on BPC_SelectCourse_C_OnCourseSelectGadgetCustomSelected");
static_assert(offsetof(BPC_SelectCourse_C_OnCourseSelectGadgetCustomSelected, SelectedGrandprixButton) == 0x000000, "Member 'BPC_SelectCourse_C_OnCourseSelectGadgetCustomSelected::SelectedGrandprixButton' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnFadeFinished
// 0x0001 (0x0001 - 0x0000)
struct BPC_SelectCourse_C_OnFadeFinished final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnFadeFinished) == 0x000001, "Wrong alignment on BPC_SelectCourse_C_OnFadeFinished");
static_assert(sizeof(BPC_SelectCourse_C_OnFadeFinished) == 0x000001, "Wrong size on BPC_SelectCourse_C_OnFadeFinished");
static_assert(offsetof(BPC_SelectCourse_C_OnFadeFinished, FadeDirection) == 0x000000, "Member 'BPC_SelectCourse_C_OnFadeFinished::FadeDirection' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnTimeTrialSelected_Event
// 0x0008 (0x0008 - 0x0000)
struct BPC_SelectCourse_C_OnTimeTrialSelected_Event final
{
public:
	class UCourseSelectSubCategoryIcon*           SelectedGrandprixButton;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnTimeTrialSelected_Event) == 0x000008, "Wrong alignment on BPC_SelectCourse_C_OnTimeTrialSelected_Event");
static_assert(sizeof(BPC_SelectCourse_C_OnTimeTrialSelected_Event) == 0x000008, "Wrong size on BPC_SelectCourse_C_OnTimeTrialSelected_Event");
static_assert(offsetof(BPC_SelectCourse_C_OnTimeTrialSelected_Event, SelectedGrandprixButton) == 0x000000, "Member 'BPC_SelectCourse_C_OnTimeTrialSelected_Event::SelectedGrandprixButton' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnFadeoutFinished_ToTimeTrial
// 0x0001 (0x0001 - 0x0000)
struct BPC_SelectCourse_C_OnFadeoutFinished_ToTimeTrial final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnFadeoutFinished_ToTimeTrial) == 0x000001, "Wrong alignment on BPC_SelectCourse_C_OnFadeoutFinished_ToTimeTrial");
static_assert(sizeof(BPC_SelectCourse_C_OnFadeoutFinished_ToTimeTrial) == 0x000001, "Wrong size on BPC_SelectCourse_C_OnFadeoutFinished_ToTimeTrial");
static_assert(offsetof(BPC_SelectCourse_C_OnFadeoutFinished_ToTimeTrial, FadeDirection) == 0x000000, "Member 'BPC_SelectCourse_C_OnFadeoutFinished_ToTimeTrial::FadeDirection' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.Finished_SequenceStart_FadeOut
// 0x0001 (0x0001 - 0x0000)
struct BPC_SelectCourse_C_Finished_SequenceStart_FadeOut final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_Finished_SequenceStart_FadeOut) == 0x000001, "Wrong alignment on BPC_SelectCourse_C_Finished_SequenceStart_FadeOut");
static_assert(sizeof(BPC_SelectCourse_C_Finished_SequenceStart_FadeOut) == 0x000001, "Wrong size on BPC_SelectCourse_C_Finished_SequenceStart_FadeOut");
static_assert(offsetof(BPC_SelectCourse_C_Finished_SequenceStart_FadeOut, FadeDirection) == 0x000000, "Member 'BPC_SelectCourse_C_Finished_SequenceStart_FadeOut::FadeDirection' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BPC_SelectCourse_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BPC_SelectCourse_C_ReceiveEndPlay");
static_assert(sizeof(BPC_SelectCourse_C_ReceiveEndPlay) == 0x000001, "Wrong size on BPC_SelectCourse_C_ReceiveEndPlay");
static_assert(offsetof(BPC_SelectCourse_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BPC_SelectCourse_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.OnFadeInFinished
// 0x0001 (0x0001 - 0x0000)
struct BPC_SelectCourse_C_OnFadeInFinished final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SelectCourse_C_OnFadeInFinished) == 0x000001, "Wrong alignment on BPC_SelectCourse_C_OnFadeInFinished");
static_assert(sizeof(BPC_SelectCourse_C_OnFadeInFinished) == 0x000001, "Wrong size on BPC_SelectCourse_C_OnFadeInFinished");
static_assert(offsetof(BPC_SelectCourse_C_OnFadeInFinished, FadeDirection) == 0x000000, "Member 'BPC_SelectCourse_C_OnFadeInFinished::FadeDirection' has a wrong offset!");

// Function BPC_SelectCourse.BPC_SelectCourse_C.ExecuteUbergraph_BPC_SelectCourse
// 0x1110 (0x1110 - 0x0000)
struct BPC_SelectCourse_C_ExecuteUbergraph_BPC_SelectCourse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;         // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_4;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_3;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_2;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0030(0x0004)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_Map_Keys_Keys;                            // 0x0038(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CourseSelect_C*                    K2Node_DynamicCast_AsWBP_Course_Select;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_1;                       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_5;                       // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CourseSelect_C*                    K2Node_DynamicCast_AsWBP_Course_Select_1;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_6;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable;                                // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              Temp_byte_Variable_1;                              // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      K2Node_CustomEvent_SelectedCourseStageId;          // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGrandPrixId                                  K2Node_CustomEvent_SelectedGrandprixId;            // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      K2Node_CustomEvent_FirstCourseStageId;             // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
