#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_CharaMachineState

#include "Basic.hpp"

#include "UnionRun_structs.hpp"
#include "UnionLib_structs.hpp"
#include "UnionUI_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.OnMachineSelectToCharaSelectCallback
// 0x0020 (0x0020 - 0x0000)
struct BPC_CharaMachineState_C_OnMachineSelectToCharaSelectCallback final
{
public:
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuSequenceUIInterface> K2Node_DynamicCast_AsMenu_Sequence_UIInterface; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_CharaMachineState_C_OnMachineSelectToCharaSelectCallback) == 0x000008, "Wrong alignment on BPC_CharaMachineState_C_OnMachineSelectToCharaSelectCallback");
static_assert(sizeof(BPC_CharaMachineState_C_OnMachineSelectToCharaSelectCallback) == 0x000020, "Wrong size on BPC_CharaMachineState_C_OnMachineSelectToCharaSelectCallback");
static_assert(offsetof(BPC_CharaMachineState_C_OnMachineSelectToCharaSelectCallback, CallFunc_GetOwnerStateMachine_ReturnValue) == 0x000000, "Member 'BPC_CharaMachineState_C_OnMachineSelectToCharaSelectCallback::CallFunc_GetOwnerStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnMachineSelectToCharaSelectCallback, K2Node_DynamicCast_AsMenu_Sequence_UIInterface) == 0x000008, "Member 'BPC_CharaMachineState_C_OnMachineSelectToCharaSelectCallback::K2Node_DynamicCast_AsMenu_Sequence_UIInterface' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnMachineSelectToCharaSelectCallback, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_CharaMachineState_C_OnMachineSelectToCharaSelectCallback::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.OnCharaSelectToClassSelectCallbackFade
// 0x00D0 (0x00D0 - 0x0000)
struct BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData; // 0x0008(0x0078)()
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOutputExecsPin_SuccessFailed                 CallFunc_SetSelectedMachineType_OutExecsPin;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                CallFunc_GetSelectedMachineType_OutMachineType;    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOutputExecsPin_SuccessFailed                 CallFunc_GetSelectedMachineType_OutExecsPin;       // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetSelectedDriverId_OutId;                // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOutputExecsPin_SuccessFailed                 CallFunc_GetSelectedDriverId_OutExecsPin;          // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOutputExecsPin_SuccessFailed                 CallFunc_SetSelectedMachineID_OutExecsPin;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSelectCharaAndHover_bCanUse;           // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSelectCharaAndHover_bDontUsedHover;    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuRacerBase*                         CallFunc_GetMenuRacer_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerPreview_C*                 K2Node_DynamicCast_AsBP_Menu_Racer_Preview;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade) == 0x000008, "Wrong alignment on BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade");
static_assert(sizeof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade) == 0x0000D0, "Wrong size on BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, FadeDirection) == 0x000000, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::FadeDirection' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData) == 0x000008, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_MakeLiteralInt_ReturnValue) == 0x000080, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000084, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_SetSelectedMachineType_OutExecsPin) == 0x000088, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_SetSelectedMachineType_OutExecsPin' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_GetSelectedMachineType_OutMachineType) == 0x000089, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_GetSelectedMachineType_OutMachineType' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_GetSelectedMachineType_OutExecsPin) == 0x00008A, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_GetSelectedMachineType_OutExecsPin' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, K2Node_SwitchEnum_CmpSuccess) == 0x00008B, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, K2Node_SwitchEnum_CmpSuccess_1) == 0x00008C, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00008D, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_GetSelectedDriverId_OutId) == 0x00008E, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_GetSelectedDriverId_OutId' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_GetSelectedDriverId_OutExecsPin) == 0x00008F, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_GetSelectedDriverId_OutExecsPin' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_SetSelectedMachineID_OutExecsPin) == 0x000090, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_SetSelectedMachineID_OutExecsPin' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, K2Node_SwitchEnum_CmpSuccess_2) == 0x000091, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, K2Node_SwitchEnum_CmpSuccess_3) == 0x000092, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_CanSelectCharaAndHover_bCanUse) == 0x000093, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_CanSelectCharaAndHover_bCanUse' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_CanSelectCharaAndHover_bDontUsedHover) == 0x000094, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_CanSelectCharaAndHover_bDontUsedHover' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000098, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_BooleanAND_ReturnValue) == 0x0000A0, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x0000A8, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_GetMenuRacer_ReturnValue) == 0x0000B8, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_GetMenuRacer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, K2Node_DynamicCast_AsBP_Menu_Racer_Preview) == 0x0000C0, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::K2Node_DynamicCast_AsBP_Menu_Racer_Preview' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade, CallFunc_IsValid_ReturnValue_1) == 0x0000C9, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallbackFade::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.OnCharaSelectToClassSelectCallback
// 0x0038 (0x0038 - 0x0000)
struct BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback final
{
public:
	class AHierarchicalStateMachine*              CallFunc_GetChildStateMachine_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharaMachineSequence_C*             K2Node_DynamicCast_AsBP_Chara_Machine_Sequence;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate;       // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback) == 0x000008, "Wrong alignment on BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback");
static_assert(sizeof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback) == 0x000038, "Wrong size on BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback, CallFunc_GetChildStateMachine_ReturnValue) == 0x000000, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback::CallFunc_GetChildStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback, K2Node_DynamicCast_AsBP_Chara_Machine_Sequence) == 0x000010, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback::K2Node_DynamicCast_AsBP_Chara_Machine_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BPC_CharaMachineState_C_OnCharaSelectToClassSelectCallback::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.HiddenFooterSubButtonState
// 0x0010 (0x0010 - 0x0000)
struct BPC_CharaMachineState_C_HiddenFooterSubButtonState final
{
public:
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_CharaMachineState_C_HiddenFooterSubButtonState) == 0x000008, "Wrong alignment on BPC_CharaMachineState_C_HiddenFooterSubButtonState");
static_assert(sizeof(BPC_CharaMachineState_C_HiddenFooterSubButtonState) == 0x000010, "Wrong size on BPC_CharaMachineState_C_HiddenFooterSubButtonState");
static_assert(offsetof(BPC_CharaMachineState_C_HiddenFooterSubButtonState, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'BPC_CharaMachineState_C_HiddenFooterSubButtonState::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_HiddenFooterSubButtonState, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BPC_CharaMachineState_C_HiddenFooterSubButtonState::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.SetupCharaMachineSequence
// 0x0018 (0x0018 - 0x0000)
struct BPC_CharaMachineState_C_SetupCharaMachineSequence final
{
public:
	class AHierarchicalStateMachine*              CallFunc_GetChildStateMachine_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaMachineSequence_C*             K2Node_DynamicCast_AsBP_Chara_Machine_Sequence;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_CharaMachineState_C_SetupCharaMachineSequence) == 0x000008, "Wrong alignment on BPC_CharaMachineState_C_SetupCharaMachineSequence");
static_assert(sizeof(BPC_CharaMachineState_C_SetupCharaMachineSequence) == 0x000018, "Wrong size on BPC_CharaMachineState_C_SetupCharaMachineSequence");
static_assert(offsetof(BPC_CharaMachineState_C_SetupCharaMachineSequence, CallFunc_GetChildStateMachine_ReturnValue) == 0x000000, "Member 'BPC_CharaMachineState_C_SetupCharaMachineSequence::CallFunc_GetChildStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupCharaMachineSequence, K2Node_DynamicCast_AsBP_Chara_Machine_Sequence) == 0x000008, "Member 'BPC_CharaMachineState_C_SetupCharaMachineSequence::K2Node_DynamicCast_AsBP_Chara_Machine_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupCharaMachineSequence, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BPC_CharaMachineState_C_SetupCharaMachineSequence::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.SetupSubLevel
// 0x00C0 (0x00C0 - 0x0000)
struct BPC_CharaMachineState_C_SetupSubLevel final
{
public:
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetSubLevel_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFirstStateInCharaMachine_ReturnValue;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetSubLevel_ReturnValue_1;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuLightingLevelInterface> K2Node_DynamicCast_AsMenu_Lighting_Level_Interface; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SLCharaMachineSelect_C> K2Node_DynamicCast_AsBPI_SLChara_Machine_Select; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetSubLevel_ReturnValue_2;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue_2;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetSubLevel_ReturnValue_3;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SLCharaMachineSelect_C> K2Node_DynamicCast_AsBPI_SLChara_Machine_Select_1; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue_3;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCameraActor_CameraActor;               // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SLCharaMachineSelect_C> K2Node_DynamicCast_AsBPI_SLChara_Machine_Select_2; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_CharaMachineState_C_SetupSubLevel) == 0x000008, "Wrong alignment on BPC_CharaMachineState_C_SetupSubLevel");
static_assert(sizeof(BPC_CharaMachineState_C_SetupSubLevel) == 0x0000C0, "Wrong size on BPC_CharaMachineState_C_SetupSubLevel");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'BPC_CharaMachineState_C_SetupSubLevel::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, CallFunc_GetSubLevel_ReturnValue) == 0x000008, "Member 'BPC_CharaMachineState_C_SetupSubLevel::CallFunc_GetSubLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, CallFunc_IsFirstStateInCharaMachine_ReturnValue) == 0x000010, "Member 'BPC_CharaMachineState_C_SetupSubLevel::CallFunc_IsFirstStateInCharaMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, CallFunc_GetLevelScriptActor_ReturnValue) == 0x000018, "Member 'BPC_CharaMachineState_C_SetupSubLevel::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, CallFunc_GetSubLevel_ReturnValue_1) == 0x000020, "Member 'BPC_CharaMachineState_C_SetupSubLevel::CallFunc_GetSubLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, K2Node_DynamicCast_AsMenu_Lighting_Level_Interface) == 0x000028, "Member 'BPC_CharaMachineState_C_SetupSubLevel::K2Node_DynamicCast_AsMenu_Lighting_Level_Interface' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BPC_CharaMachineState_C_SetupSubLevel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, CallFunc_GetLevelScriptActor_ReturnValue_1) == 0x000040, "Member 'BPC_CharaMachineState_C_SetupSubLevel::CallFunc_GetLevelScriptActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, K2Node_DynamicCast_AsBPI_SLChara_Machine_Select) == 0x000048, "Member 'BPC_CharaMachineState_C_SetupSubLevel::K2Node_DynamicCast_AsBPI_SLChara_Machine_Select' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BPC_CharaMachineState_C_SetupSubLevel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, CallFunc_GetSubLevel_ReturnValue_2) == 0x000060, "Member 'BPC_CharaMachineState_C_SetupSubLevel::CallFunc_GetSubLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, CallFunc_GetLevelScriptActor_ReturnValue_2) == 0x000068, "Member 'BPC_CharaMachineState_C_SetupSubLevel::CallFunc_GetLevelScriptActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, CallFunc_GetSubLevel_ReturnValue_3) == 0x000070, "Member 'BPC_CharaMachineState_C_SetupSubLevel::CallFunc_GetSubLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, K2Node_DynamicCast_AsBPI_SLChara_Machine_Select_1) == 0x000078, "Member 'BPC_CharaMachineState_C_SetupSubLevel::K2Node_DynamicCast_AsBPI_SLChara_Machine_Select_1' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'BPC_CharaMachineState_C_SetupSubLevel::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, CallFunc_GetLevelScriptActor_ReturnValue_3) == 0x000090, "Member 'BPC_CharaMachineState_C_SetupSubLevel::CallFunc_GetLevelScriptActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, CallFunc_GetCameraActor_CameraActor) == 0x000098, "Member 'BPC_CharaMachineState_C_SetupSubLevel::CallFunc_GetCameraActor_CameraActor' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, K2Node_DynamicCast_AsBPI_SLChara_Machine_Select_2) == 0x0000A0, "Member 'BPC_CharaMachineState_C_SetupSubLevel::K2Node_DynamicCast_AsBPI_SLChara_Machine_Select_2' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'BPC_CharaMachineState_C_SetupSubLevel::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupSubLevel, CallFunc_GetPlayerController_ReturnValue) == 0x0000B8, "Member 'BPC_CharaMachineState_C_SetupSubLevel::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.SetMessageBarVisible
// 0x0001 (0x0001 - 0x0000)
struct BPC_CharaMachineState_C_SetMessageBarVisible final
{
public:
	bool                                          bInIsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_CharaMachineState_C_SetMessageBarVisible) == 0x000001, "Wrong alignment on BPC_CharaMachineState_C_SetMessageBarVisible");
static_assert(sizeof(BPC_CharaMachineState_C_SetMessageBarVisible) == 0x000001, "Wrong size on BPC_CharaMachineState_C_SetMessageBarVisible");
static_assert(offsetof(BPC_CharaMachineState_C_SetMessageBarVisible, bInIsVisible) == 0x000000, "Member 'BPC_CharaMachineState_C_SetMessageBarVisible::bInIsVisible' has a wrong offset!");

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.FinalizeMessageBar
// 0x0001 (0x0001 - 0x0000)
struct BPC_CharaMachineState_C_FinalizeMessageBar final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_CharaMachineState_C_FinalizeMessageBar) == 0x000001, "Wrong alignment on BPC_CharaMachineState_C_FinalizeMessageBar");
static_assert(sizeof(BPC_CharaMachineState_C_FinalizeMessageBar) == 0x000001, "Wrong size on BPC_CharaMachineState_C_FinalizeMessageBar");
static_assert(offsetof(BPC_CharaMachineState_C_FinalizeMessageBar, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BPC_CharaMachineState_C_FinalizeMessageBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.SetupMessageBar
// 0x0028 (0x0028 - 0x0000)
struct BPC_CharaMachineState_C_SetupMessageBar final
{
public:
	class UWBP_CMN_MessageBar_C*                  CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0018(0x0010)()
};
static_assert(alignof(BPC_CharaMachineState_C_SetupMessageBar) == 0x000008, "Wrong alignment on BPC_CharaMachineState_C_SetupMessageBar");
static_assert(sizeof(BPC_CharaMachineState_C_SetupMessageBar) == 0x000028, "Wrong size on BPC_CharaMachineState_C_SetupMessageBar");
static_assert(offsetof(BPC_CharaMachineState_C_SetupMessageBar, CallFunc_Create_ReturnValue) == 0x000000, "Member 'BPC_CharaMachineState_C_SetupMessageBar::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupMessageBar, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'BPC_CharaMachineState_C_SetupMessageBar::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupMessageBar, Temp_int_Variable) == 0x00000C, "Member 'BPC_CharaMachineState_C_SetupMessageBar::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupMessageBar, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'BPC_CharaMachineState_C_SetupMessageBar::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupMessageBar, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BPC_CharaMachineState_C_SetupMessageBar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_SetupMessageBar, CallFunc_MakeLiteralText_ReturnValue) == 0x000018, "Member 'BPC_CharaMachineState_C_SetupMessageBar::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.InitMenuRacer
// 0x0128 (0x0128 - 0x0000)
struct BPC_CharaMachineState_C_InitMenuRacer final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Racer;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedMachineID_OutId;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOutputExecsPin_SuccessFailed                 CallFunc_GetSelectedMachineID_OutExecsPin;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetSelectedDriverId_OutId;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOutputExecsPin_SuccessFailed                 CallFunc_GetSelectedDriverId_OutExecsPin;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuRacerBase*                         CallFunc_GetMenuRacer_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUserMachineCustomizeData              CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData; // 0x0050(0x0078)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_3;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMenuRacerBase*                         CallFunc_CreateMenuRacer_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuRacerPreview_C*                 K2Node_DynamicCast_AsBP_Menu_Racer_Preview;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_4;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AMenuRacerBase*>                 CallFunc_GetMenuRacers_ReturnValue;                // 0x0100(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuRacerBase*                         CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_CharaMachineState_C_InitMenuRacer) == 0x000008, "Wrong alignment on BPC_CharaMachineState_C_InitMenuRacer");
static_assert(sizeof(BPC_CharaMachineState_C_InitMenuRacer) == 0x000128, "Wrong size on BPC_CharaMachineState_C_InitMenuRacer");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, Index_0) == 0x000000, "Member 'BPC_CharaMachineState_C_InitMenuRacer::Index_0' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, Racer) == 0x000008, "Member 'BPC_CharaMachineState_C_InitMenuRacer::Racer' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000010, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BPC_CharaMachineState_C_InitMenuRacer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000020, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, Temp_int_Variable) == 0x000028, "Member 'BPC_CharaMachineState_C_InitMenuRacer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetWorldSubsystem_ReturnValue_2) == 0x000030, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetWorldSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BPC_CharaMachineState_C_InitMenuRacer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetSelectedMachineID_OutId) == 0x00003C, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetSelectedMachineID_OutId' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetSelectedMachineID_OutExecsPin) == 0x000040, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetSelectedMachineID_OutExecsPin' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetSelectedDriverId_OutId) == 0x000041, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetSelectedDriverId_OutId' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetSelectedDriverId_OutExecsPin) == 0x000042, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetSelectedDriverId_OutExecsPin' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, K2Node_SwitchEnum_CmpSuccess) == 0x000043, "Member 'BPC_CharaMachineState_C_InitMenuRacer::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, K2Node_SwitchEnum_CmpSuccess_1) == 0x000044, "Member 'BPC_CharaMachineState_C_InitMenuRacer::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_Conv_IntToByte_ReturnValue) == 0x000045, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetValidValue_ReturnValue) == 0x000046, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetMenuRacer_ReturnValue) == 0x000048, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetMenuRacer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData) == 0x000050, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetWorldSubsystem_ReturnValue_3) == 0x0000D0, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetWorldSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_CreateMenuRacer_ReturnValue) == 0x0000D8, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_CreateMenuRacer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, K2Node_DynamicCast_AsBP_Menu_Racer_Preview) == 0x0000E0, "Member 'BPC_CharaMachineState_C_InitMenuRacer::K2Node_DynamicCast_AsBP_Menu_Racer_Preview' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'BPC_CharaMachineState_C_InitMenuRacer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_IsValid_ReturnValue_1) == 0x0000E9, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x0000EC, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetWorldSubsystem_ReturnValue_4) == 0x0000F0, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetWorldSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F8, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_GetMenuRacers_ReturnValue) == 0x000100, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_GetMenuRacers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000110, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_Array_Get_Item) == 0x000118, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_IsValid_ReturnValue_2) == 0x000124, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_CharaMachineState_C_InitMenuRacer, CallFunc_Less_IntInt_ReturnValue) == 0x000125, "Member 'BPC_CharaMachineState_C_InitMenuRacer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.OnLoaded_CA296C1A47793A25D708E9B025DC0235
// 0x0008 (0x0008 - 0x0000)
struct BPC_CharaMachineState_C_OnLoaded_CA296C1A47793A25D708E9B025DC0235 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BPC_CharaMachineState_C_OnLoaded_CA296C1A47793A25D708E9B025DC0235) == 0x000008, "Wrong alignment on BPC_CharaMachineState_C_OnLoaded_CA296C1A47793A25D708E9B025DC0235");
static_assert(sizeof(BPC_CharaMachineState_C_OnLoaded_CA296C1A47793A25D708E9B025DC0235) == 0x000008, "Wrong size on BPC_CharaMachineState_C_OnLoaded_CA296C1A47793A25D708E9B025DC0235");
static_assert(offsetof(BPC_CharaMachineState_C_OnLoaded_CA296C1A47793A25D708E9B025DC0235, Loaded) == 0x000000, "Member 'BPC_CharaMachineState_C_OnLoaded_CA296C1A47793A25D708E9B025DC0235::Loaded' has a wrong offset!");

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.MatchingTimeOut
// 0x0004 (0x0004 - 0x0000)
struct BPC_CharaMachineState_C_MatchingTimeOut final
{
public:
	float                                         InTimeOutTime;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_CharaMachineState_C_MatchingTimeOut) == 0x000004, "Wrong alignment on BPC_CharaMachineState_C_MatchingTimeOut");
static_assert(sizeof(BPC_CharaMachineState_C_MatchingTimeOut) == 0x000004, "Wrong size on BPC_CharaMachineState_C_MatchingTimeOut");
static_assert(offsetof(BPC_CharaMachineState_C_MatchingTimeOut, InTimeOutTime) == 0x000000, "Member 'BPC_CharaMachineState_C_MatchingTimeOut::InTimeOutTime' has a wrong offset!");

// Function BPC_CharaMachineState.BPC_CharaMachineState_C.ExecuteUbergraph_BPC_CharaMachineState
// 0x0228 (0x0228 - 0x0000)
struct BPC_CharaMachineState_C_ExecuteUbergraph_BPC_CharaMachineState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable;                           // 0x0008(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_1;                         // 0x0030(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_2;                         // 0x0058(0x0028)(HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsChara_Machine_Selects_Base; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_3;                         // 0x00B0(0x0028)(HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable_4;                         // 0x00D8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InTimeOutTime;                        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x012C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHierarchicalStateMachine*              CallFunc_GetChildStateMachine_ReturnValue;         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaMachineSequence_C*             K2Node_DynamicCast_AsBP_Chara_Machine_Sequence;    // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHierarchicalStateMachine*              CallFunc_GetChildStateMachine_ReturnValue_1;       // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaMachineSequence_C*             K2Node_DynamicCast_AsBP_Chara_Machine_Sequence_1;  // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_3;       // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSubLevelName_ReturnValue;              // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSubLevelName_ReturnValue_1;            // 0x0194(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHierarchicalStateMachine*              CallFunc_GetChildStateMachine_ReturnValue_2;       // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHierarchicalStateMachine*              CallFunc_GetChildStateMachine_ReturnValue_3;       // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharaMachineSelectSequence*            K2Node_DynamicCast_AsChara_Machine_Select_Sequence; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
