#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateEntryRival

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_RaceSequenceStateEntryRival.BPC_RaceSequenceStateEntryRival_C.OnUpdateState
// 0x0004 (0x0004 - 0x0000)
struct BPC_RaceSequenceStateEntryRival_C_OnUpdateState final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateEntryRival_C_OnUpdateState) == 0x000004, "Wrong alignment on BPC_RaceSequenceStateEntryRival_C_OnUpdateState");
static_assert(sizeof(BPC_RaceSequenceStateEntryRival_C_OnUpdateState) == 0x000004, "Wrong size on BPC_RaceSequenceStateEntryRival_C_OnUpdateState");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_OnUpdateState, InDeltaTime) == 0x000000, "Member 'BPC_RaceSequenceStateEntryRival_C_OnUpdateState::InDeltaTime' has a wrong offset!");

// Function BPC_RaceSequenceStateEntryRival.BPC_RaceSequenceStateEntryRival_C.OnKeyPressed_Event
// 0x0018 (0x0018 - 0x0000)
struct BPC_RaceSequenceStateEntryRival_C_OnKeyPressed_Event final
{
public:
	struct FKey                                   PressedKey;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateEntryRival_C_OnKeyPressed_Event) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateEntryRival_C_OnKeyPressed_Event");
static_assert(sizeof(BPC_RaceSequenceStateEntryRival_C_OnKeyPressed_Event) == 0x000018, "Wrong size on BPC_RaceSequenceStateEntryRival_C_OnKeyPressed_Event");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_OnKeyPressed_Event, PressedKey) == 0x000000, "Member 'BPC_RaceSequenceStateEntryRival_C_OnKeyPressed_Event::PressedKey' has a wrong offset!");

// Function BPC_RaceSequenceStateEntryRival.BPC_RaceSequenceStateEntryRival_C.ExecuteUbergraph_BPC_RaceSequenceStateEntryRival
// 0x0400 (0x0400 - 0x0000)
struct BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FKey& PressedKey)> K2Node_CreateDelegate_OutputDelegate_1;           // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_EntryRival_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00D0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IUnionVehicleRaceObjectInterface> CallFunc_GetRacerIndex_self_CastInput;  // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRacerIndex_ReturnValue;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AVehicleInRacePawn*                     CallFunc_Array_Get_Item_1;                         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item_2;                         // 0x0160(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_OffsetRacerTransform_OutTransform;        // 0x01C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0220(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              CallFunc_ApplyAuraToRacers_Out_Effects;            // 0x0328(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_GetRacerCount_ReturnValue;                // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0340(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RaceSequence_C*                     K2Node_DynamicCast_AsBP_Race_Sequence;             // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_CustomEvent_PressedKey;                     // 0x0370(0x0018)(HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetRaceRivalRacerIndices_ReturnValue;     // 0x0388(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasRaceRival_ReturnValue;                 // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVehicleInRacePawn*                     CallFunc_Array_Get_Item_3;                         // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x03CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival) == 0x000010, "Wrong alignment on BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival");
static_assert(sizeof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival) == 0x000400, "Wrong size on BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, EntryPoint) == 0x000000, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, Temp_bool_IsClosed_Variable) == 0x000028, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, Temp_bool_Has_Been_Initd_Variable) == 0x000029, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_Event_InDeltaTime) == 0x000034, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B8, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, Temp_int_Loop_Counter_Variable_1) == 0x0000C0, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C4, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_Less_IntInt_ReturnValue) == 0x0000CC, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_GetTransform_ReturnValue) == 0x0000D0, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_GetRacerIndex_self_CastInput) == 0x000130, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_GetRacerIndex_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_GetRacerIndex_ReturnValue) == 0x000140, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_GetRacerIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, Temp_int_Array_Index_Variable_1) == 0x000144, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_Array_Get_Item) == 0x000148, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_Array_Get_Item_1) == 0x000150, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_Array_Get_Item_2) == 0x000160, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_OffsetRacerTransform_OutTransform) == 0x0001C0, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_OffsetRacerTransform_OutTransform' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000220, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000318, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_Array_Length_ReturnValue_1) == 0x00031C, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_Less_IntInt_ReturnValue_1) == 0x000320, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_ApplyAuraToRacers_Out_Effects) == 0x000328, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_ApplyAuraToRacers_Out_Effects' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_GetRacerCount_ReturnValue) == 0x000338, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_GetRacerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00033C, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_CreateDelegate_OutputDelegate_3) == 0x000340, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_GetOwnerStateMachine_ReturnValue) == 0x000350, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_GetOwnerStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_DynamicCast_AsBP_Race_Sequence) == 0x000358, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_DynamicCast_AsBP_Race_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_DynamicCast_bSuccess) == 0x000360, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_GetSequencePlayer_ReturnValue) == 0x000368, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_CustomEvent_PressedKey) == 0x000370, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_CustomEvent_PressedKey' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_GetRaceRivalRacerIndices_ReturnValue) == 0x000388, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_GetRaceRivalRacerIndices_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_HasRaceRival_ReturnValue) == 0x000398, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_HasRaceRival_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_Array_Get_Item_3) == 0x0003A0, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_BooleanAND_ReturnValue) == 0x0003A8, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_GetPlayerController_ReturnValue) == 0x0003B0, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_IsValid_ReturnValue) == 0x0003B8, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_DynamicCast_AsApp_Player_Controller) == 0x0003C0, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_DynamicCast_bSuccess_1) == 0x0003C8, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_CreateDelegate_OutputDelegate_4) == 0x0003CC, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_GetPlayerController_ReturnValue_1) == 0x0003E0, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x0003E8, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, K2Node_DynamicCast_bSuccess_2) == 0x0003F0, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival, CallFunc_IsValid_ReturnValue_1) == 0x0003F1, "Member 'BPC_RaceSequenceStateEntryRival_C_ExecuteUbergraph_BPC_RaceSequenceStateEntryRival::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

