#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateEntryRival

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_RaceSequenceStateEntryRival.BPC_RaceSequenceStateEntryRival_C
// 0x0028 (0x0148 - 0x0120)
class UBPC_RaceSequenceStateEntryRival_C final : public URaceSequenceStateEntryRival
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0120(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AVehicleInRacePawn*                     TargetRacer;                                       // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_EntryRival_C*                       SequencerObject;                                   // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              Out_Effects;                                       // 0x0138(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void OnInitState();
	void OnUpdateState(float InDeltaTime);
	void OnExitState();
	void OnChangeScene_Event();
	void OnFinishedPlay_Event();
	void OnKeyPressed_Event(const struct FKey& PressedKey);
	void OnFullScreenMouseClick();
	void ExecuteUbergraph_BPC_RaceSequenceStateEntryRival(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_RaceSequenceStateEntryRival_C">();
	}
	static class UBPC_RaceSequenceStateEntryRival_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_RaceSequenceStateEntryRival_C>();
	}
};
static_assert(alignof(UBPC_RaceSequenceStateEntryRival_C) == 0x000008, "Wrong alignment on UBPC_RaceSequenceStateEntryRival_C");
static_assert(sizeof(UBPC_RaceSequenceStateEntryRival_C) == 0x000148, "Wrong size on UBPC_RaceSequenceStateEntryRival_C");
static_assert(offsetof(UBPC_RaceSequenceStateEntryRival_C, UberGraphFrame) == 0x000120, "Member 'UBPC_RaceSequenceStateEntryRival_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateEntryRival_C, TargetRacer) == 0x000128, "Member 'UBPC_RaceSequenceStateEntryRival_C::TargetRacer' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateEntryRival_C, SequencerObject) == 0x000130, "Member 'UBPC_RaceSequenceStateEntryRival_C::SequencerObject' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateEntryRival_C, Out_Effects) == 0x000138, "Member 'UBPC_RaceSequenceStateEntryRival_C::Out_Effects' has a wrong offset!");

}

