#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateLoadAssets

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UnionRun_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function BPC_RaceSequenceStateLoadAssets.BPC_RaceSequenceStateLoadAssets_C.DevelopmentTimerLap
// 0x0028 (0x0028 - 0x0000)
struct BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UAppSystemSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULapTimer*                              CallFunc_GetOrCreateLapTimer_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap");
static_assert(sizeof(BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap) == 0x000028, "Wrong size on BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap, Tag) == 0x000000, "Member 'BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap::Tag' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap, CallFunc_IsShippingBuild_ReturnValue) == 0x000018, "Member 'BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap::CallFunc_IsShippingBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap, CallFunc_GetOrCreateLapTimer_ReturnValue) == 0x000020, "Member 'BPC_RaceSequenceStateLoadAssets_C_DevelopmentTimerLap::CallFunc_GetOrCreateLapTimer_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateLoadAssets.BPC_RaceSequenceStateLoadAssets_C.SelectMaterialInstance
// 0x0088 (0x0088 - 0x0000)
struct BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance final
{
public:
	TSoftObjectPtr<class UMaterialInstance>       A;                                                 // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       B;                                                 // 0x0028(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Select;                                            // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInstance>       Ret;                                               // 0x0058(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance");
static_assert(sizeof(BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance) == 0x000088, "Wrong size on BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance, A) == 0x000000, "Member 'BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance::A' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance, B) == 0x000028, "Member 'BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance::B' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance, Select) == 0x000050, "Member 'BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance::Select' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance, Ret) == 0x000058, "Member 'BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance::Ret' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000080, "Member 'BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance, CallFunc_BooleanAND_ReturnValue) == 0x000081, "Member 'BPC_RaceSequenceStateLoadAssets_C_SelectMaterialInstance::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateLoadAssets.BPC_RaceSequenceStateLoadAssets_C.SelectTextureCube
// 0x0088 (0x0088 - 0x0000)
struct BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube final
{
public:
	TSoftObjectPtr<class UTextureCube>            A;                                                 // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TSoftObjectPtr<class UTextureCube>            B;                                                 // 0x0028(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Select;                                            // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTextureCube>            Ret;                                               // 0x0058(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube");
static_assert(sizeof(BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube) == 0x000088, "Wrong size on BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube, A) == 0x000000, "Member 'BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube::A' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube, B) == 0x000028, "Member 'BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube::B' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube, Select) == 0x000050, "Member 'BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube::Select' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube, Ret) == 0x000058, "Member 'BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube::Ret' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000080, "Member 'BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube, CallFunc_BooleanAND_ReturnValue) == 0x000081, "Member 'BPC_RaceSequenceStateLoadAssets_C_SelectTextureCube::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPC_RaceSequenceStateLoadAssets.BPC_RaceSequenceStateLoadAssets_C.RegisterObjectLevel
// 0x0AC8 (0x0AC8 - 0x0000)
struct BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel final
{
public:
	class UPrimaryStageDataAsset*                 StageData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          FreeRunFinalLap;                                   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnotherTimeTrialFinalLap;                          // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UWorld>>          NewLocalVar;                                       // 0x0010(0x0010)(Edit, BlueprintVisible)
	bool                                          bNeedFinalLapLevel;                                // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWorld>                  LocalDependant;                                    // 0x0028(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UWorld>>          LocalBackGroundLevel;                              // 0x0050(0x0010)(Edit, BlueprintVisible)
	bool                                          bNotReadyItemBoxIrregular;                         // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UWorld>>          LocalFinalLapObjectLevel;                          // 0x0068(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class UWorld>>          LocalBasicLapObjectLevel;                          // 0x0078(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWorld>                  Temp_softobject_Variable;                          // 0x0090(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  CallFunc_Array_Get_Item;                           // 0x00B8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  K2Node_Select_Default;                             // 0x00E8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  CallFunc_Array_Get_Item_1;                         // 0x0118(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLevelNameByReference_ReturnValue;      // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWorld>                  CallFunc_Array_Get_Item_2;                         // 0x0170(0x0028)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01C0(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetLevelNameByReference_ReturnValue_1;    // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLevelNameByReference_ReturnValue_2;    // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x2];                                      // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0248(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0258(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetRaceDebugParamFinalLap_ReturnValue;    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceType                                     CallFunc_GetSelectedRaceType_ReturnValue;          // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnotherStage_ReturnValue;               // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStageDynamicData                      CallFunc_GetFinalLapData_ReturnValue;              // 0x02A8(0x0100)(ConstParm)
	bool                                          CallFunc_AddLevelByReference_ReturnValue;          // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_2; // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA[0x6];                                      // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStageDynamicData                      CallFunc_GetDefaultBasicLapData_ReturnValue;       // 0x03B0(0x0100)(ConstParm)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLevelByReference_ReturnValue_1;        // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_3; // 0x04B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceType                                     CallFunc_GetSelectedRaceType_ReturnValue_1;        // 0x04B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x04B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x04B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B7[0x1];                                      // 0x04B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStageDynamicData                      CallFunc_GetFinalLapData_ReturnValue_1;            // 0x04B8(0x0100)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C2[0x2];                                      // 0x05C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStageDynamicData                      CallFunc_GetDefaultBasicLapData_ReturnValue_1;     // 0x05C8(0x0100)(ConstParm)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWorld>                  CallFunc_Array_Get_Item_3;                         // 0x06D0(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLevelByReference_ReturnValue_2;        // 0x06FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x06FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x06FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x06FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceType                                     CallFunc_GetSelectedRaceType_ReturnValue_2;        // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnotherStage_ReturnValue_1;             // 0x0701(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0702(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_703[0x1];                                      // 0x0703(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x070A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceType                                     CallFunc_GetSelectedRaceType_ReturnValue_3;        // 0x070B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x070C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x070D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x070E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x070F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceType                                     CallFunc_GetSelectedRaceType_ReturnValue_4;        // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0711(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0712(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0713(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0714(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0715(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMainStage_ReturnValue;                  // 0x0716(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceType                                     CallFunc_GetSelectedRaceType_ReturnValue_5;        // 0x0717(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRaceDebugParamFinalLap_ReturnValue_1;  // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x071A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x071B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0721(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_722[0x2];                                      // 0x0722(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceType                                     CallFunc_GetSelectedRaceType_ReturnValue_6;        // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x0729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x072A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMainStage_ReturnValue_1;                // 0x072B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x072C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceType                                     CallFunc_GetSelectedRaceType_ReturnValue_7;        // 0x072D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x072E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x072F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMainStage_ReturnValue_2;                // 0x0731(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x0732(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_733[0x5];                                      // 0x0733(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2; // 0x0738(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_749[0x7];                                      // 0x0749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0750(0x0010)()
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0768(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B1[0x7];                                      // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x07B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x07C8(0x0010)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_3; // 0x07D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x07E8(0x0010)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F9[0x7];                                      // 0x07F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0800(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_849[0x7];                                      // 0x0849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0850(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0860(0x0010)()
	TArray<TSoftObjectPtr<class UWorld>>          CallFunc_GetBackgroundLevels_OutBackgroundLevels;  // 0x0870(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0880(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLevelByReference_ReturnValue_3;        // 0x0884(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_885[0x3];                                      // 0x0885(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWorld>                  CallFunc_Array_Get_Item_4;                         // 0x0888(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_AddLevelByReference_ReturnValue_4;        // 0x08B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B1[0x7];                                      // 0x08B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStageDynamicData                      CallFunc_GetFinalLapData_ReturnValue_2;            // 0x08B8(0x0100)(ConstParm)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_4; // 0x09B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_5; // 0x09B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9BA[0x6];                                      // 0x09BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStageDynamicData                      CallFunc_GetDefaultBasicLapData_ReturnValue_2;     // 0x09C0(0x0100)(ConstParm)
	bool                                          CallFunc_AddLevelByReference_ReturnValue_5;        // 0x0AC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLevelByReference_ReturnValue_6;        // 0x0AC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0AC2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLevelByReference_ReturnValue_7;        // 0x0AC3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel) == 0x000008, "Wrong alignment on BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel");
static_assert(sizeof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel) == 0x000AC8, "Wrong size on BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, StageData) == 0x000000, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::StageData' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, FreeRunFinalLap) == 0x000008, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::FreeRunFinalLap' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, AnotherTimeTrialFinalLap) == 0x000009, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::AnotherTimeTrialFinalLap' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, NewLocalVar) == 0x000010, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, bNeedFinalLapLevel) == 0x000020, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::bNeedFinalLapLevel' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, LocalDependant) == 0x000028, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::LocalDependant' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, LocalBackGroundLevel) == 0x000050, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::LocalBackGroundLevel' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, bNotReadyItemBoxIrregular) == 0x000060, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::bNotReadyItemBoxIrregular' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, LocalFinalLapObjectLevel) == 0x000068, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::LocalFinalLapObjectLevel' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, LocalBasicLapObjectLevel) == 0x000078, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::LocalBasicLapObjectLevel' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, Temp_bool_Variable) == 0x000088, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, Temp_softobject_Variable) == 0x000090, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000E0, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, K2Node_Select_Default) == 0x0000E8, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Array_Length_ReturnValue_1) == 0x000110, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, Temp_int_Array_Index_Variable) == 0x000114, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Array_Get_Item_1) == 0x000118, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000140, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetLevelNameByReference_ReturnValue) == 0x000148, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetLevelNameByReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Contains_ReturnValue) == 0x000158, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, Temp_int_Loop_Counter_Variable) == 0x00015C, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Less_IntInt_ReturnValue) == 0x000160, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000164, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, Temp_int_Array_Index_Variable_1) == 0x000168, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Array_Get_Item_2) == 0x000170, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000198, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x0001A8, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Conv_StringToText_ReturnValue) == 0x0001B0, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, K2Node_MakeStruct_FormatArgumentData) == 0x0001C0, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetLevelNameByReference_ReturnValue_1) == 0x000208, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetLevelNameByReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetLevelNameByReference_ReturnValue_2) == 0x000218, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetLevelNameByReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Contains_ReturnValue_1) == 0x000228, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Contains_ReturnValue_2) == 0x000229, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, Temp_int_Loop_Counter_Variable_1) == 0x00022C, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Add_IntInt_ReturnValue_1) == 0x000230, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000238, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000248, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, K2Node_MakeStruct_FormatArgumentData_1) == 0x000258, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetRaceDebugParamFinalLap_ReturnValue) == 0x0002A0, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetRaceDebugParamFinalLap_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002A1, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetSelectedRaceType_ReturnValue) == 0x0002A2, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetSelectedRaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0002A3, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002A4, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_IsAnotherStage_ReturnValue) == 0x0002A5, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_IsAnotherStage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_BooleanAND_ReturnValue) == 0x0002A6, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_BooleanAND_ReturnValue_1) == 0x0002A7, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetFinalLapData_ReturnValue) == 0x0002A8, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetFinalLapData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_AddLevelByReference_ReturnValue) == 0x0003A8, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_AddLevelByReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_IsValidSoftObjectReference_ReturnValue_2) == 0x0003A9, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_IsValidSoftObjectReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetDefaultBasicLapData_ReturnValue) == 0x0003B0, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetDefaultBasicLapData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_BooleanOR_ReturnValue) == 0x0004B0, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_AddLevelByReference_ReturnValue_1) == 0x0004B1, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_AddLevelByReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_IsValidSoftObjectReference_ReturnValue_3) == 0x0004B2, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_IsValidSoftObjectReference_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetSelectedRaceType_ReturnValue_1) == 0x0004B3, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetSelectedRaceType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0004B4, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0004B5, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_BooleanOR_ReturnValue_1) == 0x0004B6, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetFinalLapData_ReturnValue_1) == 0x0004B8, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetFinalLapData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Array_Length_ReturnValue_2) == 0x0005B8, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, Temp_int_Loop_Counter_Variable_2) == 0x0005BC, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Less_IntInt_ReturnValue_1) == 0x0005C0, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Less_IntInt_ReturnValue_2) == 0x0005C1, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Add_IntInt_ReturnValue_2) == 0x0005C4, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetDefaultBasicLapData_ReturnValue_1) == 0x0005C8, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetDefaultBasicLapData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, Temp_int_Array_Index_Variable_2) == 0x0006C8, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Array_Get_Item_3) == 0x0006D0, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Array_Length_ReturnValue_3) == 0x0006F8, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_AddLevelByReference_ReturnValue_2) == 0x0006FC, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_AddLevelByReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0006FD, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0006FE, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_BooleanAND_ReturnValue_2) == 0x0006FF, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetSelectedRaceType_ReturnValue_2) == 0x000700, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetSelectedRaceType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_IsAnotherStage_ReturnValue_1) == 0x000701, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_IsAnotherStage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000702, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_Add_IntInt_ReturnValue_3) == 0x000704, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000708, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_BooleanAND_ReturnValue_3) == 0x000709, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_BooleanAND_ReturnValue_4) == 0x00070A, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetSelectedRaceType_ReturnValue_3) == 0x00070B, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetSelectedRaceType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_BooleanAND_ReturnValue_5) == 0x00070C, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x00070D, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x00070E, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_BooleanOR_ReturnValue_2) == 0x00070F, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_GetSelectedRaceType_ReturnValue_4) == 0x000710, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_GetSelectedRaceType_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel, CallFunc_BooleanAND_ReturnValue_6) == 0x000711, "Member 'BPC_RaceSequenceStateLoadAssets_C_RegisterObjectLevel::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
