#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStatePauseMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_RaceSequenceStatePauseMenu.BPC_RaceSequenceStatePauseMenu_C.CreatePauseMenu
// 0x0010 (0x0010 - 0x0000)
struct BPC_RaceSequenceStatePauseMenu_C_CreatePauseMenu final
{
public:
	bool                                          IsCreate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PauseMenu_C*                       PauseMenu;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStatePauseMenu_C_CreatePauseMenu) == 0x000008, "Wrong alignment on BPC_RaceSequenceStatePauseMenu_C_CreatePauseMenu");
static_assert(sizeof(BPC_RaceSequenceStatePauseMenu_C_CreatePauseMenu) == 0x000010, "Wrong size on BPC_RaceSequenceStatePauseMenu_C_CreatePauseMenu");
static_assert(offsetof(BPC_RaceSequenceStatePauseMenu_C_CreatePauseMenu, IsCreate) == 0x000000, "Member 'BPC_RaceSequenceStatePauseMenu_C_CreatePauseMenu::IsCreate' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStatePauseMenu_C_CreatePauseMenu, PauseMenu) == 0x000008, "Member 'BPC_RaceSequenceStatePauseMenu_C_CreatePauseMenu::PauseMenu' has a wrong offset!");

// Function BPC_RaceSequenceStatePauseMenu.BPC_RaceSequenceStatePauseMenu_C.ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu
// 0x0048 (0x0048 - 0x0000)
struct BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PauseMenu_C*                       CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHierarchicalStateMachine*              CallFunc_GetChildStateMachine_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_RacePauseMenuSequence_C*            K2Node_DynamicCast_AsBP_Race_Pause_Menu_Sequence;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetNextRaceSequenceState_ReturnValue;     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsCreate;                       // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PauseMenu_C*                       K2Node_CustomEvent_PauseMenu;                      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu) == 0x000008, "Wrong alignment on BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu");
static_assert(sizeof(BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu) == 0x000048, "Wrong size on BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu");
static_assert(offsetof(BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu, EntryPoint) == 0x000000, "Member 'BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu, CallFunc_GetChildStateMachine_ReturnValue) == 0x000020, "Member 'BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu::CallFunc_GetChildStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu, K2Node_DynamicCast_AsBP_Race_Pause_Menu_Sequence) == 0x000028, "Member 'BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu::K2Node_DynamicCast_AsBP_Race_Pause_Menu_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu, CallFunc_SetNextRaceSequenceState_ReturnValue) == 0x000031, "Member 'BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu::CallFunc_SetNextRaceSequenceState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu, K2Node_CustomEvent_IsCreate) == 0x000032, "Member 'BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu::K2Node_CustomEvent_IsCreate' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu, K2Node_CustomEvent_PauseMenu) == 0x000038, "Member 'BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu::K2Node_CustomEvent_PauseMenu' has a wrong offset!");
static_assert(offsetof(BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BPC_RaceSequenceStatePauseMenu_C_ExecuteUbergraph_BPC_RaceSequenceStatePauseMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

