#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_MachineCustomizePartsSelectState

#include "Basic.hpp"

#include "ST_GarageData_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionRun_structs.hpp"


namespace SDK::Params
{

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.TipsWindow_CloseTipsWindow
// 0x0020 (0x0020 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow final
{
public:
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMachinePartsSelectWindow*              CallFunc_GetPartsSelectWindow_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetLastFocusedButton_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow) == 0x000008, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow) == 0x000020, "Wrong size on BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow, CallFunc_GetPartsSelectWindow_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow::CallFunc_GetPartsSelectWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow, CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex) == 0x000010, "Member 'BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow::CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow, CallFunc_GetLastFocusedButton_ReturnValue) == 0x000018, "Member 'BPC_MachineCustomizePartsSelectState_C_TipsWindow_CloseTipsWindow::CallFunc_GetLastFocusedButton_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.OpenTipsWindow
// 0x0038 (0x0038 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow final
{
public:
	EHintId                                       InHintId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Popup_Window_Hint_C*               CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow) == 0x000008, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow) == 0x000038, "Wrong size on BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow, InHintId) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow::InHintId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow, CallFunc_MakeLiteralByte_ReturnValue) == 0x000010, "Member 'BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000020, "Member 'BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BPC_MachineCustomizePartsSelectState_C_OpenTipsWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.UpdateCustomizeData
// 0x0260 (0x0260 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData final
{
public:
	struct FUserMachineCustomizeData              InCustomizeData;                                   // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FUserMachineCustomizeData              OutCustomizeData;                                  // 0x0078(0x0078)(Parm, OutParm)
	struct FUserMachineCustomizeData              TempCustomizeData;                                 // 0x00F0(0x0078)(Edit, BlueprintVisible)
	struct FUserStickerData                       Temp_struct_Variable;                              // 0x0168(0x0028)(ConstParm, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUserStickerData                       Temp_struct_Variable_1;                            // 0x01A8(0x0028)(ConstParm, NoDestructor)
	struct FUserMachineCustomizeData              CallFunc_GetSelectedMachineCustomizeData_ReturnValue; // 0x01D0(0x0078)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData) == 0x000008, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData) == 0x000260, "Wrong size on BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, InCustomizeData) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::InCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, OutCustomizeData) == 0x000078, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::OutCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, TempCustomizeData) == 0x0000F0, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::TempCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, Temp_struct_Variable) == 0x000168, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, Temp_int_Variable) == 0x000190, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000194, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, CallFunc_Add_IntInt_ReturnValue) == 0x000198, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, Temp_int_Variable_1) == 0x00019C, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0001A0, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001A4, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, Temp_struct_Variable_1) == 0x0001A8, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, CallFunc_GetSelectedMachineCustomizeData_ReturnValue) == 0x0001D0, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::CallFunc_GetSelectedMachineCustomizeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000248, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00024C, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000250, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000254, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000258, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00025C, "Member 'BPC_MachineCustomizePartsSelectState_C_UpdateCustomizeData::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.OnPartsSelected
// 0x01E8 (0x01E8 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_OnPartsSelected final
{
public:
	EMachinePartsType                             InPartsType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    InPartsId;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetCurrentPartsIds_OutFrontPartsId;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetCurrentPartsIds_OutRearPartsId;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetCurrentPartsIds_OutTirePartsId;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_GetSelectedMachineCustomizeData_ReturnValue; // 0x0008(0x0078)()
	struct FUserMachineCustomizeData              K2Node_SetFieldsInStruct_StructOut;                // 0x0080(0x0078)()
	struct FUserMachineCustomizeData              CallFunc_GetSelectedMachineCustomizeData_ReturnValue_1; // 0x00F8(0x0078)()
	struct FUserMachineCustomizeData              CallFunc_UpdateCustomizeData_OutCustomizeData;     // 0x0170(0x0078)()
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_OnPartsSelected) == 0x000008, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_OnPartsSelected");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_OnPartsSelected) == 0x0001E8, "Wrong size on BPC_MachineCustomizePartsSelectState_C_OnPartsSelected");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsSelected, InPartsType) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsSelected::InPartsType' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsSelected, InPartsId) == 0x000001, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsSelected::InPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsSelected, CallFunc_GetCurrentPartsIds_OutFrontPartsId) == 0x000002, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsSelected::CallFunc_GetCurrentPartsIds_OutFrontPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsSelected, CallFunc_GetCurrentPartsIds_OutRearPartsId) == 0x000003, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsSelected::CallFunc_GetCurrentPartsIds_OutRearPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsSelected, CallFunc_GetCurrentPartsIds_OutTirePartsId) == 0x000004, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsSelected::CallFunc_GetCurrentPartsIds_OutTirePartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsSelected, CallFunc_GetSelectedMachineCustomizeData_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsSelected::CallFunc_GetSelectedMachineCustomizeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsSelected, K2Node_SetFieldsInStruct_StructOut) == 0x000080, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsSelected::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsSelected, CallFunc_GetSelectedMachineCustomizeData_ReturnValue_1) == 0x0000F8, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsSelected::CallFunc_GetSelectedMachineCustomizeData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsSelected, CallFunc_UpdateCustomizeData_OutCustomizeData) == 0x000170, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsSelected::CallFunc_UpdateCustomizeData_OutCustomizeData' has a wrong offset!");

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.OnPartsFocused
// 0x0006 (0x0006 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_OnPartsFocused final
{
public:
	EMachinePartsType                             InPartsType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    InPartsId;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                CarStatusType;                                     // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    PartsID;                                           // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachinePartsType                             PartsType;                                         // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                CallFunc_GetCarStatusType_ReturnValue;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_OnPartsFocused) == 0x000001, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_OnPartsFocused");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_OnPartsFocused) == 0x000006, "Wrong size on BPC_MachineCustomizePartsSelectState_C_OnPartsFocused");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsFocused, InPartsType) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsFocused::InPartsType' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsFocused, InPartsId) == 0x000001, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsFocused::InPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsFocused, CarStatusType) == 0x000002, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsFocused::CarStatusType' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsFocused, PartsID) == 0x000003, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsFocused::PartsID' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsFocused, PartsType) == 0x000004, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsFocused::PartsType' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnPartsFocused, CallFunc_GetCarStatusType_ReturnValue) == 0x000005, "Member 'BPC_MachineCustomizePartsSelectState_C_OnPartsFocused::CallFunc_GetCarStatusType_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.SetCustomizeModelView
// 0x02D8 (0x02D8 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView final
{
public:
	EMachineId                                    CallFunc_GetCurrentPartsIds_OutFrontPartsId;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetCurrentPartsIds_OutRearPartsId;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetCurrentPartsIds_OutTirePartsId;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_GetSelectedMachineCustomizeData_ReturnValue; // 0x0008(0x0078)()
	struct FUserMachineCustomizeData              CallFunc_Get_Customize_Data_OutCustomizeData;      // 0x0080(0x0078)()
	struct FUserMachineCustomizeData              K2Node_SetFieldsInStruct_StructOut;                // 0x00F8(0x0078)()
	struct FUserMachineCustomizeData              CallFunc_UpdateCustomizeData_OutCustomizeData;     // 0x0170(0x0078)()
	struct FUserMachineCustomizeData              CallFunc_Get_Customize_Data_OutCustomizeData_1;    // 0x01E8(0x0078)()
	struct FUserMachineCustomizeData              CallFunc_Get_Customize_Data_OutCustomizeData_2;    // 0x0260(0x0078)()
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView) == 0x000008, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView) == 0x0002D8, "Wrong size on BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView, CallFunc_GetCurrentPartsIds_OutFrontPartsId) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView::CallFunc_GetCurrentPartsIds_OutFrontPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView, CallFunc_GetCurrentPartsIds_OutRearPartsId) == 0x000001, "Member 'BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView::CallFunc_GetCurrentPartsIds_OutRearPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView, CallFunc_GetCurrentPartsIds_OutTirePartsId) == 0x000002, "Member 'BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView::CallFunc_GetCurrentPartsIds_OutTirePartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView, CallFunc_GetSelectedMachineCustomizeData_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView::CallFunc_GetSelectedMachineCustomizeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView, CallFunc_Get_Customize_Data_OutCustomizeData) == 0x000080, "Member 'BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView::CallFunc_Get_Customize_Data_OutCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView, K2Node_SetFieldsInStruct_StructOut) == 0x0000F8, "Member 'BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView, CallFunc_UpdateCustomizeData_OutCustomizeData) == 0x000170, "Member 'BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView::CallFunc_UpdateCustomizeData_OutCustomizeData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView, CallFunc_Get_Customize_Data_OutCustomizeData_1) == 0x0001E8, "Member 'BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView::CallFunc_Get_Customize_Data_OutCustomizeData_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView, CallFunc_Get_Customize_Data_OutCustomizeData_2) == 0x000260, "Member 'BPC_MachineCustomizePartsSelectState_C_SetCustomizeModelView::CallFunc_Get_Customize_Data_OutCustomizeData_2' has a wrong offset!");

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.OnSetup
// 0x0080 (0x0080 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_OnSetup final
{
public:
	bool                                          CallFunc_IsOpenTabControlTipsWindow_bEnableOpenWindow; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_GetSelectedMachineCustomizeData_ReturnValue; // 0x0008(0x0078)()
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_OnSetup) == 0x000008, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_OnSetup");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_OnSetup) == 0x000080, "Wrong size on BPC_MachineCustomizePartsSelectState_C_OnSetup");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnSetup, CallFunc_IsOpenTabControlTipsWindow_bEnableOpenWindow) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_OnSetup::CallFunc_IsOpenTabControlTipsWindow_bEnableOpenWindow' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnSetup, CallFunc_GetSelectedMachineCustomizeData_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizePartsSelectState_C_OnSetup::CallFunc_GetSelectedMachineCustomizeData_ReturnValue' has a wrong offset!");

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.OnSetupPage
// 0x0098 (0x0098 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_OnSetupPage final
{
public:
	class UMachinePartsSelectWindow*              CallFunc_GetPartsSelectWindow_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMachinePartsSelectWindow*              CallFunc_GetPartsSelectWindow_ReturnValue_1;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetFocusedPartsIdAndType_OutMachineId;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachinePartsType                             CallFunc_GetFocusedPartsIdAndType_OutMachinePartsType; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMachinePartsSelectWindow*              CallFunc_GetPartsSelectWindow_ReturnValue_2;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                CallFunc_GetCarStatusType_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MachineCustomizeSequence_C*         K2Node_DynamicCast_AsBP_Machine_Customize_Sequence; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_GarageData                         CallFunc_GetGarageData_OutGarageData;              // 0x0038(0x0058)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_OnSetupPage) == 0x000008, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_OnSetupPage");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_OnSetupPage) == 0x000098, "Wrong size on BPC_MachineCustomizePartsSelectState_C_OnSetupPage");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnSetupPage, CallFunc_GetPartsSelectWindow_ReturnValue) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_OnSetupPage::CallFunc_GetPartsSelectWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnSetupPage, CallFunc_GetPartsSelectWindow_ReturnValue_1) == 0x000008, "Member 'BPC_MachineCustomizePartsSelectState_C_OnSetupPage::CallFunc_GetPartsSelectWindow_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnSetupPage, CallFunc_GetFocusedPartsIdAndType_OutMachineId) == 0x000010, "Member 'BPC_MachineCustomizePartsSelectState_C_OnSetupPage::CallFunc_GetFocusedPartsIdAndType_OutMachineId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnSetupPage, CallFunc_GetFocusedPartsIdAndType_OutMachinePartsType) == 0x000011, "Member 'BPC_MachineCustomizePartsSelectState_C_OnSetupPage::CallFunc_GetFocusedPartsIdAndType_OutMachinePartsType' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnSetupPage, CallFunc_GetPartsSelectWindow_ReturnValue_2) == 0x000018, "Member 'BPC_MachineCustomizePartsSelectState_C_OnSetupPage::CallFunc_GetPartsSelectWindow_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnSetupPage, CallFunc_GetCarStatusType_ReturnValue) == 0x000020, "Member 'BPC_MachineCustomizePartsSelectState_C_OnSetupPage::CallFunc_GetCarStatusType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnSetupPage, K2Node_DynamicCast_AsBP_Machine_Customize_Sequence) == 0x000028, "Member 'BPC_MachineCustomizePartsSelectState_C_OnSetupPage::K2Node_DynamicCast_AsBP_Machine_Customize_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnSetupPage, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPC_MachineCustomizePartsSelectState_C_OnSetupPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnSetupPage, CallFunc_GetGarageData_OutGarageData) == 0x000038, "Member 'BPC_MachineCustomizePartsSelectState_C_OnSetupPage::CallFunc_GetGarageData_OutGarageData' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_OnSetupPage, K2Node_SwitchEnum_CmpSuccess) == 0x000090, "Member 'BPC_MachineCustomizePartsSelectState_C_OnSetupPage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.SetProperties
// 0x0080 (0x0080 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_SetProperties final
{
public:
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMachineCustomizeSequence*              K2Node_DynamicCast_AsMachine_Customize_Sequence;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MachineCustomizeSequence_C*         K2Node_DynamicCast_AsBP_Machine_Customize_Sequence; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_GarageData                         CallFunc_GetGarageData_OutGarageData;              // 0x0028(0x0058)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_SetProperties) == 0x000008, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_SetProperties");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_SetProperties) == 0x000080, "Wrong size on BPC_MachineCustomizePartsSelectState_C_SetProperties");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetProperties, CallFunc_GetOwnerStateMachine_ReturnValue) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_SetProperties::CallFunc_GetOwnerStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetProperties, K2Node_DynamicCast_AsMachine_Customize_Sequence) == 0x000008, "Member 'BPC_MachineCustomizePartsSelectState_C_SetProperties::K2Node_DynamicCast_AsMachine_Customize_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetProperties, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BPC_MachineCustomizePartsSelectState_C_SetProperties::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetProperties, K2Node_DynamicCast_AsBP_Machine_Customize_Sequence) == 0x000018, "Member 'BPC_MachineCustomizePartsSelectState_C_SetProperties::K2Node_DynamicCast_AsBP_Machine_Customize_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetProperties, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'BPC_MachineCustomizePartsSelectState_C_SetProperties::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_SetProperties, CallFunc_GetGarageData_OutGarageData) == 0x000028, "Member 'BPC_MachineCustomizePartsSelectState_C_SetProperties::CallFunc_GetGarageData_OutGarageData' has a wrong offset!");

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.ExecuteUbergraph_BPC_MachineCustomizePartsSelectState
// 0x0040 (0x0040 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EMachineCustomizeTabID InTabID)> K2Node_CreateDelegate_OutputDelegate_1;          // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMachineCustomTab*                      CallFunc_GetTab_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMachineCustomTab*                      CallFunc_GetTab_ReturnValue_1;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState) == 0x000008, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState) == 0x000040, "Wrong size on BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState, EntryPoint) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState, CallFunc_GetTab_ReturnValue) == 0x000030, "Member 'BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState::CallFunc_GetTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState, CallFunc_GetTab_ReturnValue_1) == 0x000038, "Member 'BPC_MachineCustomizePartsSelectState_C_ExecuteUbergraph_BPC_MachineCustomizePartsSelectState::CallFunc_GetTab_ReturnValue_1' has a wrong offset!");

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.GetCamera
// 0x0078 (0x0078 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_GetCamera final
{
public:
	class AGarageCamera*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class AHierarchicalStateMachine*              CallFunc_GetOwnerStateMachine_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MachineCustomizeSequence_C*         K2Node_DynamicCast_AsBP_Machine_Customize_Sequence; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_GarageData                         CallFunc_GetGarageData_OutGarageData;              // 0x0020(0x0058)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_GetCamera) == 0x000008, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_GetCamera");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_GetCamera) == 0x000078, "Wrong size on BPC_MachineCustomizePartsSelectState_C_GetCamera");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_GetCamera, ReturnValue) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_GetCamera::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_GetCamera, CallFunc_GetOwnerStateMachine_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizePartsSelectState_C_GetCamera::CallFunc_GetOwnerStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_GetCamera, K2Node_DynamicCast_AsBP_Machine_Customize_Sequence) == 0x000010, "Member 'BPC_MachineCustomizePartsSelectState_C_GetCamera::K2Node_DynamicCast_AsBP_Machine_Customize_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_GetCamera, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_MachineCustomizePartsSelectState_C_GetCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_GetCamera, CallFunc_GetGarageData_OutGarageData) == 0x000020, "Member 'BPC_MachineCustomizePartsSelectState_C_GetCamera::CallFunc_GetGarageData_OutGarageData' has a wrong offset!");

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.GetCurrentPartsIds
// 0x0018 (0x0018 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds final
{
public:
	EMachineId                                    OutFrontPartsId;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    OutRearPartsId;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    OutTirePartsId;                                    // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMachinePartsSelectWindow*              CallFunc_GetPartsSelectWindow_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetCurrentPartsIds_OutFrontPartsId;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetCurrentPartsIds_OutRearPartsId;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    CallFunc_GetCurrentPartsIds_OutTirePartsId;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds) == 0x000008, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds) == 0x000018, "Wrong size on BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds, OutFrontPartsId) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds::OutFrontPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds, OutRearPartsId) == 0x000001, "Member 'BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds::OutRearPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds, OutTirePartsId) == 0x000002, "Member 'BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds::OutTirePartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds, CallFunc_GetPartsSelectWindow_ReturnValue) == 0x000008, "Member 'BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds::CallFunc_GetPartsSelectWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds, CallFunc_GetCurrentPartsIds_OutFrontPartsId) == 0x000010, "Member 'BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds::CallFunc_GetCurrentPartsIds_OutFrontPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds, CallFunc_GetCurrentPartsIds_OutRearPartsId) == 0x000011, "Member 'BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds::CallFunc_GetCurrentPartsIds_OutRearPartsId' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds, CallFunc_GetCurrentPartsIds_OutTirePartsId) == 0x000012, "Member 'BPC_MachineCustomizePartsSelectState_C_GetCurrentPartsIds::CallFunc_GetCurrentPartsIds_OutTirePartsId' has a wrong offset!");

// Function BPC_MachineCustomizePartsSelectState.BPC_MachineCustomizePartsSelectState_C.IsOpenTabControlTipsWindow
// 0x0010 (0x0010 - 0x0000)
struct BPC_MachineCustomizePartsSelectState_C_IsOpenTabControlTipsWindow final
{
public:
	bool                                          bEnableOpenWindow;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadHint_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_MachineCustomizePartsSelectState_C_IsOpenTabControlTipsWindow) == 0x000004, "Wrong alignment on BPC_MachineCustomizePartsSelectState_C_IsOpenTabControlTipsWindow");
static_assert(sizeof(BPC_MachineCustomizePartsSelectState_C_IsOpenTabControlTipsWindow) == 0x000010, "Wrong size on BPC_MachineCustomizePartsSelectState_C_IsOpenTabControlTipsWindow");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_IsOpenTabControlTipsWindow, bEnableOpenWindow) == 0x000000, "Member 'BPC_MachineCustomizePartsSelectState_C_IsOpenTabControlTipsWindow::bEnableOpenWindow' has a wrong offset!");
static_assert(offsetof(BPC_MachineCustomizePartsSelectState_C_IsOpenTabControlTipsWindow, CallFunc_GetIsOnlineGameMode_ReturnValue) == 0x000001, "Member 'BPC_MachineCustomizePartsSelectState_C_IsOpenTabControlTipsWindow::CallFunc_GetIsOnlineGameMode_ReturnValue' has a wrong offset!");
