#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_GadgetCustomize

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function BPFL_GadgetCustomize.BPFL_GadgetCustomize_C.GetGadgetDataTableDisabledGadgetIds
// 0x0200 (0x0200 - 0x0000)
struct BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EGadgetId>                             OutDisabledGadgetIds;                              // 0x0008(0x0010)(Parm, OutParm)
	struct FGadgetData                            TempGadgetData;                                    // 0x0018(0x00C0)(Edit, BlueprintVisible)
	TArray<EGadgetId>                             OutGadgetIds;                                      // 0x00D8(0x0010)(Edit, BlueprintVisible)
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x00F8(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGadgetData                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0118(0x00C0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGadgetId>                             K2Node_MakeArray_Array;                            // 0x01E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds) == 0x000008, "Wrong alignment on BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds");
static_assert(sizeof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds) == 0x000200, "Wrong size on BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, __WorldContext) == 0x000000, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, OutDisabledGadgetIds) == 0x000008, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::OutDisabledGadgetIds' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, TempGadgetData) == 0x000018, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::TempGadgetData' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, OutGadgetIds) == 0x0000D8, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::OutGadgetIds' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000E8, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, Temp_int_Array_Index_Variable) == 0x0000F0, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, CallFunc_IsValid_ReturnValue) == 0x0000F4, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, CallFunc_IsValid_ReturnValue_1) == 0x0000F5, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0000F8, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, Temp_int_Loop_Counter_Variable) == 0x000108, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, CallFunc_Array_Get_Item) == 0x00010C, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, CallFunc_GetDataTableRowFromName_OutRow) == 0x000118, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001D8, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, CallFunc_Add_IntInt_ReturnValue) == 0x0001DC, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, CallFunc_Array_Length_ReturnValue) == 0x0001E0, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, CallFunc_Less_IntInt_ReturnValue) == 0x0001E4, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, K2Node_MakeArray_Array) == 0x0001E8, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, CallFunc_Not_PreBool_ReturnValue) == 0x0001F8, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds, CallFunc_Array_Add_ReturnValue) == 0x0001FC, "Member 'BPFL_GadgetCustomize_C_GetGadgetDataTableDisabledGadgetIds::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BPFL_GadgetCustomize.BPFL_GadgetCustomize_C.GetGadgetDetailData
// 0x01A8 (0x01A8 - 0x0000)
struct BPFL_GadgetCustomize_C_GetGadgetDetailData final
{
public:
	int32                                         InSlotState;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSlotIndex;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              OutThumbnailTexture;                               // 0x0010(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	class FText                                   OutExplanation;                                    // 0x0038(0x0010)(Parm, OutParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0048(0x0010)()
	int32                                         CallFunc_GetGadgetSlotStateLocked_ReturnValue;     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingRaceNumToGadgetPlate_ReturnValue; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)()
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGadgetData                            CallFunc_GetGadgetData_OutGadgetData;              // 0x00E0(0x00C0)()
	bool                                          CallFunc_GetGadgetData_ReturnValue;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_GadgetCustomize_C_GetGadgetDetailData) == 0x000008, "Wrong alignment on BPFL_GadgetCustomize_C_GetGadgetDetailData");
static_assert(sizeof(BPFL_GadgetCustomize_C_GetGadgetDetailData) == 0x0001A8, "Wrong size on BPFL_GadgetCustomize_C_GetGadgetDetailData");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, InSlotState) == 0x000000, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::InSlotState' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, InSlotIndex) == 0x000004, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::InSlotIndex' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, __WorldContext) == 0x000008, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, OutThumbnailTexture) == 0x000010, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::OutThumbnailTexture' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, OutExplanation) == 0x000038, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::OutExplanation' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, CallFunc_MakeLiteralText_ReturnValue) == 0x000048, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, CallFunc_GetGadgetSlotStateLocked_ReturnValue) == 0x000058, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::CallFunc_GetGadgetSlotStateLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, CallFunc_GetRemainingRaceNumToGadgetPlate_ReturnValue) == 0x00005C, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::CallFunc_GetRemainingRaceNumToGadgetPlate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000060, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000068, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, K2Node_MakeArray_Array) == 0x0000B8, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000D8, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, CallFunc_GetValidValue_ReturnValue) == 0x0000D9, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000DA, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, CallFunc_GetGadgetData_OutGadgetData) == 0x0000E0, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::CallFunc_GetGadgetData_OutGadgetData' has a wrong offset!");
static_assert(offsetof(BPFL_GadgetCustomize_C_GetGadgetDetailData, CallFunc_GetGadgetData_ReturnValue) == 0x0001A0, "Member 'BPFL_GadgetCustomize_C_GetGadgetDetailData::CallFunc_GetGadgetData_ReturnValue' has a wrong offset!");

}

