#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_DodonpaEventUtilityLibrary

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPFL_DodonpaEventUtilityLibrary.BPFL_DodonpaEventUtilityLibrary_C.Call Dodonpa Event
// 0x0158 (0x0158 - 0x0000)
struct BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0010(0x0010)()
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	TScriptInterface<class IDialogueEventInterface> K2Node_DynamicCast_AsDialogue_Event_Interface;   // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0010)()
	bool                                          CallFunc_CallDialogueEvent_Success;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelLoaded_ReturnValue;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x00D0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0138(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event) == 0x000008, "Wrong alignment on BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event");
static_assert(sizeof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event) == 0x000158, "Wrong size on BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, EventName) == 0x000000, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::EventName' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, __WorldContext) == 0x000008, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, CallFunc_Conv_NameToText_ReturnValue) == 0x000010, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, CallFunc_GetStreamingLevel_ReturnValue) == 0x000020, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, CallFunc_GetLevelScriptActor_ReturnValue) == 0x000070, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, K2Node_MakeArray_Array) == 0x000078, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, K2Node_DynamicCast_AsDialogue_Event_Interface) == 0x000088, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::K2Node_DynamicCast_AsDialogue_Event_Interface' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, CallFunc_CallDialogueEvent_Success) == 0x0000B0, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::CallFunc_CallDialogueEvent_Success' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B8, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, CallFunc_IsLevelLoaded_ReturnValue) == 0x0000C8, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::CallFunc_IsLevelLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, CallFunc_Conv_NameToText_ReturnValue_1) == 0x0000D0, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, K2Node_MakeArray_Array_1) == 0x000128, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, CallFunc_Format_ReturnValue_1) == 0x000138, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000148, "Member 'BPFL_DodonpaEventUtilityLibrary_C_Call_Dodonpa_Event::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");

// Function BPFL_DodonpaEventUtilityLibrary.BPFL_DodonpaEventUtilityLibrary_C.DodonpaEventDestroy
// 0x0038 (0x0038 - 0x0000)
struct BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IDialogueEventInterface> K2Node_DynamicCast_AsDialogue_Event_Interface;   // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy) == 0x000008, "Wrong alignment on BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy");
static_assert(sizeof(BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy) == 0x000038, "Wrong size on BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy, __WorldContext) == 0x000000, "Member 'BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy, CallFunc_GetStreamingLevel_ReturnValue) == 0x000008, "Member 'BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy, CallFunc_GetLevelScriptActor_ReturnValue) == 0x000018, "Member 'BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy, K2Node_DynamicCast_AsDialogue_Event_Interface) == 0x000020, "Member 'BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy::K2Node_DynamicCast_AsDialogue_Event_Interface' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPFL_DodonpaEventUtilityLibrary_C_DodonpaEventDestroy::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPFL_DodonpaEventUtilityLibrary.BPFL_DodonpaEventUtilityLibrary_C.GetDodonpaEventCamera
// 0x0058 (0x0058 - 0x0000)
struct BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           Camera;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetMapLevelStreaming_MapLevelStreaming;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TopMenuScene_C>   K2Node_DynamicCast_AsBPI_Top_Menu_Scene;           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CallFunc_GetDodonpaEventSceneCamera_NewParam;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera) == 0x000008, "Wrong alignment on BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera");
static_assert(sizeof(BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera) == 0x000058, "Wrong size on BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera, __WorldContext) == 0x000000, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera, Camera) == 0x000008, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera::Camera' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera, CallFunc_MakeLiteralString_ReturnValue) == 0x000010, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera, CallFunc_GetMapLevelStreaming_MapLevelStreaming) == 0x000020, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera::CallFunc_GetMapLevelStreaming_MapLevelStreaming' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera, CallFunc_GetLevelScriptActor_ReturnValue) == 0x000028, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera, K2Node_DynamicCast_AsBPI_Top_Menu_Scene) == 0x000030, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera::K2Node_DynamicCast_AsBPI_Top_Menu_Scene' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera, CallFunc_GetDodonpaEventSceneCamera_NewParam) == 0x000048, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera::CallFunc_GetDodonpaEventSceneCamera_NewParam' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetDodonpaEventCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPFL_DodonpaEventUtilityLibrary.BPFL_DodonpaEventUtilityLibrary_C.GetMapLevelStreaming
// 0x0050 (0x0050 - 0x0000)
struct BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        MapLevelStreaming;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentTopMenuLevelName_ReturnValue;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelLoaded_ReturnValue;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming) == 0x000008, "Wrong alignment on BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming");
static_assert(sizeof(BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming) == 0x000050, "Wrong size on BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming, __WorldContext) == 0x000000, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming, MapLevelStreaming) == 0x000008, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming::MapLevelStreaming' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming, CallFunc_MakeLiteralString_ReturnValue) == 0x000010, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000020, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming, CallFunc_GetCurrentTopMenuLevelName_ReturnValue) == 0x000028, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming::CallFunc_GetCurrentTopMenuLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming, CallFunc_GetStreamingLevel_ReturnValue) == 0x000030, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming, CallFunc_MakeLiteralString_ReturnValue_1) == 0x000038, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming, CallFunc_IsLevelLoaded_ReturnValue) == 0x000049, "Member 'BPFL_DodonpaEventUtilityLibrary_C_GetMapLevelStreaming::CallFunc_IsLevelLoaded_ReturnValue' has a wrong offset!");

// Function BPFL_DodonpaEventUtilityLibrary.BPFL_DodonpaEventUtilityLibrary_C.IsDestroyedDodonpaEvent
// 0x0040 (0x0040 - 0x0000)
struct BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDestroyed;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IDialogueEventInterface> K2Node_DynamicCast_AsDialogue_Event_Interface;   // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDestroyed_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent) == 0x000008, "Wrong alignment on BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent");
static_assert(sizeof(BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent) == 0x000040, "Wrong size on BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent, __WorldContext) == 0x000000, "Member 'BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent, IsDestroyed) == 0x000008, "Member 'BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent::IsDestroyed' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent, CallFunc_GetStreamingLevel_ReturnValue) == 0x000010, "Member 'BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent, CallFunc_GetLevelScriptActor_ReturnValue) == 0x000020, "Member 'BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent, K2Node_DynamicCast_AsDialogue_Event_Interface) == 0x000028, "Member 'BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent::K2Node_DynamicCast_AsDialogue_Event_Interface' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent, CallFunc_IsDestroyed_ReturnValue) == 0x000039, "Member 'BPFL_DodonpaEventUtilityLibrary_C_IsDestroyedDodonpaEvent::CallFunc_IsDestroyed_ReturnValue' has a wrong offset!");

// Function BPFL_DodonpaEventUtilityLibrary.BPFL_DodonpaEventUtilityLibrary_C.IsEventComplete
// 0x0068 (0x0068 - 0x0000)
struct BPFL_DodonpaEventUtilityLibrary_C_IsEventComplete final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsComplete;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IDialogueEventInterface> K2Node_DynamicCast_AsDialogue_Event_Interface;   // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsComplete_Complete;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IDialogueEventInterface> K2Node_DynamicCast_AsDialogue_Event_Interface_1; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFirstStarted_Started;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_DodonpaEventUtilityLibrary_C_IsEventComplete) == 0x000008, "Wrong alignment on BPFL_DodonpaEventUtilityLibrary_C_IsEventComplete");
static_assert(sizeof(BPFL_DodonpaEventUtilityLibrary_C_IsEventComplete) == 0x000068, "Wrong size on BPFL_DodonpaEventUtilityLibrary_C_IsEventComplete");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_IsEventComplete, __WorldContext) == 0x000000, "Member 'BPFL_DodonpaEventUtilityLibrary_C_IsEventComplete::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_DodonpaEventUtilityLibrary_C_IsEventComplete, IsComplete) == 0x000008, "Member 'BPFL_DodonpaEventUtilityLibrary_C_IsEventComplete::IsComplete' has a wrong offset!");
