#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_Widget

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPFL_Widget.BPFL_Widget_C.ChangeInputRegistrationOnVisibilityChanged
// 0x0028 (0x0028 - 0x0000)
struct BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged final
{
public:
	class UWidget*                                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Visibility;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged) == 0x000008, "Wrong alignment on BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged");
static_assert(sizeof(BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged) == 0x000028, "Wrong size on BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged");
static_assert(offsetof(BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged, Target) == 0x000000, "Member 'BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged::Target' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged, Visibility) == 0x000008, "Member 'BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged::Visibility' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged, __WorldContext) == 0x000010, "Member 'BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged, CallFunc_GetAppPlayerController_ReturnValue) == 0x000018, "Member 'BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged, CallFunc_UnregisterSingleSubMenu_ReturnValue) == 0x000021, "Member 'BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged::CallFunc_UnregisterSingleSubMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged, CallFunc_IsValid_ReturnValue) == 0x000022, "Member 'BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged, CallFunc_IsValid_ReturnValue_1) == 0x000023, "Member 'BPFL_Widget_C_ChangeInputRegistrationOnVisibilityChanged::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BPFL_Widget.BPFL_Widget_C.ReplacementPlatformIconTexture 
// 0x0048 (0x0048 - 0x0000)
struct BPFL_Widget_C_ReplacementPlatformIconTexture_ final
{
public:
	class UImage*                                 InImage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionPlatform                                Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionPlatform                                Temp_byte_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionPlatform                                Temp_byte_Variable_2;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionPlatform                                Temp_byte_Variable_3;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionPlatform                                Temp_byte_Variable_4;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionPlatform                                Temp_byte_Variable_5;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionPlatform                                Temp_byte_Variable_6;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionPlatform                                Temp_byte_Variable_7;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         Temp_byte_Variable_8;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         CallFunc_GetPlatform_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionPlatform                                K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetPlatformIcon_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_As_____;                        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Widget_C_ReplacementPlatformIconTexture_) == 0x000008, "Wrong alignment on BPFL_Widget_C_ReplacementPlatformIconTexture_");
static_assert(sizeof(BPFL_Widget_C_ReplacementPlatformIconTexture_) == 0x000048, "Wrong size on BPFL_Widget_C_ReplacementPlatformIconTexture_");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, InImage) == 0x000000, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::InImage' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, __WorldContext) == 0x000008, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, Temp_byte_Variable) == 0x000010, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, Temp_byte_Variable_1) == 0x000020, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, Temp_byte_Variable_2) == 0x000021, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, Temp_byte_Variable_3) == 0x000022, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, Temp_byte_Variable_4) == 0x000023, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, Temp_byte_Variable_5) == 0x000024, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, Temp_byte_Variable_6) == 0x000025, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, Temp_byte_Variable_7) == 0x000026, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, Temp_byte_Variable_8) == 0x000027, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, CallFunc_GetPlatform_ReturnValue) == 0x000028, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::CallFunc_GetPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, K2Node_Select_Default) == 0x000029, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, CallFunc_GetPlatformIcon_ReturnValue) == 0x000030, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::CallFunc_GetPlatformIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, K2Node_DynamicCast_As_____) == 0x000038, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::K2Node_DynamicCast_As_____' has a wrong offset!");
static_assert(offsetof(BPFL_Widget_C_ReplacementPlatformIconTexture_, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BPFL_Widget_C_ReplacementPlatformIconTexture_::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

