#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_CommonSceneAnimationUtility

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "ST_CharacterAnimationSettings_structs.hpp"


namespace SDK::Params
{

// Function BPFL_CommonSceneAnimationUtility.BPFL_CommonSceneAnimationUtility_C.GetSceneDriverAnimationAsset
// 0x00D0 (0x00D0 - 0x0000)
struct BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset final
{
public:
	EDriverId                                     In_DriverId;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverPose                                   In_Pose;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             DataTable;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequenceBase>       Anim;                                              // 0x0018(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	double                                        Time;                                              // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSkipFacialBlend;                                  // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_CharacterAnimationSettings         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x0070)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset) == 0x000008, "Wrong alignment on BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset");
static_assert(sizeof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset) == 0x0000D0, "Wrong size on BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset, In_DriverId) == 0x000000, "Member 'BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset::In_DriverId' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset, In_Pose) == 0x000001, "Member 'BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset::In_Pose' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset, DataTable) == 0x000008, "Member 'BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset::DataTable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset, __WorldContext) == 0x000010, "Member 'BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset, Anim) == 0x000018, "Member 'BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset::Anim' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset, Time) == 0x000040, "Member 'BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset::Time' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset, bSkipFacialBlend) == 0x000048, "Member 'BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset::bSkipFacialBlend' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset, CallFunc_GetEnumeratorName_ReturnValue) == 0x00004C, "Member 'BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset, K2Node_SwitchEnum_CmpSuccess) == 0x000054, "Member 'BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000C8, "Member 'BPFL_CommonSceneAnimationUtility_C_GetSceneDriverAnimationAsset::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BPFL_CommonSceneAnimationUtility.BPFL_CommonSceneAnimationUtility_C.LoadSceneDriverAnimationAssets
// 0x00A8 (0x00A8 - 0x0000)
struct BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets final
{
public:
	TArray<class ASceneDriver*>                   In_SceneDrivers;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDataTable*                             DataTable;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        LoadAssets;                                        // 0x0020(0x0010)(Parm, OutParm)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneDriver*                           CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDriverPose                                   CallFunc_GetDriverPose_ReturnValue;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequenceBase>       CallFunc_GetSceneDriverAnimationAsset_Anim;        // 0x0058(0x0028)(HasGetValueTypeHash)
	double                                        CallFunc_GetSceneDriverAnimationAsset_Time;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSceneDriverAnimationAsset_bSkipFacialBlend; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets) == 0x000008, "Wrong alignment on BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets");
static_assert(sizeof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets) == 0x0000A8, "Wrong size on BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, In_SceneDrivers) == 0x000000, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::In_SceneDrivers' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, DataTable) == 0x000010, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::DataTable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, __WorldContext) == 0x000018, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, LoadAssets) == 0x000020, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::LoadAssets' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, ReturnValue) == 0x000030, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, CallFunc_Array_Get_Item) == 0x000048, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, CallFunc_GetDriverPose_ReturnValue) == 0x000050, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::CallFunc_GetDriverPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, CallFunc_GetSceneDriverAnimationAsset_Anim) == 0x000058, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::CallFunc_GetSceneDriverAnimationAsset_Anim' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, CallFunc_GetSceneDriverAnimationAsset_Time) == 0x000080, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::CallFunc_GetSceneDriverAnimationAsset_Time' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, CallFunc_GetSceneDriverAnimationAsset_bSkipFacialBlend) == 0x000088, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::CallFunc_GetSceneDriverAnimationAsset_bSkipFacialBlend' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000090, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000098, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, CallFunc_Less_IntInt_ReturnValue) == 0x000099, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, CallFunc_Add_IntInt_ReturnValue) == 0x00009C, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets, CallFunc_Array_Add_ReturnValue) == 0x0000A0, "Member 'BPFL_CommonSceneAnimationUtility_C_LoadSceneDriverAnimationAssets::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

