#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_ResultReward

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function BPFL_ResultReward.BPFL_ResultReward_C.MakeResultRewardItemInfos
// 0x0730 (0x0730 - 0x0000)
struct BPFL_ResultReward_C_MakeResultRewardItemInfos final
{
public:
	TArray<struct FRewardRedStarRingData>         RSRList;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FResultRewardItemInfo>          Output;                                            // 0x0018(0x0010)(Parm, OutParm)
	TArray<struct FResultRewardItemInfo>          ItemInfos;                                         // 0x0028(0x0010)(Edit, BlueprintVisible)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionStatsManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMultiPlayBonus_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWirelessLobbyContext*                  K2Node_DynamicCast_AsWireless_Lobby_Context;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRaceHostLocalUser_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFriendMatchLobbyContext*               K2Node_DynamicCast_AsFriend_Match_Lobby_Context;   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRaceHostLocalUser_ReturnValue_1;        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionStatsManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRaceRedStarRingDisplay_ReturnValue;     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRewardRedStarRingData                 CallFunc_Array_Get_Item;                           // 0x0088(0x0020)()
	struct FRewardRedStarRingData                 CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0020)()
	struct FResultRewardItemInfo                  K2Node_MakeStruct_ResultRewardItemInfo;            // 0x00C8(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinalRace_ReturnValue;                  // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetMenuDataLastChoiceRivalLevel_ReturnValue; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetSelectedMenuSpeedClassId_ReturnValue;  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWinRivalTotalRank_ReturnValue;         // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRewardRedStarRingHonorTableRow        CallFunc_FindNumRewardRivalWinDonpaTicket_OutData; // 0x0100(0x0020)()
	bool                                          CallFunc_FindNumRewardRivalWinDonpaTicket_ReturnValue; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResultRewardItemInfo                  K2Node_MakeStruct_ResultRewardItemInfo_1;          // 0x0128(0x0020)()
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyRaceRivalExists_ReturnValue;       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERivalTeamId                                  CallFunc_GetResultRivalTeamId_ReturnValue;         // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAdjustedRivalTeamLevelByID_ReturnValue; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRivalRaceFriendMatch_ReturnValue;       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRewardRedStarRingHonorTableRow        CallFunc_GetRivalTeamWinRacerAwardData_OutRewardHonor; // 0x0168(0x0020)()
	struct FResultRewardItemInfo                  K2Node_MakeStruct_ResultRewardItemInfo_2;          // 0x0188(0x0020)()
	struct FRewardRedStarRingHonorTableRow        CallFunc_GetDataTableRowFromName_OutRow;           // 0x01A8(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResultPlayerRank_ReturnValue;          // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResultRewardItemInfo                  K2Node_MakeStruct_ResultRewardItemInfo_3;          // 0x01D8(0x0020)()
	struct FResultRewardItemInfo                  K2Node_MakeStruct_ResultRewardItemInfo_4;          // 0x01F8(0x0020)()
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAppRaceConfigData                     CallFunc_GetAppRaceConfigData_OutData;             // 0x0220(0x0490)()
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_2;      // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B2[0x2];                                      // 0x06B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRSRDonpaTicket_ReturnValue;            // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRewardRedStarRingHonorTableRow        CallFunc_GetMultiPlayBonusRacerAwardData_OutRewardHonor; // 0x06B8(0x0020)()
	struct FResultRewardItemInfo                  K2Node_MakeStruct_ResultRewardItemInfo_5;          // 0x06D8(0x0020)()
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResultRewardItemInfo                  K2Node_MakeStruct_ResultRewardItemInfo_6;          // 0x0700(0x0020)()
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_ResultReward_C_MakeResultRewardItemInfos) == 0x000010, "Wrong alignment on BPFL_ResultReward_C_MakeResultRewardItemInfos");
static_assert(sizeof(BPFL_ResultReward_C_MakeResultRewardItemInfos) == 0x000730, "Wrong size on BPFL_ResultReward_C_MakeResultRewardItemInfos");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, RSRList) == 0x000000, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::RSRList' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, __WorldContext) == 0x000010, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, Output) == 0x000018, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::Output' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, ItemInfos) == 0x000028, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::ItemInfos' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000038, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000040, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetPublicLobbyContext_ReturnValue) == 0x000048, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetPublicLobbyContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetMultiPlayBonus_ReturnValue) == 0x000050, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetMultiPlayBonus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, K2Node_DynamicCast_AsWireless_Lobby_Context) == 0x000058, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::K2Node_DynamicCast_AsWireless_Lobby_Context' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_IsRaceHostLocalUser_ReturnValue) == 0x000061, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_IsRaceHostLocalUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, K2Node_DynamicCast_AsFriend_Match_Lobby_Context) == 0x000068, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::K2Node_DynamicCast_AsFriend_Match_Lobby_Context' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_IsRaceHostLocalUser_ReturnValue_1) == 0x000071, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_IsRaceHostLocalUser_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000078, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_IsRaceRedStarRingDisplay_ReturnValue) == 0x000080, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_IsRaceRedStarRingDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_Array_Get_Item) == 0x000088, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, K2Node_MakeStruct_ResultRewardItemInfo) == 0x0000C8, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::K2Node_MakeStruct_ResultRewardItemInfo' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x0000EC, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_Greater_IntInt_ReturnValue) == 0x0000ED, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, K2Node_SwitchEnum_CmpSuccess) == 0x0000EE, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_IsFinalRace_ReturnValue) == 0x0000EF, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_IsFinalRace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetMenuDataLastChoiceRivalLevel_ReturnValue) == 0x0000F0, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetMenuDataLastChoiceRivalLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000F4, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetSelectedMenuSpeedClassId_ReturnValue) == 0x0000F8, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetSelectedMenuSpeedClassId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetWinRivalTotalRank_ReturnValue) == 0x0000F9, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetWinRivalTotalRank_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_FindNumRewardRivalWinDonpaTicket_OutData) == 0x000100, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_FindNumRewardRivalWinDonpaTicket_OutData' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_FindNumRewardRivalWinDonpaTicket_ReturnValue) == 0x000120, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_FindNumRewardRivalWinDonpaTicket_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, K2Node_MakeStruct_ResultRewardItemInfo_1) == 0x000128, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::K2Node_MakeStruct_ResultRewardItemInfo_1' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetSelectedGameModeId_ReturnValue_1) == 0x000148, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetSelectedGameModeId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_Array_Add_ReturnValue) == 0x00014C, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000150, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_Array_Add_ReturnValue_1) == 0x000154, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_IsPartyRaceRivalExists_ReturnValue) == 0x000158, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_IsPartyRaceRivalExists_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetResultRivalTeamId_ReturnValue) == 0x000159, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetResultRivalTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetAdjustedRivalTeamLevelByID_ReturnValue) == 0x00015C, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetAdjustedRivalTeamLevelByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_IsRivalRaceFriendMatch_ReturnValue) == 0x000160, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_IsRivalRaceFriendMatch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetRivalTeamWinRacerAwardData_OutRewardHonor) == 0x000168, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetRivalTeamWinRacerAwardData_OutRewardHonor' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, K2Node_MakeStruct_ResultRewardItemInfo_2) == 0x000188, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::K2Node_MakeStruct_ResultRewardItemInfo_2' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetDataTableRowFromName_OutRow) == 0x0001A8, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001C8, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_Array_Add_ReturnValue_2) == 0x0001CC, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetResultPlayerRank_ReturnValue) == 0x0001D0, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetResultPlayerRank_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, K2Node_MakeStruct_ResultRewardItemInfo_3) == 0x0001D8, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::K2Node_MakeStruct_ResultRewardItemInfo_3' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, K2Node_MakeStruct_ResultRewardItemInfo_4) == 0x0001F8, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::K2Node_MakeStruct_ResultRewardItemInfo_4' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_Array_Add_ReturnValue_3) == 0x000218, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_Array_Add_ReturnValue_4) == 0x00021C, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetAppRaceConfigData_OutData) == 0x000220, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetAppRaceConfigData_OutData' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetSelectedGameModeId_ReturnValue_2) == 0x0006B0, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetSelectedGameModeId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0006B1, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetRSRDonpaTicket_ReturnValue) == 0x0006B4, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetRSRDonpaTicket_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_GetMultiPlayBonusRacerAwardData_OutRewardHonor) == 0x0006B8, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_GetMultiPlayBonusRacerAwardData_OutRewardHonor' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, K2Node_MakeStruct_ResultRewardItemInfo_5) == 0x0006D8, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::K2Node_MakeStruct_ResultRewardItemInfo_5' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_Array_Add_ReturnValue_5) == 0x0006F8, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, K2Node_MakeStruct_ResultRewardItemInfo_6) == 0x000700, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::K2Node_MakeStruct_ResultRewardItemInfo_6' has a wrong offset!");
static_assert(offsetof(BPFL_ResultReward_C_MakeResultRewardItemInfos, CallFunc_Array_Add_ReturnValue_6) == 0x000720, "Member 'BPFL_ResultReward_C_MakeResultRewardItemInfos::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");

}

