#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_CommonStageCameraUtility

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function BPFL_CommonStageCameraUtility.BPFL_CommonStageCameraUtility_C.ApplySettingsCineCameraAll
// 0x0098 (0x0098 - 0x0000)
struct BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll final
{
public:
	class UDataTable*                             In_DataTable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EStageId                                      In_StageId;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          OutResult;                                         // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACineCameraActor*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStageCameraSettings                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CallFunc_GetCineCameraComponent_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CallFunc_GetCineCameraComponent_ReturnValue_1;     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll) == 0x000008, "Wrong alignment on BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll");
static_assert(sizeof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll) == 0x000098, "Wrong size on BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, In_DataTable) == 0x000000, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::In_DataTable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, In_StageId) == 0x000008, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::In_StageId' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, __WorldContext) == 0x000010, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, OutResult) == 0x000018, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::OutResult' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, CallFunc_GetEnumeratorName_ReturnValue) == 0x000030, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, CallFunc_GetDataTableRowFromName_OutRow) == 0x000040, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000068, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, CallFunc_Array_Get_Item) == 0x000070, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, CallFunc_GetCineCameraComponent_ReturnValue) == 0x000078, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::CallFunc_GetCineCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, CallFunc_GetCineCameraComponent_ReturnValue_1) == 0x000080, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::CallFunc_GetCineCameraComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BPFL_CommonStageCameraUtility.BPFL_CommonStageCameraUtility_C.ApplySettingsCineCameraByTag
// 0x00A0 (0x00A0 - 0x0000)
struct BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag final
{
public:
	class UDataTable*                             In_DataTable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EStageId                                      In_StageId;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   In_Tag;                                            // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          OutResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACineCameraActor*>               CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0028(0x0010)(ReferenceParm)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStageCameraSettings                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CallFunc_GetCineCameraComponent_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CallFunc_GetCineCameraComponent_ReturnValue_1;     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag) == 0x000008, "Wrong alignment on BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag");
static_assert(sizeof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag) == 0x0000A0, "Wrong size on BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, In_DataTable) == 0x000000, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::In_DataTable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, In_StageId) == 0x000008, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::In_StageId' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, In_Tag) == 0x00000C, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::In_Tag' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, __WorldContext) == 0x000018, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, OutResult) == 0x000020, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::OutResult' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000028, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, CallFunc_GetEnumeratorName_ReturnValue) == 0x000038, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, Temp_int_Array_Index_Variable) == 0x000074, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, CallFunc_Array_Get_Item) == 0x000078, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, CallFunc_GetCineCameraComponent_ReturnValue) == 0x000080, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::CallFunc_GetCineCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, CallFunc_GetCineCameraComponent_ReturnValue_1) == 0x000088, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::CallFunc_GetCineCameraComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, Temp_int_Loop_Counter_Variable) == 0x000090, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsCineCameraByTag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BPFL_CommonStageCameraUtility.BPFL_CommonStageCameraUtility_C.ApplySettingsSceneCaptureAll
// 0x0088 (0x0088 - 0x0000)
struct BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll final
{
public:
	class UDataTable*                             In_DataTable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EStageId                                      In_StageId;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          OutResult;                                         // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASceneCapture2D*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStageCameraSettings                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll) == 0x000008, "Wrong alignment on BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll");
static_assert(sizeof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll) == 0x000088, "Wrong size on BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, In_DataTable) == 0x000000, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::In_DataTable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, In_StageId) == 0x000008, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::In_StageId' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, __WorldContext) == 0x000010, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, OutResult) == 0x000018, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::OutResult' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, CallFunc_GetEnumeratorName_ReturnValue) == 0x000030, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, CallFunc_GetDataTableRowFromName_OutRow) == 0x000040, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000068, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, CallFunc_Array_Get_Item) == 0x000070, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'BPFL_CommonStageCameraUtility_C_ApplySettingsSceneCaptureAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

