#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_VehicleObjectRef

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_VehicleObjectRef.BPI_VehicleObjectRef_C.GetRaceLapObjRef
// 0x0008 (0x0008 - 0x0000)
struct BPI_VehicleObjectRef_C_GetRaceLapObjRef final
{
public:
	class UObject*                                OutRaceLapObject;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_VehicleObjectRef_C_GetRaceLapObjRef) == 0x000008, "Wrong alignment on BPI_VehicleObjectRef_C_GetRaceLapObjRef");
static_assert(sizeof(BPI_VehicleObjectRef_C_GetRaceLapObjRef) == 0x000008, "Wrong size on BPI_VehicleObjectRef_C_GetRaceLapObjRef");
static_assert(offsetof(BPI_VehicleObjectRef_C_GetRaceLapObjRef, OutRaceLapObject) == 0x000000, "Member 'BPI_VehicleObjectRef_C_GetRaceLapObjRef::OutRaceLapObject' has a wrong offset!");

// Function BPI_VehicleObjectRef.BPI_VehicleObjectRef_C.GetRaceUIObjRef
// 0x0008 (0x0008 - 0x0000)
struct BPI_VehicleObjectRef_C_GetRaceUIObjRef final
{
public:
	class UObject*                                RaceUI;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_VehicleObjectRef_C_GetRaceUIObjRef) == 0x000008, "Wrong alignment on BPI_VehicleObjectRef_C_GetRaceUIObjRef");
static_assert(sizeof(BPI_VehicleObjectRef_C_GetRaceUIObjRef) == 0x000008, "Wrong size on BPI_VehicleObjectRef_C_GetRaceUIObjRef");
static_assert(offsetof(BPI_VehicleObjectRef_C_GetRaceUIObjRef, RaceUI) == 0x000000, "Member 'BPI_VehicleObjectRef_C_GetRaceUIObjRef::RaceUI' has a wrong offset!");

// Function BPI_VehicleObjectRef.BPI_VehicleObjectRef_C.SetRaceLapObjRef
// 0x0008 (0x0008 - 0x0000)
struct BPI_VehicleObjectRef_C_SetRaceLapObjRef final
{
public:
	class UObject*                                InRaceRapObjectRef;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_VehicleObjectRef_C_SetRaceLapObjRef) == 0x000008, "Wrong alignment on BPI_VehicleObjectRef_C_SetRaceLapObjRef");
static_assert(sizeof(BPI_VehicleObjectRef_C_SetRaceLapObjRef) == 0x000008, "Wrong size on BPI_VehicleObjectRef_C_SetRaceLapObjRef");
static_assert(offsetof(BPI_VehicleObjectRef_C_SetRaceLapObjRef, InRaceRapObjectRef) == 0x000000, "Member 'BPI_VehicleObjectRef_C_SetRaceLapObjRef::InRaceRapObjectRef' has a wrong offset!");

// Function BPI_VehicleObjectRef.BPI_VehicleObjectRef_C.SetRaceUIObjRef
// 0x0008 (0x0008 - 0x0000)
struct BPI_VehicleObjectRef_C_SetRaceUIObjRef final
{
public:
	class UObject*                                RaceUI;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_VehicleObjectRef_C_SetRaceUIObjRef) == 0x000008, "Wrong alignment on BPI_VehicleObjectRef_C_SetRaceUIObjRef");
static_assert(sizeof(BPI_VehicleObjectRef_C_SetRaceUIObjRef) == 0x000008, "Wrong size on BPI_VehicleObjectRef_C_SetRaceUIObjRef");
static_assert(offsetof(BPI_VehicleObjectRef_C_SetRaceUIObjRef, RaceUI) == 0x000000, "Member 'BPI_VehicleObjectRef_C_SetRaceUIObjRef::RaceUI' has a wrong offset!");

}

