#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DELETE_WBP_PauseMenu_Sub_Header

#include "Basic.hpp"


namespace SDK::Params
{

// Function DELETE_WBP_PauseMenu_Sub_Header.DELETE_WBP_PauseMenu_Sub_Header_C.ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header
// 0x0010 (0x0010 - 0x0000)
struct DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewPlayerIndex;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header) == 0x000004, "Wrong alignment on DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header");
static_assert(sizeof(DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header) == 0x000010, "Wrong size on DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header");
static_assert(offsetof(DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header, EntryPoint) == 0x000000, "Member 'DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header::EntryPoint' has a wrong offset!");
static_assert(offsetof(DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header, K2Node_CustomEvent_NewPlayerIndex) == 0x000004, "Member 'DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header::K2Node_CustomEvent_NewPlayerIndex' has a wrong offset!");
static_assert(offsetof(DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x000008, "Member 'DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000D, "Member 'DELETE_WBP_PauseMenu_Sub_Header_C_ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function DELETE_WBP_PauseMenu_Sub_Header.DELETE_WBP_PauseMenu_Sub_Header_C.SetPlayerIndex
// 0x0004 (0x0004 - 0x0000)
struct DELETE_WBP_PauseMenu_Sub_Header_C_SetPlayerIndex final
{
public:
	int32                                         NewPlayerIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DELETE_WBP_PauseMenu_Sub_Header_C_SetPlayerIndex) == 0x000004, "Wrong alignment on DELETE_WBP_PauseMenu_Sub_Header_C_SetPlayerIndex");
static_assert(sizeof(DELETE_WBP_PauseMenu_Sub_Header_C_SetPlayerIndex) == 0x000004, "Wrong size on DELETE_WBP_PauseMenu_Sub_Header_C_SetPlayerIndex");
static_assert(offsetof(DELETE_WBP_PauseMenu_Sub_Header_C_SetPlayerIndex, NewPlayerIndex) == 0x000000, "Member 'DELETE_WBP_PauseMenu_Sub_Header_C_SetPlayerIndex::NewPlayerIndex' has a wrong offset!");

}

