#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DELETE_WBP_PauseMenu_Sub_Header

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DELETE_WBP_PauseMenu_Sub_Header.DELETE_WBP_PauseMenu_Sub_Header_C
// 0x0020 (0x0300 - 0x02E0)
class UDELETE_WBP_PauseMenu_Sub_Header_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Pause;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_C*                WBP_CMN_PlayerNumber;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Header(int32 EntryPoint);
	void SetPlayerIndex(int32 NewPlayerIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DELETE_WBP_PauseMenu_Sub_Header_C">();
	}
	static class UDELETE_WBP_PauseMenu_Sub_Header_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDELETE_WBP_PauseMenu_Sub_Header_C>();
	}
};
static_assert(alignof(UDELETE_WBP_PauseMenu_Sub_Header_C) == 0x000008, "Wrong alignment on UDELETE_WBP_PauseMenu_Sub_Header_C");
static_assert(sizeof(UDELETE_WBP_PauseMenu_Sub_Header_C) == 0x000300, "Wrong size on UDELETE_WBP_PauseMenu_Sub_Header_C");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Header_C, UberGraphFrame) == 0x0002E0, "Member 'UDELETE_WBP_PauseMenu_Sub_Header_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Header_C, base) == 0x0002E8, "Member 'UDELETE_WBP_PauseMenu_Sub_Header_C::base' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Header_C, TXT_Pause) == 0x0002F0, "Member 'UDELETE_WBP_PauseMenu_Sub_Header_C::TXT_Pause' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Header_C, WBP_CMN_PlayerNumber) == 0x0002F8, "Member 'UDELETE_WBP_PauseMenu_Sub_Header_C::WBP_CMN_PlayerNumber' has a wrong offset!");

}

