#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DELETE_WBP_PauseMenu_Sub_Option_Top_Btn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DELETE_WBP_PauseMenu_Sub_Option_Top_Btn.DELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C
// 0x0058 (0x04D8 - 0x0480)
class UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C final : public UUnionUIButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Active_to_NonActive;                           // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_NonActive_to_Active;                           // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_Loop;                                   // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_Loop;                                   // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_NonActive_Loop;                                // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_Black;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundAtomCue*                          SelectSE;                                          // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          DecideSE;                                          // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          CancelSE;                                          // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_DELETE_WBP_PauseMenu_Sub_Option_Top_Btn(int32 EntryPoint);
	void Finished_123E221D4303D24E9A775D824635A9D0();
	void Finished_4C9264DD4011245B334598A3D7154B7F();
	void Finished_7EB0CDD446C4775C214A91BBDD7F9C28();
	void Finished_B9B2CF7D431EA821DEF2A7B104D74570();
	void Finished_D20231E14DA366ACE2866C8994722AFE();
	void Finished_F19E20C444646D10594D94B466E83167();
	void OnAccelInput(float InValue);
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnBrakeInput(float InValue);
	void OnDriftPressed();
	void OnDriftReleased();
	void OnEmotePressed();
	void OnEmoteReleased();
	void OnFocus_Impl();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnHornPressed();
	void OnHornReleased();
	void OnPausePressed();
	void OnPauseReleased();
	void OnPitchInput(float InValue);
	void OnRearViewPressed();
	void OnRearViewReleased();
	void OnSlimeCancelXInput(float InValue);
	void OnSlimeCancelYInput(float InValue);
	void OnSpecialPressed();
	void OnSteerInput(float InValue);
	void OnTradeItemPressed();
	void OnTradeItemReleased();
	void OnTrickX2Input(float InValue);
	void OnTrickXInput(float InValue);
	void OnTrickY2Input(float InValue);
	void OnTrickYInput(float InValue);
	void OnUseItemPressed();
	void OnUseItemReleased();
	void PlayAnimationActiveLoop();
	void PlayAnimationNoActive();
	void PlayAnimationSelectLoop();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C">();
	}
	static class UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C>();
	}
};
static_assert(alignof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C) == 0x000008, "Wrong alignment on UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C");
static_assert(sizeof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C) == 0x0004D8, "Wrong size on UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C, UberGraphFrame) == 0x000480, "Member 'UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C, Btn_Active_to_NonActive) == 0x000488, "Member 'UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C::Btn_Active_to_NonActive' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C, Btn_NonActive_to_Active) == 0x000490, "Member 'UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C::Btn_NonActive_to_Active' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C, Btn_Select_Loop) == 0x000498, "Member 'UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C::Btn_Select_Loop' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C, Btn_Active_Loop) == 0x0004A0, "Member 'UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C::Btn_Active_Loop' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C, Btn_NonActive_Loop) == 0x0004A8, "Member 'UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C::Btn_NonActive_Loop' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C, BG_Black) == 0x0004B0, "Member 'UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C::BG_Black' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C, SelectSE) == 0x0004B8, "Member 'UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C::SelectSE' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C, IsSelected) == 0x0004C0, "Member 'UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C, DecideSE) == 0x0004C8, "Member 'UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C::DecideSE' has a wrong offset!");
static_assert(offsetof(UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C, CancelSE) == 0x0004D0, "Member 'UDELETE_WBP_PauseMenu_Sub_Option_Top_Btn_C::CancelSE' has a wrong offset!");

}

