#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_HintTutorialStructure

#include "Basic.hpp"

#include "UNION_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_HintTutorialStructure.F_HintTutorialStructure
// 0x0028 (0x0028 - 0x0000)
struct FF_HintTutorialStructure final
{
public:
	class FText                                   TitleText_2_D3075A9244EC5E7ACBF20A89024877BC;      // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FName                                   TutorialMovieName_6_72596C284CD64EDD904C85A79292B64F; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTutorialTextDispTime>          TextTiming_18_2277B2A94479537F9C46168FFBE16632;    // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FF_HintTutorialStructure) == 0x000008, "Wrong alignment on FF_HintTutorialStructure");
static_assert(sizeof(FF_HintTutorialStructure) == 0x000028, "Wrong size on FF_HintTutorialStructure");
static_assert(offsetof(FF_HintTutorialStructure, TitleText_2_D3075A9244EC5E7ACBF20A89024877BC) == 0x000000, "Member 'FF_HintTutorialStructure::TitleText_2_D3075A9244EC5E7ACBF20A89024877BC' has a wrong offset!");
static_assert(offsetof(FF_HintTutorialStructure, TutorialMovieName_6_72596C284CD64EDD904C85A79292B64F) == 0x000010, "Member 'FF_HintTutorialStructure::TutorialMovieName_6_72596C284CD64EDD904C85A79292B64F' has a wrong offset!");
static_assert(offsetof(FF_HintTutorialStructure, TextTiming_18_2277B2A94479537F9C46168FFBE16632) == 0x000018, "Member 'FF_HintTutorialStructure::TextTiming_18_2277B2A94479537F9C46168FFBE16632' has a wrong offset!");

}

