#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GFur

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct GFur.FurLod
// 0x0010 (0x0010 - 0x0000)
struct FFurLod final
{
public:
	float                                         ScreenSize;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LayerCount;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Lod;                                               // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PhysicsEnabled;                                    // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableMorphTargets;                               // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFurLod) == 0x000004, "Wrong alignment on FFurLod");
static_assert(sizeof(FFurLod) == 0x000010, "Wrong size on FFurLod");
static_assert(offsetof(FFurLod, ScreenSize) == 0x000000, "Member 'FFurLod::ScreenSize' has a wrong offset!");
static_assert(offsetof(FFurLod, LayerCount) == 0x000004, "Member 'FFurLod::LayerCount' has a wrong offset!");
static_assert(offsetof(FFurLod, Lod) == 0x000008, "Member 'FFurLod::Lod' has a wrong offset!");
static_assert(offsetof(FFurLod, PhysicsEnabled) == 0x00000C, "Member 'FFurLod::PhysicsEnabled' has a wrong offset!");
static_assert(offsetof(FFurLod, DisableMorphTargets) == 0x00000D, "Member 'FFurLod::DisableMorphTargets' has a wrong offset!");

}

