#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LS_EntryRacers_Overview

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "LevelSequence_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LS_EntryRacers_Overview.LS_EntryRacers_Overview_DirectorBP_C
// 0x0030 (0x0078 - 0x0048)
class ULS_EntryRacers_Overview_DirectorBP_C final : public ULevelSequenceDirector
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void()>              OnFinishedPlay;                                    // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class AActor* In_Actor, int32 In_RacerIndex)> OnEnterRacerActor;   // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ASceneDriver*                           SceneDriver;                                       // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LS_EntryRacers_Overview_DirectorBP(int32 EntryPoint);
	void OnEnterRacer(class AActor* In_RacerActor, int32 In_Index);
	void OnPlayAnimation(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP(class AActor* In_RacerActor);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_0(class AActor* In_RacerActor);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_1(class AActor* In_RacerActor);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_10(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_11();
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_12(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_13(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_14(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_15(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_16(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_17(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_18(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_19(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_2(class AActor* In_RacerActor);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_20(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_21(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_22(class ABP_SceneDriver_C* BP_SceneDriver_0);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_3(class AActor* In_RacerActor);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_4(class AActor* In_RacerActor);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_5(class AActor* In_RacerActor);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_6(class AActor* In_RacerActor);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_7(class AActor* In_RacerActor);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_8(class AActor* In_RacerActor);
	void SequenceEvent__ENTRYPOINTLS_EntryRacers_Overview_DirectorBP_9(class AActor* In_RacerActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LS_EntryRacers_Overview_DirectorBP_C">();
	}
	static class ULS_EntryRacers_Overview_DirectorBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULS_EntryRacers_Overview_DirectorBP_C>();
	}
};
static_assert(alignof(ULS_EntryRacers_Overview_DirectorBP_C) == 0x000008, "Wrong alignment on ULS_EntryRacers_Overview_DirectorBP_C");
static_assert(sizeof(ULS_EntryRacers_Overview_DirectorBP_C) == 0x000078, "Wrong size on ULS_EntryRacers_Overview_DirectorBP_C");
static_assert(offsetof(ULS_EntryRacers_Overview_DirectorBP_C, UberGraphFrame) == 0x000048, "Member 'ULS_EntryRacers_Overview_DirectorBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULS_EntryRacers_Overview_DirectorBP_C, OnFinishedPlay) == 0x000050, "Member 'ULS_EntryRacers_Overview_DirectorBP_C::OnFinishedPlay' has a wrong offset!");
static_assert(offsetof(ULS_EntryRacers_Overview_DirectorBP_C, OnEnterRacerActor) == 0x000060, "Member 'ULS_EntryRacers_Overview_DirectorBP_C::OnEnterRacerActor' has a wrong offset!");
static_assert(offsetof(ULS_EntryRacers_Overview_DirectorBP_C, SceneDriver) == 0x000070, "Member 'ULS_EntryRacers_Overview_DirectorBP_C::SceneDriver' has a wrong offset!");

}

