#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LS_FestaResult_Camera01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function LS_FestaResult_Camera01.LS_FestaResult_Camera01_DirectorBP_C.ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP
// 0x0220 (0x0220 - 0x0000)
struct LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneDriver_C*                      K2Node_CustomEvent_SceneDriver_1;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDriverPose                                   CallFunc_GetDriverPose_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneDriver_C*                      K2Node_CustomEvent_SceneDriver;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequenceBase>       CallFunc_GetSceneDriverAnimationAsset_Anim;        // 0x0020(0x0028)(HasGetValueTypeHash)
	double                                        CallFunc_GetSceneDriverAnimationAsset_Time;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSceneDriverAnimationAsset_bSkipFacialBlend; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim________;                 // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0010)()
	bool                                          CallFunc_PlayAnimationByAsset_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0100(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0120(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0168(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0180(0x0010)()
	EDriverPose                                   CallFunc_GetDriverPose_ReturnValue_1;              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_1;                // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_2;                // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_3;                // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_196[0x2];                                      // 0x0196(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             Temp_object_Variable;                              // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_1;                            // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FestResultBG_C*                     K2Node_CustomEvent_BP_FestResultBG;                // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue_4;                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             Temp_object_Variable_2;                            // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_Select_Default;                             // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequenceBase>       CallFunc_GetSceneDriverAnimationAsset_Anim_1;      // 0x01C8(0x0028)(HasGetValueTypeHash)
	double                                        CallFunc_GetSceneDriverAnimationAsset_Time_1;      // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSceneDriverAnimationAsset_bSkipFacialBlend_1; // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_DynamicCast_As____________;                 // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByAsset_ReturnValue_1;       // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimationByAsset_Position_ImplicitCast; // 0x0214(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationByAsset_Position_ImplicitCast_1; // 0x0218(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP) == 0x000008, "Wrong alignment on LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP");
static_assert(sizeof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP) == 0x000220, "Wrong size on LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, EntryPoint) == 0x000000, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, Temp_int_Variable) == 0x000004, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, K2Node_CustomEvent_SceneDriver_1) == 0x000008, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::K2Node_CustomEvent_SceneDriver_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_GetDriverPose_ReturnValue) == 0x000010, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_GetDriverPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, K2Node_CustomEvent_SceneDriver) == 0x000018, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::K2Node_CustomEvent_SceneDriver' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_GetSceneDriverAnimationAsset_Anim) == 0x000020, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_GetSceneDriverAnimationAsset_Anim' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_GetSceneDriverAnimationAsset_Time) == 0x000048, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_GetSceneDriverAnimationAsset_Time' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_GetSceneDriverAnimationAsset_bSkipFacialBlend) == 0x000050, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_GetSceneDriverAnimationAsset_bSkipFacialBlend' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000058, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000060, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, K2Node_DynamicCast_AsAnim________) == 0x000070, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::K2Node_DynamicCast_AsAnim________' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_PlayAnimationByAsset_ReturnValue) == 0x000090, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_PlayAnimationByAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x0000E0, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, K2Node_MakeArray_Array) == 0x0000F0, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000100, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_Format_ReturnValue) == 0x000110, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, K2Node_MakeStruct_FormatArgumentData_1) == 0x000120, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, K2Node_MakeArray_Array_1) == 0x000168, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000178, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_Format_ReturnValue_1) == 0x000180, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_GetDriverPose_ReturnValue_1) == 0x000190, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_GetDriverPose_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_ActorHasTag_ReturnValue) == 0x000191, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_ActorHasTag_ReturnValue_1) == 0x000192, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_ActorHasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_ActorHasTag_ReturnValue_2) == 0x000193, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_ActorHasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_ActorHasTag_ReturnValue_3) == 0x000194, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_ActorHasTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_BooleanOR_ReturnValue) == 0x000195, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, Temp_object_Variable) == 0x000198, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, Temp_object_Variable_1) == 0x0001A0, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, K2Node_CustomEvent_BP_FestResultBG) == 0x0001A8, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::K2Node_CustomEvent_BP_FestResultBG' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_ActorHasTag_ReturnValue_4) == 0x0001B0, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_ActorHasTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, Temp_object_Variable_2) == 0x0001B8, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, K2Node_Select_Default) == 0x0001C0, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_GetSceneDriverAnimationAsset_Anim_1) == 0x0001C8, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_GetSceneDriverAnimationAsset_Anim_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_GetSceneDriverAnimationAsset_Time_1) == 0x0001F0, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_GetSceneDriverAnimationAsset_Time_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_GetSceneDriverAnimationAsset_bSkipFacialBlend_1) == 0x0001F8, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_GetSceneDriverAnimationAsset_bSkipFacialBlend_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x0001F9, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000200, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, K2Node_DynamicCast_As____________) == 0x000208, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::K2Node_DynamicCast_As____________' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, K2Node_DynamicCast_bSuccess_1) == 0x000210, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_PlayAnimationByAsset_ReturnValue_1) == 0x000211, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_PlayAnimationByAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_PlayAnimationByAsset_Position_ImplicitCast) == 0x000214, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_PlayAnimationByAsset_Position_ImplicitCast' has a wrong offset!");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP, CallFunc_PlayAnimationByAsset_Position_ImplicitCast_1) == 0x000218, "Member 'LS_FestaResult_Camera01_DirectorBP_C_ExecuteUbergraph_LS_FestaResult_Camera01_DirectorBP::CallFunc_PlayAnimationByAsset_Position_ImplicitCast_1' has a wrong offset!");

// Function LS_FestaResult_Camera01.LS_FestaResult_Camera01_DirectorBP_C.PauseIfNeed_Trigger
// 0x0008 (0x0008 - 0x0000)
struct LS_FestaResult_Camera01_DirectorBP_C_PauseIfNeed_Trigger final
{
public:
	class ABP_FestResultBG_C*                     BP_FestResultBG;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_FestaResult_Camera01_DirectorBP_C_PauseIfNeed_Trigger) == 0x000008, "Wrong alignment on LS_FestaResult_Camera01_DirectorBP_C_PauseIfNeed_Trigger");
static_assert(sizeof(LS_FestaResult_Camera01_DirectorBP_C_PauseIfNeed_Trigger) == 0x000008, "Wrong size on LS_FestaResult_Camera01_DirectorBP_C_PauseIfNeed_Trigger");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_PauseIfNeed_Trigger, BP_FestResultBG) == 0x000000, "Member 'LS_FestaResult_Camera01_DirectorBP_C_PauseIfNeed_Trigger::BP_FestResultBG' has a wrong offset!");

// Function LS_FestaResult_Camera01.LS_FestaResult_Camera01_DirectorBP_C.PlayAnimation_Trigger
// 0x0008 (0x0008 - 0x0000)
struct LS_FestaResult_Camera01_DirectorBP_C_PlayAnimation_Trigger final
{
public:
	class ABP_SceneDriver_C*                      SceneDriver;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_FestaResult_Camera01_DirectorBP_C_PlayAnimation_Trigger) == 0x000008, "Wrong alignment on LS_FestaResult_Camera01_DirectorBP_C_PlayAnimation_Trigger");
static_assert(sizeof(LS_FestaResult_Camera01_DirectorBP_C_PlayAnimation_Trigger) == 0x000008, "Wrong size on LS_FestaResult_Camera01_DirectorBP_C_PlayAnimation_Trigger");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_PlayAnimation_Trigger, SceneDriver) == 0x000000, "Member 'LS_FestaResult_Camera01_DirectorBP_C_PlayAnimation_Trigger::SceneDriver' has a wrong offset!");

// Function LS_FestaResult_Camera01.LS_FestaResult_Camera01_DirectorBP_C.PlayAnimationByRank_Trigger
// 0x0008 (0x0008 - 0x0000)
struct LS_FestaResult_Camera01_DirectorBP_C_PlayAnimationByRank_Trigger final
{
public:
	class ABP_SceneDriver_C*                      SceneDriver;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_FestaResult_Camera01_DirectorBP_C_PlayAnimationByRank_Trigger) == 0x000008, "Wrong alignment on LS_FestaResult_Camera01_DirectorBP_C_PlayAnimationByRank_Trigger");
static_assert(sizeof(LS_FestaResult_Camera01_DirectorBP_C_PlayAnimationByRank_Trigger) == 0x000008, "Wrong size on LS_FestaResult_Camera01_DirectorBP_C_PlayAnimationByRank_Trigger");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_PlayAnimationByRank_Trigger, SceneDriver) == 0x000000, "Member 'LS_FestaResult_Camera01_DirectorBP_C_PlayAnimationByRank_Trigger::SceneDriver' has a wrong offset!");

// Function LS_FestaResult_Camera01.LS_FestaResult_Camera01_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_0
// 0x0008 (0x0008 - 0x0000)
struct LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_0 final
{
public:
	class ABP_SceneDriver_C*                      SceneDriver;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_0) == 0x000008, "Wrong alignment on LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_0");
static_assert(sizeof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_0) == 0x000008, "Wrong size on LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_0");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_0, SceneDriver) == 0x000000, "Member 'LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_0::SceneDriver' has a wrong offset!");

// Function LS_FestaResult_Camera01.LS_FestaResult_Camera01_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_1
// 0x0008 (0x0008 - 0x0000)
struct LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_1 final
{
public:
	class ABP_SceneDriver_C*                      SceneDriver;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_1) == 0x000008, "Wrong alignment on LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_1");
static_assert(sizeof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_1) == 0x000008, "Wrong size on LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_1");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_1, SceneDriver) == 0x000000, "Member 'LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_1::SceneDriver' has a wrong offset!");

// Function LS_FestaResult_Camera01.LS_FestaResult_Camera01_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_2
// 0x0008 (0x0008 - 0x0000)
struct LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_2 final
{
public:
	class ABP_SceneDriver_C*                      SceneDriver;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_2) == 0x000008, "Wrong alignment on LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_2");
static_assert(sizeof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_2) == 0x000008, "Wrong size on LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_2");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_2, SceneDriver) == 0x000000, "Member 'LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_2::SceneDriver' has a wrong offset!");

// Function LS_FestaResult_Camera01.LS_FestaResult_Camera01_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_3
// 0x0008 (0x0008 - 0x0000)
struct LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_3 final
{
public:
	class ABP_SceneDriver_C*                      SceneDriver;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_3) == 0x000008, "Wrong alignment on LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_3");
static_assert(sizeof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_3) == 0x000008, "Wrong size on LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_3");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_3, SceneDriver) == 0x000000, "Member 'LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_3::SceneDriver' has a wrong offset!");

// Function LS_FestaResult_Camera01.LS_FestaResult_Camera01_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_4
// 0x0008 (0x0008 - 0x0000)
struct LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_4 final
{
public:
	class ABP_SceneDriver_C*                      SceneDriver;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_4) == 0x000008, "Wrong alignment on LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_4");
static_assert(sizeof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_4) == 0x000008, "Wrong size on LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_4");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_4, SceneDriver) == 0x000000, "Member 'LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_4::SceneDriver' has a wrong offset!");

// Function LS_FestaResult_Camera01.LS_FestaResult_Camera01_DirectorBP_C.SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_5
// 0x0008 (0x0008 - 0x0000)
struct LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_5 final
{
public:
	class ABP_FestResultBG_C*                     BP_FestResultBG;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_5) == 0x000008, "Wrong alignment on LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_5");
static_assert(sizeof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_5) == 0x000008, "Wrong size on LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_5");
static_assert(offsetof(LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_5, BP_FestResultBG) == 0x000000, "Member 'LS_FestaResult_Camera01_DirectorBP_C_SequenceEvent__ENTRYPOINTLS_FestaResult_Camera01_DirectorBP_5::BP_FestResultBG' has a wrong offset!");

}

