#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LS_RivalResult_Hvr_L

#include "Basic.hpp"


namespace SDK::Params
{

// Function LS_RivalResult_Hvr_L.LS_RivalResult_Hvr_L_DirectorBP_C.ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP
// 0x0020 (0x0020 - 0x0000)
struct LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RaceBefore_RivalRacer_Cutin_C*     CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP) == 0x000008, "Wrong alignment on LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP");
static_assert(sizeof(LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP) == 0x000020, "Wrong size on LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP");
static_assert(offsetof(LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP, EntryPoint) == 0x000000, "Member 'LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP, CallFunc_Create_ReturnValue) == 0x000008, "Member 'LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP, Temp_bool_IsClosed_Variable) == 0x000011, "Member 'LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'LS_RivalResult_Hvr_L_DirectorBP_C_ExecuteUbergraph_LS_RivalResult_Hvr_L_DirectorBP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

