#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MachineResourceElement

#include "Basic.hpp"

#include "UnionRun_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MachineResourceElement.MachineResourceElement_C.ExecuteUbergraph_MachineResourceElement
// 0x07D8 (0x07D8 - 0x0000)
struct MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue; // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMachinePartsDataAsset*                 K2Node_DynamicCast_AsMachine_Parts_Data_Asset;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMachineTirePartsDataAsset*             K2Node_DynamicCast_AsMachine_Tire_Parts_Data_Asset; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_As__________;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoading_ReturnValue;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserMachineCustomizeData              CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData; // 0x0090(0x0078)()
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_GetCenterPartsPathByMachineId_OutPath;    // 0x0128(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_GetSidePartsPathByMachineId_OutPath;      // 0x0148(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_2;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMachinePartsData                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0178(0x01F8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0374(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachinePartsData                      CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0388(0x01F8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachinePartsData                      CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0588(0x01F8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoading_ReturnValue_1;                  // 0x0781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHoverboardMachineId_ReturnValue;        // 0x0782(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_783[0x5];                                      // 0x0783(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_3;                            // 0x0788(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMachinePartsDataAsset*                 K2Node_DynamicCast_AsMachine_Parts_Data_Asset_1;   // 0x0790(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_799[0x3];                                      // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x079C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoading_ReturnValue_2;                  // 0x07AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoading_ReturnValue_3;                  // 0x07AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AE[0x2];                                      // 0x07AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PlayerNo;                       // 0x07B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                K2Node_CustomEvent_CarStatusType;                  // 0x07B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    K2Node_CustomEvent_MachineID;                      // 0x07B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B6[0x2];                                      // 0x07B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x07B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x07C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHoverboardMachineId_ReturnValue_1;      // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement) == 0x000008, "Wrong alignment on MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement");
static_assert(sizeof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement) == 0x0007D8, "Wrong size on MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, EntryPoint) == 0x000000, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::EntryPoint' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_CustomEvent_Loaded_2) == 0x000008, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue) == 0x000010, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, Temp_object_Variable) == 0x000038, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_DynamicCast_AsMachine_Parts_Data_Asset) == 0x000040, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_DynamicCast_AsMachine_Parts_Data_Asset' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_CustomEvent_Loaded_1) == 0x000050, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, Temp_object_Variable_1) == 0x000058, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_DynamicCast_AsMachine_Tire_Parts_Data_Asset) == 0x000060, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_DynamicCast_AsMachine_Tire_Parts_Data_Asset' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_CustomEvent_Loaded) == 0x000070, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, Temp_object_Variable_2) == 0x000078, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_DynamicCast_As__________) == 0x000080, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_DynamicCast_As__________' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_IsLoading_ReturnValue) == 0x000089, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_IsLoading_ReturnValue' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData) == 0x000090, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetMachineCustomizeDataById_OutUserMachineCustomizeData' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_CreateDelegate_OutputDelegate) == 0x000108, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetEnumeratorName_ReturnValue) == 0x000118, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetEnumeratorName_ReturnValue_1) == 0x000120, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetEnumeratorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetCenterPartsPathByMachineId_OutPath) == 0x000128, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetCenterPartsPathByMachineId_OutPath' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetSidePartsPathByMachineId_OutPath) == 0x000148, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetSidePartsPathByMachineId_OutPath' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetEnumeratorName_ReturnValue_2) == 0x000168, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetEnumeratorName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000170, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetDataTableRowFromName_OutRow) == 0x000178, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000370, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_CreateDelegate_OutputDelegate_1) == 0x000374, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000388, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000580, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000588, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000780, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_IsLoading_ReturnValue_1) == 0x000781, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_IsLoading_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_IsHoverboardMachineId_ReturnValue) == 0x000782, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_IsHoverboardMachineId_ReturnValue' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, Temp_object_Variable_3) == 0x000788, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_DynamicCast_AsMachine_Parts_Data_Asset_1) == 0x000790, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_DynamicCast_AsMachine_Parts_Data_Asset_1' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_DynamicCast_bSuccess_3) == 0x000798, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_CreateDelegate_OutputDelegate_2) == 0x00079C, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_IsLoading_ReturnValue_2) == 0x0007AC, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_IsLoading_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_IsLoading_ReturnValue_3) == 0x0007AD, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_IsLoading_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_CustomEvent_PlayerNo) == 0x0007B0, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_CustomEvent_PlayerNo' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_CustomEvent_CarStatusType) == 0x0007B4, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_CustomEvent_CarStatusType' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_CustomEvent_MachineID) == 0x0007B5, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_CustomEvent_MachineID' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_CustomEvent_Loaded_3) == 0x0007B8, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, K2Node_CreateDelegate_OutputDelegate_3) == 0x0007C0, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement, CallFunc_IsHoverboardMachineId_ReturnValue_1) == 0x0007D0, "Member 'MachineResourceElement_C_ExecuteUbergraph_MachineResourceElement::CallFunc_IsHoverboardMachineId_ReturnValue_1' has a wrong offset!");

// Function MachineResourceElement.MachineResourceElement_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct MachineResourceElement_C_Initialize final
{
public:
	int32                                         PlayerNo_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                CarStatusType_0;                                   // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    MachineId_0;                                       // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MachineResourceElement_C_Initialize) == 0x000004, "Wrong alignment on MachineResourceElement_C_Initialize");
static_assert(sizeof(MachineResourceElement_C_Initialize) == 0x000008, "Wrong size on MachineResourceElement_C_Initialize");
static_assert(offsetof(MachineResourceElement_C_Initialize, PlayerNo_0) == 0x000000, "Member 'MachineResourceElement_C_Initialize::PlayerNo_0' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_Initialize, CarStatusType_0) == 0x000004, "Member 'MachineResourceElement_C_Initialize::CarStatusType_0' has a wrong offset!");
static_assert(offsetof(MachineResourceElement_C_Initialize, MachineId_0) == 0x000005, "Member 'MachineResourceElement_C_Initialize::MachineId_0' has a wrong offset!");

// Function MachineResourceElement.MachineResourceElement_C.OnLoaded_7EC97FE04E6C0C687DDC7C8EAE6DB204
// 0x0008 (0x0008 - 0x0000)
struct MachineResourceElement_C_OnLoaded_7EC97FE04E6C0C687DDC7C8EAE6DB204 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MachineResourceElement_C_OnLoaded_7EC97FE04E6C0C687DDC7C8EAE6DB204) == 0x000008, "Wrong alignment on MachineResourceElement_C_OnLoaded_7EC97FE04E6C0C687DDC7C8EAE6DB204");
static_assert(sizeof(MachineResourceElement_C_OnLoaded_7EC97FE04E6C0C687DDC7C8EAE6DB204) == 0x000008, "Wrong size on MachineResourceElement_C_OnLoaded_7EC97FE04E6C0C687DDC7C8EAE6DB204");
static_assert(offsetof(MachineResourceElement_C_OnLoaded_7EC97FE04E6C0C687DDC7C8EAE6DB204, Loaded) == 0x000000, "Member 'MachineResourceElement_C_OnLoaded_7EC97FE04E6C0C687DDC7C8EAE6DB204::Loaded' has a wrong offset!");

// Function MachineResourceElement.MachineResourceElement_C.OnLoaded_95CBE1C547B13B8B9D57678CC6841399
// 0x0008 (0x0008 - 0x0000)
struct MachineResourceElement_C_OnLoaded_95CBE1C547B13B8B9D57678CC6841399 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MachineResourceElement_C_OnLoaded_95CBE1C547B13B8B9D57678CC6841399) == 0x000008, "Wrong alignment on MachineResourceElement_C_OnLoaded_95CBE1C547B13B8B9D57678CC6841399");
static_assert(sizeof(MachineResourceElement_C_OnLoaded_95CBE1C547B13B8B9D57678CC6841399) == 0x000008, "Wrong size on MachineResourceElement_C_OnLoaded_95CBE1C547B13B8B9D57678CC6841399");
static_assert(offsetof(MachineResourceElement_C_OnLoaded_95CBE1C547B13B8B9D57678CC6841399, Loaded) == 0x000000, "Member 'MachineResourceElement_C_OnLoaded_95CBE1C547B13B8B9D57678CC6841399::Loaded' has a wrong offset!");

// Function MachineResourceElement.MachineResourceElement_C.OnLoaded_A4A9566F4CFB176F6C82718A086116EC
// 0x0008 (0x0008 - 0x0000)
struct MachineResourceElement_C_OnLoaded_A4A9566F4CFB176F6C82718A086116EC final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MachineResourceElement_C_OnLoaded_A4A9566F4CFB176F6C82718A086116EC) == 0x000008, "Wrong alignment on MachineResourceElement_C_OnLoaded_A4A9566F4CFB176F6C82718A086116EC");
static_assert(sizeof(MachineResourceElement_C_OnLoaded_A4A9566F4CFB176F6C82718A086116EC) == 0x000008, "Wrong size on MachineResourceElement_C_OnLoaded_A4A9566F4CFB176F6C82718A086116EC");
static_assert(offsetof(MachineResourceElement_C_OnLoaded_A4A9566F4CFB176F6C82718A086116EC, Loaded) == 0x000000, "Member 'MachineResourceElement_C_OnLoaded_A4A9566F4CFB176F6C82718A086116EC::Loaded' has a wrong offset!");

// Function MachineResourceElement.MachineResourceElement_C.OnLoaded_F35FE6E84B36E7912B5397B1CD02FC96
// 0x0008 (0x0008 - 0x0000)
struct MachineResourceElement_C_OnLoaded_F35FE6E84B36E7912B5397B1CD02FC96 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MachineResourceElement_C_OnLoaded_F35FE6E84B36E7912B5397B1CD02FC96) == 0x000008, "Wrong alignment on MachineResourceElement_C_OnLoaded_F35FE6E84B36E7912B5397B1CD02FC96");
static_assert(sizeof(MachineResourceElement_C_OnLoaded_F35FE6E84B36E7912B5397B1CD02FC96) == 0x000008, "Wrong size on MachineResourceElement_C_OnLoaded_F35FE6E84B36E7912B5397B1CD02FC96");
static_assert(offsetof(MachineResourceElement_C_OnLoaded_F35FE6E84B36E7912B5397B1CD02FC96, Loaded) == 0x000000, "Member 'MachineResourceElement_C_OnLoaded_F35FE6E84B36E7912B5397B1CD02FC96::Loaded' has a wrong offset!");

}

