#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_HoldItemVATData

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_HoldItemVATData.ST_HoldItemVATData
// 0x0060 (0x0060 - 0x0000)
struct FST_HoldItemVATData final
{
public:
	EItemId                                       Id_5_A3FA2BF04CA06A93A21092B4D0D70D59;             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimToTextureDataAsset*                DataAsset_16_F6E1098F4F7E371B6E983C9F178B723B;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            StaticMesh_26_3698DB4645F3E3089CCF3AB1505C0E24;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstance*>              Materials_68_6D5DFE8146AE3C0A613FCBB1DA1FB596;     // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         AnimFrameInToLoop_23_E7AD2F964C53C1EED76FF69BD69CFE09; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimFrameLoopToOut_25_388ECB3B4B32647D350315A84E76E96E; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimStartIndex_38_1333A2B54B1625A38701C8977B97E75F; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 NumFrames_53_4102872E4265AE45968FA98EA45A315D;     // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<bool>                                  bAnimLoops_57_BF217F714CF40366EB9A2C8368D90FA8;    // 0x0048(0x0010)(Edit, BlueprintVisible)
	bool                                          bUseOutAnim_59_A63FAB524FC415CB019CB9BE94D038EC;   // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IndexOffset_62_7E1B13864529C22CB5D5B59D952A774C;   // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_HoldItemVATData) == 0x000008, "Wrong alignment on FST_HoldItemVATData");
static_assert(sizeof(FST_HoldItemVATData) == 0x000060, "Wrong size on FST_HoldItemVATData");
static_assert(offsetof(FST_HoldItemVATData, Id_5_A3FA2BF04CA06A93A21092B4D0D70D59) == 0x000000, "Member 'FST_HoldItemVATData::Id_5_A3FA2BF04CA06A93A21092B4D0D70D59' has a wrong offset!");
static_assert(offsetof(FST_HoldItemVATData, DataAsset_16_F6E1098F4F7E371B6E983C9F178B723B) == 0x000008, "Member 'FST_HoldItemVATData::DataAsset_16_F6E1098F4F7E371B6E983C9F178B723B' has a wrong offset!");
static_assert(offsetof(FST_HoldItemVATData, StaticMesh_26_3698DB4645F3E3089CCF3AB1505C0E24) == 0x000010, "Member 'FST_HoldItemVATData::StaticMesh_26_3698DB4645F3E3089CCF3AB1505C0E24' has a wrong offset!");
static_assert(offsetof(FST_HoldItemVATData, Materials_68_6D5DFE8146AE3C0A613FCBB1DA1FB596) == 0x000018, "Member 'FST_HoldItemVATData::Materials_68_6D5DFE8146AE3C0A613FCBB1DA1FB596' has a wrong offset!");
static_assert(offsetof(FST_HoldItemVATData, AnimFrameInToLoop_23_E7AD2F964C53C1EED76FF69BD69CFE09) == 0x000028, "Member 'FST_HoldItemVATData::AnimFrameInToLoop_23_E7AD2F964C53C1EED76FF69BD69CFE09' has a wrong offset!");
static_assert(offsetof(FST_HoldItemVATData, AnimFrameLoopToOut_25_388ECB3B4B32647D350315A84E76E96E) == 0x00002C, "Member 'FST_HoldItemVATData::AnimFrameLoopToOut_25_388ECB3B4B32647D350315A84E76E96E' has a wrong offset!");
static_assert(offsetof(FST_HoldItemVATData, AnimStartIndex_38_1333A2B54B1625A38701C8977B97E75F) == 0x000030, "Member 'FST_HoldItemVATData::AnimStartIndex_38_1333A2B54B1625A38701C8977B97E75F' has a wrong offset!");
static_assert(offsetof(FST_HoldItemVATData, NumFrames_53_4102872E4265AE45968FA98EA45A315D) == 0x000038, "Member 'FST_HoldItemVATData::NumFrames_53_4102872E4265AE45968FA98EA45A315D' has a wrong offset!");
static_assert(offsetof(FST_HoldItemVATData, bAnimLoops_57_BF217F714CF40366EB9A2C8368D90FA8) == 0x000048, "Member 'FST_HoldItemVATData::bAnimLoops_57_BF217F714CF40366EB9A2C8368D90FA8' has a wrong offset!");
static_assert(offsetof(FST_HoldItemVATData, bUseOutAnim_59_A63FAB524FC415CB019CB9BE94D038EC) == 0x000058, "Member 'FST_HoldItemVATData::bUseOutAnim_59_A63FAB524FC415CB019CB9BE94D038EC' has a wrong offset!");
static_assert(offsetof(FST_HoldItemVATData, IndexOffset_62_7E1B13864529C22CB5D5B59D952A774C) == 0x00005C, "Member 'FST_HoldItemVATData::IndexOffset_62_7E1B13864529C22CB5D5B59D952A774C' has a wrong offset!");

}

