#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_StickerMachineData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_StickerMachineData.ST_StickerMachineData
// 0x0068 (0x0068 - 0x0000)
struct FST_StickerMachineData final
{
public:
	struct FBox2D                                 Box_3_059BE084421C2D579FEE43AC9D5BFC65;            // 0x0000(0x0028)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   FrontParts_29_5F572E6A4C14DF959A23859C94AD670A;    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SideParts_30_32B1A92E40E87B27C9AD0C8A0804AA33;     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RearParts_31_9D192A0043A91459925E6EA777633706;     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         FrontMaterialIndex_12_8686507D458597E9DBBC4C878B38D60C; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     FrontMaterial_16_46457EF945B045056104C1BAFAE82747; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         RearMaterialIndex_25_C49A07A74663CE0ABB69BDBB08228958; // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     RearMaterial_28_D86870CE4840579410C7A3AED13D18CB;  // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          FlipUv_19_881EDB584A6FF9BF2A60CE9680E34CAF;        // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_StickerMachineData) == 0x000008, "Wrong alignment on FST_StickerMachineData");
static_assert(sizeof(FST_StickerMachineData) == 0x000068, "Wrong size on FST_StickerMachineData");
static_assert(offsetof(FST_StickerMachineData, Box_3_059BE084421C2D579FEE43AC9D5BFC65) == 0x000000, "Member 'FST_StickerMachineData::Box_3_059BE084421C2D579FEE43AC9D5BFC65' has a wrong offset!");
static_assert(offsetof(FST_StickerMachineData, FrontParts_29_5F572E6A4C14DF959A23859C94AD670A) == 0x000028, "Member 'FST_StickerMachineData::FrontParts_29_5F572E6A4C14DF959A23859C94AD670A' has a wrong offset!");
static_assert(offsetof(FST_StickerMachineData, SideParts_30_32B1A92E40E87B27C9AD0C8A0804AA33) == 0x000030, "Member 'FST_StickerMachineData::SideParts_30_32B1A92E40E87B27C9AD0C8A0804AA33' has a wrong offset!");
static_assert(offsetof(FST_StickerMachineData, RearParts_31_9D192A0043A91459925E6EA777633706) == 0x000038, "Member 'FST_StickerMachineData::RearParts_31_9D192A0043A91459925E6EA777633706' has a wrong offset!");
static_assert(offsetof(FST_StickerMachineData, FrontMaterialIndex_12_8686507D458597E9DBBC4C878B38D60C) == 0x000040, "Member 'FST_StickerMachineData::FrontMaterialIndex_12_8686507D458597E9DBBC4C878B38D60C' has a wrong offset!");
static_assert(offsetof(FST_StickerMachineData, FrontMaterial_16_46457EF945B045056104C1BAFAE82747) == 0x000048, "Member 'FST_StickerMachineData::FrontMaterial_16_46457EF945B045056104C1BAFAE82747' has a wrong offset!");
static_assert(offsetof(FST_StickerMachineData, RearMaterialIndex_25_C49A07A74663CE0ABB69BDBB08228958) == 0x000050, "Member 'FST_StickerMachineData::RearMaterialIndex_25_C49A07A74663CE0ABB69BDBB08228958' has a wrong offset!");
static_assert(offsetof(FST_StickerMachineData, RearMaterial_28_D86870CE4840579410C7A3AED13D18CB) == 0x000058, "Member 'FST_StickerMachineData::RearMaterial_28_D86870CE4840579410C7A3AED13D18CB' has a wrong offset!");
static_assert(offsetof(FST_StickerMachineData, FlipUv_19_881EDB584A6FF9BF2A60CE9680E34CAF) == 0x000060, "Member 'FST_StickerMachineData::FlipUv_19_881EDB584A6FF9BF2A60CE9680E34CAF' has a wrong offset!");

}

