#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_StickerPresetPageItemData

#include "Basic.hpp"

#include "EStickerPresetSelectPageItemType_structs.hpp"
#include "UNION_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_StickerPresetPageItemData.ST_StickerPresetPageItemData
// 0x0050 (0x0050 - 0x0000)
struct FST_StickerPresetPageItemData final
{
public:
	class FName                                   Id_15_2F35AF0840EC554156E7A8B410D9B3B1;            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStickerPresetSelectPageItemType              Type_2_D3921A234D2D9CA518615DBC082B9192;           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_6_0622A95D4ED957A26400919E748C3E20;           // 0x0010(0x0010)(Edit, BlueprintVisible)
	class UTexture2D*                             IconTexture_31_02DAEC934F9FE1894B61D19C604B35FB;   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ThumnailTexture_30_627FC021439A4CDC0158B6B17E3EBA55; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabledColorChange_20_1AB3ADB441576A43098E2E91ED21A82E; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabledFreeScale_21_ADA45BE94BB407913D030B80E8FC195D; // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExtraSticker_46_9E6BC2FD4BDC7696FDF94798EBAD8B9A; // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExtraStickerPattern                          ExtraPattern_48_FF3B2A174CED2429FAEF968C5FF8441A;  // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected_24_99F8F37C420A2C4BCAE43281D77B7E19;   // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNew_25_5D3EC5154A9E3AA6655E85BA6DF9E9C7;        // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStickerState                                 State_34_D38B019C4162FFEADC934697DE356EFD;         // 0x0036(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanPurchase_37_92541E484DF6A5F7C85E57A4B117E4F8;  // 0x0037(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Price_40_4C9EF9F3487EAD9DA4A4088636A67AF2;         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHiddenUntilUnlock_50_54C2B3634CABFE0F68ED65BCE096B08C; // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   UnlockText_43_3EB1A60445FBDD6872B9C1BCBB020796;    // 0x0040(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FST_StickerPresetPageItemData) == 0x000008, "Wrong alignment on FST_StickerPresetPageItemData");
static_assert(sizeof(FST_StickerPresetPageItemData) == 0x000050, "Wrong size on FST_StickerPresetPageItemData");
static_assert(offsetof(FST_StickerPresetPageItemData, Id_15_2F35AF0840EC554156E7A8B410D9B3B1) == 0x000000, "Member 'FST_StickerPresetPageItemData::Id_15_2F35AF0840EC554156E7A8B410D9B3B1' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, Type_2_D3921A234D2D9CA518615DBC082B9192) == 0x000008, "Member 'FST_StickerPresetPageItemData::Type_2_D3921A234D2D9CA518615DBC082B9192' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, Name_6_0622A95D4ED957A26400919E748C3E20) == 0x000010, "Member 'FST_StickerPresetPageItemData::Name_6_0622A95D4ED957A26400919E748C3E20' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, IconTexture_31_02DAEC934F9FE1894B61D19C604B35FB) == 0x000020, "Member 'FST_StickerPresetPageItemData::IconTexture_31_02DAEC934F9FE1894B61D19C604B35FB' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, ThumnailTexture_30_627FC021439A4CDC0158B6B17E3EBA55) == 0x000028, "Member 'FST_StickerPresetPageItemData::ThumnailTexture_30_627FC021439A4CDC0158B6B17E3EBA55' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, IsEnabledColorChange_20_1AB3ADB441576A43098E2E91ED21A82E) == 0x000030, "Member 'FST_StickerPresetPageItemData::IsEnabledColorChange_20_1AB3ADB441576A43098E2E91ED21A82E' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, IsEnabledFreeScale_21_ADA45BE94BB407913D030B80E8FC195D) == 0x000031, "Member 'FST_StickerPresetPageItemData::IsEnabledFreeScale_21_ADA45BE94BB407913D030B80E8FC195D' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, IsExtraSticker_46_9E6BC2FD4BDC7696FDF94798EBAD8B9A) == 0x000032, "Member 'FST_StickerPresetPageItemData::IsExtraSticker_46_9E6BC2FD4BDC7696FDF94798EBAD8B9A' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, ExtraPattern_48_FF3B2A174CED2429FAEF968C5FF8441A) == 0x000033, "Member 'FST_StickerPresetPageItemData::ExtraPattern_48_FF3B2A174CED2429FAEF968C5FF8441A' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, bIsSelected_24_99F8F37C420A2C4BCAE43281D77B7E19) == 0x000034, "Member 'FST_StickerPresetPageItemData::bIsSelected_24_99F8F37C420A2C4BCAE43281D77B7E19' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, bIsNew_25_5D3EC5154A9E3AA6655E85BA6DF9E9C7) == 0x000035, "Member 'FST_StickerPresetPageItemData::bIsNew_25_5D3EC5154A9E3AA6655E85BA6DF9E9C7' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, State_34_D38B019C4162FFEADC934697DE356EFD) == 0x000036, "Member 'FST_StickerPresetPageItemData::State_34_D38B019C4162FFEADC934697DE356EFD' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, bCanPurchase_37_92541E484DF6A5F7C85E57A4B117E4F8) == 0x000037, "Member 'FST_StickerPresetPageItemData::bCanPurchase_37_92541E484DF6A5F7C85E57A4B117E4F8' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, Price_40_4C9EF9F3487EAD9DA4A4088636A67AF2) == 0x000038, "Member 'FST_StickerPresetPageItemData::Price_40_4C9EF9F3487EAD9DA4A4088636A67AF2' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, bIsHiddenUntilUnlock_50_54C2B3634CABFE0F68ED65BCE096B08C) == 0x00003C, "Member 'FST_StickerPresetPageItemData::bIsHiddenUntilUnlock_50_54C2B3634CABFE0F68ED65BCE096B08C' has a wrong offset!");
static_assert(offsetof(FST_StickerPresetPageItemData, UnlockText_43_3EB1A60445FBDD6872B9C1BCBB020796) == 0x000040, "Member 'FST_StickerPresetPageItemData::UnlockText_43_3EB1A60445FBDD6872B9C1BCBB020796' has a wrong offset!");

}

