#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "RigVM_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_2b22c70be80d2302
// 0x0410 (0x0410 - 0x0000)
struct FPropertyBag_2b22c70be80d2302 final
{
public:
	float                                         RigVMModel___MathFloatSub_Result;                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_A;                       // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_4_Transform;             // 0x0010(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_4_CachedIndex;           // 0x0070(0x0010)(Edit)
	float                                         RigVMModel___MathFloatSub_B;                       // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___OffsetTransformForItem_OffsetTransform__IO; // 0x0090(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___OffsetTransformForItem_CachedIndex;   // 0x00F0(0x0010)(Edit)
	float                                         RigVMModel___MathFloatSub_1_Result;                // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_1_A;                     // 0x0104(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_4_1_Transform;           // 0x0110(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_4_1_CachedIndex;         // 0x0170(0x0010)(Edit)
	float                                         RigVMModel___MathFloatSub_1_B;                     // 0x0180(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0xC];                                      // 0x0184(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___OffsetTransformForItem_1_OffsetTransform__IO; // 0x0190(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___OffsetTransformForItem_1_CachedIndex; // 0x01F0(0x0010)(Edit)
	float                                         RigVMModel___MathFloatSub_2_Result;                // 0x0200(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_2_A;                     // 0x0204(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_208[0x8];                                      // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_4_1_1_Transform;         // 0x0210(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_4_1_1_CachedIndex;       // 0x0270(0x0010)(Edit)
	float                                         RigVMModel___MathFloatSub_2_B;                     // 0x0280(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0xC];                                      // 0x0284(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___OffsetTransformForItem_2_OffsetTransform__IO; // 0x0290(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___OffsetTransformForItem_2_CachedIndex; // 0x02F0(0x0010)(Edit)
	float                                         RigVMModel___MathFloatSub_3_Result;                // 0x0300(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_3_A;                     // 0x0304(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_4_1_1_1_Transform;       // 0x0310(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_4_1_1_1_CachedIndex;     // 0x0370(0x0010)(Edit)
	float                                         RigVMModel___MathFloatSub_3_B;                     // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0xC];                                      // 0x0384(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___OffsetTransformForItem_3_OffsetTransform__IO; // 0x0390(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___OffsetTransformForItem_3_CachedIndex; // 0x03F0(0x0010)(Edit)
	class FName                                   RigVMModel___Branch_RigVMUnitNode_BlockToRun;      // 0x0400(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_2b22c70be80d2302) == 0x000010, "Wrong alignment on FPropertyBag_2b22c70be80d2302");
static_assert(sizeof(FPropertyBag_2b22c70be80d2302) == 0x000410, "Wrong size on FPropertyBag_2b22c70be80d2302");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___MathFloatSub_Result) == 0x000000, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___MathFloatSub_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___MathFloatSub_A) == 0x000004, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___MathFloatSub_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___GetTransform_4_Transform) == 0x000010, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___GetTransform_4_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___GetTransform_4_CachedIndex) == 0x000070, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___GetTransform_4_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___MathFloatSub_B) == 0x000080, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___MathFloatSub_B' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___OffsetTransformForItem_OffsetTransform__IO) == 0x000090, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___OffsetTransformForItem_OffsetTransform__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___OffsetTransformForItem_CachedIndex) == 0x0000F0, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___OffsetTransformForItem_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___MathFloatSub_1_Result) == 0x000100, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___MathFloatSub_1_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___MathFloatSub_1_A) == 0x000104, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___MathFloatSub_1_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___GetTransform_4_1_Transform) == 0x000110, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___GetTransform_4_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___GetTransform_4_1_CachedIndex) == 0x000170, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___GetTransform_4_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___MathFloatSub_1_B) == 0x000180, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___MathFloatSub_1_B' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___OffsetTransformForItem_1_OffsetTransform__IO) == 0x000190, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___OffsetTransformForItem_1_OffsetTransform__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___OffsetTransformForItem_1_CachedIndex) == 0x0001F0, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___OffsetTransformForItem_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___MathFloatSub_2_Result) == 0x000200, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___MathFloatSub_2_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___MathFloatSub_2_A) == 0x000204, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___MathFloatSub_2_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___GetTransform_4_1_1_Transform) == 0x000210, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___GetTransform_4_1_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___GetTransform_4_1_1_CachedIndex) == 0x000270, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___GetTransform_4_1_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___MathFloatSub_2_B) == 0x000280, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___MathFloatSub_2_B' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___OffsetTransformForItem_2_OffsetTransform__IO) == 0x000290, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___OffsetTransformForItem_2_OffsetTransform__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___OffsetTransformForItem_2_CachedIndex) == 0x0002F0, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___OffsetTransformForItem_2_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___MathFloatSub_3_Result) == 0x000300, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___MathFloatSub_3_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___MathFloatSub_3_A) == 0x000304, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___MathFloatSub_3_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___GetTransform_4_1_1_1_Transform) == 0x000310, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___GetTransform_4_1_1_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___GetTransform_4_1_1_1_CachedIndex) == 0x000370, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___GetTransform_4_1_1_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___MathFloatSub_3_B) == 0x000380, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___MathFloatSub_3_B' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___OffsetTransformForItem_3_OffsetTransform__IO) == 0x000390, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___OffsetTransformForItem_3_OffsetTransform__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___OffsetTransformForItem_3_CachedIndex) == 0x0003F0, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___OffsetTransformForItem_3_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2b22c70be80d2302, RigVMModel___Branch_RigVMUnitNode_BlockToRun) == 0x000400, "Member 'FPropertyBag_2b22c70be80d2302::RigVMModel___Branch_RigVMUnitNode_BlockToRun' has a wrong offset!");

// PropertyBag Transient.PropertyBag_ef7ccffbc18d8751
// 0x0038 (0x0038 - 0x0000)
struct FPropertyBag_ef7ccffbc18d8751 final
{
public:
	struct FRigElementKey                         RigVMModel___Set_Transform_Item__Const;            // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_Space__Const;           // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_bInitial__Const;        // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_1_Item__Const;           // 0x0010(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_Item__Const;             // 0x001C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Multiply_1_B__Const;                  // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_Weight__Const;          // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_bPropagateToChildren__Const; // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_ef7ccffbc18d8751) == 0x000008, "Wrong alignment on FPropertyBag_ef7ccffbc18d8751");
static_assert(sizeof(FPropertyBag_ef7ccffbc18d8751) == 0x000038, "Wrong size on FPropertyBag_ef7ccffbc18d8751");
static_assert(offsetof(FPropertyBag_ef7ccffbc18d8751, RigVMModel___Set_Transform_Item__Const) == 0x000000, "Member 'FPropertyBag_ef7ccffbc18d8751::RigVMModel___Set_Transform_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ef7ccffbc18d8751, RigVMModel___Set_Transform_Space__Const) == 0x00000C, "Member 'FPropertyBag_ef7ccffbc18d8751::RigVMModel___Set_Transform_Space__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ef7ccffbc18d8751, RigVMModel___Set_Transform_bInitial__Const) == 0x00000D, "Member 'FPropertyBag_ef7ccffbc18d8751::RigVMModel___Set_Transform_bInitial__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ef7ccffbc18d8751, RigVMModel___GetTransform_1_Item__Const) == 0x000010, "Member 'FPropertyBag_ef7ccffbc18d8751::RigVMModel___GetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ef7ccffbc18d8751, RigVMModel___GetTransform_Item__Const) == 0x00001C, "Member 'FPropertyBag_ef7ccffbc18d8751::RigVMModel___GetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ef7ccffbc18d8751, RigVMModel___Multiply_1_B__Const) == 0x000028, "Member 'FPropertyBag_ef7ccffbc18d8751::RigVMModel___Multiply_1_B__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ef7ccffbc18d8751, RigVMModel___Set_Transform_Weight__Const) == 0x000030, "Member 'FPropertyBag_ef7ccffbc18d8751::RigVMModel___Set_Transform_Weight__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ef7ccffbc18d8751, RigVMModel___Set_Transform_bPropagateToChildren__Const) == 0x000034, "Member 'FPropertyBag_ef7ccffbc18d8751::RigVMModel___Set_Transform_bPropagateToChildren__Const' has a wrong offset!");

// PropertyBag Transient.PropertyBag_f9173372bdc8c8d3
// 0x01B0 (0x01B0 - 0x0000)
struct FPropertyBag_f9173372bdc8c8d3 final
{
public:
	struct FVector                                RigVMModel___Add_Result;                           // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_1_Transform;             // 0x0020(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_CachedIndex;           // 0x0080(0x0010)(Edit)
	struct FVector                                RigVMModel___Add_A;                                // 0x0090(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Scale_Result;                         // 0x00A8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Unit_Result;                          // 0x00C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Subtract_Result;                      // 0x00D8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___GetTransform_Transform;               // 0x00F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_CachedIndex;             // 0x0150(0x0010)(Edit)
	struct FVector                                RigVMModel___Subtract_A;                           // 0x0160(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Multiply_1_Result;                    // 0x0178(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_MathVectorDistance_Result; // 0x0180(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Multiply_1_A;                         // 0x0188(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Scale_Factor;                         // 0x0190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_CachedIndex;            // 0x0198(0x0010)(Edit)
};
static_assert(alignof(FPropertyBag_f9173372bdc8c8d3) == 0x000010, "Wrong alignment on FPropertyBag_f9173372bdc8c8d3");
static_assert(sizeof(FPropertyBag_f9173372bdc8c8d3) == 0x0001B0, "Wrong size on FPropertyBag_f9173372bdc8c8d3");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___Add_Result) == 0x000000, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___Add_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___GetTransform_1_Transform) == 0x000020, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___GetTransform_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___GetTransform_1_CachedIndex) == 0x000080, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___GetTransform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___Add_A) == 0x000090, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___Add_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___Scale_Result) == 0x0000A8, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___Scale_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___Unit_Result) == 0x0000C0, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___Unit_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___Subtract_Result) == 0x0000D8, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___Subtract_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___GetTransform_Transform) == 0x0000F0, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___GetTransform_CachedIndex) == 0x000150, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___Subtract_A) == 0x000160, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___Subtract_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___Multiply_1_Result) == 0x000178, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___Multiply_1_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___RigVMFunction_MathVectorDistance_Result) == 0x000180, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___RigVMFunction_MathVectorDistance_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___Multiply_1_A) == 0x000188, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___Multiply_1_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___Scale_Factor) == 0x000190, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___Scale_Factor' has a wrong offset!");
static_assert(offsetof(FPropertyBag_f9173372bdc8c8d3, RigVMModel___Set_Transform_CachedIndex) == 0x000198, "Member 'FPropertyBag_f9173372bdc8c8d3::RigVMModel___Set_Transform_CachedIndex' has a wrong offset!");

// PropertyBag Transient.PropertyBag_32c2d1b48a8b35d0
// 0x0110 (0x0110 - 0x0000)
struct FPropertyBag_32c2d1b48a8b35d0 final
{
public:
	class FName                                   RigVMModel___SetControlRotator_Control__Const;     // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SetControlRotator_Weight__Const;      // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RigVMModel___ArrayGetAtIndex_Array_Get_at_Index_Index__Const; // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SetControlRotator_Space__Const;       // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___RotationConstraintLocalSpaceOffset_Child__Const; // 0x0014(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RotationConstraintLocalSpaceOffset_bMaintainOffset__Const; // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFilterOptionPerAxis                   RigVMModel___RotationConstraintLocalSpaceOffset_Filter__Const; // 0x0021(0x0003)(Edit, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___RotationConstraintLocalSpaceOffset_Parents__Const; // 0x0028(0x0010)(Edit)
	struct FRigUnit_RotationConstraint_AdvancedSettings RigVMModel___RotationConstraintLocalSpaceOffset_AdvancedSettings__Const; // 0x0038(0x0002)(Edit, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___RotationConstraintLocalSpaceOffset_Weight__Const; // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetControlRotator_1_Control__Const;   // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RotationConstraintLocalSpaceOffset_1_Child__Const; // 0x0048(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FFilterOptionPerAxis                   RigVMModel___RotationConstraintLocalSpaceOffset_1_Filter__Const; // 0x0054(0x0003)(Edit, NoDestructor)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___RotationConstraintLocalSpaceOffset_1_Parents__Const; // 0x0058(0x0010)(Edit)
	struct FRigUnit_RotationConstraint_AdvancedSettings RigVMModel___RotationConstraintLocalSpaceOffset_1_AdvancedSettings__Const; // 0x0068(0x0002)(Edit, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RigVMModel___SetControlRotator_2_Control__Const;   // 0x006C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RigVMModel___ArrayGetAtIndex_3_Array_Get_at_Index_Index__Const; // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RotationConstraintLocalSpaceOffset_2_Child__Const; // 0x0078(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___RotationConstraintLocalSpaceOffset_2_Parents__Const; // 0x0088(0x0010)(Edit)
	class FName                                   RigVMModel___SetControlRotator_1_1_Control__Const; // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RotationConstraintLocalSpaceOffset_1_1_Child__Const; // 0x00A0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___RotationConstraintLocalSpaceOffset_1_1_Parents__Const; // 0x00B0(0x0010)(Edit)
	class FName                                   RigVMModel___SetControlRotator_2_1_Control__Const; // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RigVMModel___ArrayGetAtIndex_3_1_Array_Get_at_Index_Index__Const; // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RotationConstraintLocalSpaceOffset_2_1_Child__Const; // 0x00CC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConstraintParent>              RigVMModel___RotationConstraintLocalSpaceOffset_2_1_Parents__Const; // 0x00D8(0x0010)(Edit)
	class FName                                   RigVMModel___SetControlRotator_2_1_1_Control__Const; // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RigVMModel___ArrayGetAtIndex_3_1_1_Array_Get_at_Index_Index__Const; // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RotationConstraintLocalSpaceOffset_2_1_1_Child__Const; // 0x00F4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConstraintParent>              RigVMModel___RotationConstraintLocalSpaceOffset_2_1_1_Parents__Const; // 0x0100(0x0010)(Edit)
};
static_assert(alignof(FPropertyBag_32c2d1b48a8b35d0) == 0x000008, "Wrong alignment on FPropertyBag_32c2d1b48a8b35d0");
static_assert(sizeof(FPropertyBag_32c2d1b48a8b35d0) == 0x000110, "Wrong size on FPropertyBag_32c2d1b48a8b35d0");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___SetControlRotator_Control__Const) == 0x000000, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___SetControlRotator_Control__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___SetControlRotator_Weight__Const) == 0x000008, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___SetControlRotator_Weight__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___ArrayGetAtIndex_Array_Get_at_Index_Index__Const) == 0x00000C, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___ArrayGetAtIndex_Array_Get_at_Index_Index__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___SetControlRotator_Space__Const) == 0x000010, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___SetControlRotator_Space__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_Child__Const) == 0x000014, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_Child__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_bMaintainOffset__Const) == 0x000020, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_bMaintainOffset__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_Filter__Const) == 0x000021, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_Filter__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_Parents__Const) == 0x000028, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_Parents__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_AdvancedSettings__Const) == 0x000038, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_AdvancedSettings__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_Weight__Const) == 0x00003C, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_Weight__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___SetControlRotator_1_Control__Const) == 0x000040, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___SetControlRotator_1_Control__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_1_Child__Const) == 0x000048, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_1_Child__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_1_Filter__Const) == 0x000054, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_1_Filter__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_1_Parents__Const) == 0x000058, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_1_Parents__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_1_AdvancedSettings__Const) == 0x000068, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_1_AdvancedSettings__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___SetControlRotator_2_Control__Const) == 0x00006C, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___SetControlRotator_2_Control__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___ArrayGetAtIndex_3_Array_Get_at_Index_Index__Const) == 0x000074, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___ArrayGetAtIndex_3_Array_Get_at_Index_Index__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_2_Child__Const) == 0x000078, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_2_Child__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_2_Parents__Const) == 0x000088, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_2_Parents__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___SetControlRotator_1_1_Control__Const) == 0x000098, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___SetControlRotator_1_1_Control__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_1_1_Child__Const) == 0x0000A0, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_1_1_Child__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_1_1_Parents__Const) == 0x0000B0, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_1_1_Parents__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___SetControlRotator_2_1_Control__Const) == 0x0000C0, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___SetControlRotator_2_1_Control__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___ArrayGetAtIndex_3_1_Array_Get_at_Index_Index__Const) == 0x0000C8, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___ArrayGetAtIndex_3_1_Array_Get_at_Index_Index__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_2_1_Child__Const) == 0x0000CC, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_2_1_Child__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_2_1_Parents__Const) == 0x0000D8, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_2_1_Parents__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___SetControlRotator_2_1_1_Control__Const) == 0x0000E8, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___SetControlRotator_2_1_1_Control__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___ArrayGetAtIndex_3_1_1_Array_Get_at_Index_Index__Const) == 0x0000F0, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___ArrayGetAtIndex_3_1_1_Array_Get_at_Index_Index__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_2_1_1_Child__Const) == 0x0000F4, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_2_1_1_Child__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_32c2d1b48a8b35d0, RigVMModel___RotationConstraintLocalSpaceOffset_2_1_1_Parents__Const) == 0x000100, "Member 'FPropertyBag_32c2d1b48a8b35d0::RigVMModel___RotationConstraintLocalSpaceOffset_2_1_1_Parents__Const' has a wrong offset!");

// PropertyBag Transient.PropertyBag_389b85a709814b05
// 0x00D0 (0x00D0 - 0x0000)
struct FPropertyBag_389b85a709814b05 final
{
public:
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_Item__Const;   // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___OffsetTransformForItem_OffsetTransform__Const; // 0x0010(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_4_Item__Const;           // 0x0070(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___GetTransform_4_Space__Const;          // 0x007C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetTransform_4_bInitial__Const;       // 0x007D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___OffsetTransformForItem_Weight__Const; // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_1_Item__Const; // 0x0084(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_4_1_Item__Const;         // 0x0090(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_2_Item__Const; // 0x009C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_4_1_1_Item__Const;       // 0x00A8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_3_Item__Const; // 0x00B4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_4_1_1_1_Item__Const;     // 0x00C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_389b85a709814b05) == 0x000010, "Wrong alignment on FPropertyBag_389b85a709814b05");
static_assert(sizeof(FPropertyBag_389b85a709814b05) == 0x0000D0, "Wrong size on FPropertyBag_389b85a709814b05");
static_assert(offsetof(FPropertyBag_389b85a709814b05, RigVMModel___OffsetTransformForItem_Item__Const) == 0x000000, "Member 'FPropertyBag_389b85a709814b05::RigVMModel___OffsetTransformForItem_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_389b85a709814b05, RigVMModel___OffsetTransformForItem_OffsetTransform__Const) == 0x000010, "Member 'FPropertyBag_389b85a709814b05::RigVMModel___OffsetTransformForItem_OffsetTransform__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_389b85a709814b05, RigVMModel___GetTransform_4_Item__Const) == 0x000070, "Member 'FPropertyBag_389b85a709814b05::RigVMModel___GetTransform_4_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_389b85a709814b05, RigVMModel___GetTransform_4_Space__Const) == 0x00007C, "Member 'FPropertyBag_389b85a709814b05::RigVMModel___GetTransform_4_Space__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_389b85a709814b05, RigVMModel___GetTransform_4_bInitial__Const) == 0x00007D, "Member 'FPropertyBag_389b85a709814b05::RigVMModel___GetTransform_4_bInitial__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_389b85a709814b05, RigVMModel___OffsetTransformForItem_Weight__Const) == 0x000080, "Member 'FPropertyBag_389b85a709814b05::RigVMModel___OffsetTransformForItem_Weight__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_389b85a709814b05, RigVMModel___OffsetTransformForItem_1_Item__Const) == 0x000084, "Member 'FPropertyBag_389b85a709814b05::RigVMModel___OffsetTransformForItem_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_389b85a709814b05, RigVMModel___GetTransform_4_1_Item__Const) == 0x000090, "Member 'FPropertyBag_389b85a709814b05::RigVMModel___GetTransform_4_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_389b85a709814b05, RigVMModel___OffsetTransformForItem_2_Item__Const) == 0x00009C, "Member 'FPropertyBag_389b85a709814b05::RigVMModel___OffsetTransformForItem_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_389b85a709814b05, RigVMModel___GetTransform_4_1_1_Item__Const) == 0x0000A8, "Member 'FPropertyBag_389b85a709814b05::RigVMModel___GetTransform_4_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_389b85a709814b05, RigVMModel___OffsetTransformForItem_3_Item__Const) == 0x0000B4, "Member 'FPropertyBag_389b85a709814b05::RigVMModel___OffsetTransformForItem_3_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_389b85a709814b05, RigVMModel___GetTransform_4_1_1_1_Item__Const) == 0x0000C0, "Member 'FPropertyBag_389b85a709814b05::RigVMModel___GetTransform_4_1_1_1_Item__Const' has a wrong offset!");

// PropertyBag Transient.PropertyBag_60be6ea1e24c72e3
// 0x01B8 (0x01B8 - 0x0000)
struct FPropertyBag_60be6ea1e24c72e3 final
{
public:
	struct FRotator                               RigVMModel___ArrayGetAtIndex_Array_Get_at_Index_Element; // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___SetControlRotator_CachedControlIndex; // 0x0018(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RotationConstraintLocalSpaceOffset_ChildCache; // 0x0028(0x0010)(Edit)
	TArray<TArray<struct FCachedRigElement>>      RigVMModel___RotationConstraintLocalSpaceOffset_ParentCaches; // 0x0038(0x0010)(Edit)
	struct FRotator                               RigVMModel___ArrayGetAtIndex_2_Array_Get_at_Index_Element; // 0x0048(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___SetControlRotator_1_CachedControlIndex; // 0x0060(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RotationConstraintLocalSpaceOffset_1_ChildCache; // 0x0070(0x0010)(Edit)
	TArray<TArray<struct FCachedRigElement>>      RigVMModel___RotationConstraintLocalSpaceOffset_1_ParentCaches; // 0x0080(0x0010)(Edit)
	struct FRotator                               RigVMModel___ArrayGetAtIndex_3_Array_Get_at_Index_Element; // 0x0090(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___SetControlRotator_2_CachedControlIndex; // 0x00A8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RotationConstraintLocalSpaceOffset_2_ChildCache; // 0x00B8(0x0010)(Edit)
	TArray<TArray<struct FCachedRigElement>>      RigVMModel___RotationConstraintLocalSpaceOffset_2_ParentCaches; // 0x00C8(0x0010)(Edit)
	struct FRotator                               RigVMModel___ArrayGetAtIndex_2_1_Array_Get_at_Index_Element; // 0x00D8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___SetControlRotator_1_1_CachedControlIndex; // 0x00F0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RotationConstraintLocalSpaceOffset_1_1_ChildCache; // 0x0100(0x0010)(Edit)
	TArray<TArray<struct FCachedRigElement>>      RigVMModel___RotationConstraintLocalSpaceOffset_1_1_ParentCaches; // 0x0110(0x0010)(Edit)
	struct FRotator                               RigVMModel___ArrayGetAtIndex_3_1_Array_Get_at_Index_Element; // 0x0120(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___SetControlRotator_2_1_CachedControlIndex; // 0x0138(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RotationConstraintLocalSpaceOffset_2_1_ChildCache; // 0x0148(0x0010)(Edit)
	TArray<TArray<struct FCachedRigElement>>      RigVMModel___RotationConstraintLocalSpaceOffset_2_1_ParentCaches; // 0x0158(0x0010)(Edit)
	struct FRotator                               RigVMModel___ArrayGetAtIndex_3_1_1_Array_Get_at_Index_Element; // 0x0168(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___SetControlRotator_2_1_1_CachedControlIndex; // 0x0180(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RotationConstraintLocalSpaceOffset_2_1_1_ChildCache; // 0x0190(0x0010)(Edit)
	TArray<TArray<struct FCachedRigElement>>      RigVMModel___RotationConstraintLocalSpaceOffset_2_1_1_ParentCaches; // 0x01A0(0x0010)(Edit)
	class FName                                   RigVMModel___Branch_RigVMUnitNode_BlockToRun;      // 0x01B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_60be6ea1e24c72e3) == 0x000008, "Wrong alignment on FPropertyBag_60be6ea1e24c72e3");
static_assert(sizeof(FPropertyBag_60be6ea1e24c72e3) == 0x0001B8, "Wrong size on FPropertyBag_60be6ea1e24c72e3");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___ArrayGetAtIndex_Array_Get_at_Index_Element) == 0x000000, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___ArrayGetAtIndex_Array_Get_at_Index_Element' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___SetControlRotator_CachedControlIndex) == 0x000018, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___SetControlRotator_CachedControlIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___RotationConstraintLocalSpaceOffset_ChildCache) == 0x000028, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___RotationConstraintLocalSpaceOffset_ChildCache' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___RotationConstraintLocalSpaceOffset_ParentCaches) == 0x000038, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___RotationConstraintLocalSpaceOffset_ParentCaches' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___ArrayGetAtIndex_2_Array_Get_at_Index_Element) == 0x000048, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___ArrayGetAtIndex_2_Array_Get_at_Index_Element' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___SetControlRotator_1_CachedControlIndex) == 0x000060, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___SetControlRotator_1_CachedControlIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___RotationConstraintLocalSpaceOffset_1_ChildCache) == 0x000070, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___RotationConstraintLocalSpaceOffset_1_ChildCache' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___RotationConstraintLocalSpaceOffset_1_ParentCaches) == 0x000080, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___RotationConstraintLocalSpaceOffset_1_ParentCaches' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___ArrayGetAtIndex_3_Array_Get_at_Index_Element) == 0x000090, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___ArrayGetAtIndex_3_Array_Get_at_Index_Element' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___SetControlRotator_2_CachedControlIndex) == 0x0000A8, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___SetControlRotator_2_CachedControlIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___RotationConstraintLocalSpaceOffset_2_ChildCache) == 0x0000B8, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___RotationConstraintLocalSpaceOffset_2_ChildCache' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___RotationConstraintLocalSpaceOffset_2_ParentCaches) == 0x0000C8, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___RotationConstraintLocalSpaceOffset_2_ParentCaches' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___ArrayGetAtIndex_2_1_Array_Get_at_Index_Element) == 0x0000D8, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___ArrayGetAtIndex_2_1_Array_Get_at_Index_Element' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___SetControlRotator_1_1_CachedControlIndex) == 0x0000F0, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___SetControlRotator_1_1_CachedControlIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___RotationConstraintLocalSpaceOffset_1_1_ChildCache) == 0x000100, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___RotationConstraintLocalSpaceOffset_1_1_ChildCache' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___RotationConstraintLocalSpaceOffset_1_1_ParentCaches) == 0x000110, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___RotationConstraintLocalSpaceOffset_1_1_ParentCaches' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___ArrayGetAtIndex_3_1_Array_Get_at_Index_Element) == 0x000120, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___ArrayGetAtIndex_3_1_Array_Get_at_Index_Element' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___SetControlRotator_2_1_CachedControlIndex) == 0x000138, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___SetControlRotator_2_1_CachedControlIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___RotationConstraintLocalSpaceOffset_2_1_ChildCache) == 0x000148, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___RotationConstraintLocalSpaceOffset_2_1_ChildCache' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___RotationConstraintLocalSpaceOffset_2_1_ParentCaches) == 0x000158, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___RotationConstraintLocalSpaceOffset_2_1_ParentCaches' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___ArrayGetAtIndex_3_1_1_Array_Get_at_Index_Element) == 0x000168, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___ArrayGetAtIndex_3_1_1_Array_Get_at_Index_Element' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___SetControlRotator_2_1_1_CachedControlIndex) == 0x000180, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___SetControlRotator_2_1_1_CachedControlIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___RotationConstraintLocalSpaceOffset_2_1_1_ChildCache) == 0x000190, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___RotationConstraintLocalSpaceOffset_2_1_1_ChildCache' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___RotationConstraintLocalSpaceOffset_2_1_1_ParentCaches) == 0x0001A0, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___RotationConstraintLocalSpaceOffset_2_1_1_ParentCaches' has a wrong offset!");
static_assert(offsetof(FPropertyBag_60be6ea1e24c72e3, RigVMModel___Branch_RigVMUnitNode_BlockToRun) == 0x0001B0, "Member 'FPropertyBag_60be6ea1e24c72e3::RigVMModel___Branch_RigVMUnitNode_BlockToRun' has a wrong offset!");

// PropertyBag Transient.PropertyBag_566ba77a926ee9d1
// 0x00E0 (0x00E0 - 0x0000)
struct FPropertyBag_566ba77a926ee9d1 final
{
public:
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_Item__Const;   // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___OffsetTransformForItem_OffsetTransform__Const; // 0x0010(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RigVMModel___ArrayGetAtIndex_Array_Get_at_Index_Index__Const; // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_4_Item__Const;           // 0x0074(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___GetTransform_4_Space__Const;          // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetTransform_4_bInitial__Const;       // 0x0081(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___OffsetTransformForItem_Weight__Const; // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_1_Item__Const; // 0x0088(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	int32                                         RigVMModel___ArrayGetAtIndex_1_Array_Get_at_Index_Index__Const; // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_4_1_Item__Const;         // 0x0098(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_2_Item__Const; // 0x00A4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	int32                                         RigVMModel___ArrayGetAtIndex_1_1_Array_Get_at_Index_Index__Const; // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_4_1_1_Item__Const;       // 0x00B4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_3_Item__Const; // 0x00C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	int32                                         RigVMModel___ArrayGetAtIndex_1_1_1_Array_Get_at_Index_Index__Const; // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_4_1_1_1_Item__Const;     // 0x00D0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_566ba77a926ee9d1) == 0x000010, "Wrong alignment on FPropertyBag_566ba77a926ee9d1");
static_assert(sizeof(FPropertyBag_566ba77a926ee9d1) == 0x0000E0, "Wrong size on FPropertyBag_566ba77a926ee9d1");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___OffsetTransformForItem_Item__Const) == 0x000000, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___OffsetTransformForItem_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___OffsetTransformForItem_OffsetTransform__Const) == 0x000010, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___OffsetTransformForItem_OffsetTransform__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___ArrayGetAtIndex_Array_Get_at_Index_Index__Const) == 0x000070, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___ArrayGetAtIndex_Array_Get_at_Index_Index__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___GetTransform_4_Item__Const) == 0x000074, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___GetTransform_4_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___GetTransform_4_Space__Const) == 0x000080, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___GetTransform_4_Space__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___GetTransform_4_bInitial__Const) == 0x000081, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___GetTransform_4_bInitial__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___OffsetTransformForItem_Weight__Const) == 0x000084, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___OffsetTransformForItem_Weight__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___OffsetTransformForItem_1_Item__Const) == 0x000088, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___OffsetTransformForItem_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___ArrayGetAtIndex_1_Array_Get_at_Index_Index__Const) == 0x000094, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___ArrayGetAtIndex_1_Array_Get_at_Index_Index__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___GetTransform_4_1_Item__Const) == 0x000098, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___GetTransform_4_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___OffsetTransformForItem_2_Item__Const) == 0x0000A4, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___OffsetTransformForItem_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___ArrayGetAtIndex_1_1_Array_Get_at_Index_Index__Const) == 0x0000B0, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___ArrayGetAtIndex_1_1_Array_Get_at_Index_Index__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___GetTransform_4_1_1_Item__Const) == 0x0000B4, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___GetTransform_4_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_566ba77a926ee9d1, RigVMModel___OffsetTransformForItem_3_Item__Const) == 0x0000C0, "Member 'FPropertyBag_566ba77a926ee9d1::RigVMModel___OffsetTransformForItem_3_Item__Const' has a wrong offset!");
