#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnionLib

#include "Basic.hpp"


namespace SDK
{

// Enum UnionLib.EAppBlueprintLogVerbosity
// NumValues: 0x0009
enum class EAppBlueprintLogVerbosity : uint8
{
	Error                                    = 0,
	Warning                                  = 1,
	Display                                  = 2,
	Log                                      = 3,
	Verbose                                  = 4,
	VeryVerbose                              = 5,
	WarningDialog                            = 6,
	DisplayDialog                            = 7,
	EAppBlueprintLogVerbosity_MAX            = 8,
};

// Enum UnionLib.EOutputExecsPin_SuccessFailed
// NumValues: 0x0003
enum class EOutputExecsPin_SuccessFailed : uint8
{
	Success                                  = 0,
	Failed                                   = 1,
	EOutputExecsPin_MAX                      = 2,
};

// ScriptStruct UnionLib.HierarchicalStateMachineStateInfo
// 0x0068 (0x0068 - 0x0000)
struct FHierarchicalStateMachineStateInfo final
{
public:
	class FName                                   StateName;                                         // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnInitState;                                       // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float DeltaTime)>              OnUpdateState;                                     // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnExitState;                                       // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ChildStateMachineClass;                            // 0x0038(0x0028)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateEvenWhenPaused;                             // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHierarchicalStateMachineStateInfo) == 0x000008, "Wrong alignment on FHierarchicalStateMachineStateInfo");
static_assert(sizeof(FHierarchicalStateMachineStateInfo) == 0x000068, "Wrong size on FHierarchicalStateMachineStateInfo");
static_assert(offsetof(FHierarchicalStateMachineStateInfo, StateName) == 0x000000, "Member 'FHierarchicalStateMachineStateInfo::StateName' has a wrong offset!");
static_assert(offsetof(FHierarchicalStateMachineStateInfo, OnInitState) == 0x000008, "Member 'FHierarchicalStateMachineStateInfo::OnInitState' has a wrong offset!");
static_assert(offsetof(FHierarchicalStateMachineStateInfo, OnUpdateState) == 0x000018, "Member 'FHierarchicalStateMachineStateInfo::OnUpdateState' has a wrong offset!");
static_assert(offsetof(FHierarchicalStateMachineStateInfo, OnExitState) == 0x000028, "Member 'FHierarchicalStateMachineStateInfo::OnExitState' has a wrong offset!");
static_assert(offsetof(FHierarchicalStateMachineStateInfo, ChildStateMachineClass) == 0x000038, "Member 'FHierarchicalStateMachineStateInfo::ChildStateMachineClass' has a wrong offset!");
static_assert(offsetof(FHierarchicalStateMachineStateInfo, bUpdateEvenWhenPaused) == 0x000060, "Member 'FHierarchicalStateMachineStateInfo::bUpdateEvenWhenPaused' has a wrong offset!");

}

