#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnionRun

#include "Basic.hpp"

#include "UnionRun_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UnionRun.UnionCourseObjectBase.GetObjectPlacementType
// 0x0001 (0x0001 - 0x0000)
struct UnionCourseObjectBase_GetObjectPlacementType final
{
public:
	EObjectPlacementType                          ReturnValue;                                       // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionCourseObjectBase_GetObjectPlacementType) == 0x000001, "Wrong alignment on UnionCourseObjectBase_GetObjectPlacementType");
static_assert(sizeof(UnionCourseObjectBase_GetObjectPlacementType) == 0x000001, "Wrong size on UnionCourseObjectBase_GetObjectPlacementType");
static_assert(offsetof(UnionCourseObjectBase_GetObjectPlacementType, ReturnValue) == 0x000000, "Member 'UnionCourseObjectBase_GetObjectPlacementType::ReturnValue' has a wrong offset!");

// Function UnionRun.UnionCourseObjectBase.GetPatternRandomId
// 0x0004 (0x0004 - 0x0000)
struct UnionCourseObjectBase_GetPatternRandomId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionCourseObjectBase_GetPatternRandomId) == 0x000004, "Wrong alignment on UnionCourseObjectBase_GetPatternRandomId");
static_assert(sizeof(UnionCourseObjectBase_GetPatternRandomId) == 0x000004, "Wrong size on UnionCourseObjectBase_GetPatternRandomId");
static_assert(offsetof(UnionCourseObjectBase_GetPatternRandomId, ReturnValue) == 0x000000, "Member 'UnionCourseObjectBase_GetPatternRandomId::ReturnValue' has a wrong offset!");

// Function UnionRun.UnionCourseObjectBase.SetDomainIndex
// 0x0001 (0x0001 - 0x0000)
struct UnionCourseObjectBase_SetDomainIndex final
{
public:
	EDomainIndex                                  Index_0;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionCourseObjectBase_SetDomainIndex) == 0x000001, "Wrong alignment on UnionCourseObjectBase_SetDomainIndex");
static_assert(sizeof(UnionCourseObjectBase_SetDomainIndex) == 0x000001, "Wrong size on UnionCourseObjectBase_SetDomainIndex");
static_assert(offsetof(UnionCourseObjectBase_SetDomainIndex, Index_0) == 0x000000, "Member 'UnionCourseObjectBase_SetDomainIndex::Index_0' has a wrong offset!");

// Function UnionRun.UnionCourseObjectBase.SetDomainNumber
// 0x0001 (0x0001 - 0x0000)
struct UnionCourseObjectBase_SetDomainNumber final
{
public:
	EDomainNumber                                 Number;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionCourseObjectBase_SetDomainNumber) == 0x000001, "Wrong alignment on UnionCourseObjectBase_SetDomainNumber");
static_assert(sizeof(UnionCourseObjectBase_SetDomainNumber) == 0x000001, "Wrong size on UnionCourseObjectBase_SetDomainNumber");
static_assert(offsetof(UnionCourseObjectBase_SetDomainNumber, Number) == 0x000000, "Member 'UnionCourseObjectBase_SetDomainNumber::Number' has a wrong offset!");

// Function UnionRun.UnionCourseObjectBase.SetPatternRandomId
// 0x0004 (0x0004 - 0x0000)
struct UnionCourseObjectBase_SetPatternRandomId final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionCourseObjectBase_SetPatternRandomId) == 0x000004, "Wrong alignment on UnionCourseObjectBase_SetPatternRandomId");
static_assert(sizeof(UnionCourseObjectBase_SetPatternRandomId) == 0x000004, "Wrong size on UnionCourseObjectBase_SetPatternRandomId");
static_assert(offsetof(UnionCourseObjectBase_SetPatternRandomId, ID) == 0x000000, "Member 'UnionCourseObjectBase_SetPatternRandomId::ID' has a wrong offset!");

// Function UnionRun.UnionCourseObjectBase.SetRandomObjectType
// 0x0001 (0x0001 - 0x0000)
struct UnionCourseObjectBase_SetRandomObjectType final
{
public:
	ERandomObjType                                Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionCourseObjectBase_SetRandomObjectType) == 0x000001, "Wrong alignment on UnionCourseObjectBase_SetRandomObjectType");
static_assert(sizeof(UnionCourseObjectBase_SetRandomObjectType) == 0x000001, "Wrong size on UnionCourseObjectBase_SetRandomObjectType");
static_assert(offsetof(UnionCourseObjectBase_SetRandomObjectType, Type) == 0x000000, "Member 'UnionCourseObjectBase_SetRandomObjectType::Type' has a wrong offset!");

// Function UnionRun.UnionCourseObjectBase.GetDomainNumber
// 0x0001 (0x0001 - 0x0000)
struct UnionCourseObjectBase_GetDomainNumber final
{
public:
	EDomainNumber                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionCourseObjectBase_GetDomainNumber) == 0x000001, "Wrong alignment on UnionCourseObjectBase_GetDomainNumber");
static_assert(sizeof(UnionCourseObjectBase_GetDomainNumber) == 0x000001, "Wrong size on UnionCourseObjectBase_GetDomainNumber");
static_assert(offsetof(UnionCourseObjectBase_GetDomainNumber, ReturnValue) == 0x000000, "Member 'UnionCourseObjectBase_GetDomainNumber::ReturnValue' has a wrong offset!");

// Function UnionRun.GimmickBigBakubaku.InitStaticBody
// 0x0010 (0x0010 - 0x0000)
struct GimmickBigBakubaku_InitStaticBody final
{
public:
	const class UGimmickStaticBodyComponent*      StaticBody;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GimmickBigBakubaku_InitStaticBody) == 0x000008, "Wrong alignment on GimmickBigBakubaku_InitStaticBody");
static_assert(sizeof(GimmickBigBakubaku_InitStaticBody) == 0x000010, "Wrong size on GimmickBigBakubaku_InitStaticBody");
static_assert(offsetof(GimmickBigBakubaku_InitStaticBody, StaticBody) == 0x000000, "Member 'GimmickBigBakubaku_InitStaticBody::StaticBody' has a wrong offset!");
static_assert(offsetof(GimmickBigBakubaku_InitStaticBody, SocketName) == 0x000008, "Member 'GimmickBigBakubaku_InitStaticBody::SocketName' has a wrong offset!");

// Function UnionRun.AsuraAnimInstance.SetAsuraState
// 0x0001 (0x0001 - 0x0000)
struct AsuraAnimInstance_SetAsuraState final
{
public:
	EAsuraState                                   State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsuraAnimInstance_SetAsuraState) == 0x000001, "Wrong alignment on AsuraAnimInstance_SetAsuraState");
static_assert(sizeof(AsuraAnimInstance_SetAsuraState) == 0x000001, "Wrong size on AsuraAnimInstance_SetAsuraState");
static_assert(offsetof(AsuraAnimInstance_SetAsuraState, State) == 0x000000, "Member 'AsuraAnimInstance_SetAsuraState::State' has a wrong offset!");

// Function UnionRun.AsuraAnimInstance.IsAsuraState
// 0x0002 (0x0002 - 0x0000)
struct AsuraAnimInstance_IsAsuraState final
{
public:
	EAsuraState                                   State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsuraAnimInstance_IsAsuraState) == 0x000001, "Wrong alignment on AsuraAnimInstance_IsAsuraState");
static_assert(sizeof(AsuraAnimInstance_IsAsuraState) == 0x000002, "Wrong size on AsuraAnimInstance_IsAsuraState");
static_assert(offsetof(AsuraAnimInstance_IsAsuraState, State) == 0x000000, "Member 'AsuraAnimInstance_IsAsuraState::State' has a wrong offset!");
static_assert(offsetof(AsuraAnimInstance_IsAsuraState, ReturnValue) == 0x000001, "Member 'AsuraAnimInstance_IsAsuraState::ReturnValue' has a wrong offset!");

// Function UnionRun.RaceLogUtil.GetRacerLapInfo
// 0x0018 (0x0018 - 0x0000)
struct RaceLogUtil_GetRacerLapInfo final
{
public:
	int32                                         RacerIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RaceLogUtil_GetRacerLapInfo) == 0x000008, "Wrong alignment on RaceLogUtil_GetRacerLapInfo");
static_assert(sizeof(RaceLogUtil_GetRacerLapInfo) == 0x000018, "Wrong size on RaceLogUtil_GetRacerLapInfo");
static_assert(offsetof(RaceLogUtil_GetRacerLapInfo, RacerIndex) == 0x000000, "Member 'RaceLogUtil_GetRacerLapInfo::RacerIndex' has a wrong offset!");
static_assert(offsetof(RaceLogUtil_GetRacerLapInfo, ReturnValue) == 0x000008, "Member 'RaceLogUtil_GetRacerLapInfo::ReturnValue' has a wrong offset!");

// Function UnionRun.RaceLogUtil.GetRacerStatusInfo
// 0x0018 (0x0018 - 0x0000)
struct RaceLogUtil_GetRacerStatusInfo final
{
public:
	int32                                         RacerIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RaceLogUtil_GetRacerStatusInfo) == 0x000008, "Wrong alignment on RaceLogUtil_GetRacerStatusInfo");
static_assert(sizeof(RaceLogUtil_GetRacerStatusInfo) == 0x000018, "Wrong size on RaceLogUtil_GetRacerStatusInfo");
static_assert(offsetof(RaceLogUtil_GetRacerStatusInfo, RacerIndex) == 0x000000, "Member 'RaceLogUtil_GetRacerStatusInfo::RacerIndex' has a wrong offset!");
static_assert(offsetof(RaceLogUtil_GetRacerStatusInfo, ReturnValue) == 0x000008, "Member 'RaceLogUtil_GetRacerStatusInfo::ReturnValue' has a wrong offset!");

// Function UnionRun.RaceLogUtil.PrintRaceLog
// 0x0028 (0x0028 - 0x0000)
struct RaceLogUtil_PrintRaceLog final
{
public:
	int32                                         RacerIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 str;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 at;                                                // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RaceLogUtil_PrintRaceLog) == 0x000008, "Wrong alignment on RaceLogUtil_PrintRaceLog");
static_assert(sizeof(RaceLogUtil_PrintRaceLog) == 0x000028, "Wrong size on RaceLogUtil_PrintRaceLog");
static_assert(offsetof(RaceLogUtil_PrintRaceLog, RacerIndex) == 0x000000, "Member 'RaceLogUtil_PrintRaceLog::RacerIndex' has a wrong offset!");
static_assert(offsetof(RaceLogUtil_PrintRaceLog, str) == 0x000008, "Member 'RaceLogUtil_PrintRaceLog::str' has a wrong offset!");
static_assert(offsetof(RaceLogUtil_PrintRaceLog, at) == 0x000018, "Member 'RaceLogUtil_PrintRaceLog::at' has a wrong offset!");

// Function UnionRun.RaceLogUtil.PrintRunLog
// 0x0028 (0x0028 - 0x0000)
struct RaceLogUtil_PrintRunLog final
{
public:
	int32                                         RacerIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 str;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 at;                                                // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RaceLogUtil_PrintRunLog) == 0x000008, "Wrong alignment on RaceLogUtil_PrintRunLog");
static_assert(sizeof(RaceLogUtil_PrintRunLog) == 0x000028, "Wrong size on RaceLogUtil_PrintRunLog");
static_assert(offsetof(RaceLogUtil_PrintRunLog, RacerIndex) == 0x000000, "Member 'RaceLogUtil_PrintRunLog::RacerIndex' has a wrong offset!");
static_assert(offsetof(RaceLogUtil_PrintRunLog, str) == 0x000008, "Member 'RaceLogUtil_PrintRunLog::str' has a wrong offset!");
static_assert(offsetof(RaceLogUtil_PrintRunLog, at) == 0x000018, "Member 'RaceLogUtil_PrintRunLog::at' has a wrong offset!");

// Function UnionRun.RaceLogUtil.PrintWarpLog
// 0x0028 (0x0028 - 0x0000)
struct RaceLogUtil_PrintWarpLog final
{
public:
	int32                                         RacerIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 str;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 at;                                                // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RaceLogUtil_PrintWarpLog) == 0x000008, "Wrong alignment on RaceLogUtil_PrintWarpLog");
static_assert(sizeof(RaceLogUtil_PrintWarpLog) == 0x000028, "Wrong size on RaceLogUtil_PrintWarpLog");
static_assert(offsetof(RaceLogUtil_PrintWarpLog, RacerIndex) == 0x000000, "Member 'RaceLogUtil_PrintWarpLog::RacerIndex' has a wrong offset!");
static_assert(offsetof(RaceLogUtil_PrintWarpLog, str) == 0x000008, "Member 'RaceLogUtil_PrintWarpLog::str' has a wrong offset!");
static_assert(offsetof(RaceLogUtil_PrintWarpLog, at) == 0x000018, "Member 'RaceLogUtil_PrintWarpLog::at' has a wrong offset!");

// Function UnionRun.AttackReplyInterface.NotifyAttackFailed
// 0x0028 (0x0028 - 0x0000)
struct AttackReplyInterface_NotifyAttackFailed final
{
public:
	struct FAttackReply                           Info;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AttackReplyInterface_NotifyAttackFailed) == 0x000008, "Wrong alignment on AttackReplyInterface_NotifyAttackFailed");
static_assert(sizeof(AttackReplyInterface_NotifyAttackFailed) == 0x000028, "Wrong size on AttackReplyInterface_NotifyAttackFailed");
static_assert(offsetof(AttackReplyInterface_NotifyAttackFailed, Info) == 0x000000, "Member 'AttackReplyInterface_NotifyAttackFailed::Info' has a wrong offset!");

// Function UnionRun.AttackReplyInterface.NotifyAttackFinishOverwritten
// 0x0028 (0x0028 - 0x0000)
struct AttackReplyInterface_NotifyAttackFinishOverwritten final
{
public:
	struct FAttackReply                           Info;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AttackReplyInterface_NotifyAttackFinishOverwritten) == 0x000008, "Wrong alignment on AttackReplyInterface_NotifyAttackFinishOverwritten");
static_assert(sizeof(AttackReplyInterface_NotifyAttackFinishOverwritten) == 0x000028, "Wrong size on AttackReplyInterface_NotifyAttackFinishOverwritten");
static_assert(offsetof(AttackReplyInterface_NotifyAttackFinishOverwritten, Info) == 0x000000, "Member 'AttackReplyInterface_NotifyAttackFinishOverwritten::Info' has a wrong offset!");

// Function UnionRun.AttackReplyInterface.NotifyAttackFinishSucceed
// 0x0028 (0x0028 - 0x0000)
struct AttackReplyInterface_NotifyAttackFinishSucceed final
{
public:
	struct FAttackReply                           Info;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AttackReplyInterface_NotifyAttackFinishSucceed) == 0x000008, "Wrong alignment on AttackReplyInterface_NotifyAttackFinishSucceed");
static_assert(sizeof(AttackReplyInterface_NotifyAttackFinishSucceed) == 0x000028, "Wrong size on AttackReplyInterface_NotifyAttackFinishSucceed");
static_assert(offsetof(AttackReplyInterface_NotifyAttackFinishSucceed, Info) == 0x000000, "Member 'AttackReplyInterface_NotifyAttackFinishSucceed::Info' has a wrong offset!");

// Function UnionRun.AttackReplyInterface.NotifyAttackMissingShot
// 0x0028 (0x0028 - 0x0000)
struct AttackReplyInterface_NotifyAttackMissingShot final
{
public:
	struct FAttackReply                           Info;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AttackReplyInterface_NotifyAttackMissingShot) == 0x000008, "Wrong alignment on AttackReplyInterface_NotifyAttackMissingShot");
static_assert(sizeof(AttackReplyInterface_NotifyAttackMissingShot) == 0x000028, "Wrong size on AttackReplyInterface_NotifyAttackMissingShot");
static_assert(offsetof(AttackReplyInterface_NotifyAttackMissingShot, Info) == 0x000000, "Member 'AttackReplyInterface_NotifyAttackMissingShot::Info' has a wrong offset!");

// Function UnionRun.AttackReplyInterface.NotifyAttackPauseEnd
// 0x0028 (0x0028 - 0x0000)
struct AttackReplyInterface_NotifyAttackPauseEnd final
{
public:
	struct FAttackReply                           Info;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AttackReplyInterface_NotifyAttackPauseEnd) == 0x000008, "Wrong alignment on AttackReplyInterface_NotifyAttackPauseEnd");
static_assert(sizeof(AttackReplyInterface_NotifyAttackPauseEnd) == 0x000028, "Wrong size on AttackReplyInterface_NotifyAttackPauseEnd");
static_assert(offsetof(AttackReplyInterface_NotifyAttackPauseEnd, Info) == 0x000000, "Member 'AttackReplyInterface_NotifyAttackPauseEnd::Info' has a wrong offset!");

// Function UnionRun.AttackReplyInterface.NotifyAttackPauseStart
// 0x0028 (0x0028 - 0x0000)
struct AttackReplyInterface_NotifyAttackPauseStart final
{
public:
	struct FAttackReply                           Info;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AttackReplyInterface_NotifyAttackPauseStart) == 0x000008, "Wrong alignment on AttackReplyInterface_NotifyAttackPauseStart");
static_assert(sizeof(AttackReplyInterface_NotifyAttackPauseStart) == 0x000028, "Wrong size on AttackReplyInterface_NotifyAttackPauseStart");
static_assert(offsetof(AttackReplyInterface_NotifyAttackPauseStart, Info) == 0x000000, "Member 'AttackReplyInterface_NotifyAttackPauseStart::Info' has a wrong offset!");

// Function UnionRun.AttackReplyInterface.NotifyAttackSucced
// 0x0028 (0x0028 - 0x0000)
struct AttackReplyInterface_NotifyAttackSucced final
{
public:
	struct FAttackReply                           Info;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AttackReplyInterface_NotifyAttackSucced) == 0x000008, "Wrong alignment on AttackReplyInterface_NotifyAttackSucced");
static_assert(sizeof(AttackReplyInterface_NotifyAttackSucced) == 0x000028, "Wrong size on AttackReplyInterface_NotifyAttackSucced");
static_assert(offsetof(AttackReplyInterface_NotifyAttackSucced, Info) == 0x000000, "Member 'AttackReplyInterface_NotifyAttackSucced::Info' has a wrong offset!");

// Function UnionRun.AttackReplyInterface.NotifyAttackTimeElapsed
// 0x0028 (0x0028 - 0x0000)
struct AttackReplyInterface_NotifyAttackTimeElapsed final
{
public:
	struct FAttackReply                           Info;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AttackReplyInterface_NotifyAttackTimeElapsed) == 0x000008, "Wrong alignment on AttackReplyInterface_NotifyAttackTimeElapsed");
static_assert(sizeof(AttackReplyInterface_NotifyAttackTimeElapsed) == 0x000028, "Wrong size on AttackReplyInterface_NotifyAttackTimeElapsed");
static_assert(offsetof(AttackReplyInterface_NotifyAttackTimeElapsed, Info) == 0x000000, "Member 'AttackReplyInterface_NotifyAttackTimeElapsed::Info' has a wrong offset!");

// Function UnionRun.UnionCameraBase.IsCurrentViewTarget
// 0x0001 (0x0001 - 0x0000)
struct UnionCameraBase_IsCurrentViewTarget final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionCameraBase_IsCurrentViewTarget) == 0x000001, "Wrong alignment on UnionCameraBase_IsCurrentViewTarget");
static_assert(sizeof(UnionCameraBase_IsCurrentViewTarget) == 0x000001, "Wrong size on UnionCameraBase_IsCurrentViewTarget");
static_assert(offsetof(UnionCameraBase_IsCurrentViewTarget, ReturnValue) == 0x000000, "Member 'UnionCameraBase_IsCurrentViewTarget::ReturnValue' has a wrong offset!");

// Function UnionRun.UnionCameraBase.IsInBlending
// 0x0001 (0x0001 - 0x0000)
struct UnionCameraBase_IsInBlending final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionCameraBase_IsInBlending) == 0x000001, "Wrong alignment on UnionCameraBase_IsInBlending");
static_assert(sizeof(UnionCameraBase_IsInBlending) == 0x000001, "Wrong size on UnionCameraBase_IsInBlending");
static_assert(offsetof(UnionCameraBase_IsInBlending, ReturnValue) == 0x000000, "Member 'UnionCameraBase_IsInBlending::ReturnValue' has a wrong offset!");

// Function UnionRun.UnionCameraBase.RequestEndCamera
// 0x0001 (0x0001 - 0x0000)
struct UnionCameraBase_RequestEndCamera final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionCameraBase_RequestEndCamera) == 0x000001, "Wrong alignment on UnionCameraBase_RequestEndCamera");
static_assert(sizeof(UnionCameraBase_RequestEndCamera) == 0x000001, "Wrong size on UnionCameraBase_RequestEndCamera");
static_assert(offsetof(UnionCameraBase_RequestEndCamera, ReturnValue) == 0x000000, "Member 'UnionCameraBase_RequestEndCamera::ReturnValue' has a wrong offset!");

// Function UnionRun.UnionCameraBase.RequestStartCamera
// 0x0001 (0x0001 - 0x0000)
struct UnionCameraBase_RequestStartCamera final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionCameraBase_RequestStartCamera) == 0x000001, "Wrong alignment on UnionCameraBase_RequestStartCamera");
static_assert(sizeof(UnionCameraBase_RequestStartCamera) == 0x000001, "Wrong size on UnionCameraBase_RequestStartCamera");
static_assert(offsetof(UnionCameraBase_RequestStartCamera, ReturnValue) == 0x000000, "Member 'UnionCameraBase_RequestStartCamera::ReturnValue' has a wrong offset!");

// Function UnionRun.BoostPadObject.OnVATUpdate
// 0x0018 (0x0018 - 0x0000)
struct BoostPadObject_OnVATUpdate final
{
public:
	class UUnionVATMeshComponent*                 VATComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUnionVATSequenceInfo                  SequenceInfo;                                      // 0x0008(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BoostPadObject_OnVATUpdate) == 0x000008, "Wrong alignment on BoostPadObject_OnVATUpdate");
static_assert(sizeof(BoostPadObject_OnVATUpdate) == 0x000018, "Wrong size on BoostPadObject_OnVATUpdate");
static_assert(offsetof(BoostPadObject_OnVATUpdate, VATComponent) == 0x000000, "Member 'BoostPadObject_OnVATUpdate::VATComponent' has a wrong offset!");
static_assert(offsetof(BoostPadObject_OnVATUpdate, SequenceInfo) == 0x000008, "Member 'BoostPadObject_OnVATUpdate::SequenceInfo' has a wrong offset!");

// Function UnionRun.BoostPadObject.SetBoostPadType
// 0x0002 (0x0002 - 0x0000)
struct BoostPadObject_SetBoostPadType final
{
public:
	EBoostPadType                                 Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSpecial;                                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoostPadObject_SetBoostPadType) == 0x000001, "Wrong alignment on BoostPadObject_SetBoostPadType");
static_assert(sizeof(BoostPadObject_SetBoostPadType) == 0x000002, "Wrong size on BoostPadObject_SetBoostPadType");
static_assert(offsetof(BoostPadObject_SetBoostPadType, Type) == 0x000000, "Member 'BoostPadObject_SetBoostPadType::Type' has a wrong offset!");
static_assert(offsetof(BoostPadObject_SetBoostPadType, IsSpecial) == 0x000001, "Member 'BoostPadObject_SetBoostPadType::IsSpecial' has a wrong offset!");

// Function UnionRun.BoostPadObject.SetGateScaleRate
// 0x0004 (0x0004 - 0x0000)
struct BoostPadObject_SetGateScaleRate final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BoostPadObject_SetGateScaleRate) == 0x000004, "Wrong alignment on BoostPadObject_SetGateScaleRate");
static_assert(sizeof(BoostPadObject_SetGateScaleRate) == 0x000004, "Wrong size on BoostPadObject_SetGateScaleRate");
static_assert(offsetof(BoostPadObject_SetGateScaleRate, Rate) == 0x000000, "Member 'BoostPadObject_SetGateScaleRate::Rate' has a wrong offset!");

// Function UnionRun.BPFL_UnionRunTuningUtil.GetHoverBaseHeight
// 0x0008 (0x0008 - 0x0000)
struct BPFL_UnionRunTuningUtil_GetHoverBaseHeight final
{
public:
	EVehicleType                                  VehicleType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionRunTuningUtil_GetHoverBaseHeight) == 0x000004, "Wrong alignment on BPFL_UnionRunTuningUtil_GetHoverBaseHeight");
static_assert(sizeof(BPFL_UnionRunTuningUtil_GetHoverBaseHeight) == 0x000008, "Wrong size on BPFL_UnionRunTuningUtil_GetHoverBaseHeight");
static_assert(offsetof(BPFL_UnionRunTuningUtil_GetHoverBaseHeight, VehicleType) == 0x000000, "Member 'BPFL_UnionRunTuningUtil_GetHoverBaseHeight::VehicleType' has a wrong offset!");
static_assert(offsetof(BPFL_UnionRunTuningUtil_GetHoverBaseHeight, ReturnValue) == 0x000004, "Member 'BPFL_UnionRunTuningUtil_GetHoverBaseHeight::ReturnValue' has a wrong offset!");

// Function UnionRun.BPFL_UnionRunTuningUtil.GetIsDroneDisable
// 0x0001 (0x0001 - 0x0000)
struct BPFL_UnionRunTuningUtil_GetIsDroneDisable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionRunTuningUtil_GetIsDroneDisable) == 0x000001, "Wrong alignment on BPFL_UnionRunTuningUtil_GetIsDroneDisable");
static_assert(sizeof(BPFL_UnionRunTuningUtil_GetIsDroneDisable) == 0x000001, "Wrong size on BPFL_UnionRunTuningUtil_GetIsDroneDisable");
static_assert(offsetof(BPFL_UnionRunTuningUtil_GetIsDroneDisable, ReturnValue) == 0x000000, "Member 'BPFL_UnionRunTuningUtil_GetIsDroneDisable::ReturnValue' has a wrong offset!");

// Function UnionRun.BPFL_UnionRunTuningUtil.GetMeshSizeRate
// 0x0008 (0x0008 - 0x0000)
struct BPFL_UnionRunTuningUtil_GetMeshSizeRate final
{
public:
	EVehicleDisplayMode                           DisplayMode;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionRunTuningUtil_GetMeshSizeRate) == 0x000004, "Wrong alignment on BPFL_UnionRunTuningUtil_GetMeshSizeRate");
static_assert(sizeof(BPFL_UnionRunTuningUtil_GetMeshSizeRate) == 0x000008, "Wrong size on BPFL_UnionRunTuningUtil_GetMeshSizeRate");
static_assert(offsetof(BPFL_UnionRunTuningUtil_GetMeshSizeRate, DisplayMode) == 0x000000, "Member 'BPFL_UnionRunTuningUtil_GetMeshSizeRate::DisplayMode' has a wrong offset!");
static_assert(offsetof(BPFL_UnionRunTuningUtil_GetMeshSizeRate, ReturnValue) == 0x000004, "Member 'BPFL_UnionRunTuningUtil_GetMeshSizeRate::ReturnValue' has a wrong offset!");

// Function UnionRun.BPFL_UnionRunTuningUtil.GetStartingLightPosition
// 0x0010 (0x0010 - 0x0000)
struct BPFL_UnionRunTuningUtil_GetStartingLightPosition final
{
public:
	int32                                         SelectedPlayerNum;                                 // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Front;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Right;                                             // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionRunTuningUtil_GetStartingLightPosition) == 0x000004, "Wrong alignment on BPFL_UnionRunTuningUtil_GetStartingLightPosition");
static_assert(sizeof(BPFL_UnionRunTuningUtil_GetStartingLightPosition) == 0x000010, "Wrong size on BPFL_UnionRunTuningUtil_GetStartingLightPosition");
static_assert(offsetof(BPFL_UnionRunTuningUtil_GetStartingLightPosition, SelectedPlayerNum) == 0x000000, "Member 'BPFL_UnionRunTuningUtil_GetStartingLightPosition::SelectedPlayerNum' has a wrong offset!");
static_assert(offsetof(BPFL_UnionRunTuningUtil_GetStartingLightPosition, Front) == 0x000004, "Member 'BPFL_UnionRunTuningUtil_GetStartingLightPosition::Front' has a wrong offset!");
static_assert(offsetof(BPFL_UnionRunTuningUtil_GetStartingLightPosition, Height) == 0x000008, "Member 'BPFL_UnionRunTuningUtil_GetStartingLightPosition::Height' has a wrong offset!");
static_assert(offsetof(BPFL_UnionRunTuningUtil_GetStartingLightPosition, Right) == 0x00000C, "Member 'BPFL_UnionRunTuningUtil_GetStartingLightPosition::Right' has a wrong offset!");

// Function UnionRun.BPFL_UnionRunTuningUtil.GetYellowDrillMeshSizeRate
// 0x0004 (0x0004 - 0x0000)
struct BPFL_UnionRunTuningUtil_GetYellowDrillMeshSizeRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionRunTuningUtil_GetYellowDrillMeshSizeRate) == 0x000004, "Wrong alignment on BPFL_UnionRunTuningUtil_GetYellowDrillMeshSizeRate");
static_assert(sizeof(BPFL_UnionRunTuningUtil_GetYellowDrillMeshSizeRate) == 0x000004, "Wrong size on BPFL_UnionRunTuningUtil_GetYellowDrillMeshSizeRate");
static_assert(offsetof(BPFL_UnionRunTuningUtil_GetYellowDrillMeshSizeRate, ReturnValue) == 0x000000, "Member 'BPFL_UnionRunTuningUtil_GetYellowDrillMeshSizeRate::ReturnValue' has a wrong offset!");

// Function UnionRun.BPFL_UnionRunVehicleUtil.GetCarStatusType
// 0x0002 (0x0002 - 0x0000)
struct BPFL_UnionRunVehicleUtil_GetCarStatusType final
{
public:
	EMachineId                                    InMachineID;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarStatusType                                ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionRunVehicleUtil_GetCarStatusType) == 0x000001, "Wrong alignment on BPFL_UnionRunVehicleUtil_GetCarStatusType");
static_assert(sizeof(BPFL_UnionRunVehicleUtil_GetCarStatusType) == 0x000002, "Wrong size on BPFL_UnionRunVehicleUtil_GetCarStatusType");
static_assert(offsetof(BPFL_UnionRunVehicleUtil_GetCarStatusType, InMachineID) == 0x000000, "Member 'BPFL_UnionRunVehicleUtil_GetCarStatusType::InMachineID' has a wrong offset!");
static_assert(offsetof(BPFL_UnionRunVehicleUtil_GetCarStatusType, ReturnValue) == 0x000001, "Member 'BPFL_UnionRunVehicleUtil_GetCarStatusType::ReturnValue' has a wrong offset!");

// Function UnionRun.BPFL_UnionRunVehicleUtil.GetDefaultMachineId
// 0x0002 (0x0002 - 0x0000)
struct BPFL_UnionRunVehicleUtil_GetDefaultMachineId final
{
public:
	ECarStatusType                                InCarStatusType;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMachineId                                    ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionRunVehicleUtil_GetDefaultMachineId) == 0x000001, "Wrong alignment on BPFL_UnionRunVehicleUtil_GetDefaultMachineId");
static_assert(sizeof(BPFL_UnionRunVehicleUtil_GetDefaultMachineId) == 0x000002, "Wrong size on BPFL_UnionRunVehicleUtil_GetDefaultMachineId");
static_assert(offsetof(BPFL_UnionRunVehicleUtil_GetDefaultMachineId, InCarStatusType) == 0x000000, "Member 'BPFL_UnionRunVehicleUtil_GetDefaultMachineId::InCarStatusType' has a wrong offset!");
static_assert(offsetof(BPFL_UnionRunVehicleUtil_GetDefaultMachineId, ReturnValue) == 0x000001, "Member 'BPFL_UnionRunVehicleUtil_GetDefaultMachineId::ReturnValue' has a wrong offset!");

// Function UnionRun.BPFL_UnionRunVehicleUtil.GetFirstBasicCustomMachineId
// 0x0002 (0x0002 - 0x0000)
struct BPFL_UnionRunVehicleUtil_GetFirstBasicCustomMachineId final
{
public:
	ECarStatusType                                InCarStatusType;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMachineId                                    ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionRunVehicleUtil_GetFirstBasicCustomMachineId) == 0x000001, "Wrong alignment on BPFL_UnionRunVehicleUtil_GetFirstBasicCustomMachineId");
static_assert(sizeof(BPFL_UnionRunVehicleUtil_GetFirstBasicCustomMachineId) == 0x000002, "Wrong size on BPFL_UnionRunVehicleUtil_GetFirstBasicCustomMachineId");
static_assert(offsetof(BPFL_UnionRunVehicleUtil_GetFirstBasicCustomMachineId, InCarStatusType) == 0x000000, "Member 'BPFL_UnionRunVehicleUtil_GetFirstBasicCustomMachineId::InCarStatusType' has a wrong offset!");
static_assert(offsetof(BPFL_UnionRunVehicleUtil_GetFirstBasicCustomMachineId, ReturnValue) == 0x000001, "Member 'BPFL_UnionRunVehicleUtil_GetFirstBasicCustomMachineId::ReturnValue' has a wrong offset!");

// Function UnionRun.BPFL_UnionRunVehicleUtil.IsHoverboard
// 0x0002 (0x0002 - 0x0000)
struct BPFL_UnionRunVehicleUtil_IsHoverboard final
{
public:
	ECarStatusType                                InCarStatusType;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionRunVehicleUtil_IsHoverboard) == 0x000001, "Wrong alignment on BPFL_UnionRunVehicleUtil_IsHoverboard");
static_assert(sizeof(BPFL_UnionRunVehicleUtil_IsHoverboard) == 0x000002, "Wrong size on BPFL_UnionRunVehicleUtil_IsHoverboard");
static_assert(offsetof(BPFL_UnionRunVehicleUtil_IsHoverboard, InCarStatusType) == 0x000000, "Member 'BPFL_UnionRunVehicleUtil_IsHoverboard::InCarStatusType' has a wrong offset!");
static_assert(offsetof(BPFL_UnionRunVehicleUtil_IsHoverboard, ReturnValue) == 0x000001, "Member 'BPFL_UnionRunVehicleUtil_IsHoverboard::ReturnValue' has a wrong offset!");

// Function UnionRun.BreakObjectAnimInstance.SetHit
// 0x0004 (0x0004 - 0x0000)
struct BreakObjectAnimInstance_SetHit final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BreakObjectAnimInstance_SetHit) == 0x000004, "Wrong alignment on BreakObjectAnimInstance_SetHit");
static_assert(sizeof(BreakObjectAnimInstance_SetHit) == 0x000004, "Wrong size on BreakObjectAnimInstance_SetHit");
static_assert(offsetof(BreakObjectAnimInstance_SetHit, Speed) == 0x000000, "Member 'BreakObjectAnimInstance_SetHit::Speed' has a wrong offset!");

// Function UnionRun.KingBoomBooAnimInstance.GetIsAttack
// 0x0001 (0x0001 - 0x0000)
struct KingBoomBooAnimInstance_GetIsAttack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KingBoomBooAnimInstance_GetIsAttack) == 0x000001, "Wrong alignment on KingBoomBooAnimInstance_GetIsAttack");
static_assert(sizeof(KingBoomBooAnimInstance_GetIsAttack) == 0x000001, "Wrong size on KingBoomBooAnimInstance_GetIsAttack");
static_assert(offsetof(KingBoomBooAnimInstance_GetIsAttack, ReturnValue) == 0x000000, "Member 'KingBoomBooAnimInstance_GetIsAttack::ReturnValue' has a wrong offset!");

// Function UnionRun.KingBoomBooAnimInstance.GetIsAttackEnd
// 0x0001 (0x0001 - 0x0000)
struct KingBoomBooAnimInstance_GetIsAttackEnd final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KingBoomBooAnimInstance_GetIsAttackEnd) == 0x000001, "Wrong alignment on KingBoomBooAnimInstance_GetIsAttackEnd");
static_assert(sizeof(KingBoomBooAnimInstance_GetIsAttackEnd) == 0x000001, "Wrong size on KingBoomBooAnimInstance_GetIsAttackEnd");
static_assert(offsetof(KingBoomBooAnimInstance_GetIsAttackEnd, ReturnValue) == 0x000000, "Member 'KingBoomBooAnimInstance_GetIsAttackEnd::ReturnValue' has a wrong offset!");

// Function UnionRun.KingBoomBooAnimInstance.GetIsEnd
// 0x0001 (0x0001 - 0x0000)
struct KingBoomBooAnimInstance_GetIsEnd final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KingBoomBooAnimInstance_GetIsEnd) == 0x000001, "Wrong alignment on KingBoomBooAnimInstance_GetIsEnd");
static_assert(sizeof(KingBoomBooAnimInstance_GetIsEnd) == 0x000001, "Wrong size on KingBoomBooAnimInstance_GetIsEnd");
static_assert(offsetof(KingBoomBooAnimInstance_GetIsEnd, ReturnValue) == 0x000000, "Member 'KingBoomBooAnimInstance_GetIsEnd::ReturnValue' has a wrong offset!");

// Function UnionRun.KingBoomBooAnimInstance.GetIsExit
// 0x0001 (0x0001 - 0x0000)
struct KingBoomBooAnimInstance_GetIsExit final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KingBoomBooAnimInstance_GetIsExit) == 0x000001, "Wrong alignment on KingBoomBooAnimInstance_GetIsExit");
static_assert(sizeof(KingBoomBooAnimInstance_GetIsExit) == 0x000001, "Wrong size on KingBoomBooAnimInstance_GetIsExit");
static_assert(offsetof(KingBoomBooAnimInstance_GetIsExit, ReturnValue) == 0x000000, "Member 'KingBoomBooAnimInstance_GetIsExit::ReturnValue' has a wrong offset!");

// Function UnionRun.KingBoomBooAnimInstance.GetIsMove
// 0x0001 (0x0001 - 0x0000)
struct KingBoomBooAnimInstance_GetIsMove final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KingBoomBooAnimInstance_GetIsMove) == 0x000001, "Wrong alignment on KingBoomBooAnimInstance_GetIsMove");
static_assert(sizeof(KingBoomBooAnimInstance_GetIsMove) == 0x000001, "Wrong size on KingBoomBooAnimInstance_GetIsMove");
static_assert(offsetof(KingBoomBooAnimInstance_GetIsMove, ReturnValue) == 0x000000, "Member 'KingBoomBooAnimInstance_GetIsMove::ReturnValue' has a wrong offset!");

// Function UnionRun.KingBoomBooAnimInstance.GetIsStart
// 0x0001 (0x0001 - 0x0000)
struct KingBoomBooAnimInstance_GetIsStart final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KingBoomBooAnimInstance_GetIsStart) == 0x000001, "Wrong alignment on KingBoomBooAnimInstance_GetIsStart");
static_assert(sizeof(KingBoomBooAnimInstance_GetIsStart) == 0x000001, "Wrong size on KingBoomBooAnimInstance_GetIsStart");
static_assert(offsetof(KingBoomBooAnimInstance_GetIsStart, ReturnValue) == 0x000000, "Member 'KingBoomBooAnimInstance_GetIsStart::ReturnValue' has a wrong offset!");

// Function UnionRun.KingBoomBooAnimInstance.SetIsAttack
// 0x0001 (0x0001 - 0x0000)
struct KingBoomBooAnimInstance_SetIsAttack final
{
public:
	bool                                          flag;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KingBoomBooAnimInstance_SetIsAttack) == 0x000001, "Wrong alignment on KingBoomBooAnimInstance_SetIsAttack");
static_assert(sizeof(KingBoomBooAnimInstance_SetIsAttack) == 0x000001, "Wrong size on KingBoomBooAnimInstance_SetIsAttack");
static_assert(offsetof(KingBoomBooAnimInstance_SetIsAttack, flag) == 0x000000, "Member 'KingBoomBooAnimInstance_SetIsAttack::flag' has a wrong offset!");

// Function UnionRun.KingBoomBooAnimInstance.SetIsAttackEnd
// 0x0001 (0x0001 - 0x0000)
struct KingBoomBooAnimInstance_SetIsAttackEnd final
{
public:
	bool                                          flag;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KingBoomBooAnimInstance_SetIsAttackEnd) == 0x000001, "Wrong alignment on KingBoomBooAnimInstance_SetIsAttackEnd");
static_assert(sizeof(KingBoomBooAnimInstance_SetIsAttackEnd) == 0x000001, "Wrong size on KingBoomBooAnimInstance_SetIsAttackEnd");
static_assert(offsetof(KingBoomBooAnimInstance_SetIsAttackEnd, flag) == 0x000000, "Member 'KingBoomBooAnimInstance_SetIsAttackEnd::flag' has a wrong offset!");

// Function UnionRun.KingBoomBooAnimInstance.SetIsEnd
// 0x0001 (0x0001 - 0x0000)
struct KingBoomBooAnimInstance_SetIsEnd final
{
public:
	bool                                          flag;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KingBoomBooAnimInstance_SetIsEnd) == 0x000001, "Wrong alignment on KingBoomBooAnimInstance_SetIsEnd");
static_assert(sizeof(KingBoomBooAnimInstance_SetIsEnd) == 0x000001, "Wrong size on KingBoomBooAnimInstance_SetIsEnd");
static_assert(offsetof(KingBoomBooAnimInstance_SetIsEnd, flag) == 0x000000, "Member 'KingBoomBooAnimInstance_SetIsEnd::flag' has a wrong offset!");

// Function UnionRun.KingBoomBooAnimInstance.SetIsExit
// 0x0001 (0x0001 - 0x0000)
struct KingBoomBooAnimInstance_SetIsExit final
{
public:
	bool                                          flag;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KingBoomBooAnimInstance_SetIsExit) == 0x000001, "Wrong alignment on KingBoomBooAnimInstance_SetIsExit");
static_assert(sizeof(KingBoomBooAnimInstance_SetIsExit) == 0x000001, "Wrong size on KingBoomBooAnimInstance_SetIsExit");
static_assert(offsetof(KingBoomBooAnimInstance_SetIsExit, flag) == 0x000000, "Member 'KingBoomBooAnimInstance_SetIsExit::flag' has a wrong offset!");

// Function UnionRun.KingBoomBooAnimInstance.SetIsMove
// 0x0001 (0x0001 - 0x0000)
struct KingBoomBooAnimInstance_SetIsMove final
{
public:
	bool                                          flag;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KingBoomBooAnimInstance_SetIsMove) == 0x000001, "Wrong alignment on KingBoomBooAnimInstance_SetIsMove");
static_assert(sizeof(KingBoomBooAnimInstance_SetIsMove) == 0x000001, "Wrong size on KingBoomBooAnimInstance_SetIsMove");
static_assert(offsetof(KingBoomBooAnimInstance_SetIsMove, flag) == 0x000000, "Member 'KingBoomBooAnimInstance_SetIsMove::flag' has a wrong offset!");

// Function UnionRun.KingBoomBooAnimInstance.SetIsStart
// 0x0001 (0x0001 - 0x0000)
struct KingBoomBooAnimInstance_SetIsStart final
{
public:
	bool                                          flag;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KingBoomBooAnimInstance_SetIsStart) == 0x000001, "Wrong alignment on KingBoomBooAnimInstance_SetIsStart");
static_assert(sizeof(KingBoomBooAnimInstance_SetIsStart) == 0x000001, "Wrong size on KingBoomBooAnimInstance_SetIsStart");
static_assert(offsetof(KingBoomBooAnimInstance_SetIsStart, flag) == 0x000000, "Member 'KingBoomBooAnimInstance_SetIsStart::flag' has a wrong offset!");

// Function UnionRun.BreakObjectBase.HitRacer
// 0x0004 (0x0004 - 0x0000)
struct BreakObjectBase_HitRacer final
{
public:
	int32                                         RacerIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BreakObjectBase_HitRacer) == 0x000004, "Wrong alignment on BreakObjectBase_HitRacer");
static_assert(sizeof(BreakObjectBase_HitRacer) == 0x000004, "Wrong size on BreakObjectBase_HitRacer");
static_assert(offsetof(BreakObjectBase_HitRacer, RacerIndex) == 0x000000, "Member 'BreakObjectBase_HitRacer::RacerIndex' has a wrong offset!");

// Function UnionRun.BreakObjectBase.GetBlendSpaceValue
// 0x0004 (0x0004 - 0x0000)
struct BreakObjectBase_GetBlendSpaceValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BreakObjectBase_GetBlendSpaceValue) == 0x000004, "Wrong alignment on BreakObjectBase_GetBlendSpaceValue");
static_assert(sizeof(BreakObjectBase_GetBlendSpaceValue) == 0x000004, "Wrong size on BreakObjectBase_GetBlendSpaceValue");
static_assert(offsetof(BreakObjectBase_GetBlendSpaceValue, ReturnValue) == 0x000000, "Member 'BreakObjectBase_GetBlendSpaceValue::ReturnValue' has a wrong offset!");

// Function UnionRun.BreakObjectBase.IsBroken
// 0x0001 (0x0001 - 0x0000)
struct BreakObjectBase_IsBroken final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BreakObjectBase_IsBroken) == 0x000001, "Wrong alignment on BreakObjectBase_IsBroken");
static_assert(sizeof(BreakObjectBase_IsBroken) == 0x000001, "Wrong size on BreakObjectBase_IsBroken");
static_assert(offsetof(BreakObjectBase_IsBroken, ReturnValue) == 0x000000, "Member 'BreakObjectBase_IsBroken::ReturnValue' has a wrong offset!");

// Function UnionRun.BtDebugDispActor.Execute_AreaDataBlockDisp
// 0x0010 (0x0010 - 0x0000)
struct BtDebugDispActor_Execute_AreaDataBlockDisp final
{
public:
	TArray<class FString>                         args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BtDebugDispActor_Execute_AreaDataBlockDisp) == 0x000008, "Wrong alignment on BtDebugDispActor_Execute_AreaDataBlockDisp");
static_assert(sizeof(BtDebugDispActor_Execute_AreaDataBlockDisp) == 0x000010, "Wrong size on BtDebugDispActor_Execute_AreaDataBlockDisp");
static_assert(offsetof(BtDebugDispActor_Execute_AreaDataBlockDisp, args) == 0x000000, "Member 'BtDebugDispActor_Execute_AreaDataBlockDisp::args' has a wrong offset!");

// Function UnionRun.BtDebugDispActor.Execute_AreaDataCourseCollisionDisp
// 0x0010 (0x0010 - 0x0000)
struct BtDebugDispActor_Execute_AreaDataCourseCollisionDisp final
{
public:
	TArray<class FString>                         args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BtDebugDispActor_Execute_AreaDataCourseCollisionDisp) == 0x000008, "Wrong alignment on BtDebugDispActor_Execute_AreaDataCourseCollisionDisp");
static_assert(sizeof(BtDebugDispActor_Execute_AreaDataCourseCollisionDisp) == 0x000010, "Wrong size on BtDebugDispActor_Execute_AreaDataCourseCollisionDisp");
static_assert(offsetof(BtDebugDispActor_Execute_AreaDataCourseCollisionDisp, args) == 0x000000, "Member 'BtDebugDispActor_Execute_AreaDataCourseCollisionDisp::args' has a wrong offset!");

// Function UnionRun.BtDebugDispActor.Execute_AreaDataCourseCollisionText
// 0x0010 (0x0010 - 0x0000)
struct BtDebugDispActor_Execute_AreaDataCourseCollisionText final
{
public:
	TArray<class FString>                         args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BtDebugDispActor_Execute_AreaDataCourseCollisionText) == 0x000008, "Wrong alignment on BtDebugDispActor_Execute_AreaDataCourseCollisionText");
static_assert(sizeof(BtDebugDispActor_Execute_AreaDataCourseCollisionText) == 0x000010, "Wrong size on BtDebugDispActor_Execute_AreaDataCourseCollisionText");
static_assert(offsetof(BtDebugDispActor_Execute_AreaDataCourseCollisionText, args) == 0x000000, "Member 'BtDebugDispActor_Execute_AreaDataCourseCollisionText::args' has a wrong offset!");

// Function UnionRun.BtDebugDispActor.Execute_CalcStageAABB
// 0x0010 (0x0010 - 0x0000)
struct BtDebugDispActor_Execute_CalcStageAABB final
{
public:
	TArray<class FString>                         args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BtDebugDispActor_Execute_CalcStageAABB) == 0x000008, "Wrong alignment on BtDebugDispActor_Execute_CalcStageAABB");
static_assert(sizeof(BtDebugDispActor_Execute_CalcStageAABB) == 0x000010, "Wrong size on BtDebugDispActor_Execute_CalcStageAABB");
static_assert(offsetof(BtDebugDispActor_Execute_CalcStageAABB, args) == 0x000000, "Member 'BtDebugDispActor_Execute_CalcStageAABB::args' has a wrong offset!");

// Function UnionRun.BtDebugDispActor.Execute_CollisionDisp
// 0x0010 (0x0010 - 0x0000)
struct BtDebugDispActor_Execute_CollisionDisp final
{
public:
	TArray<class FString>                         args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BtDebugDispActor_Execute_CollisionDisp) == 0x000008, "Wrong alignment on BtDebugDispActor_Execute_CollisionDisp");
static_assert(sizeof(BtDebugDispActor_Execute_CollisionDisp) == 0x000010, "Wrong size on BtDebugDispActor_Execute_CollisionDisp");
static_assert(offsetof(BtDebugDispActor_Execute_CollisionDisp, args) == 0x000000, "Member 'BtDebugDispActor_Execute_CollisionDisp::args' has a wrong offset!");

// Function UnionRun.BtDebugDispActor.Execute_CollisionText
// 0x0010 (0x0010 - 0x0000)
struct BtDebugDispActor_Execute_CollisionText final
{
public:
	TArray<class FString>                         args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BtDebugDispActor_Execute_CollisionText) == 0x000008, "Wrong alignment on BtDebugDispActor_Execute_CollisionText");
static_assert(sizeof(BtDebugDispActor_Execute_CollisionText) == 0x000010, "Wrong size on BtDebugDispActor_Execute_CollisionText");
static_assert(offsetof(BtDebugDispActor_Execute_CollisionText, args) == 0x000000, "Member 'BtDebugDispActor_Execute_CollisionText::args' has a wrong offset!");

// Function UnionRun.BtDebugDispActor.Execute_DispStageAABB
// 0x0010 (0x0010 - 0x0000)
struct BtDebugDispActor_Execute_DispStageAABB final
{
public:
	TArray<class FString>                         args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BtDebugDispActor_Execute_DispStageAABB) == 0x000008, "Wrong alignment on BtDebugDispActor_Execute_DispStageAABB");
static_assert(sizeof(BtDebugDispActor_Execute_DispStageAABB) == 0x000010, "Wrong size on BtDebugDispActor_Execute_DispStageAABB");
static_assert(offsetof(BtDebugDispActor_Execute_DispStageAABB, args) == 0x000000, "Member 'BtDebugDispActor_Execute_DispStageAABB::args' has a wrong offset!");

// Function UnionRun.BtDebugDispActor.Execute_DrawSphere
// 0x0010 (0x0010 - 0x0000)
struct BtDebugDispActor_Execute_DrawSphere final
{
public:
	TArray<class FString>                         args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BtDebugDispActor_Execute_DrawSphere) == 0x000008, "Wrong alignment on BtDebugDispActor_Execute_DrawSphere");
static_assert(sizeof(BtDebugDispActor_Execute_DrawSphere) == 0x000010, "Wrong size on BtDebugDispActor_Execute_DrawSphere");
static_assert(offsetof(BtDebugDispActor_Execute_DrawSphere, args) == 0x000000, "Member 'BtDebugDispActor_Execute_DrawSphere::args' has a wrong offset!");

// Function UnionRun.BtDebugDispActor.Execute_RayCast
// 0x0010 (0x0010 - 0x0000)
