#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnionUI

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UnionSystem_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "UnionUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "ImageWriteQueue_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class UnionUI.BPFL_ChallengeManagerUtil
// 0x0000 (0x0028 - 0x0028)
class UBPFL_ChallengeManagerUtil final : public UBlueprintFunctionLibrary
{
public:
	static TArray<struct FChallengeStruct> GetChallengeClearList(int32 ListLength);
	static TArray<struct FChallengeOwnerStruct> GetChallengeClearOwnerList();
	static void GetChallengeProgress(const class UObject* WorldContextObject, int32* NowProgress);
	static TArray<struct FChallengeStruct> GetChallengeSaveData(EChallengeCategory InCategory);
	static TArray<struct FChallengeStruct> GetChallengeShowList();
	static void GetSpecialChallengeProgress(const class UObject* WorldContextObject, int32* NowProgress);
	static bool IsChallengeCategoryClear(EChallengeCategory Category);
	static bool IsOpenSpecialChallenge();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPFL_ChallengeManagerUtil">();
	}
	static class UBPFL_ChallengeManagerUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPFL_ChallengeManagerUtil>();
	}
};
static_assert(alignof(UBPFL_ChallengeManagerUtil) == 0x000008, "Wrong alignment on UBPFL_ChallengeManagerUtil");
static_assert(sizeof(UBPFL_ChallengeManagerUtil) == 0x000028, "Wrong size on UBPFL_ChallengeManagerUtil");

// Class UnionUI.BPFL_UnionUI
// 0x0000 (0x0028 - 0x0028)
class UBPFL_UnionUI final : public UBlueprintFunctionLibrary
{
public:
	static ECommonMenuButtonType ConvertMenuButtonType(const class FString& InString, bool* OutIsValid);
	static void GetArrowKeyControlDir(const struct FKeyEvent& InKeyEvent, EUnionUIControlDir* OutControlDir);
	static void GetDPadControlDir(const struct FKeyEvent& InKeyEvent, EUnionUIControlDir* OutControlDir);
	static void GetJoyStickControlDir(const struct FKeyEvent& InKeyEvent, EUnionUIControlDir* OutControlDir);
	static void GetKeyboardControlDir(const struct FKeyEvent& InKeyEvent, EUnionUIControlDir* OutControlDir);
	static class FText GetTerminologyText(const class FName InTableId, const class FString& InKey);
	static class FText GetTerminologyTextByText(const class FText& InTex);
	static class FText GetTextAddCommasToValue(const int32& InValue);
	static int32 GetUserIndexByFocusEvent(const struct FFocusEvent& InFocusEvent);
	static int32 GetUserIndexByInputEvent(const struct FInputEvent& InInputEvent);
	static int32 GetUserIndexByMouseEvent(const struct FPointerEvent& InInputEvent);
	static void GetWidgetRenderTransform(const class UWidget* InWidget, struct FWidgetTransform* OutRenderTransform);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPFL_UnionUI">();
	}
	static class UBPFL_UnionUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPFL_UnionUI>();
	}
};
static_assert(alignof(UBPFL_UnionUI) == 0x000008, "Wrong alignment on UBPFL_UnionUI");
static_assert(sizeof(UBPFL_UnionUI) == 0x000028, "Wrong size on UBPFL_UnionUI");

// Class UnionUI.FontFunctionObject
// 0x00A0 (0x00C8 - 0x0028)
class UFontFunctionObject final : public UObject
{
public:
	TMap<int32, int32>                            DinToMoriMap;                                      // 0x0028(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TMap<int32, int32>                            MoriToDinMap;                                      // 0x0078(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)

public:
	void CalcFontPoint(const EFontSizeType& InSrcFontType, const EFontSizeType& InDstFontType, const int32& InFontPoint, bool* bSuccess, int32* OutFontPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FontFunctionObject">();
	}
	static class UFontFunctionObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFontFunctionObject>();
	}
};
static_assert(alignof(UFontFunctionObject) == 0x000008, "Wrong alignment on UFontFunctionObject");
static_assert(sizeof(UFontFunctionObject) == 0x0000C8, "Wrong size on UFontFunctionObject");
static_assert(offsetof(UFontFunctionObject, DinToMoriMap) == 0x000028, "Member 'UFontFunctionObject::DinToMoriMap' has a wrong offset!");
static_assert(offsetof(UFontFunctionObject, MoriToDinMap) == 0x000078, "Member 'UFontFunctionObject::MoriToDinMap' has a wrong offset!");

// Class UnionUI.WidgetManContainer
// 0x0040 (0x0068 - 0x0028)
class UWidgetManContainer final : public UObject
{
public:
	class UObject*                                Logic;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUserWidget*>                    WidgetArray;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UCanvasPanelSlot*>               CanvasPanelSlotArray;                              // 0x0040(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        LogicArray;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          IsSubWidget;                                       // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ContainerZOrder;                                   // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AddWidget(class UUserWidget* Widget, class UCanvasPanelSlot* Slot, class UObject* LogicObjectRef, bool* bSucceeded);
	void FindWidget(class UUserWidget* Widget, bool* IsFound, int32* Index_0);
	void GetWidgetAt(int32 Index_0, bool* IsSucceeded, class UUserWidget** Widget, class UObject** LogicObject);
	void GetWidgetCount(int32* WidgetCount);
	void Initialize(class UUserWidget* Widget, const int32 ZOrder, class UCanvasPanelSlot* Slot, class UObject* LogicObjectRef, bool bSubWidget);
	void IsSubWidgetContainer(bool* bSubWidget);
	void OffsetZOrder(int32 Offset);
	void SetZOrder(int32 InZOrder);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetManContainer">();
	}
	static class UWidgetManContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetManContainer>();
	}
};
static_assert(alignof(UWidgetManContainer) == 0x000008, "Wrong alignment on UWidgetManContainer");
static_assert(sizeof(UWidgetManContainer) == 0x000068, "Wrong size on UWidgetManContainer");
static_assert(offsetof(UWidgetManContainer, Logic) == 0x000028, "Member 'UWidgetManContainer::Logic' has a wrong offset!");
static_assert(offsetof(UWidgetManContainer, WidgetArray) == 0x000030, "Member 'UWidgetManContainer::WidgetArray' has a wrong offset!");
static_assert(offsetof(UWidgetManContainer, CanvasPanelSlotArray) == 0x000040, "Member 'UWidgetManContainer::CanvasPanelSlotArray' has a wrong offset!");
static_assert(offsetof(UWidgetManContainer, LogicArray) == 0x000050, "Member 'UWidgetManContainer::LogicArray' has a wrong offset!");
static_assert(offsetof(UWidgetManContainer, IsSubWidget) == 0x000060, "Member 'UWidgetManContainer::IsSubWidget' has a wrong offset!");
static_assert(offsetof(UWidgetManContainer, ContainerZOrder) == 0x000064, "Member 'UWidgetManContainer::ContainerZOrder' has a wrong offset!");

// Class UnionUI.MenuCameraManager
// 0x01F0 (0x0480 - 0x0290)
class alignas(0x10) AMenuCameraManager final : public AActor
{
public:
	class AActor*                                 CameraActor;                                       // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_298[0x180];                                    // 0x0298(0x0180)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraFOV;                                         // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41C[0x8];                                      // 0x041C(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraManualFocusDistance;                         // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_428[0x10];                                     // 0x0428(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(ELobbyCameraMoveType MoveType)> OnCameraMoveEndEvent;              // 0x0438(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlayLevelSequence;                               // 0x0448(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlayReverseLevelSequence;                        // 0x0458(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFinishedLevelSequence;                           // 0x0468(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CameraCharaSlide(class AActor* Target, float Time);
	void CameraMoveToTransform(const struct FTransform& TargetTransform, float Time);
	void CameraZoomIn(class AActor* Target, float Time);
	void CameraZoomOut(float Time);
	void ForceResetCameraMove();
	void SetCameraParam(class AActor* Camera, EEasingFunc InEasingFunc);
	void SetLookAtRacerCameraPos(const struct FVector& OffsetPos, const struct FVector& OffsetLookAtPos);
	void SetManualFocusDistance(float InManualDistance);
	void SetUpCameraFOV(float InFOV);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MenuCameraManager">();
	}
	static class AMenuCameraManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMenuCameraManager>();
	}
};
static_assert(alignof(AMenuCameraManager) == 0x000010, "Wrong alignment on AMenuCameraManager");
static_assert(sizeof(AMenuCameraManager) == 0x000480, "Wrong size on AMenuCameraManager");
static_assert(offsetof(AMenuCameraManager, CameraActor) == 0x000290, "Member 'AMenuCameraManager::CameraActor' has a wrong offset!");
static_assert(offsetof(AMenuCameraManager, CameraFOV) == 0x000418, "Member 'AMenuCameraManager::CameraFOV' has a wrong offset!");
static_assert(offsetof(AMenuCameraManager, CameraManualFocusDistance) == 0x000424, "Member 'AMenuCameraManager::CameraManualFocusDistance' has a wrong offset!");
static_assert(offsetof(AMenuCameraManager, OnCameraMoveEndEvent) == 0x000438, "Member 'AMenuCameraManager::OnCameraMoveEndEvent' has a wrong offset!");
static_assert(offsetof(AMenuCameraManager, OnPlayLevelSequence) == 0x000448, "Member 'AMenuCameraManager::OnPlayLevelSequence' has a wrong offset!");
static_assert(offsetof(AMenuCameraManager, OnPlayReverseLevelSequence) == 0x000458, "Member 'AMenuCameraManager::OnPlayReverseLevelSequence' has a wrong offset!");
static_assert(offsetof(AMenuCameraManager, OnFinishedLevelSequence) == 0x000468, "Member 'AMenuCameraManager::OnFinishedLevelSequence' has a wrong offset!");

// Class UnionUI.MenuInputRecieveObject
// 0x02F8 (0x0320 - 0x0028)
class UMenuInputRecieveObject final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir)> OnUpKeyPressedEvent; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir)> OnDownKeyPressedEvent; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir)> OnLeftKeyPressedEvent; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir)> OnRightKeyPressedEvent; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnAcceptKeyPressedEvent;                   // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnBackKeyPressedEvent;                     // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnFaceButtonLeftPressedEvent;              // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnFaceButtonTopPressedEvent;               // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnLeftShoulderPressedEvent;                // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnRightShoulderPressedEvent;               // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnLeftStickButtonPressedEvent;             // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnRightStickButtonPressedEvent;            // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnSpecialPressedEvent;                     // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnSpecialShotEvent;                        // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir, const int32& PlayerControllerIndex)> OnUpKeyPressedWithPlayerIdEvent; // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir, const int32& PlayerControllerIndex)> OnDownKeyPressedWithPlayerIdEvent; // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir, const int32& PlayerControllerIndex)> OnLeftKeyPressedWithPlayerIdEvent; // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir, const int32& PlayerControllerIndex)> OnRightKeyPressedWithPlayerIdEvent; // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> OnAcceptKeyPressedWithPlayerIdEvent; // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> OnBackKeyPressedWithPlayerIdEvent; // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> OnFaceButtonLeftPressedWithPlayerIdEvent; // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> OnFaceButtonTopPressedWithPlayerIdEvent; // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> OnLeftShoulderPressedWithPlayerIdEvent; // 0x0190(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> OnRightShoulderPressedWithPlayerIdEvent; // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, const int32& PlayerControllerIndex)> OnSpecialPressedWithPlayerIdEvent; // 0x01B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir)> OnUpKeyReleasedEvent; // 0x01C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir)> OnDownKeyReleasedEvent; // 0x01D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir)> OnLeftKeyReleasedEvent; // 0x01E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir)> OnRightKeyReleasedEvent; // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnAcceptKeyReleasedEvent;                  // 0x0200(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnBackKeyReleasedEvent;                    // 0x0210(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnFaceButtonLeftReleasedEvent;             // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnFaceButtonTopReleasedEvent;              // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnLeftShoulderReleasedEvent;               // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnRightShoulderReleasedEvent;              // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnLeftStickButtonReleasedEvent;            // 0x0260(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnRightStickButtonReleasedEvent;           // 0x0270(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object)> OnSpecialReleasedEvent;                    // 0x0280(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, const struct FVector2D& Value)> OnLeftStickAxisEvent; // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, const struct FVector2D& Value)> OnRightStickAxisEvent; // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, const struct FVector2D& Value, const int32& PlayerControllerIndex)> OnLeftStickAxisWithPlayerIdEvent; // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, const struct FVector2D& Value, const int32& PlayerControllerIndex)> OnRightStickAxisWithPlayerIdEvent; // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir, const int32& PlayerControllerIndex)> OnUpKeyReleasedWithPlayerIdEvent; // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir, const int32& PlayerControllerIndex)> OnDownKeyReleasedWithPlayerIdEvent; // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir, const int32& PlayerControllerIndex)> OnLeftKeyReleasedWithPlayerIdEvent; // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Object, EUnionUIControlDir Dir, const int32& PlayerControllerIndex)> OnRightKeyReleasedWithPlayerIdEvent; // 0x0300(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                         Pad_310[0x10];                                     // 0x0310(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MenuInputRecieveObject">();
	}
	static class UMenuInputRecieveObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenuInputRecieveObject>();
	}
};
static_assert(alignof(UMenuInputRecieveObject) == 0x000008, "Wrong alignment on UMenuInputRecieveObject");
static_assert(sizeof(UMenuInputRecieveObject) == 0x000320, "Wrong size on UMenuInputRecieveObject");
static_assert(offsetof(UMenuInputRecieveObject, OnUpKeyPressedEvent) == 0x000030, "Member 'UMenuInputRecieveObject::OnUpKeyPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnDownKeyPressedEvent) == 0x000040, "Member 'UMenuInputRecieveObject::OnDownKeyPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnLeftKeyPressedEvent) == 0x000050, "Member 'UMenuInputRecieveObject::OnLeftKeyPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnRightKeyPressedEvent) == 0x000060, "Member 'UMenuInputRecieveObject::OnRightKeyPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnAcceptKeyPressedEvent) == 0x000070, "Member 'UMenuInputRecieveObject::OnAcceptKeyPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnBackKeyPressedEvent) == 0x000080, "Member 'UMenuInputRecieveObject::OnBackKeyPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnFaceButtonLeftPressedEvent) == 0x000090, "Member 'UMenuInputRecieveObject::OnFaceButtonLeftPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnFaceButtonTopPressedEvent) == 0x0000A0, "Member 'UMenuInputRecieveObject::OnFaceButtonTopPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnLeftShoulderPressedEvent) == 0x0000B0, "Member 'UMenuInputRecieveObject::OnLeftShoulderPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnRightShoulderPressedEvent) == 0x0000C0, "Member 'UMenuInputRecieveObject::OnRightShoulderPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnLeftStickButtonPressedEvent) == 0x0000D0, "Member 'UMenuInputRecieveObject::OnLeftStickButtonPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnRightStickButtonPressedEvent) == 0x0000E0, "Member 'UMenuInputRecieveObject::OnRightStickButtonPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnSpecialPressedEvent) == 0x0000F0, "Member 'UMenuInputRecieveObject::OnSpecialPressedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnSpecialShotEvent) == 0x000100, "Member 'UMenuInputRecieveObject::OnSpecialShotEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnUpKeyPressedWithPlayerIdEvent) == 0x000110, "Member 'UMenuInputRecieveObject::OnUpKeyPressedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnDownKeyPressedWithPlayerIdEvent) == 0x000120, "Member 'UMenuInputRecieveObject::OnDownKeyPressedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnLeftKeyPressedWithPlayerIdEvent) == 0x000130, "Member 'UMenuInputRecieveObject::OnLeftKeyPressedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnRightKeyPressedWithPlayerIdEvent) == 0x000140, "Member 'UMenuInputRecieveObject::OnRightKeyPressedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnAcceptKeyPressedWithPlayerIdEvent) == 0x000150, "Member 'UMenuInputRecieveObject::OnAcceptKeyPressedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnBackKeyPressedWithPlayerIdEvent) == 0x000160, "Member 'UMenuInputRecieveObject::OnBackKeyPressedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnFaceButtonLeftPressedWithPlayerIdEvent) == 0x000170, "Member 'UMenuInputRecieveObject::OnFaceButtonLeftPressedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnFaceButtonTopPressedWithPlayerIdEvent) == 0x000180, "Member 'UMenuInputRecieveObject::OnFaceButtonTopPressedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnLeftShoulderPressedWithPlayerIdEvent) == 0x000190, "Member 'UMenuInputRecieveObject::OnLeftShoulderPressedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnRightShoulderPressedWithPlayerIdEvent) == 0x0001A0, "Member 'UMenuInputRecieveObject::OnRightShoulderPressedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnSpecialPressedWithPlayerIdEvent) == 0x0001B0, "Member 'UMenuInputRecieveObject::OnSpecialPressedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnUpKeyReleasedEvent) == 0x0001C0, "Member 'UMenuInputRecieveObject::OnUpKeyReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnDownKeyReleasedEvent) == 0x0001D0, "Member 'UMenuInputRecieveObject::OnDownKeyReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnLeftKeyReleasedEvent) == 0x0001E0, "Member 'UMenuInputRecieveObject::OnLeftKeyReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnRightKeyReleasedEvent) == 0x0001F0, "Member 'UMenuInputRecieveObject::OnRightKeyReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnAcceptKeyReleasedEvent) == 0x000200, "Member 'UMenuInputRecieveObject::OnAcceptKeyReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnBackKeyReleasedEvent) == 0x000210, "Member 'UMenuInputRecieveObject::OnBackKeyReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnFaceButtonLeftReleasedEvent) == 0x000220, "Member 'UMenuInputRecieveObject::OnFaceButtonLeftReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnFaceButtonTopReleasedEvent) == 0x000230, "Member 'UMenuInputRecieveObject::OnFaceButtonTopReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnLeftShoulderReleasedEvent) == 0x000240, "Member 'UMenuInputRecieveObject::OnLeftShoulderReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnRightShoulderReleasedEvent) == 0x000250, "Member 'UMenuInputRecieveObject::OnRightShoulderReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnLeftStickButtonReleasedEvent) == 0x000260, "Member 'UMenuInputRecieveObject::OnLeftStickButtonReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnRightStickButtonReleasedEvent) == 0x000270, "Member 'UMenuInputRecieveObject::OnRightStickButtonReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnSpecialReleasedEvent) == 0x000280, "Member 'UMenuInputRecieveObject::OnSpecialReleasedEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnLeftStickAxisEvent) == 0x000290, "Member 'UMenuInputRecieveObject::OnLeftStickAxisEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnRightStickAxisEvent) == 0x0002A0, "Member 'UMenuInputRecieveObject::OnRightStickAxisEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnLeftStickAxisWithPlayerIdEvent) == 0x0002B0, "Member 'UMenuInputRecieveObject::OnLeftStickAxisWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnRightStickAxisWithPlayerIdEvent) == 0x0002C0, "Member 'UMenuInputRecieveObject::OnRightStickAxisWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnUpKeyReleasedWithPlayerIdEvent) == 0x0002D0, "Member 'UMenuInputRecieveObject::OnUpKeyReleasedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnDownKeyReleasedWithPlayerIdEvent) == 0x0002E0, "Member 'UMenuInputRecieveObject::OnDownKeyReleasedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnLeftKeyReleasedWithPlayerIdEvent) == 0x0002F0, "Member 'UMenuInputRecieveObject::OnLeftKeyReleasedWithPlayerIdEvent' has a wrong offset!");
static_assert(offsetof(UMenuInputRecieveObject, OnRightKeyReleasedWithPlayerIdEvent) == 0x000300, "Member 'UMenuInputRecieveObject::OnRightKeyReleasedWithPlayerIdEvent' has a wrong offset!");

// Class UnionUI.RichTextBlockDefaultDecorator
// 0x0000 (0x0028 - 0x0028)
class URichTextBlockDefaultDecorator final : public URichTextBlockDecorator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RichTextBlockDefaultDecorator">();
	}
	static class URichTextBlockDefaultDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichTextBlockDefaultDecorator>();
	}
};
static_assert(alignof(URichTextBlockDefaultDecorator) == 0x000008, "Wrong alignment on URichTextBlockDefaultDecorator");
static_assert(sizeof(URichTextBlockDefaultDecorator) == 0x000028, "Wrong size on URichTextBlockDefaultDecorator");

// Class UnionUI.RichTextBlockRubyDecorator
// 0x0418 (0x0440 - 0x0028)
class URichTextBlockRubyDecorator : public URichTextBlockDecorator
{
public:
	int32                                         DisplayBaseTextStartIndex;                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OriginalLetterIndex;                               // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 TaggedContentOriginalIndex;                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ParseTagName;                                      // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 AttributeLabelName;                                // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 AttributeStyleName;                                // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   RubyTextStyleNameFormat;                           // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              RubyOffset;                                        // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideRubyStyle;                                // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        RubyTextStyleOverride;                             // 0x0090(0x0340)(Edit, Protected, NativeAccessSpecifierProtected)
	class FString                                 WithoutXmlString;                                  // 0x03D0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<int32, class FString>                    BaseIndex_RubyStringMap;                           // 0x03E0(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	int32                                         CalcedFontSize;                                    // 0x0430(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RubyFontSize;                                      // 0x0434(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateOriginalTextIndex(const int32 InOriginalTextIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RichTextBlockRubyDecorator">();
	}
	static class URichTextBlockRubyDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichTextBlockRubyDecorator>();
	}
};
static_assert(alignof(URichTextBlockRubyDecorator) == 0x000010, "Wrong alignment on URichTextBlockRubyDecorator");
static_assert(sizeof(URichTextBlockRubyDecorator) == 0x000440, "Wrong size on URichTextBlockRubyDecorator");
static_assert(offsetof(URichTextBlockRubyDecorator, DisplayBaseTextStartIndex) == 0x000028, "Member 'URichTextBlockRubyDecorator::DisplayBaseTextStartIndex' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, OriginalLetterIndex) == 0x00002C, "Member 'URichTextBlockRubyDecorator::OriginalLetterIndex' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, TaggedContentOriginalIndex) == 0x000030, "Member 'URichTextBlockRubyDecorator::TaggedContentOriginalIndex' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, ParseTagName) == 0x000040, "Member 'URichTextBlockRubyDecorator::ParseTagName' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, AttributeLabelName) == 0x000050, "Member 'URichTextBlockRubyDecorator::AttributeLabelName' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, AttributeStyleName) == 0x000060, "Member 'URichTextBlockRubyDecorator::AttributeStyleName' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, RubyTextStyleNameFormat) == 0x000070, "Member 'URichTextBlockRubyDecorator::RubyTextStyleNameFormat' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, RubyOffset) == 0x000078, "Member 'URichTextBlockRubyDecorator::RubyOffset' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, bOverrideRubyStyle) == 0x000088, "Member 'URichTextBlockRubyDecorator::bOverrideRubyStyle' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, RubyTextStyleOverride) == 0x000090, "Member 'URichTextBlockRubyDecorator::RubyTextStyleOverride' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, WithoutXmlString) == 0x0003D0, "Member 'URichTextBlockRubyDecorator::WithoutXmlString' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, BaseIndex_RubyStringMap) == 0x0003E0, "Member 'URichTextBlockRubyDecorator::BaseIndex_RubyStringMap' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, CalcedFontSize) == 0x000430, "Member 'URichTextBlockRubyDecorator::CalcedFontSize' has a wrong offset!");
static_assert(offsetof(URichTextBlockRubyDecorator, RubyFontSize) == 0x000434, "Member 'URichTextBlockRubyDecorator::RubyFontSize' has a wrong offset!");

// Class UnionUI.UICapture2DTargetInterface
// 0x0000 (0x0000 - 0x0000)
class IUICapture2DTargetInterface final
{
public:
	TArray<class AActor*> GetCaptureTargetActorArr();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UICapture2DTargetInterface">();
	}
	static class IUICapture2DTargetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUICapture2DTargetInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IUICapture2DTargetInterface) == 0x000001, "Wrong alignment on IUICapture2DTargetInterface");
static_assert(sizeof(IUICapture2DTargetInterface) == 0x000001, "Wrong size on IUICapture2DTargetInterface");

// Class UnionUI.UnionComboBoxString
// 0x0020 (0x1DF0 - 0x1DD0)
class UUnionComboBoxString final : public UComboBoxString
{
public:
	bool                                          IsInit;                                            // 0x1DD0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1DD1[0x1F];                                    // 0x1DD1(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FilterOptions(const class FString& FilterText);
	void InitializeOptions(const TArray<class FString>& Initialize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnionComboBoxString">();
	}
	static class UUnionComboBoxString* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnionComboBoxString>();
	}
};
static_assert(alignof(UUnionComboBoxString) == 0x000010, "Wrong alignment on UUnionComboBoxString");
static_assert(sizeof(UUnionComboBoxString) == 0x001DF0, "Wrong size on UUnionComboBoxString");
static_assert(offsetof(UUnionComboBoxString, IsInit) == 0x001DD0, "Member 'UUnionComboBoxString::IsInit' has a wrong offset!");

// Class UnionUI.UnionFontScroll
// 0x03E0 (0x06C0 - 0x02E0)
class UUnionFontScroll : public UUserWidget
{
public:
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRichTextBlock*                    TextWidgetChild;                                   // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URetainerBox*                           RetainerBoxChild;                                  // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Text;                                              // 0x02F8(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        TextStyleParameter;                                // 0x0310(0x0340)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	ETextJustify                                  TextJustification;                                 // 0x0650(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_651[0x3];                                      // 0x0651(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TextScrollSpeed;                                   // 0x0654(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TextStartScrollDelayTime;                          // 0x0658(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SizeBoxLimitX;                                     // 0x065C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndBlankCnt;                                       // 0x0660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SizeBoxAdjustValue;                                // 0x0664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanDisappearSlowly;                                // 0x0668(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GradiationSpeed;                                   // 0x066C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LeftVisible;                                       // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LeftAppearSpeed;                                   // 0x0674(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartLocationMultiplier;                           // 0x0678(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AdjustRetainerBoxSize;                             // 0x067C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CenterWhileNotScroll;                              // 0x0680(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LeftStartLocationWhenScroll;                       // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_690[0x30];                                     // 0x0690(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RefreshText();
	void SetIsRefreshingText(bool Refreshing);
	void SetText(const class FText& InText);
	void SetupTextScroll();
	void SetupTextStartPosition();
	void StartScroll();
	void StartScrollDelayEvent();
	void StopScroll();
	void UpdateText(const class FText& InText);
	void UpdateTextWithoutStartScroll(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnionFontScroll">();
	}
	static class UUnionFontScroll* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnionFontScroll>();
	}
};
static_assert(alignof(UUnionFontScroll) == 0x000010, "Wrong alignment on UUnionFontScroll");
static_assert(sizeof(UUnionFontScroll) == 0x0006C0, "Wrong size on UUnionFontScroll");
static_assert(offsetof(UUnionFontScroll, TextWidgetChild) == 0x0002E8, "Member 'UUnionFontScroll::TextWidgetChild' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, RetainerBoxChild) == 0x0002F0, "Member 'UUnionFontScroll::RetainerBoxChild' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, Text) == 0x0002F8, "Member 'UUnionFontScroll::Text' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, TextStyleParameter) == 0x000310, "Member 'UUnionFontScroll::TextStyleParameter' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, TextJustification) == 0x000650, "Member 'UUnionFontScroll::TextJustification' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, TextScrollSpeed) == 0x000654, "Member 'UUnionFontScroll::TextScrollSpeed' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, TextStartScrollDelayTime) == 0x000658, "Member 'UUnionFontScroll::TextStartScrollDelayTime' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, SizeBoxLimitX) == 0x00065C, "Member 'UUnionFontScroll::SizeBoxLimitX' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, EndBlankCnt) == 0x000660, "Member 'UUnionFontScroll::EndBlankCnt' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, SizeBoxAdjustValue) == 0x000664, "Member 'UUnionFontScroll::SizeBoxAdjustValue' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, CanDisappearSlowly) == 0x000668, "Member 'UUnionFontScroll::CanDisappearSlowly' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, GradiationSpeed) == 0x00066C, "Member 'UUnionFontScroll::GradiationSpeed' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, LeftVisible) == 0x000670, "Member 'UUnionFontScroll::LeftVisible' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, LeftAppearSpeed) == 0x000674, "Member 'UUnionFontScroll::LeftAppearSpeed' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, StartLocationMultiplier) == 0x000678, "Member 'UUnionFontScroll::StartLocationMultiplier' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, AdjustRetainerBoxSize) == 0x00067C, "Member 'UUnionFontScroll::AdjustRetainerBoxSize' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, CenterWhileNotScroll) == 0x000680, "Member 'UUnionFontScroll::CenterWhileNotScroll' has a wrong offset!");
static_assert(offsetof(UUnionFontScroll, LeftStartLocationWhenScroll) == 0x000688, "Member 'UUnionFontScroll::LeftStartLocationWhenScroll' has a wrong offset!");

// Class UnionUI.UnionLoadingGauge
// 0x0008 (0x02E8 - 0x02E0)
class UUnionLoadingGauge : public UUserWidget
{
public:
	EUnionLoadingGaugeState                       LoadingGaugeNowState;                              // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUnionLoadingGaugeState                       LoadingGaugeTargetState;                           // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E2[0x2];                                      // 0x02E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GaugeAnimationRate;                                // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool IsEqLoadingGaugeState();
	bool IsSkipLoadingGaugeState();
	bool IsTargetStateBigger();
	void ProceedTargetState();
	void SkipNowState();
	void UpdateLoadingGaugeTargetState(EUnionLoadingGaugeState InTargetState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnionLoadingGauge">();
	}
	static class UUnionLoadingGauge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnionLoadingGauge>();
	}
};
static_assert(alignof(UUnionLoadingGauge) == 0x000008, "Wrong alignment on UUnionLoadingGauge");
static_assert(sizeof(UUnionLoadingGauge) == 0x0002E8, "Wrong size on UUnionLoadingGauge");
static_assert(offsetof(UUnionLoadingGauge, LoadingGaugeNowState) == 0x0002E0, "Member 'UUnionLoadingGauge::LoadingGaugeNowState' has a wrong offset!");
static_assert(offsetof(UUnionLoadingGauge, LoadingGaugeTargetState) == 0x0002E1, "Member 'UUnionLoadingGauge::LoadingGaugeTargetState' has a wrong offset!");
static_assert(offsetof(UUnionLoadingGauge, GaugeAnimationRate) == 0x0002E4, "Member 'UUnionLoadingGauge::GaugeAnimationRate' has a wrong offset!");

// Class UnionUI.MouseButtonBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMouseButtonBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool IsEnableMouseClick();
	static bool IsEnableMouseHover();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MouseButtonBlueprintFunctionLibrary">();
	}
	static class UMouseButtonBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMouseButtonBlueprintFunctionLibrary>();
	}
};
static_assert(alignof(UMouseButtonBlueprintFunctionLibrary) == 0x000008, "Wrong alignment on UMouseButtonBlueprintFunctionLibrary");
static_assert(sizeof(UMouseButtonBlueprintFunctionLibrary) == 0x000028, "Wrong size on UMouseButtonBlueprintFunctionLibrary");

// Class UnionUI.UnionRichTextBlockImageDecorator
// 0x0010 (0x0040 - 0x0030)
class UUnionRichTextBlockImageDecorator : public URichTextBlockImageDecorator
{
public:
	class UDataTable*                             OverrideImageSet;                                  // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayerIndex;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEachPlayerSetting;                                // 0x003C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FindResorceObject(class FName TagOrId, class UObject* OutObject);
	void FindRichImageRow(class FName TagOrId, struct FRichImageRow* OutRichImageRow);
	void FindRichSlateBrush(class FName TagOrId, struct FSlateBrush* OutSlateBrush);
	void SetEachPlayer(bool InEachPlayer);
	void SetPlayerIndex(int32 InIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnionRichTextBlockImageDecorator">();
	}
	static class UUnionRichTextBlockImageDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnionRichTextBlockImageDecorator>();
	}
};
static_assert(alignof(UUnionRichTextBlockImageDecorator) == 0x000008, "Wrong alignment on UUnionRichTextBlockImageDecorator");
static_assert(sizeof(UUnionRichTextBlockImageDecorator) == 0x000040, "Wrong size on UUnionRichTextBlockImageDecorator");
static_assert(offsetof(UUnionRichTextBlockImageDecorator, OverrideImageSet) == 0x000030, "Member 'UUnionRichTextBlockImageDecorator::OverrideImageSet' has a wrong offset!");
static_assert(offsetof(UUnionRichTextBlockImageDecorator, PlayerIndex) == 0x000038, "Member 'UUnionRichTextBlockImageDecorator::PlayerIndex' has a wrong offset!");
static_assert(offsetof(UUnionRichTextBlockImageDecorator, bEachPlayerSetting) == 0x00003C, "Member 'UUnionRichTextBlockImageDecorator::bEachPlayerSetting' has a wrong offset!");

// Class UnionUI.UnionScreenCaptureActor
// 0x0028 (0x02B8 - 0x0290)
class AUnionScreenCaptureActor final : public AActor
{
public:
	class FString                                 FileNameBase;                                      // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B0[0x8];                                      // 0x02B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void SaveTextureToFile(class UTextureRenderTarget2D* InRenderTarget, const TArray<struct FColor>& Bitmap, const class FString& InFilePath);

	void CaptureScreen();
	class UTextureRenderTarget2D* GetTextureRenderTarget2D();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnionScreenCaptureActor">();
	}
	static class AUnionScreenCaptureActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUnionScreenCaptureActor>();
	}
};
static_assert(alignof(AUnionScreenCaptureActor) == 0x000008, "Wrong alignment on AUnionScreenCaptureActor");
static_assert(sizeof(AUnionScreenCaptureActor) == 0x0002B8, "Wrong size on AUnionScreenCaptureActor");
static_assert(offsetof(AUnionScreenCaptureActor, FileNameBase) == 0x000290, "Member 'AUnionScreenCaptureActor::FileNameBase' has a wrong offset!");
static_assert(offsetof(AUnionScreenCaptureActor, Width) == 0x0002A0, "Member 'AUnionScreenCaptureActor::Width' has a wrong offset!");
static_assert(offsetof(AUnionScreenCaptureActor, Height) == 0x0002A4, "Member 'AUnionScreenCaptureActor::Height' has a wrong offset!");
static_assert(offsetof(AUnionScreenCaptureActor, RenderTarget) == 0x0002A8, "Member 'AUnionScreenCaptureActor::RenderTarget' has a wrong offset!");

// Class UnionUI.UnionStickerCamera
// 0x0000 (0x02A8 - 0x02A8)
class AUnionStickerCamera final : public ASceneCapture2D
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnionStickerCamera">();
	}
	static class AUnionStickerCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUnionStickerCamera>();
	}
};
static_assert(alignof(AUnionStickerCamera) == 0x000008, "Wrong alignment on AUnionStickerCamera");
static_assert(sizeof(AUnionStickerCamera) == 0x0002A8, "Wrong size on AUnionStickerCamera");

// Class UnionUI.UnionStickerFrame
// 0x0008 (0x0298 - 0x0290)
class AUnionStickerFrame final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AddStaticMeshComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnionStickerFrame">();
	}
	static class AUnionStickerFrame* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUnionStickerFrame>();
	}
};
static_assert(alignof(AUnionStickerFrame) == 0x000008, "Wrong alignment on AUnionStickerFrame");
static_assert(sizeof(AUnionStickerFrame) == 0x000298, "Wrong size on AUnionStickerFrame");
static_assert(offsetof(AUnionStickerFrame, StaticMeshComponent) == 0x000290, "Member 'AUnionStickerFrame::StaticMeshComponent' has a wrong offset!");

// Class UnionUI.UnionStickerRenderTarget
// 0x0008 (0x0030 - 0x0028)
class UUnionStickerRenderTarget final : public UObject
{
public:
