#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnionRun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Hedgehog_classes.hpp"
#include "UnionRun_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionSystem_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "PhysicsCore_classes.hpp"


namespace SDK
{

// Class UnionRun.AreaBoxInterface
// 0x0000 (0x0000 - 0x0000)
class IAreaBoxInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AreaBoxInterface">();
	}
	static class IAreaBoxInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAreaBoxInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IAreaBoxInterface) == 0x000001, "Wrong alignment on IAreaBoxInterface");
static_assert(sizeof(IAreaBoxInterface) == 0x000001, "Wrong size on IAreaBoxInterface");

// Class UnionRun.UnionCourseObjectBase
// 0x00B0 (0x0340 - 0x0290)
class AUnionCourseObjectBase : public AActor
{
public:
	ECourseObjType                                CourseObjType;                                     // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VioletVoidAbsorbTargetScale;                       // 0x0298(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUnionSplineMoveComponent*              SplineMoveComponent;                               // 0x02B0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUnionRoundTripMoveComponent*           RoundTripMoveComponent;                            // 0x02B8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x10];                                     // 0x02C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsRingGateHidden;                                 // 0x02D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECourseObjColType                             ColType;                                           // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsAttachMove;                                     // 0x02D2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsMove;                                           // 0x02D3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsRoundTripMove;                                  // 0x02D4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AttachOffsetLocation;                              // 0x02D8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                 ParentSkeletalMeshComponent;                       // 0x02F0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AttachSocketName;                                  // 0x02F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x8];                                      // 0x0300(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             RoundTripDataTable;                                // 0x0308(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EObjectPlacementType                          ObjectPlacementType;                               // 0x0310(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IgnoreGimmickCurringDataTable;                     // 0x0311(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ERandomObjType                                RandomObjType;                                     // 0x0312(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_313[0x1];                                      // 0x0313(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PatternRandomId;                                   // 0x0314(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         LinkActorArray;                                    // 0x0318(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_328[0x18];                                     // 0x0328(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckIsValidParentActor();
	const EObjectPlacementType GetObjectPlacementType();
	const int32 GetPatternRandomId();
	void SetDomainIndex(EDomainIndex Index_0);
	void SetDomainNumber(EDomainNumber Number);
	void SetPatternRandomId(int32 ID);
	void SetRandomObjectType(ERandomObjType Type);

	EDomainNumber GetDomainNumber() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnionCourseObjectBase">();
	}
	static class AUnionCourseObjectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUnionCourseObjectBase>();
	}
};
static_assert(alignof(AUnionCourseObjectBase) == 0x000008, "Wrong alignment on AUnionCourseObjectBase");
static_assert(sizeof(AUnionCourseObjectBase) == 0x000340, "Wrong size on AUnionCourseObjectBase");
static_assert(offsetof(AUnionCourseObjectBase, CourseObjType) == 0x000290, "Member 'AUnionCourseObjectBase::CourseObjType' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, VioletVoidAbsorbTargetScale) == 0x000298, "Member 'AUnionCourseObjectBase::VioletVoidAbsorbTargetScale' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, SplineMoveComponent) == 0x0002B0, "Member 'AUnionCourseObjectBase::SplineMoveComponent' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, RoundTripMoveComponent) == 0x0002B8, "Member 'AUnionCourseObjectBase::RoundTripMoveComponent' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, bIsRingGateHidden) == 0x0002D0, "Member 'AUnionCourseObjectBase::bIsRingGateHidden' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, ColType) == 0x0002D1, "Member 'AUnionCourseObjectBase::ColType' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, bIsAttachMove) == 0x0002D2, "Member 'AUnionCourseObjectBase::bIsAttachMove' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, bIsMove) == 0x0002D3, "Member 'AUnionCourseObjectBase::bIsMove' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, bIsRoundTripMove) == 0x0002D4, "Member 'AUnionCourseObjectBase::bIsRoundTripMove' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, AttachOffsetLocation) == 0x0002D8, "Member 'AUnionCourseObjectBase::AttachOffsetLocation' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, ParentSkeletalMeshComponent) == 0x0002F0, "Member 'AUnionCourseObjectBase::ParentSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, AttachSocketName) == 0x0002F8, "Member 'AUnionCourseObjectBase::AttachSocketName' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, RoundTripDataTable) == 0x000308, "Member 'AUnionCourseObjectBase::RoundTripDataTable' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, ObjectPlacementType) == 0x000310, "Member 'AUnionCourseObjectBase::ObjectPlacementType' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, IgnoreGimmickCurringDataTable) == 0x000311, "Member 'AUnionCourseObjectBase::IgnoreGimmickCurringDataTable' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, RandomObjType) == 0x000312, "Member 'AUnionCourseObjectBase::RandomObjType' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, PatternRandomId) == 0x000314, "Member 'AUnionCourseObjectBase::PatternRandomId' has a wrong offset!");
static_assert(offsetof(AUnionCourseObjectBase, LinkActorArray) == 0x000318, "Member 'AUnionCourseObjectBase::LinkActorArray' has a wrong offset!");

// Class UnionRun.UnionGimmickObjectBase
// 0x0270 (0x05B0 - 0x0340)
class AUnionGimmickObjectBase : public AUnionCourseObjectBase
{
public:
	uint8                                         Pad_340[0x220];                                    // 0x0340(0x0220)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          ComAvoid;                                          // 0x0560(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_561[0x3];                                      // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ComAvoidWidth;                                     // 0x0564(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETimingGimmickType                            TimingGimmickType;                                 // 0x0568(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ComBeneficial;                                     // 0x0569(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_56A[0x1];                                      // 0x056A(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsVioletVoidTarget;                               // 0x056B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGimmickContactType                           GimmickContactType;                                // 0x056C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsBackGroundGimmick;                              // 0x056D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_56E[0x42];                                     // 0x056E(0x0042)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnionGimmickObjectBase">();
	}
	static class AUnionGimmickObjectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUnionGimmickObjectBase>();
	}
};
static_assert(alignof(AUnionGimmickObjectBase) == 0x000008, "Wrong alignment on AUnionGimmickObjectBase");
static_assert(sizeof(AUnionGimmickObjectBase) == 0x0005B0, "Wrong size on AUnionGimmickObjectBase");
static_assert(offsetof(AUnionGimmickObjectBase, ComAvoid) == 0x000560, "Member 'AUnionGimmickObjectBase::ComAvoid' has a wrong offset!");
static_assert(offsetof(AUnionGimmickObjectBase, ComAvoidWidth) == 0x000564, "Member 'AUnionGimmickObjectBase::ComAvoidWidth' has a wrong offset!");
static_assert(offsetof(AUnionGimmickObjectBase, TimingGimmickType) == 0x000568, "Member 'AUnionGimmickObjectBase::TimingGimmickType' has a wrong offset!");
static_assert(offsetof(AUnionGimmickObjectBase, ComBeneficial) == 0x000569, "Member 'AUnionGimmickObjectBase::ComBeneficial' has a wrong offset!");
static_assert(offsetof(AUnionGimmickObjectBase, bIsVioletVoidTarget) == 0x00056B, "Member 'AUnionGimmickObjectBase::bIsVioletVoidTarget' has a wrong offset!");
static_assert(offsetof(AUnionGimmickObjectBase, GimmickContactType) == 0x00056C, "Member 'AUnionGimmickObjectBase::GimmickContactType' has a wrong offset!");
static_assert(offsetof(AUnionGimmickObjectBase, bIsBackGroundGimmick) == 0x00056D, "Member 'AUnionGimmickObjectBase::bIsBackGroundGimmick' has a wrong offset!");

// Class UnionRun.GimmickBigBakubaku
// 0x0060 (0x0610 - 0x05B0)
class alignas(0x10) AGimmickBigBakubaku final : public AUnionGimmickObjectBase
{
public:
	uint8                                         Pad_5B0[0x8];                                      // 0x05B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         GFurComponent;                                     // 0x05B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUnionSkeletalMeshComponent*            SkeletalMeshComponent;                             // 0x05C0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGimmickStaticBodyComponent*            ToothCenterStaticBody;                             // 0x05C8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGimmickStaticBodyComponent*            ToothLeft1StaticBody;                              // 0x05D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGimmickStaticBodyComponent*            ToothLeft2StaticBody;                              // 0x05D8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGimmickStaticBodyComponent*            ToothRight1StaticBody;                             // 0x05E0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGimmickStaticBodyComponent*            ToothRight2StaticBody;                             // 0x05E8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ERacerDamageType                              _DamageType;                                       // 0x05F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          AnimSequence;                                      // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentDeltaTime;                                  // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          m_Init;                                            // 0x0604(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_605[0xB];                                      // 0x0605(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InitStaticBody(const class UGimmickStaticBodyComponent* StaticBody, class FName SocketName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GimmickBigBakubaku">();
	}
	static class AGimmickBigBakubaku* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGimmickBigBakubaku>();
	}
};
static_assert(alignof(AGimmickBigBakubaku) == 0x000010, "Wrong alignment on AGimmickBigBakubaku");
static_assert(sizeof(AGimmickBigBakubaku) == 0x000610, "Wrong size on AGimmickBigBakubaku");
static_assert(offsetof(AGimmickBigBakubaku, GFurComponent) == 0x0005B8, "Member 'AGimmickBigBakubaku::GFurComponent' has a wrong offset!");
static_assert(offsetof(AGimmickBigBakubaku, SkeletalMeshComponent) == 0x0005C0, "Member 'AGimmickBigBakubaku::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(AGimmickBigBakubaku, ToothCenterStaticBody) == 0x0005C8, "Member 'AGimmickBigBakubaku::ToothCenterStaticBody' has a wrong offset!");
static_assert(offsetof(AGimmickBigBakubaku, ToothLeft1StaticBody) == 0x0005D0, "Member 'AGimmickBigBakubaku::ToothLeft1StaticBody' has a wrong offset!");
static_assert(offsetof(AGimmickBigBakubaku, ToothLeft2StaticBody) == 0x0005D8, "Member 'AGimmickBigBakubaku::ToothLeft2StaticBody' has a wrong offset!");
static_assert(offsetof(AGimmickBigBakubaku, ToothRight1StaticBody) == 0x0005E0, "Member 'AGimmickBigBakubaku::ToothRight1StaticBody' has a wrong offset!");
static_assert(offsetof(AGimmickBigBakubaku, ToothRight2StaticBody) == 0x0005E8, "Member 'AGimmickBigBakubaku::ToothRight2StaticBody' has a wrong offset!");
static_assert(offsetof(AGimmickBigBakubaku, _DamageType) == 0x0005F0, "Member 'AGimmickBigBakubaku::_DamageType' has a wrong offset!");
static_assert(offsetof(AGimmickBigBakubaku, AnimSequence) == 0x0005F8, "Member 'AGimmickBigBakubaku::AnimSequence' has a wrong offset!");
static_assert(offsetof(AGimmickBigBakubaku, CurrentDeltaTime) == 0x000600, "Member 'AGimmickBigBakubaku::CurrentDeltaTime' has a wrong offset!");
static_assert(offsetof(AGimmickBigBakubaku, m_Init) == 0x000604, "Member 'AGimmickBigBakubaku::m_Init' has a wrong offset!");

// Class UnionRun.AreaCollisionInterface
// 0x0000 (0x0000 - 0x0000)
class IAreaCollisionInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AreaCollisionInterface">();
	}
	static class IAreaCollisionInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAreaCollisionInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IAreaCollisionInterface) == 0x000001, "Wrong alignment on IAreaCollisionInterface");
static_assert(sizeof(IAreaCollisionInterface) == 0x000001, "Wrong size on IAreaCollisionInterface");

// Class UnionRun.AreaDataDividedCourseCollisions
// 0x0108 (0x0130 - 0x0028)
class UAreaDataDividedCourseCollisions final : public UObject
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAreaDataCourseColSettings             Settings;                                          // 0x0090(0x0050)(NativeAccessSpecifierPublic)
	struct FAreaDataCourseColContents             Contents;                                          // 0x00E0(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AreaDataDividedCourseCollisions">();
	}
	static class UAreaDataDividedCourseCollisions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAreaDataDividedCourseCollisions>();
	}
};
static_assert(alignof(UAreaDataDividedCourseCollisions) == 0x000008, "Wrong alignment on UAreaDataDividedCourseCollisions");
static_assert(sizeof(UAreaDataDividedCourseCollisions) == 0x000130, "Wrong size on UAreaDataDividedCourseCollisions");
static_assert(offsetof(UAreaDataDividedCourseCollisions, Settings) == 0x000090, "Member 'UAreaDataDividedCourseCollisions::Settings' has a wrong offset!");
static_assert(offsetof(UAreaDataDividedCourseCollisions, Contents) == 0x0000E0, "Member 'UAreaDataDividedCourseCollisions::Contents' has a wrong offset!");

// Class UnionRun.EnemyAnimInstance
// 0x0000 (0x0370 - 0x0370)
#pragma pack(push, 0x1)
class alignas(0x10) UEnemyAnimInstance : public UAnimInstance
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnemyAnimInstance">();
	}
	static class UEnemyAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnemyAnimInstance>();
	}
};
#pragma pack(pop)
static_assert(alignof(UEnemyAnimInstance) == 0x000010, "Wrong alignment on UEnemyAnimInstance");
static_assert(sizeof(UEnemyAnimInstance) == 0x000370, "Wrong size on UEnemyAnimInstance");

// Class UnionRun.IntervalVATObject
// 0x0020 (0x02B0 - 0x0290)
class AIntervalVATObject : public AActor
{
public:
	class UUnionVATMeshComponent*                 VATMeshComponent;                                  // 0x0290(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         IntervalTime;                                      // 0x0298(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         StartTime;                                         // 0x029C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EventTime;                                         // 0x02A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A4[0xC];                                      // 0x02A4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IntervalVATObject">();
	}
	static class AIntervalVATObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIntervalVATObject>();
	}
};
static_assert(alignof(AIntervalVATObject) == 0x000008, "Wrong alignment on AIntervalVATObject");
static_assert(sizeof(AIntervalVATObject) == 0x0002B0, "Wrong size on AIntervalVATObject");
static_assert(offsetof(AIntervalVATObject, VATMeshComponent) == 0x000290, "Member 'AIntervalVATObject::VATMeshComponent' has a wrong offset!");
static_assert(offsetof(AIntervalVATObject, IntervalTime) == 0x000298, "Member 'AIntervalVATObject::IntervalTime' has a wrong offset!");
static_assert(offsetof(AIntervalVATObject, StartTime) == 0x00029C, "Member 'AIntervalVATObject::StartTime' has a wrong offset!");
static_assert(offsetof(AIntervalVATObject, EventTime) == 0x0002A0, "Member 'AIntervalVATObject::EventTime' has a wrong offset!");

// Class UnionRun.GimmickMechaFish
// 0x0020 (0x02D0 - 0x02B0)
class AGimmickMechaFish final : public AIntervalVATObject
{
public:
	class UNiagaraComponent*                      JumpStartEffect;                                   // 0x02B0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      JumpEndEffect;                                     // 0x02B8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUnionAtomComponent*                    JumpStartSound;                                    // 0x02C0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUnionAtomComponent*                    JumpEndSound;                                      // 0x02C8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GimmickMechaFish">();
	}
	static class AGimmickMechaFish* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGimmickMechaFish>();
	}
};
static_assert(alignof(AGimmickMechaFish) == 0x000008, "Wrong alignment on AGimmickMechaFish");
static_assert(sizeof(AGimmickMechaFish) == 0x0002D0, "Wrong size on AGimmickMechaFish");
static_assert(offsetof(AGimmickMechaFish, JumpStartEffect) == 0x0002B0, "Member 'AGimmickMechaFish::JumpStartEffect' has a wrong offset!");
static_assert(offsetof(AGimmickMechaFish, JumpEndEffect) == 0x0002B8, "Member 'AGimmickMechaFish::JumpEndEffect' has a wrong offset!");
static_assert(offsetof(AGimmickMechaFish, JumpStartSound) == 0x0002C0, "Member 'AGimmickMechaFish::JumpStartSound' has a wrong offset!");
static_assert(offsetof(AGimmickMechaFish, JumpEndSound) == 0x0002C8, "Member 'AGimmickMechaFish::JumpEndSound' has a wrong offset!");

// Class UnionRun.AsuraAnimInstance
// 0x0000 (0x0370 - 0x0370)
class UAsuraAnimInstance final : public UEnemyAnimInstance
{
public:
	void SetAsuraState(EAsuraState State);

	bool IsAsuraState(EAsuraState State) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsuraAnimInstance">();
	}
	static class UAsuraAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsuraAnimInstance>();
	}
};
static_assert(alignof(UAsuraAnimInstance) == 0x000010, "Wrong alignment on UAsuraAnimInstance");
static_assert(sizeof(UAsuraAnimInstance) == 0x000370, "Wrong size on UAsuraAnimInstance");

// Class UnionRun.RaceLogUtil
// 0x0000 (0x0028 - 0x0028)
class URaceLogUtil final : public UBlueprintFunctionLibrary
{
public:
	static class FString GetRacerLapInfo(int32 RacerIndex);
	static class FString GetRacerStatusInfo(int32 RacerIndex);
	static void PrintRaceLog(int32 RacerIndex, const class FString& str, const class FString& at);
	static void PrintRunLog(int32 RacerIndex, const class FString& str, const class FString& at);
	static void PrintWarpLog(int32 RacerIndex, const class FString& str, const class FString& at);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RaceLogUtil">();
	}
	static class URaceLogUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<URaceLogUtil>();
	}
};
static_assert(alignof(URaceLogUtil) == 0x000008, "Wrong alignment on URaceLogUtil");
static_assert(sizeof(URaceLogUtil) == 0x000028, "Wrong size on URaceLogUtil");

// Class UnionRun.AttackReplyInterface
// 0x0000 (0x0000 - 0x0000)
class IAttackReplyInterface final
{
public:
	void NotifyAttackFailed(const struct FAttackReply& Info);
	void NotifyAttackFinishOverwritten(const struct FAttackReply& Info);
	void NotifyAttackFinishSucceed(const struct FAttackReply& Info);
	void NotifyAttackMissingShot(const struct FAttackReply& Info);
	void NotifyAttackPauseEnd(const struct FAttackReply& Info);
	void NotifyAttackPauseStart(const struct FAttackReply& Info);
	void NotifyAttackSucced(const struct FAttackReply& Info);
	void NotifyAttackTimeElapsed(const struct FAttackReply& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttackReplyInterface">();
	}
	static class IAttackReplyInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAttackReplyInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IAttackReplyInterface) == 0x000001, "Wrong alignment on IAttackReplyInterface");
static_assert(sizeof(IAttackReplyInterface) == 0x000001, "Wrong size on IAttackReplyInterface");

// Class UnionRun.UnionCameraBase
// 0x0048 (0x02D8 - 0x0290)
class AUnionCameraBase : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        Root;                                              // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraComponent*                       Camera;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoStart;                                        // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRacerCameraDomainNumber;                       // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRacerCameraFOV;                                // 0x02AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUnionCameraPriority                          Priority;                                          // 0x02AB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FViewTargetTransitionParams            StartBlendSetting;                                 // 0x02AC(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FViewTargetTransitionParams            EndBlendSetting;                                   // 0x02BC(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         RacerIndex;                                        // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDomainNumber                                 DomainNumber;                                      // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsCurrentViewTarget();
	bool IsInBlending();
	bool RequestEndCamera();
	bool RequestStartCamera();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnionCameraBase">();
	}
	static class AUnionCameraBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUnionCameraBase>();
	}
};
static_assert(alignof(AUnionCameraBase) == 0x000008, "Wrong alignment on AUnionCameraBase");
static_assert(sizeof(AUnionCameraBase) == 0x0002D8, "Wrong size on AUnionCameraBase");
static_assert(offsetof(AUnionCameraBase, Root) == 0x000298, "Member 'AUnionCameraBase::Root' has a wrong offset!");
static_assert(offsetof(AUnionCameraBase, Camera) == 0x0002A0, "Member 'AUnionCameraBase::Camera' has a wrong offset!");
static_assert(offsetof(AUnionCameraBase, bAutoStart) == 0x0002A8, "Member 'AUnionCameraBase::bAutoStart' has a wrong offset!");
static_assert(offsetof(AUnionCameraBase, bUseRacerCameraDomainNumber) == 0x0002A9, "Member 'AUnionCameraBase::bUseRacerCameraDomainNumber' has a wrong offset!");
static_assert(offsetof(AUnionCameraBase, bUseRacerCameraFOV) == 0x0002AA, "Member 'AUnionCameraBase::bUseRacerCameraFOV' has a wrong offset!");
static_assert(offsetof(AUnionCameraBase, Priority) == 0x0002AB, "Member 'AUnionCameraBase::Priority' has a wrong offset!");
static_assert(offsetof(AUnionCameraBase, StartBlendSetting) == 0x0002AC, "Member 'AUnionCameraBase::StartBlendSetting' has a wrong offset!");
static_assert(offsetof(AUnionCameraBase, EndBlendSetting) == 0x0002BC, "Member 'AUnionCameraBase::EndBlendSetting' has a wrong offset!");
static_assert(offsetof(AUnionCameraBase, RacerIndex) == 0x0002CC, "Member 'AUnionCameraBase::RacerIndex' has a wrong offset!");
static_assert(offsetof(AUnionCameraBase, DomainNumber) == 0x0002D0, "Member 'AUnionCameraBase::DomainNumber' has a wrong offset!");

// Class UnionRun.ReplayFixedCameraFocus
// 0x0050 (0x0328 - 0x02D8)
class AReplayFixedCameraFocus final : public AUnionCameraBase
{
public:
	class USceneComponent*                        CameraRoot;                                        // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        FocusTarget;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 FocusTargetActor;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFovBlend;                                      // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartFovBlend;                                     // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndFovBlend;                                       // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpTime;                                        // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEasingFunc                                   EasingFunc;                                        // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InterpExp;                                         // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetOffset;                                      // 0x0308(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_320[0x8];                                      // 0x0320(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReplayFixedCameraFocus">();
	}
	static class AReplayFixedCameraFocus* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReplayFixedCameraFocus>();
	}
};
static_assert(alignof(AReplayFixedCameraFocus) == 0x000008, "Wrong alignment on AReplayFixedCameraFocus");
static_assert(sizeof(AReplayFixedCameraFocus) == 0x000328, "Wrong size on AReplayFixedCameraFocus");
static_assert(offsetof(AReplayFixedCameraFocus, CameraRoot) == 0x0002D8, "Member 'AReplayFixedCameraFocus::CameraRoot' has a wrong offset!");
static_assert(offsetof(AReplayFixedCameraFocus, FocusTarget) == 0x0002E0, "Member 'AReplayFixedCameraFocus::FocusTarget' has a wrong offset!");
static_assert(offsetof(AReplayFixedCameraFocus, FocusTargetActor) == 0x0002E8, "Member 'AReplayFixedCameraFocus::FocusTargetActor' has a wrong offset!");
static_assert(offsetof(AReplayFixedCameraFocus, bUseFovBlend) == 0x0002F0, "Member 'AReplayFixedCameraFocus::bUseFovBlend' has a wrong offset!");
static_assert(offsetof(AReplayFixedCameraFocus, StartFovBlend) == 0x0002F4, "Member 'AReplayFixedCameraFocus::StartFovBlend' has a wrong offset!");
static_assert(offsetof(AReplayFixedCameraFocus, EndFovBlend) == 0x0002F8, "Member 'AReplayFixedCameraFocus::EndFovBlend' has a wrong offset!");
static_assert(offsetof(AReplayFixedCameraFocus, InterpTime) == 0x0002FC, "Member 'AReplayFixedCameraFocus::InterpTime' has a wrong offset!");
static_assert(offsetof(AReplayFixedCameraFocus, EasingFunc) == 0x000300, "Member 'AReplayFixedCameraFocus::EasingFunc' has a wrong offset!");
static_assert(offsetof(AReplayFixedCameraFocus, InterpExp) == 0x000304, "Member 'AReplayFixedCameraFocus::InterpExp' has a wrong offset!");
static_assert(offsetof(AReplayFixedCameraFocus, TargetOffset) == 0x000308, "Member 'AReplayFixedCameraFocus::TargetOffset' has a wrong offset!");

// Class UnionRun.BoostPadObject
// 0x01D0 (0x0780 - 0x05B0)
class alignas(0x10) ABoostPadObject final : public AUnionGimmickObjectBase
{
public:
	class UUnionVATMeshComponent*                 VATMeshComponent;                                  // 0x05B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticBodyComponent*                   StaticBodyComponent;                               // 0x05B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoostPadType                                 BoostPadType;                                      // 0x05C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C1[0x3];                                      // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoostGateRadius;                                   // 0x05C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIrregular;                                      // 0x05C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            BoostPadMeshByType[0xA];                           // 0x05D0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            SpecialBoostPadMeshByType[0xA];                    // 0x0620(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         PassThroughFX;                                     // 0x0670(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CollisionExtentsByType[0xA];                       // 0x0678(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpecificId;                                        // 0x0768(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHiddenMesh;                                     // 0x076C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_76D[0x3];                                      // 0x076D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0770(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_778[0x3];                                      // 0x0778(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          m_bIsSpecial;                                      // 0x077B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESpecialObjGroup                              m_SpecialGroup;                                    // 0x077C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_77D[0x3];                                      // 0x077D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnVATUpdate(class UUnionVATMeshComponent* VATComponent, const struct FUnionVATSequenceInfo& SequenceInfo);
	void SetBoostPadType(EBoostPadType Type, bool IsSpecial);
	void SetGateScaleRate(float Rate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoostPadObject">();
	}
	static class ABoostPadObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABoostPadObject>();
	}
};
static_assert(alignof(ABoostPadObject) == 0x000010, "Wrong alignment on ABoostPadObject");
static_assert(sizeof(ABoostPadObject) == 0x000780, "Wrong size on ABoostPadObject");
static_assert(offsetof(ABoostPadObject, VATMeshComponent) == 0x0005B0, "Member 'ABoostPadObject::VATMeshComponent' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, StaticBodyComponent) == 0x0005B8, "Member 'ABoostPadObject::StaticBodyComponent' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, BoostPadType) == 0x0005C0, "Member 'ABoostPadObject::BoostPadType' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, BoostGateRadius) == 0x0005C4, "Member 'ABoostPadObject::BoostGateRadius' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, bInIrregular) == 0x0005C8, "Member 'ABoostPadObject::bInIrregular' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, BoostPadMeshByType) == 0x0005D0, "Member 'ABoostPadObject::BoostPadMeshByType' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, SpecialBoostPadMeshByType) == 0x000620, "Member 'ABoostPadObject::SpecialBoostPadMeshByType' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, PassThroughFX) == 0x000670, "Member 'ABoostPadObject::PassThroughFX' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, CollisionExtentsByType) == 0x000678, "Member 'ABoostPadObject::CollisionExtentsByType' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, SpecificId) == 0x000768, "Member 'ABoostPadObject::SpecificId' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, bIsHiddenMesh) == 0x00076C, "Member 'ABoostPadObject::bIsHiddenMesh' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, DefaultSceneRoot) == 0x000770, "Member 'ABoostPadObject::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, m_bIsSpecial) == 0x00077B, "Member 'ABoostPadObject::m_bIsSpecial' has a wrong offset!");
static_assert(offsetof(ABoostPadObject, m_SpecialGroup) == 0x00077C, "Member 'ABoostPadObject::m_SpecialGroup' has a wrong offset!");

// Class UnionRun.BounceCollision
// 0x0040 (0x05F0 - 0x05B0)
class alignas(0x10) ABounceCollision final : public AUnionGimmickObjectBase
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05B0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGimmickStaticBodyComponent*            StaticBodyComponent;                               // 0x05B8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EStaticBodyShapeType                          ShapeType;                                         // 0x05C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CollisionSize;                                     // 0x05C8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Radius;                                            // 0x05E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Height;                                            // 0x05E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ParamId;                                           // 0x05E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAirImpact;                                        // 0x05EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EUnionSurfaceType                             SurfaceType;                                       // 0x05ED(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5EE[0x2];                                      // 0x05EE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BounceCollision">();
	}
	static class ABounceCollision* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABounceCollision>();
	}
};
static_assert(alignof(ABounceCollision) == 0x000010, "Wrong alignment on ABounceCollision");
static_assert(sizeof(ABounceCollision) == 0x0005F0, "Wrong size on ABounceCollision");
static_assert(offsetof(ABounceCollision, DefaultSceneRoot) == 0x0005B0, "Member 'ABounceCollision::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABounceCollision, StaticBodyComponent) == 0x0005B8, "Member 'ABounceCollision::StaticBodyComponent' has a wrong offset!");
static_assert(offsetof(ABounceCollision, ShapeType) == 0x0005C0, "Member 'ABounceCollision::ShapeType' has a wrong offset!");
static_assert(offsetof(ABounceCollision, CollisionSize) == 0x0005C8, "Member 'ABounceCollision::CollisionSize' has a wrong offset!");
static_assert(offsetof(ABounceCollision, Radius) == 0x0005E0, "Member 'ABounceCollision::Radius' has a wrong offset!");
static_assert(offsetof(ABounceCollision, Height) == 0x0005E4, "Member 'ABounceCollision::Height' has a wrong offset!");
static_assert(offsetof(ABounceCollision, ParamId) == 0x0005E8, "Member 'ABounceCollision::ParamId' has a wrong offset!");
static_assert(offsetof(ABounceCollision, bAirImpact) == 0x0005EC, "Member 'ABounceCollision::bAirImpact' has a wrong offset!");
static_assert(offsetof(ABounceCollision, SurfaceType) == 0x0005ED, "Member 'ABounceCollision::SurfaceType' has a wrong offset!");

// Class UnionRun.GimmickOnlyOwnerSeeBase
// 0x0030 (0x05E0 - 0x05B0)
class alignas(0x10) AGimmickOnlyOwnerSeeBase : public AUnionGimmickObjectBase
{
public:
	uint8                                         Pad_5B0[0x8];                                      // 0x05B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGimmickOnlyOwnerSeeBase*>       CloneObjects;                                      // 0x05B8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GimmickOnlyOwnerSeeBase">();
	}
	static class AGimmickOnlyOwnerSeeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGimmickOnlyOwnerSeeBase>();
	}
};
static_assert(alignof(AGimmickOnlyOwnerSeeBase) == 0x000010, "Wrong alignment on AGimmickOnlyOwnerSeeBase");
static_assert(sizeof(AGimmickOnlyOwnerSeeBase) == 0x0005E0, "Wrong size on AGimmickOnlyOwnerSeeBase");
static_assert(offsetof(AGimmickOnlyOwnerSeeBase, CloneObjects) == 0x0005B8, "Member 'AGimmickOnlyOwnerSeeBase::CloneObjects' has a wrong offset!");
static_assert(offsetof(AGimmickOnlyOwnerSeeBase, DefaultSceneRoot) == 0x0005D0, "Member 'AGimmickOnlyOwnerSeeBase::DefaultSceneRoot' has a wrong offset!");

// Class UnionRun.RedStarRingObject
// 0x0090 (0x0670 - 0x05E0)
class ARedStarRingObject final : public AGimmickOnlyOwnerSeeBase
{
public:
	class UUnionStaticMeshComponent*              StaticMeshComponent;                               // 0x05E0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticBodyComponent*                   StaticBodyComponent;                               // 0x05E8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USuckedMovement*                        SuckedMovement;                                    // 0x05F0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         RedStarRingIndex;                                  // 0x05F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      NormalMaterial;                                    // 0x0600(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstance*                      PickUpMaterial;                                    // 0x0608(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_610[0x60];                                     // 0x0610(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RedStarRingObject">();
	}
	static class ARedStarRingObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARedStarRingObject>();
	}
};
static_assert(alignof(ARedStarRingObject) == 0x000010, "Wrong alignment on ARedStarRingObject");
static_assert(sizeof(ARedStarRingObject) == 0x000670, "Wrong size on ARedStarRingObject");
static_assert(offsetof(ARedStarRingObject, StaticMeshComponent) == 0x0005E0, "Member 'ARedStarRingObject::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(ARedStarRingObject, StaticBodyComponent) == 0x0005E8, "Member 'ARedStarRingObject::StaticBodyComponent' has a wrong offset!");
static_assert(offsetof(ARedStarRingObject, SuckedMovement) == 0x0005F0, "Member 'ARedStarRingObject::SuckedMovement' has a wrong offset!");
static_assert(offsetof(ARedStarRingObject, RedStarRingIndex) == 0x0005F8, "Member 'ARedStarRingObject::RedStarRingIndex' has a wrong offset!");
static_assert(offsetof(ARedStarRingObject, NormalMaterial) == 0x000600, "Member 'ARedStarRingObject::NormalMaterial' has a wrong offset!");
static_assert(offsetof(ARedStarRingObject, PickUpMaterial) == 0x000608, "Member 'ARedStarRingObject::PickUpMaterial' has a wrong offset!");

// Class UnionRun.BounceMoveObject
// 0x0040 (0x05F0 - 0x05B0)
class alignas(0x10) ABounceMoveObject final : public AUnionGimmickObjectBase
{
public:
	uint8                                         Pad_5B0[0x8];                                      // 0x05B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionBounceMoveComponent*              BounceComponent;                                   // 0x05B8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGimmickStaticBodyComponent*            Body;                                              // 0x05C0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUnionAtomComponent*                    LoopSound;                                         // 0x05C8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUnionAtomComponent*                    BounceSound;                                       // 0x05D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      LoopEffect;                                        // 0x05D8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         AllowBounce;                                       // 0x05E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERacerDamageType                              DamageType;                                        // 0x05E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopLoopSoundOnBounce;                             // 0x05E2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopLoopEffectOnBounce;                            // 0x05E3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05E8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnFinishedBounce();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BounceMoveObject">();
	}
	static class ABounceMoveObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABounceMoveObject>();
	}
};
static_assert(alignof(ABounceMoveObject) == 0x000010, "Wrong alignment on ABounceMoveObject");
static_assert(sizeof(ABounceMoveObject) == 0x0005F0, "Wrong size on ABounceMoveObject");
static_assert(offsetof(ABounceMoveObject, BounceComponent) == 0x0005B8, "Member 'ABounceMoveObject::BounceComponent' has a wrong offset!");
static_assert(offsetof(ABounceMoveObject, Body) == 0x0005C0, "Member 'ABounceMoveObject::Body' has a wrong offset!");
static_assert(offsetof(ABounceMoveObject, LoopSound) == 0x0005C8, "Member 'ABounceMoveObject::LoopSound' has a wrong offset!");
static_assert(offsetof(ABounceMoveObject, BounceSound) == 0x0005D0, "Member 'ABounceMoveObject::BounceSound' has a wrong offset!");
static_assert(offsetof(ABounceMoveObject, LoopEffect) == 0x0005D8, "Member 'ABounceMoveObject::LoopEffect' has a wrong offset!");
static_assert(offsetof(ABounceMoveObject, AllowBounce) == 0x0005E0, "Member 'ABounceMoveObject::AllowBounce' has a wrong offset!");
static_assert(offsetof(ABounceMoveObject, DamageType) == 0x0005E1, "Member 'ABounceMoveObject::DamageType' has a wrong offset!");
static_assert(offsetof(ABounceMoveObject, StopLoopSoundOnBounce) == 0x0005E2, "Member 'ABounceMoveObject::StopLoopSoundOnBounce' has a wrong offset!");
static_assert(offsetof(ABounceMoveObject, StopLoopEffectOnBounce) == 0x0005E3, "Member 'ABounceMoveObject::StopLoopEffectOnBounce' has a wrong offset!");
static_assert(offsetof(ABounceMoveObject, DefaultSceneRoot) == 0x0005E8, "Member 'ABounceMoveObject::DefaultSceneRoot' has a wrong offset!");

// Class UnionRun.BPFL_UnionRunTuningUtil
// 0x0000 (0x0028 - 0x0028)
class UBPFL_UnionRunTuningUtil final : public UBlueprintFunctionLibrary
{
public:
	static float GetHoverBaseHeight(EVehicleType VehicleType);
	static bool GetIsDroneDisable();
	static float GetMeshSizeRate(EVehicleDisplayMode DisplayMode);
	static void GetStartingLightPosition(const int32& SelectedPlayerNum, float* Front, float* Height, float* Right);
	static float GetYellowDrillMeshSizeRate();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPFL_UnionRunTuningUtil">();
	}
	static class UBPFL_UnionRunTuningUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPFL_UnionRunTuningUtil>();
	}
};
static_assert(alignof(UBPFL_UnionRunTuningUtil) == 0x000008, "Wrong alignment on UBPFL_UnionRunTuningUtil");
