#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnionSystem

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "CriWareRuntime_structs.hpp"
#include "CriWareRuntime_classes.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "EnhancedInput_classes.hpp"
#include "Niagara_classes.hpp"
#include "ProceduralMeshComponent_classes.hpp"
#include "AnimationBudgetAllocator_classes.hpp"
#include "AnimToTexture_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class UnionSystem.UnionStaticMeshComponent
// 0x0000 (0x05E0 - 0x05E0)
#pragma pack(push, 0x1)
class alignas(0x10) UUnionStaticMeshComponent : public UStaticMeshComponent
{
public:
	void ChangeMaterial(int32 MaterialID, bool bChange, class UMaterialInterface* InMaterial);
	void ResetMaterialAll();

	bool IsNotChangedMaterial(int32 MaterialID) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnionStaticMeshComponent">();
	}
	static class UUnionStaticMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnionStaticMeshComponent>();
	}
};
#pragma pack(pop)
static_assert(alignof(UUnionStaticMeshComponent) == 0x000010, "Wrong alignment on UUnionStaticMeshComponent");
static_assert(sizeof(UUnionStaticMeshComponent) == 0x0005E0, "Wrong size on UUnionStaticMeshComponent");

// Class UnionSystem.AppControllerInputManager
// 0x0018 (0x0058 - 0x0040)
class UAppControllerInputManager final : public UTickableWorldSubsystem
{
public:
	TArray<class AAppPlayerController*>           Controllers;                                       // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AMenuPlayerController* GetMenuPlayerController(int32 PlayerControllerIndex);
	class AAppPlayerController* GetPlayerController(int32 PlayerControllerIndex);
	bool IsMenuMouseInputMode(int32 PlayerControllerIndex);
	void RemovePlayer(class APlayerController* PlayerController, bool bDestroyPawn);
	void SetTickable(bool bTickable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppControllerInputManager">();
	}
	static class UAppControllerInputManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppControllerInputManager>();
	}
};
static_assert(alignof(UAppControllerInputManager) == 0x000008, "Wrong alignment on UAppControllerInputManager");
static_assert(sizeof(UAppControllerInputManager) == 0x000058, "Wrong size on UAppControllerInputManager");
static_assert(offsetof(UAppControllerInputManager, Controllers) == 0x000040, "Member 'UAppControllerInputManager::Controllers' has a wrong offset!");

// Class UnionSystem.AppSequenceLogManagerSubsystem
// 0x0008 (0x0038 - 0x0030)
class UAppSequenceLogManagerSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BackupSequenceType();
	ESequenceMainType GetBackupSequenceMainType();
	ESequenceSubType GetBackupSequenceSubType();
	ESequenceMainType GetSequenceMainType();
	ESequenceSubType GetSequenceSubType();
	void SetSequenceSubType(ESequenceSubType SubType);
	void SetSequenceType(ESequenceMainType MainType, ESequenceSubType SubType);

	int32 GetSequenceTypeNum() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppSequenceLogManagerSubsystem">();
	}
	static class UAppSequenceLogManagerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppSequenceLogManagerSubsystem>();
	}
};
static_assert(alignof(UAppSequenceLogManagerSubsystem) == 0x000008, "Wrong alignment on UAppSequenceLogManagerSubsystem");
static_assert(sizeof(UAppSequenceLogManagerSubsystem) == 0x000038, "Wrong size on UAppSequenceLogManagerSubsystem");

// Class UnionSystem.AppFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAppFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetClampUserNameLength();
	static class FString GetDateString(const struct FDateTime& DateTime);
	static class FString GetDateTimeString(const struct FDateTime& DateTime);
	static class FString GetDateTimeStringWithoutSecond(const struct FDateTime& DateTime);
	static class FString GetHexString(int32 Input, int32 Length, bool AddZero);
	static struct FDateTime GetLocalDateTime(int64 UnixTimestampFromServer);
	static class FString GetLocalDateTimeString(int64 UnixTimestampFromServer);
	static EMilestoneVersion GetMileStoneVersion();
	static EMilestoneVersion GetMileStoneVersionWithWorldContext(const class UObject* WorldContextObject);
	static EAppSupportedPlatform GetPlatform();
	static ECrossplayPlatform GetPlatformGroup();
	static class FString GetUtcDateTimeString(int64 UnixTimestampFromServer);
	static int32 HexToNumber(const class FString& str);
	static bool Is2ndRom();
	static bool Is2ndRomWithWorldContext(const class UObject* WorldContextObject);
	static bool IsDevelopmentBuild();
	static bool IsMasterLaunchOptionEnabled();
	static bool IsPlayInEditor();
	static bool IsPlayStation();
	static bool IsPre2ndRom();
	static bool IsShippingBuild();
	static bool IsSupportHDVibration();
	static bool IsSwitch();
	static bool IsTestBuild();
	static bool IsVersionOverThan10100();
	static bool IsWindows();
	static bool IsXbox();
	static void OutputUE_LOG(EAppLogLevel InLevel, const class FString& Message);
	static void SetMilestoneVersion(EMilestoneVersion NewMilestoneVersion);
	static class FString TruncateStringWithEllipsis(const class FString& str, int32 Length);
	static class FText TruncateTextWithEllipsis(const class FText& Text, int32 Length);
	static class UObject* TryLoadAsset(const class FString& AssetPath);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppFunctionLibrary">();
	}
	static class UAppFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppFunctionLibrary>();
	}
};
static_assert(alignof(UAppFunctionLibrary) == 0x000008, "Wrong alignment on UAppFunctionLibrary");
static_assert(sizeof(UAppFunctionLibrary) == 0x000028, "Wrong size on UAppFunctionLibrary");

// Class UnionSystem.ChallengeStatsUtility
// 0x0000 (0x0028 - 0x0028)
class UChallengeStatsUtility final : public UBlueprintFunctionLibrary
{
public:
	static void AddChallengeStats(EChallengeId InChallengeId, int32 InValue);
	static void ChallengeProgressUpdateCategory(const EChallengeCategory InCategory);
	static void CheckAllChallengeStats();
	static TArray<EChallengeId> GetCategoryChallenge(const EChallengeCategory InCategory);
	static TArray<struct FChallengeStruct> GetCategoryChallengeData(const EChallengeCategory InCategory);
	static int32 GetCategoryClearCount(const EChallengeCategory InCategory);
	static TArray<struct FChallengeStatsData> GetCategoryStats(const EChallengeCategory InCategory);
	static EChallengeCategory GetChallengeCategory(const EChallengeId InId);
	static struct FChallengeStruct GetChallengeData(const EChallengeId InChallengeId);
	static int32 GetChallengeProgressCount();
	static EChallengeProgressState GetChallengeProgressState(const EChallengeId InChallengeId);
	static struct FChallengeStatsData GetChallengeStats(const EChallengeId InChallengeId);
	static int32 GetChallengeStatsCount(const EChallengeId InChallengeId);
	static struct FChallengePointReward GetPointReward(int32 ItemGetBgIdx, int32 ItemGetPointIdx);
	static int32 GetSpecialChallengeClearCount();
	static bool IsChallengeAcquiredStateCheck();
	static bool IsChallengeCategoryNewIcon(const EChallengeCategory InCategory);
	static bool IsCompleteChallenge(const EChallengeId InChallengeId);
	static bool IsCompleteChallengeCategory(const EChallengeCategory InCategory);
	static void SetChallengeProgressState(const EChallengeId InChallengeId, const EChallengeProgressState InProgressState);
	static void SetChallengeStats(EChallengeId InChallengeId, int32 InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChallengeStatsUtility">();
	}
	static class UChallengeStatsUtility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeStatsUtility>();
	}
};
static_assert(alignof(UChallengeStatsUtility) == 0x000008, "Wrong alignment on UChallengeStatsUtility");
static_assert(sizeof(UChallengeStatsUtility) == 0x000028, "Wrong size on UChallengeStatsUtility");

// Class UnionSystem.MilestoneUtil
// 0x0000 (0x0028 - 0x0028)
class UMilestoneUtil final : public UBlueprintFunctionLibrary
{
public:
	static EMilestoneVersion GetEnablePrelaunchAnotherStageLotteryMilestoneVersion();
	static const TArray<EDriverId> GetGrandPrixRivalDriverIds();
	static EDriverId GetRivalByMilestoneVersion();
	static bool IsAlreadyGrandPrixLeast1Play();
	static bool IsCharaIconLockCover(EDriverId DriverId);
	static bool IsCloseCourseInRaceParkCustomMatchMilestoneVersion();
	static bool IsDisableDecisionInRaceParkMilestoneVersion();
	static bool IsDisableEtceteraChallengeMilestoneVersion();
	static bool IsDisableEtceteraHintMilestoneVersion();
	static bool IsDisableEtceteraOthersMilestoneVersion();
	static bool IsDisableEtceteraStoreMilestoneVersion();
	static bool IsDisableEtceteraTitleMilestoneVersion();
	static bool IsDisableFestaMilestoneVersion();
	static bool IsDisableFriendlistMilestoneVersion();
	static bool IsDisableGrandPrixCourse2MilestoneVersion();
	static bool IsDisableGrandPrixCourse3MilestoneVersion();
	static bool IsDisableGrandPrixCourseMilestoneVersion();
	static bool IsDisableGrandPrixMilestoneVersion();
	static bool IsDisableHornAuraTabMilestoneVersion();
	static bool IsDisableRaceParkMilestoneVersion();
	static bool IsDisableRaceParkRivalOnOffMilestoneVersion();
	static bool IsDisableSelectTimeTrialMilestoneVersion();
	static bool IsDisableTimeTrialMilestoneVersion();
	static bool IsDisableTopMenuFestaRuleMilestoneVersion();
	static bool IsDisableTopMenuNewsMilestoneVersion();
	static bool IsDisableTrialMilestoneVersion();
	static bool IsEnableAdvertiseRatingMilestoneVersion();
	static bool IsEnableEtceteraFullGameStoreMilestoneVersion();
	static bool IsEnableResetSaveDataMilestoneVersion();
	static bool IsEnableSpecificTitleDebugCommandMilestoneVersion();
	static bool IsEnableThumbnailCollaboRaceMilestoneVersion();
	static bool IsEnableTitleDemoMilestoneVersion();
	static bool IsEnableTitleStoreMilestoneVersion();
	static bool IsEnableTopMenuStoreMilestoneVersion();
	static bool IsEnableTopMenuStorePopupAutoMilestoneVersion();
	static bool IsExclusionGhostUpDownloadEventMilestoneVersion();
	static bool IsForceEnableTopMenuNewsMilestoneVersion();
	static bool IsHiddenCharacter(EDriverId DriverId);
	static bool IsHiddenMachineParts(EMachineId MachineId);
	static bool IsHiddenRomVerMilestoneVersion();
	static bool IsHiddenWebManualQRcodeMilestoneVersion();
	static bool IsInitialMachineParts(EMachineId MachineId, int32 FrontPrice, int32 RearPrice, int32 TirePrice);
	static bool IsLimitDonpaTicketMilestoneVersion();
	static bool IsLimitRewardInRaceParkMilestoneVersion();
	static bool IsOfflineMilestoneVersion();
	static bool IsRaceUnLockedMilestoneVersion(const EGameModeId InGameModeId, const EStageId InStageId);
	static bool IsSkipDodonpaEventMilestoneVersion();
	static bool IsSkipSelectPlayNumMilestoneVersion();
	static bool IsTopMenuAccessLoginSuccessOnly();
	static bool IsVisibleCompanyNameMilestoneVersion();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MilestoneUtil">();
	}
	static class UMilestoneUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMilestoneUtil>();
	}
};
static_assert(alignof(UMilestoneUtil) == 0x000008, "Wrong alignment on UMilestoneUtil");
static_assert(sizeof(UMilestoneUtil) == 0x000028, "Wrong size on UMilestoneUtil");

// Class UnionSystem.AppGameInstance
// 0x0020 (0x01E0 - 0x01C0)
class UAppGameInstance : public UGameInstance
{
public:
	uint8                                         Pad_1C0[0x20];                                     // 0x01C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReadVCSChangelistFromFile();
	void Set2ndRom(bool Is2ndRom);

	void GetVCSRevisionNum(int32* OutVCSRevisionNum) const;
	void GetVCSRevisionStr(class FString* OutVCSString) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppGameInstance">();
	}
	static class UAppGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppGameInstance>();
	}
};
static_assert(alignof(UAppGameInstance) == 0x000008, "Wrong alignment on UAppGameInstance");
static_assert(sizeof(UAppGameInstance) == 0x0001E0, "Wrong size on UAppGameInstance");

// Class UnionSystem.HonorTitleListDataAsset
// 0x0058 (0x0088 - 0x0030)
class UHonorTitleListDataAsset final : public UDataAsset
{
public:
	class UDataTable*                             HonorTitleCompositeDataTable;                      // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, struct FHonorTitleListData>       HonorTitleTableDataMap;                            // 0x0038(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)

public:
	void ClearData();
	void Update();

	TArray<struct FHonorTitleListData> GetAllHonorTitleAndIdWithRarity(int32 Rarity, TArray<int32>* outHonorTitleIdArray) const;
	TArray<struct FHonorTitleListData> GetAllHonorTitleWithRarity(int32 Rarity) const;
	TSoftObjectPtr<class UTexture2D> GetHonorTitlePlate(int32 HonorTitleId) const;
	int32 GetHonorTitleRarity(int32 HonorTitleId) const;
	class FText GetHonorTitleVBName(int32 HonorTitleId, bool* IsValid) const;
	bool GetIsHonorTitleDLC(int32 HonorTitleIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HonorTitleListDataAsset">();
	}
	static class UHonorTitleListDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHonorTitleListDataAsset>();
	}
};
static_assert(alignof(UHonorTitleListDataAsset) == 0x000008, "Wrong alignment on UHonorTitleListDataAsset");
static_assert(sizeof(UHonorTitleListDataAsset) == 0x000088, "Wrong size on UHonorTitleListDataAsset");
static_assert(offsetof(UHonorTitleListDataAsset, HonorTitleCompositeDataTable) == 0x000030, "Member 'UHonorTitleListDataAsset::HonorTitleCompositeDataTable' has a wrong offset!");
static_assert(offsetof(UHonorTitleListDataAsset, HonorTitleTableDataMap) == 0x000038, "Member 'UHonorTitleListDataAsset::HonorTitleTableDataMap' has a wrong offset!");

// Class UnionSystem.AppGameMode
// 0x0000 (0x0328 - 0x0328)
class AAppGameMode : public AGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppGameMode">();
	}
	static class AAppGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppGameMode>();
	}
};
static_assert(alignof(AAppGameMode) == 0x000008, "Wrong alignment on AAppGameMode");
static_assert(sizeof(AAppGameMode) == 0x000328, "Wrong size on AAppGameMode");

// Class UnionSystem.ControllerButtonData
// 0x0050 (0x0080 - 0x0030)
class UControllerButtonData final : public UDataAsset
{
public:
	TMap<struct FKey, EControllerButtonTextureIndex> KeyConfig;                                      // 0x0030(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControllerButtonData">();
	}
	static class UControllerButtonData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControllerButtonData>();
	}
};
static_assert(alignof(UControllerButtonData) == 0x000008, "Wrong alignment on UControllerButtonData");
static_assert(sizeof(UControllerButtonData) == 0x000080, "Wrong size on UControllerButtonData");
static_assert(offsetof(UControllerButtonData, KeyConfig) == 0x000030, "Member 'UControllerButtonData::KeyConfig' has a wrong offset!");

// Class UnionSystem.SimpleAnimationComponent
// 0x0080 (0x0120 - 0x00A0)
class alignas(0x10) USimpleAnimationComponent : public UActorComponent
{
public:
	class UAnimSequence*                          Animation;                                         // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Target;                                            // 0x00A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayOffsetInFrame;                                 // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x68];                                      // 0x00B8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleAnimationComponent">();
	}
	static class USimpleAnimationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleAnimationComponent>();
	}
};
static_assert(alignof(USimpleAnimationComponent) == 0x000010, "Wrong alignment on USimpleAnimationComponent");
static_assert(sizeof(USimpleAnimationComponent) == 0x000120, "Wrong size on USimpleAnimationComponent");
static_assert(offsetof(USimpleAnimationComponent, Animation) == 0x0000A0, "Member 'USimpleAnimationComponent::Animation' has a wrong offset!");
static_assert(offsetof(USimpleAnimationComponent, Target) == 0x0000A8, "Member 'USimpleAnimationComponent::Target' has a wrong offset!");
static_assert(offsetof(USimpleAnimationComponent, PlayRate) == 0x0000B0, "Member 'USimpleAnimationComponent::PlayRate' has a wrong offset!");
static_assert(offsetof(USimpleAnimationComponent, PlayOffsetInFrame) == 0x0000B4, "Member 'USimpleAnimationComponent::PlayOffsetInFrame' has a wrong offset!");

// Class UnionSystem.SimpleAnimEventComponent
// 0x0020 (0x0140 - 0x0120)
class USimpleAnimEventComponent final : public USimpleAnimationComponent
{
public:
	TArray<struct FUnionSimpleAnimEvent>          AnimEventSequence;                                 // 0x0120(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleAnimEventComponent">();
	}
	static class USimpleAnimEventComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleAnimEventComponent>();
	}
};
static_assert(alignof(USimpleAnimEventComponent) == 0x000010, "Wrong alignment on USimpleAnimEventComponent");
static_assert(sizeof(USimpleAnimEventComponent) == 0x000140, "Wrong size on USimpleAnimEventComponent");
static_assert(offsetof(USimpleAnimEventComponent, AnimEventSequence) == 0x000120, "Member 'USimpleAnimEventComponent::AnimEventSequence' has a wrong offset!");

// Class UnionSystem.AtomListenerFocusPointForCamera
// 0x0020 (0x0250 - 0x0230)
class UAtomListenerFocusPointForCamera : public USceneComponent
{
public:
	float                                         DistanceFocusLevel;                                // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirectionFocusLevel;                               // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraComponent*                       Camera;                                            // 0x0238(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_240[0x10];                                     // 0x0240(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCameraActivated();
	void SetCamera(class UCameraComponent* NewCamera);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomListenerFocusPointForCamera">();
	}
	static class UAtomListenerFocusPointForCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomListenerFocusPointForCamera>();
	}
};
static_assert(alignof(UAtomListenerFocusPointForCamera) == 0x000010, "Wrong alignment on UAtomListenerFocusPointForCamera");
static_assert(sizeof(UAtomListenerFocusPointForCamera) == 0x000250, "Wrong size on UAtomListenerFocusPointForCamera");
static_assert(offsetof(UAtomListenerFocusPointForCamera, DistanceFocusLevel) == 0x000230, "Member 'UAtomListenerFocusPointForCamera::DistanceFocusLevel' has a wrong offset!");
static_assert(offsetof(UAtomListenerFocusPointForCamera, DirectionFocusLevel) == 0x000234, "Member 'UAtomListenerFocusPointForCamera::DirectionFocusLevel' has a wrong offset!");
static_assert(offsetof(UAtomListenerFocusPointForCamera, Camera) == 0x000238, "Member 'UAtomListenerFocusPointForCamera::Camera' has a wrong offset!");

// Class UnionSystem.AppListenerFocusPoint
// 0x0000 (0x0250 - 0x0250)
class UAppListenerFocusPoint final : public UAtomListenerFocusPointForCamera
{
public:
	void SetupComponent(int32 PlayerIndex, int32 NumLocalPlayers);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppListenerFocusPoint">();
	}
	static class UAppListenerFocusPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppListenerFocusPoint>();
	}
};
static_assert(alignof(UAppListenerFocusPoint) == 0x000010, "Wrong alignment on UAppListenerFocusPoint");
static_assert(sizeof(UAppListenerFocusPoint) == 0x000250, "Wrong size on UAppListenerFocusPoint");

// Class UnionSystem.AppOptionConfigSaveGameHelper
// 0x0000 (0x0028 - 0x0028)
class UAppOptionConfigSaveGameHelper final : public UBlueprintFunctionLibrary
{
public:
	static bool AllowCrossPlay();
	static bool AllowCrossPlayOnlyAppSetting();
	static void ApplyAmbientOcclusion();
	static void ApplyAntiAliasMethod();
	static void ApplyAudioSettings();
	static void ApplyBlur();
	static void ApplyFrameRateLimit();
	static void ApplyFullscreenMode(bool ApplyImmediately);
	static void ApplyGraphicMode();
	static void ApplyGraphicQuality();
	static void ApplyGraphicsSettings();
	static void ApplyModelQuality();
	static void ApplyReflectionQuality();
	static void ApplyRenderingScale();
	static void ApplyResolutionSize(bool ApplyImmediately);
	static void ApplyScreenBrightness();
	static void ApplyShadowQuality();
	static void ApplyUseDisplay(bool ApplyImmediately);
	static void ApplyVSync(bool ApplyImmediately);
	static void CalcGetUserAssistData(TArray<struct FUserAssistData>* OutAssistData);
	static ECaptionVisible GetCaptionVisibility();
	static EKeyConfigOperationType GetControllerOperationType(int32 InPlayerIndex);
	static EForceFeedbackLevel GetForceFeedbackLevel(int32 PlayerIndex);
	static ELanguage GetTextLangFromSave();
	static ELanguage GetVoiceLangFromSave();
	static void InitTextLangIfInvalid();
	static void InitVoiceLangIfInvalid();
	static bool IsControllerGyroAssistEnabled(int32 InPlayerIndex);
	static bool IsControllerOperationTypeCustom(int32 InPlayerIndex);
	static bool IsDiffUserAssistDataWithSaveData(const TArray<struct FUserAssistData>& InAssistData);
	static bool IsInverseAcceptAndCancel(int32 InPlayerIndex);
	static bool IsInverseFlyModeUpDown(int32 InPlayerIndex);
	static bool IsRunningOnSteamDeck();
	static void ResetControllerSettingsForLocalMultiPlayer();
	static void SetAllPlayerForceFeedbackLevelFromSave();
	static void SetControllerGyroAssistEnabled(int32 InPlayerIndex, bool InEnable);
	static void SetControllerOperationType(int32 InPlayerIndex, EKeyConfigOperationType InOperationType);
	static void SetForceFeedbackLevel(int32 PlayerIndex, EForceFeedbackLevel VibrationLevel);
	static void SetInverseAcceptAndCancel(int32 InPlayerIndex, bool InInverse);
	static void SetTextLangToSave(ELanguage NewLanguage);
	static void SetVoiceLangToSave(ELanguage NewLanguage);
	static bool UpdateGraphicSettingsAtFirstTime();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppOptionConfigSaveGameHelper">();
	}
	static class UAppOptionConfigSaveGameHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppOptionConfigSaveGameHelper>();
	}
};
static_assert(alignof(UAppOptionConfigSaveGameHelper) == 0x000008, "Wrong alignment on UAppOptionConfigSaveGameHelper");
static_assert(sizeof(UAppOptionConfigSaveGameHelper) == 0x000028, "Wrong size on UAppOptionConfigSaveGameHelper");

// Class UnionSystem.AppPlayerController
// 0x01E0 (0x0A38 - 0x0858)
class AAppPlayerController : public APlayerController
{
public:
	uint8                                         Pad_858[0x8];                                      // 0x0858(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputDataAsset*                        InputDataAsset;                                    // 0x0860(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DefaultInputConfigName;                            // 0x0868(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EAppControllerInputType BeforeType, EAppControllerInputType AfterType)> OnChangeControllerInputTypeEvent; // 0x0870(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPointerEvent& InPointerEvent)> OnMousePointerEvent;  // 0x0880(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPointerEvent& InPointerEvent)> OnMousePointerUpEvent; // 0x0890(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMouseFullScreenClickEvent;                       // 0x08A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMouseLeftButtonReleasedEvent;                    // 0x08B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C0[0x100];                                    // 0x08C0(0x0100)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                LastHoveredObject;                                 // 0x09C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C8[0x70];                                     // 0x09C8(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddRegisterSubMenu(class UObject* InMenuObject, int32 InPriority);
	void ApplyOptionControllerSettings();
	bool CalcIsMousePositionInViewport();
	void CalcTutorialControllerType(uint8* Type, uint8* Platform);
	void ClearUserFocus();
	void DoInputMenu(EMenuInputKey InKey);
	EAppControllerInputType GetCurrentInputType();
	class UObject* GetLastHoveredObject();
	struct FKey GetMappableKeyByMappingName(const class FName& MappingName);
	struct FKey GetMenuConfigKey(const class FName& InActionName, bool IsGamepad, bool IsAnalog);
	struct FKey GetRaceConfigKey(const class FName& InActionName, bool IsPrimary, bool IsGamepad);
	void OnApplicationHasReactivated();
	void OnChangeControllerInputType(EAppControllerInputType BeforeType, EAppControllerInputType AfterType);
	void OnLeftMousePressed();
	void OnLeftStickVectorAxisEvent(const struct FVector& InStickVector);
	void OnMousePointer(const struct FPointerEvent& InPointerEvent);
	void OnMousePointerEventBP(const struct FPointerEvent& InPointerEvent);
	void OnMousePointerUp(const struct FPointerEvent& InPointerEvent);
	void RegisterMainMenu(class UObject* InObject, EMainMenuRegistPriority InPriority);
	void RegisterMenu(class UObject* InMenuObject, int32 InPriority);
	void SetCurrentInputConfig(const class FName InputConfigName);
	void SetEnableMainMenu(const class UObject* InObject, bool IsEnable);
	void SetEnableMainMenuAll(bool IsEnable);
	void SetEnableMainMenuLowerPriority(bool IsEnable, int32 InPrioirty);
	void SetEnableMainMenuUpperPriority(bool IsEnable, int32 InPrioirty);
	void SetEnableSubMenu(const class UObject* InObject, bool IsEnable);
	void SetEnableSubMenuAll(bool IsEnable);
	void SetEnableSubMenuLowerPriority(bool IsEnable, int32 InPrioirty);
	void SetEnableSubMenuUpperPriority(bool IsEnable, int32 InPrioirty);
	void SetForceNonConsumeMouseEvent(bool bEnable);
	void SetInputBlocked(bool InBlocked);
	void SetLastHoveredObject(class UObject* HoveredObject);
	bool UnregisterMainMenu(const class UObject* InObject);
	void UnregisterMainMenuAll();
	void UnregisterMenu();
	bool UnregisterSingleMenu(const class UObject* InMenuObject);
	bool UnregisterSingleSubMenu(const class UObject* InMenuObject);
	void UnregisterSubMenu();

	bool GetLeftMouseButtonPressing() const;
	struct FVector2D GetLeftStickAxisValue() const;
	class UObject* GetRegisteredMenu() const;
	TArray<class UObject*> GetRegisteredSubMenu() const;
	class FName GetSystemFocusedWidgetName() const;
	bool OnIsMenuInputEnabled() const;
	bool OnIsSubMenuInputEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppPlayerController">();
	}
	static class AAppPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppPlayerController>();
	}
};
static_assert(alignof(AAppPlayerController) == 0x000008, "Wrong alignment on AAppPlayerController");
static_assert(sizeof(AAppPlayerController) == 0x000A38, "Wrong size on AAppPlayerController");
static_assert(offsetof(AAppPlayerController, InputDataAsset) == 0x000860, "Member 'AAppPlayerController::InputDataAsset' has a wrong offset!");
static_assert(offsetof(AAppPlayerController, DefaultInputConfigName) == 0x000868, "Member 'AAppPlayerController::DefaultInputConfigName' has a wrong offset!");
static_assert(offsetof(AAppPlayerController, OnChangeControllerInputTypeEvent) == 0x000870, "Member 'AAppPlayerController::OnChangeControllerInputTypeEvent' has a wrong offset!");
static_assert(offsetof(AAppPlayerController, OnMousePointerEvent) == 0x000880, "Member 'AAppPlayerController::OnMousePointerEvent' has a wrong offset!");
static_assert(offsetof(AAppPlayerController, OnMousePointerUpEvent) == 0x000890, "Member 'AAppPlayerController::OnMousePointerUpEvent' has a wrong offset!");
static_assert(offsetof(AAppPlayerController, OnMouseFullScreenClickEvent) == 0x0008A0, "Member 'AAppPlayerController::OnMouseFullScreenClickEvent' has a wrong offset!");
static_assert(offsetof(AAppPlayerController, OnMouseLeftButtonReleasedEvent) == 0x0008B0, "Member 'AAppPlayerController::OnMouseLeftButtonReleasedEvent' has a wrong offset!");
static_assert(offsetof(AAppPlayerController, LastHoveredObject) == 0x0009C0, "Member 'AAppPlayerController::LastHoveredObject' has a wrong offset!");

// Class UnionSystem.AppPlayerControllerSubsystem
// 0x0280 (0x02B0 - 0x0030)
class UAppPlayerControllerSubsystem final : public UGameInstanceSubsystem
{
public:
	TMap<class FName, EControllerButtonTextureIndex> ButtonNameToTextureIndex;                       // 0x0030(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, class UMaterialInstanceDynamic*> ButtonMaterials;                              // 0x0080(0x0050)(BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, class FName>                TagToActionMapping;                                // 0x00D0(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FKey, class UMaterialInstanceDynamic*> KeyToButtonMaterial;                          // 0x0120(0x0050)(BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<struct FKey, EControllerButtonTextureIndex> KeyToPadTextureIndex;                           // 0x0170(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	class UTexture2D*                             CurrentButtonTexture;                              // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UControllerButtonData*                  FKeyToControllerTextureIndex;                      // 0x01C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CurrentDisplayKeyboardLayout;                      // 0x01D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CurrentDisplayKeytopPattern;                       // 0x01D1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EControllerButtonTextureIndex, EMenuKeyboardButtonTextureIndex> PadToMenuKeyboardTextureIndex; // 0x01D8(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_228[0x28];                                     // 0x0228(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAppPlayerController*>           AppPlayerControllers;                              // 0x0250(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<struct FKey, struct FLocalizeRuntimeTextArray> KeyToKeytopTextMap;                          // 0x0260(0x0050)(NativeAccessSpecifierPrivate)

public:
	void AddDeviceChangeInterface(int32 InPlayerControllerIndex, class UObject* InIFObject);
	EAppControllerInputType CalcCurrentDeviceButtonTexture(int32 PlayerControllerIndex, class UTexture2D** OutTexure);
	void CallChangeControllerInputType(int32 InPlayerControllerIndex, EAppControllerInputType InControllerInputType);
	class AAppPlayerController* CreatePlayer(int32 ControllerId, bool bSpawnPlayerController);
	class AAppPlayerController* GetAppPlayerController(int32 ControllerId);
	int32 GetControllerTextureIndexFromFKey(const struct FKey& InKey);
	EControllerButtonTextureType GetCurrentButtonTextureType();
	class UTexture2D* GetCurrentDeviceTexture();
	class UTexture2D* GetMenuKeyboardButtonTexture();
	class UTexture2D* GetMenuMouseButtonTexture();
	void RemoveDeviceChangeInterface(int32 InPlayerControllerIndex, class UObject* InIFObject);
	void RemovePlayer(int32 ControllerId, bool bDestroyPawn);
	void SetButtonTextureType(EControllerButtonTextureType InTextureType);
	class AAppPlayerController* SetPlayer(int32 ControllerId, class APlayerController* PlayerController);
	void SetTextureForButtonMaterials(class UObject* InTextureObj);
	void UpdateButtonMaterialByDeviceType(uint8 DeviceType);
	void UpdateCurrentButtonTextureType();

	uint8 GetCurrentDisplayKeytopPattern(int32 InPlayerIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppPlayerControllerSubsystem">();
	}
	static class UAppPlayerControllerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppPlayerControllerSubsystem>();
	}
};
static_assert(alignof(UAppPlayerControllerSubsystem) == 0x000008, "Wrong alignment on UAppPlayerControllerSubsystem");
static_assert(sizeof(UAppPlayerControllerSubsystem) == 0x0002B0, "Wrong size on UAppPlayerControllerSubsystem");
static_assert(offsetof(UAppPlayerControllerSubsystem, ButtonNameToTextureIndex) == 0x000030, "Member 'UAppPlayerControllerSubsystem::ButtonNameToTextureIndex' has a wrong offset!");
static_assert(offsetof(UAppPlayerControllerSubsystem, ButtonMaterials) == 0x000080, "Member 'UAppPlayerControllerSubsystem::ButtonMaterials' has a wrong offset!");
static_assert(offsetof(UAppPlayerControllerSubsystem, TagToActionMapping) == 0x0000D0, "Member 'UAppPlayerControllerSubsystem::TagToActionMapping' has a wrong offset!");
static_assert(offsetof(UAppPlayerControllerSubsystem, KeyToButtonMaterial) == 0x000120, "Member 'UAppPlayerControllerSubsystem::KeyToButtonMaterial' has a wrong offset!");
static_assert(offsetof(UAppPlayerControllerSubsystem, KeyToPadTextureIndex) == 0x000170, "Member 'UAppPlayerControllerSubsystem::KeyToPadTextureIndex' has a wrong offset!");
static_assert(offsetof(UAppPlayerControllerSubsystem, CurrentButtonTexture) == 0x0001C0, "Member 'UAppPlayerControllerSubsystem::CurrentButtonTexture' has a wrong offset!");
static_assert(offsetof(UAppPlayerControllerSubsystem, FKeyToControllerTextureIndex) == 0x0001C8, "Member 'UAppPlayerControllerSubsystem::FKeyToControllerTextureIndex' has a wrong offset!");
static_assert(offsetof(UAppPlayerControllerSubsystem, CurrentDisplayKeyboardLayout) == 0x0001D0, "Member 'UAppPlayerControllerSubsystem::CurrentDisplayKeyboardLayout' has a wrong offset!");
static_assert(offsetof(UAppPlayerControllerSubsystem, CurrentDisplayKeytopPattern) == 0x0001D1, "Member 'UAppPlayerControllerSubsystem::CurrentDisplayKeytopPattern' has a wrong offset!");
static_assert(offsetof(UAppPlayerControllerSubsystem, PadToMenuKeyboardTextureIndex) == 0x0001D8, "Member 'UAppPlayerControllerSubsystem::PadToMenuKeyboardTextureIndex' has a wrong offset!");
static_assert(offsetof(UAppPlayerControllerSubsystem, AppPlayerControllers) == 0x000250, "Member 'UAppPlayerControllerSubsystem::AppPlayerControllers' has a wrong offset!");
static_assert(offsetof(UAppPlayerControllerSubsystem, KeyToKeytopTextMap) == 0x000260, "Member 'UAppPlayerControllerSubsystem::KeyToKeytopTextMap' has a wrong offset!");

// Class UnionSystem.AppRaceEventManager
// 0x0238 (0x0278 - 0x0040)
class UAppRaceEventManager final : public UTickableWorldSubsystem
{
public:
	TMulticastInlineDelegate<void(int32 Value)>   OnRacerPassedTravelRingGate;                       // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Value)> OnRaceSetBGMNameFirstLap;             // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Value)> OnRacePassedToPreFirstLapWhenAnotherTimeTraial; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Value1, const class FString& Value2)> OnRacePassedToFirstLap; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRacePassedToFirstLapWhenAnotherTimeTraial;       // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceTransitionToDomainSubInFirstLap;             // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceReturnFromDomainSubInFirstLap;               // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceSelectTravelRingGate;                        // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Value1, bool Value2)> OnRaceDecideTravelRingGate; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool Value)>    OnRacePassedToSecondLap;                           // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceTransitionToDomainSubInSecondLap;            // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceReturnFromDomainSubInSecondLap;              // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Value)> OnRacePassedToFinalLap;               // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Value)> OnRacePassedToFinalLapWhenTimeTiral;  // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceFinalLapLast;                                // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceTransitionToDomainSubInFinalLap;             // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceReturnFromDomainSubInFinalLap;               // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceGoal;                                        // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FAppRaceEventGoalData& Value)> OnRaceGoalWithParam;   // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Value1, const class FString& Value2)> OnRacePassedToSecondLapForce; // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Value1, const class FString& Value2)> OnRacePassedToFinalLapForce; // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Value)>   OnRaceSetAisacRingGateDistanceFirstLapToSecondLap; // 0x0190(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Value)>   OnRaceSetAisacRingGateDistanceSecondLapToFinalLap; // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool Value)>    OnRaceBGMOnCourseEditor;                           // 0x01B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceBGMFinished;                                 // 0x01C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool Value)>    OnEnableRaceSilenceSound;                          // 0x01D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool Value)>    OnEnableResultSilenceSound;                        // 0x01E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const EMainSubCourseIndex& Value1, int32 Value2)> OnChangeSubCourse; // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class AActor>>          RingGates;                                         // 0x0200(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class AActor>>          TravelRings;                                       // 0x0210(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class AActor>>          TravelRingLeftWaves;                               // 0x0220(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class AActor>>          TravelRingRightWaves;                              // 0x0230(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class AActor>>          TravelRingFloors;                                  // 0x0240(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class AActor>>          TravelDecidePanels;                                // 0x0250(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class AActor>>          SequenceParameterActorList;                        // 0x0260(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bForceSkipResultSequence;                          // 0x0270(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTickable(bool bTickable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppRaceEventManager">();
	}
	static class UAppRaceEventManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppRaceEventManager>();
	}
};
static_assert(alignof(UAppRaceEventManager) == 0x000008, "Wrong alignment on UAppRaceEventManager");
static_assert(sizeof(UAppRaceEventManager) == 0x000278, "Wrong size on UAppRaceEventManager");
static_assert(offsetof(UAppRaceEventManager, OnRacerPassedTravelRingGate) == 0x000040, "Member 'UAppRaceEventManager::OnRacerPassedTravelRingGate' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceSetBGMNameFirstLap) == 0x000050, "Member 'UAppRaceEventManager::OnRaceSetBGMNameFirstLap' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRacePassedToPreFirstLapWhenAnotherTimeTraial) == 0x000060, "Member 'UAppRaceEventManager::OnRacePassedToPreFirstLapWhenAnotherTimeTraial' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRacePassedToFirstLap) == 0x000070, "Member 'UAppRaceEventManager::OnRacePassedToFirstLap' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRacePassedToFirstLapWhenAnotherTimeTraial) == 0x000080, "Member 'UAppRaceEventManager::OnRacePassedToFirstLapWhenAnotherTimeTraial' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceTransitionToDomainSubInFirstLap) == 0x000090, "Member 'UAppRaceEventManager::OnRaceTransitionToDomainSubInFirstLap' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceReturnFromDomainSubInFirstLap) == 0x0000A0, "Member 'UAppRaceEventManager::OnRaceReturnFromDomainSubInFirstLap' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceSelectTravelRingGate) == 0x0000B0, "Member 'UAppRaceEventManager::OnRaceSelectTravelRingGate' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceDecideTravelRingGate) == 0x0000C0, "Member 'UAppRaceEventManager::OnRaceDecideTravelRingGate' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRacePassedToSecondLap) == 0x0000D0, "Member 'UAppRaceEventManager::OnRacePassedToSecondLap' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceTransitionToDomainSubInSecondLap) == 0x0000E0, "Member 'UAppRaceEventManager::OnRaceTransitionToDomainSubInSecondLap' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceReturnFromDomainSubInSecondLap) == 0x0000F0, "Member 'UAppRaceEventManager::OnRaceReturnFromDomainSubInSecondLap' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRacePassedToFinalLap) == 0x000100, "Member 'UAppRaceEventManager::OnRacePassedToFinalLap' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRacePassedToFinalLapWhenTimeTiral) == 0x000110, "Member 'UAppRaceEventManager::OnRacePassedToFinalLapWhenTimeTiral' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceFinalLapLast) == 0x000120, "Member 'UAppRaceEventManager::OnRaceFinalLapLast' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceTransitionToDomainSubInFinalLap) == 0x000130, "Member 'UAppRaceEventManager::OnRaceTransitionToDomainSubInFinalLap' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceReturnFromDomainSubInFinalLap) == 0x000140, "Member 'UAppRaceEventManager::OnRaceReturnFromDomainSubInFinalLap' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceGoal) == 0x000150, "Member 'UAppRaceEventManager::OnRaceGoal' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceGoalWithParam) == 0x000160, "Member 'UAppRaceEventManager::OnRaceGoalWithParam' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRacePassedToSecondLapForce) == 0x000170, "Member 'UAppRaceEventManager::OnRacePassedToSecondLapForce' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRacePassedToFinalLapForce) == 0x000180, "Member 'UAppRaceEventManager::OnRacePassedToFinalLapForce' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceSetAisacRingGateDistanceFirstLapToSecondLap) == 0x000190, "Member 'UAppRaceEventManager::OnRaceSetAisacRingGateDistanceFirstLapToSecondLap' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceSetAisacRingGateDistanceSecondLapToFinalLap) == 0x0001A0, "Member 'UAppRaceEventManager::OnRaceSetAisacRingGateDistanceSecondLapToFinalLap' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceBGMOnCourseEditor) == 0x0001B0, "Member 'UAppRaceEventManager::OnRaceBGMOnCourseEditor' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnRaceBGMFinished) == 0x0001C0, "Member 'UAppRaceEventManager::OnRaceBGMFinished' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnEnableRaceSilenceSound) == 0x0001D0, "Member 'UAppRaceEventManager::OnEnableRaceSilenceSound' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnEnableResultSilenceSound) == 0x0001E0, "Member 'UAppRaceEventManager::OnEnableResultSilenceSound' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, OnChangeSubCourse) == 0x0001F0, "Member 'UAppRaceEventManager::OnChangeSubCourse' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, RingGates) == 0x000200, "Member 'UAppRaceEventManager::RingGates' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, TravelRings) == 0x000210, "Member 'UAppRaceEventManager::TravelRings' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, TravelRingLeftWaves) == 0x000220, "Member 'UAppRaceEventManager::TravelRingLeftWaves' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, TravelRingRightWaves) == 0x000230, "Member 'UAppRaceEventManager::TravelRingRightWaves' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, TravelRingFloors) == 0x000240, "Member 'UAppRaceEventManager::TravelRingFloors' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, TravelDecidePanels) == 0x000250, "Member 'UAppRaceEventManager::TravelDecidePanels' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, SequenceParameterActorList) == 0x000260, "Member 'UAppRaceEventManager::SequenceParameterActorList' has a wrong offset!");
static_assert(offsetof(UAppRaceEventManager, bForceSkipResultSequence) == 0x000270, "Member 'UAppRaceEventManager::bForceSkipResultSequence' has a wrong offset!");

// Class UnionSystem.AppSaveGameHelper
// 0x0000 (0x0028 - 0x0028)
class UAppSaveGameHelper final : public UBlueprintFunctionLibrary
{
public:
	static void AddALLRivalWinCount();
	static void AddCompensationData(int32 ID);
	static void AddRaceStatsValue(const EStatsEventId InStatsId, const int32 Value);
	static void AddRewardGetDisplayRequestData(ERewardAchievementType InRewardAchievementType);
	static void AddRivalWinCount(EDriverId DriverId);
	static bool CheckRewardGetDisplayRequest(ERewardAchievementType InRewardAchievementType);
	static bool CheckRewardGetDisplayRequestData();
	static void ClearDriverNew(EDriverId InDriverId);
	static void ClearHintRead(EHintId InHintId);
	static void ClearIncompleteCollaboGPVictoryPopupRequired();
	static void ClearRewardGetDisplayRequestData(ERewardAchievementType InRewardAchievementType);
	static void ClearRewardGetDisplayRequestDataAll();
	static void ConvertItemSwitchSettingSaveToTableStruct(const struct FItemSwitchSettingSave& InSetting, struct FItemSwitchSetting* OutSetting);
	static void ConvertPartyRacePresetSettingSaveToTableStruct(const struct FPartyRacePresetSettingSave& InSetting, struct FPartyRacePresetSetting* OutSetting);
	static void Debug_AllSetHintRead();
	static void Debug_InitUserHintData();
	static void ExecuteSaveDataHealthCheck();
	static bool GetAlbumAvailable(int32 ID);
	static TArray<int32> GetAllHonorTitleUnlock();
	static TArray<int32> GetAllNewHonorTitleUnlocked();
	static float GetChallengeLastShowProgress();
	static int32 GetChallengeShowProgress();
	static TArray<int32> GetCompensationIdArray();
	static TArray<EStageId> GetCourseSwitchSetting(EGameModeId InGameModeId);
	static struct FUserAlbumTrackID GetCustomLapBGM(int32 Lap);
	static bool GetDodonpaEventCompleteFlag(EGrandPrixEventFlag SaveDataFlagId);
	static int32 GetFriendShipGivedTicket(EDriverId ID);
	static struct FUserGadgetCustomizeData GetGadgetCustomizeData();
	static int32 GetGrandPrixBeforeRivalLevel(EMenuSpeedClassId SpeedClassId);
	static int32 GetGrandPrixClassClearedCountByMenuSpeedClass(const EMenuSpeedClassId& SpeedClassId);
	static int32 GetGrandPrixClassClearedCountByMenuSpeedClassIgnoreContinuity(const EMenuSpeedClassId& SpeedClassId);
	static int32 GetGrandPrixRivalLevel(EMenuSpeedClassId SpeedClassId);
	static int32 GetGrandPrixWinCount();
	static int32 GetHonorTitleIndex();
	static struct FHonorTitleListData GetHonorTitleInfo();
	static bool GetHonorTitleUnlock(int32 HonorTitleIndex);
	static bool GetIsGhostUploaded(const EStageId InStageId, const ESpeedClassId InSpeedClassId, bool* bOutIsValid);
	static bool GetIsValidGhost(const EStageId InStageId, const ESpeedClassId InSpeedClassId);
	static struct FItemSwitchSetting GetItemSwitchSetting(EGameModeId InGameModeId);
	static struct FItemSwitchSettingSave GetItemSwitchSettingSave(EGameModeId InGameModeId);
	static void GetMachineColorPresetAll(TArray<EMachineColorPresetId>* OutMachineColorPresetId);
	static void GetMachinePartsAll(TArray<EMachineId>* OutFrontPartsId, TArray<EMachineId>* OutRearPartsId, TArray<EMachineId>* OutTirePartsId);
	static bool GetNewHonorTitleUnlocked(int32 HonorTitleIndex);
	static bool GetNoticeLobbyInvitationOnRace();
	static int32 GetPlayerIconBgColorId();
	static int32 GetPlayerIconId();
	static EGrandPrixProgressId GetProgressIdGrandPrixAnyClass(EGrandPrixId GrandPrixId);
	static EGrandPrixProgressId GetProgressIdGrandPrixMenuSpeedClass(const EGrandPrixId& GrandPirxId, const EMenuSpeedClassId& MenuSpeedClassId);
	static void GetRaceParkCustomRaceSetting(struct FPartyRacePresetSetting* OutSetting);
	static int32 GetRaceStatsValue(const EStatsEventId InStatsId);
	static TArray<bool> GetRedStarRingAcquisitionPerStage(const EStageId InStageId);
	static int32 GetRivalAppearanceCount(EDriverId DriverId);
	static int32 GetRivalAppearanceCountMin(const TArray<EDriverId>& CheckDriverIds, const TArray<EDriverId>& IgnoreDriverIds);
	static int32 GetRivalLevelAdjust();
	static int32 GetRivalWinCount(EDriverId DriverId);
	static int32 GetRivalWinRewardEventCount();
	static int32 GetSelectedGadgetPresetId(int32 InPlayerIndex);
	static TArray<int32> GetSelectedGadgetPresetIdsAllPlayer();
	static ETimeTrialWinLoseDispId GetTimeTrialLastResultId();
	static bool GetTimeTrialMedalAcquisition(const EStageId InStageId, const ESpeedClassId InSpeedClassId);
	static struct FUserTimeTrialRaceData GetTimeTrialRaceData(const EStageId InStageId, const ESpeedClassId InSpeedClassId, bool* bOutIsGhostValid);
	static int32 GetTimeTrialRewardCount();
	static uint8 GetTipsDisplayIndex();
	static uint8 GetTopKnockdownRivalLevel(const EMenuSpeedClassId SpeedClassId, const EDriverId DriverId);
	static TArray<uint8> GetTopKnockdownRivalLevelArray(const EMenuSpeedClassId SpeedClassId);
	static bool GetTrackAvailable(int32 ID);
	static bool GetTutorialActionCompletedFlag(const ETutorialAction tutorialAction);
	static bool GetTutorialCompletedFlagPerStage(const EStageId InStageId);
	static bool GetTutorialPopupDispFlag();
	static void GetUserCommonData(struct FUserCommonData* OutUserCommonData);
	static void GetUserDriverData(struct FUserDriverData* OutUserDriverData);
	static void GetUserDriverProperty(EDriverId InDriverId, struct FUserDriverProperty* OutUserDriverProperty);
	static void GetUserHintData(struct FUserHintData* OutUserHintData);
	static void GetUserHintProperty(EHintId InHintId, struct FUserHintProperty* OutUserHintProperty);
	static void GetUserMachineCustomizeData(EMachineId InMachineID, struct FUserMachineCustomizeData* OutUserMachineCustomizeData);
	static int32 GetUserNiceCount();
	static void GetUserRewardGetDisplayRequestData(struct FUserRewardGetDisplayRequestData* OutUserRewardGetDisplayRequestData);
	static EDriverId GetUserSelectedDriverId();
	static EMachineId GetUserSelectedMachineId();
	static bool HasAgreedNoticeAgreement();
	static bool HasEnteredMachineCustomizeSequence();
	static bool IsClearedGrandPrixAnySpeedClass(EGrandPrixId GrandPrixId);
	static bool IsClearedGrandPrixMenuSpeedClass(const EGrandPrixId& GrandPirxId, const EMenuSpeedClassId& SpeedClassId);
	static bool IsCompletedGrandPrixEvent(EGrandPrixEventFlag EventFlagId);
	static bool IsCompletedMachineParts(EMachineId InMachineID);
	static bool IsCompleteMainChallenge();
	static bool IsCompleteSpecialChallenge();
	static bool IsDiffGadgetPresetIds(const TArray<int32>& GadgetPresetIds);
	static bool IsFinishedAdvertiseLogoFlow();
	static bool IsGetFrontParts(EMachineId InMachineID);
