#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnionUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ImageWriteQueue_structs.hpp"


namespace SDK::Params
{

// Function UnionUI.BPFL_ChallengeManagerUtil.GetChallengeClearList
// 0x0018 (0x0018 - 0x0000)
struct BPFL_ChallengeManagerUtil_GetChallengeClearList final
{
public:
	int32                                         ListLength;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChallengeStruct>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_ChallengeManagerUtil_GetChallengeClearList) == 0x000008, "Wrong alignment on BPFL_ChallengeManagerUtil_GetChallengeClearList");
static_assert(sizeof(BPFL_ChallengeManagerUtil_GetChallengeClearList) == 0x000018, "Wrong size on BPFL_ChallengeManagerUtil_GetChallengeClearList");
static_assert(offsetof(BPFL_ChallengeManagerUtil_GetChallengeClearList, ListLength) == 0x000000, "Member 'BPFL_ChallengeManagerUtil_GetChallengeClearList::ListLength' has a wrong offset!");
static_assert(offsetof(BPFL_ChallengeManagerUtil_GetChallengeClearList, ReturnValue) == 0x000008, "Member 'BPFL_ChallengeManagerUtil_GetChallengeClearList::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_ChallengeManagerUtil.GetChallengeClearOwnerList
// 0x0010 (0x0010 - 0x0000)
struct BPFL_ChallengeManagerUtil_GetChallengeClearOwnerList final
{
public:
	TArray<struct FChallengeOwnerStruct>          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_ChallengeManagerUtil_GetChallengeClearOwnerList) == 0x000008, "Wrong alignment on BPFL_ChallengeManagerUtil_GetChallengeClearOwnerList");
static_assert(sizeof(BPFL_ChallengeManagerUtil_GetChallengeClearOwnerList) == 0x000010, "Wrong size on BPFL_ChallengeManagerUtil_GetChallengeClearOwnerList");
static_assert(offsetof(BPFL_ChallengeManagerUtil_GetChallengeClearOwnerList, ReturnValue) == 0x000000, "Member 'BPFL_ChallengeManagerUtil_GetChallengeClearOwnerList::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_ChallengeManagerUtil.GetChallengeProgress
// 0x0010 (0x0010 - 0x0000)
struct BPFL_ChallengeManagerUtil_GetChallengeProgress final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NowProgress;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BPFL_ChallengeManagerUtil_GetChallengeProgress) == 0x000008, "Wrong alignment on BPFL_ChallengeManagerUtil_GetChallengeProgress");
static_assert(sizeof(BPFL_ChallengeManagerUtil_GetChallengeProgress) == 0x000010, "Wrong size on BPFL_ChallengeManagerUtil_GetChallengeProgress");
static_assert(offsetof(BPFL_ChallengeManagerUtil_GetChallengeProgress, WorldContextObject) == 0x000000, "Member 'BPFL_ChallengeManagerUtil_GetChallengeProgress::WorldContextObject' has a wrong offset!");
static_assert(offsetof(BPFL_ChallengeManagerUtil_GetChallengeProgress, NowProgress) == 0x000008, "Member 'BPFL_ChallengeManagerUtil_GetChallengeProgress::NowProgress' has a wrong offset!");

// Function UnionUI.BPFL_ChallengeManagerUtil.GetChallengeSaveData
// 0x0018 (0x0018 - 0x0000)
struct BPFL_ChallengeManagerUtil_GetChallengeSaveData final
{
public:
	EChallengeCategory                            InCategory;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChallengeStruct>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_ChallengeManagerUtil_GetChallengeSaveData) == 0x000008, "Wrong alignment on BPFL_ChallengeManagerUtil_GetChallengeSaveData");
static_assert(sizeof(BPFL_ChallengeManagerUtil_GetChallengeSaveData) == 0x000018, "Wrong size on BPFL_ChallengeManagerUtil_GetChallengeSaveData");
static_assert(offsetof(BPFL_ChallengeManagerUtil_GetChallengeSaveData, InCategory) == 0x000000, "Member 'BPFL_ChallengeManagerUtil_GetChallengeSaveData::InCategory' has a wrong offset!");
static_assert(offsetof(BPFL_ChallengeManagerUtil_GetChallengeSaveData, ReturnValue) == 0x000008, "Member 'BPFL_ChallengeManagerUtil_GetChallengeSaveData::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_ChallengeManagerUtil.GetChallengeShowList
// 0x0010 (0x0010 - 0x0000)
struct BPFL_ChallengeManagerUtil_GetChallengeShowList final
{
public:
	TArray<struct FChallengeStruct>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_ChallengeManagerUtil_GetChallengeShowList) == 0x000008, "Wrong alignment on BPFL_ChallengeManagerUtil_GetChallengeShowList");
static_assert(sizeof(BPFL_ChallengeManagerUtil_GetChallengeShowList) == 0x000010, "Wrong size on BPFL_ChallengeManagerUtil_GetChallengeShowList");
static_assert(offsetof(BPFL_ChallengeManagerUtil_GetChallengeShowList, ReturnValue) == 0x000000, "Member 'BPFL_ChallengeManagerUtil_GetChallengeShowList::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_ChallengeManagerUtil.GetSpecialChallengeProgress
// 0x0010 (0x0010 - 0x0000)
struct BPFL_ChallengeManagerUtil_GetSpecialChallengeProgress final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NowProgress;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BPFL_ChallengeManagerUtil_GetSpecialChallengeProgress) == 0x000008, "Wrong alignment on BPFL_ChallengeManagerUtil_GetSpecialChallengeProgress");
static_assert(sizeof(BPFL_ChallengeManagerUtil_GetSpecialChallengeProgress) == 0x000010, "Wrong size on BPFL_ChallengeManagerUtil_GetSpecialChallengeProgress");
static_assert(offsetof(BPFL_ChallengeManagerUtil_GetSpecialChallengeProgress, WorldContextObject) == 0x000000, "Member 'BPFL_ChallengeManagerUtil_GetSpecialChallengeProgress::WorldContextObject' has a wrong offset!");
static_assert(offsetof(BPFL_ChallengeManagerUtil_GetSpecialChallengeProgress, NowProgress) == 0x000008, "Member 'BPFL_ChallengeManagerUtil_GetSpecialChallengeProgress::NowProgress' has a wrong offset!");

// Function UnionUI.BPFL_ChallengeManagerUtil.IsChallengeCategoryClear
// 0x0002 (0x0002 - 0x0000)
struct BPFL_ChallengeManagerUtil_IsChallengeCategoryClear final
{
public:
	EChallengeCategory                            Category;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_ChallengeManagerUtil_IsChallengeCategoryClear) == 0x000001, "Wrong alignment on BPFL_ChallengeManagerUtil_IsChallengeCategoryClear");
static_assert(sizeof(BPFL_ChallengeManagerUtil_IsChallengeCategoryClear) == 0x000002, "Wrong size on BPFL_ChallengeManagerUtil_IsChallengeCategoryClear");
static_assert(offsetof(BPFL_ChallengeManagerUtil_IsChallengeCategoryClear, Category) == 0x000000, "Member 'BPFL_ChallengeManagerUtil_IsChallengeCategoryClear::Category' has a wrong offset!");
static_assert(offsetof(BPFL_ChallengeManagerUtil_IsChallengeCategoryClear, ReturnValue) == 0x000001, "Member 'BPFL_ChallengeManagerUtil_IsChallengeCategoryClear::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_ChallengeManagerUtil.IsOpenSpecialChallenge
// 0x0001 (0x0001 - 0x0000)
struct BPFL_ChallengeManagerUtil_IsOpenSpecialChallenge final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_ChallengeManagerUtil_IsOpenSpecialChallenge) == 0x000001, "Wrong alignment on BPFL_ChallengeManagerUtil_IsOpenSpecialChallenge");
static_assert(sizeof(BPFL_ChallengeManagerUtil_IsOpenSpecialChallenge) == 0x000001, "Wrong size on BPFL_ChallengeManagerUtil_IsOpenSpecialChallenge");
static_assert(offsetof(BPFL_ChallengeManagerUtil_IsOpenSpecialChallenge, ReturnValue) == 0x000000, "Member 'BPFL_ChallengeManagerUtil_IsOpenSpecialChallenge::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_UnionUI.ConvertMenuButtonType
// 0x0018 (0x0018 - 0x0000)
struct BPFL_UnionUI_ConvertMenuButtonType final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OutIsValid;                                        // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonMenuButtonType                         ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BPFL_UnionUI_ConvertMenuButtonType) == 0x000008, "Wrong alignment on BPFL_UnionUI_ConvertMenuButtonType");
static_assert(sizeof(BPFL_UnionUI_ConvertMenuButtonType) == 0x000018, "Wrong size on BPFL_UnionUI_ConvertMenuButtonType");
static_assert(offsetof(BPFL_UnionUI_ConvertMenuButtonType, InString) == 0x000000, "Member 'BPFL_UnionUI_ConvertMenuButtonType::InString' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_ConvertMenuButtonType, OutIsValid) == 0x000010, "Member 'BPFL_UnionUI_ConvertMenuButtonType::OutIsValid' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_ConvertMenuButtonType, ReturnValue) == 0x000011, "Member 'BPFL_UnionUI_ConvertMenuButtonType::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_UnionUI.GetArrowKeyControlDir
// 0x0048 (0x0048 - 0x0000)
struct BPFL_UnionUI_GetArrowKeyControlDir final
{
public:
	struct FKeyEvent                              InKeyEvent;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EUnionUIControlDir                            OutControlDir;                                     // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BPFL_UnionUI_GetArrowKeyControlDir) == 0x000008, "Wrong alignment on BPFL_UnionUI_GetArrowKeyControlDir");
static_assert(sizeof(BPFL_UnionUI_GetArrowKeyControlDir) == 0x000048, "Wrong size on BPFL_UnionUI_GetArrowKeyControlDir");
static_assert(offsetof(BPFL_UnionUI_GetArrowKeyControlDir, InKeyEvent) == 0x000000, "Member 'BPFL_UnionUI_GetArrowKeyControlDir::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_GetArrowKeyControlDir, OutControlDir) == 0x000040, "Member 'BPFL_UnionUI_GetArrowKeyControlDir::OutControlDir' has a wrong offset!");

// Function UnionUI.BPFL_UnionUI.GetDPadControlDir
// 0x0048 (0x0048 - 0x0000)
struct BPFL_UnionUI_GetDPadControlDir final
{
public:
	struct FKeyEvent                              InKeyEvent;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EUnionUIControlDir                            OutControlDir;                                     // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BPFL_UnionUI_GetDPadControlDir) == 0x000008, "Wrong alignment on BPFL_UnionUI_GetDPadControlDir");
static_assert(sizeof(BPFL_UnionUI_GetDPadControlDir) == 0x000048, "Wrong size on BPFL_UnionUI_GetDPadControlDir");
static_assert(offsetof(BPFL_UnionUI_GetDPadControlDir, InKeyEvent) == 0x000000, "Member 'BPFL_UnionUI_GetDPadControlDir::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_GetDPadControlDir, OutControlDir) == 0x000040, "Member 'BPFL_UnionUI_GetDPadControlDir::OutControlDir' has a wrong offset!");

// Function UnionUI.BPFL_UnionUI.GetJoyStickControlDir
// 0x0048 (0x0048 - 0x0000)
struct BPFL_UnionUI_GetJoyStickControlDir final
{
public:
	struct FKeyEvent                              InKeyEvent;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EUnionUIControlDir                            OutControlDir;                                     // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BPFL_UnionUI_GetJoyStickControlDir) == 0x000008, "Wrong alignment on BPFL_UnionUI_GetJoyStickControlDir");
static_assert(sizeof(BPFL_UnionUI_GetJoyStickControlDir) == 0x000048, "Wrong size on BPFL_UnionUI_GetJoyStickControlDir");
static_assert(offsetof(BPFL_UnionUI_GetJoyStickControlDir, InKeyEvent) == 0x000000, "Member 'BPFL_UnionUI_GetJoyStickControlDir::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_GetJoyStickControlDir, OutControlDir) == 0x000040, "Member 'BPFL_UnionUI_GetJoyStickControlDir::OutControlDir' has a wrong offset!");

// Function UnionUI.BPFL_UnionUI.GetKeyboardControlDir
// 0x0048 (0x0048 - 0x0000)
struct BPFL_UnionUI_GetKeyboardControlDir final
{
public:
	struct FKeyEvent                              InKeyEvent;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EUnionUIControlDir                            OutControlDir;                                     // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BPFL_UnionUI_GetKeyboardControlDir) == 0x000008, "Wrong alignment on BPFL_UnionUI_GetKeyboardControlDir");
static_assert(sizeof(BPFL_UnionUI_GetKeyboardControlDir) == 0x000048, "Wrong size on BPFL_UnionUI_GetKeyboardControlDir");
static_assert(offsetof(BPFL_UnionUI_GetKeyboardControlDir, InKeyEvent) == 0x000000, "Member 'BPFL_UnionUI_GetKeyboardControlDir::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_GetKeyboardControlDir, OutControlDir) == 0x000040, "Member 'BPFL_UnionUI_GetKeyboardControlDir::OutControlDir' has a wrong offset!");

// Function UnionUI.BPFL_UnionUI.GetTerminologyText
// 0x0028 (0x0028 - 0x0000)
struct BPFL_UnionUI_GetTerminologyText final
{
public:
	class FName                                   InTableId;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InKey;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionUI_GetTerminologyText) == 0x000008, "Wrong alignment on BPFL_UnionUI_GetTerminologyText");
static_assert(sizeof(BPFL_UnionUI_GetTerminologyText) == 0x000028, "Wrong size on BPFL_UnionUI_GetTerminologyText");
static_assert(offsetof(BPFL_UnionUI_GetTerminologyText, InTableId) == 0x000000, "Member 'BPFL_UnionUI_GetTerminologyText::InTableId' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_GetTerminologyText, InKey) == 0x000008, "Member 'BPFL_UnionUI_GetTerminologyText::InKey' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_GetTerminologyText, ReturnValue) == 0x000018, "Member 'BPFL_UnionUI_GetTerminologyText::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_UnionUI.GetTerminologyTextByText
// 0x0020 (0x0020 - 0x0000)
struct BPFL_UnionUI_GetTerminologyTextByText final
{
public:
	class FText                                   InTex;                                             // 0x0000(0x0010)(ConstParm, Parm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionUI_GetTerminologyTextByText) == 0x000008, "Wrong alignment on BPFL_UnionUI_GetTerminologyTextByText");
static_assert(sizeof(BPFL_UnionUI_GetTerminologyTextByText) == 0x000020, "Wrong size on BPFL_UnionUI_GetTerminologyTextByText");
static_assert(offsetof(BPFL_UnionUI_GetTerminologyTextByText, InTex) == 0x000000, "Member 'BPFL_UnionUI_GetTerminologyTextByText::InTex' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_GetTerminologyTextByText, ReturnValue) == 0x000010, "Member 'BPFL_UnionUI_GetTerminologyTextByText::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_UnionUI.GetTextAddCommasToValue
// 0x0018 (0x0018 - 0x0000)
struct BPFL_UnionUI_GetTextAddCommasToValue final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionUI_GetTextAddCommasToValue) == 0x000008, "Wrong alignment on BPFL_UnionUI_GetTextAddCommasToValue");
static_assert(sizeof(BPFL_UnionUI_GetTextAddCommasToValue) == 0x000018, "Wrong size on BPFL_UnionUI_GetTextAddCommasToValue");
static_assert(offsetof(BPFL_UnionUI_GetTextAddCommasToValue, InValue) == 0x000000, "Member 'BPFL_UnionUI_GetTextAddCommasToValue::InValue' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_GetTextAddCommasToValue, ReturnValue) == 0x000008, "Member 'BPFL_UnionUI_GetTextAddCommasToValue::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_UnionUI.GetUserIndexByFocusEvent
// 0x000C (0x000C - 0x0000)
struct BPFL_UnionUI_GetUserIndexByFocusEvent final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionUI_GetUserIndexByFocusEvent) == 0x000004, "Wrong alignment on BPFL_UnionUI_GetUserIndexByFocusEvent");
static_assert(sizeof(BPFL_UnionUI_GetUserIndexByFocusEvent) == 0x00000C, "Wrong size on BPFL_UnionUI_GetUserIndexByFocusEvent");
static_assert(offsetof(BPFL_UnionUI_GetUserIndexByFocusEvent, InFocusEvent) == 0x000000, "Member 'BPFL_UnionUI_GetUserIndexByFocusEvent::InFocusEvent' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_GetUserIndexByFocusEvent, ReturnValue) == 0x000008, "Member 'BPFL_UnionUI_GetUserIndexByFocusEvent::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_UnionUI.GetUserIndexByInputEvent
// 0x0028 (0x0028 - 0x0000)
struct BPFL_UnionUI_GetUserIndexByInputEvent final
{
public:
	struct FInputEvent                            InInputEvent;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BPFL_UnionUI_GetUserIndexByInputEvent) == 0x000008, "Wrong alignment on BPFL_UnionUI_GetUserIndexByInputEvent");
static_assert(sizeof(BPFL_UnionUI_GetUserIndexByInputEvent) == 0x000028, "Wrong size on BPFL_UnionUI_GetUserIndexByInputEvent");
static_assert(offsetof(BPFL_UnionUI_GetUserIndexByInputEvent, InInputEvent) == 0x000000, "Member 'BPFL_UnionUI_GetUserIndexByInputEvent::InInputEvent' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_GetUserIndexByInputEvent, ReturnValue) == 0x000020, "Member 'BPFL_UnionUI_GetUserIndexByInputEvent::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_UnionUI.GetUserIndexByMouseEvent
// 0x0080 (0x0080 - 0x0000)
struct BPFL_UnionUI_GetUserIndexByMouseEvent final
{
public:
	struct FPointerEvent                          InInputEvent;                                      // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0078(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BPFL_UnionUI_GetUserIndexByMouseEvent) == 0x000008, "Wrong alignment on BPFL_UnionUI_GetUserIndexByMouseEvent");
static_assert(sizeof(BPFL_UnionUI_GetUserIndexByMouseEvent) == 0x000080, "Wrong size on BPFL_UnionUI_GetUserIndexByMouseEvent");
static_assert(offsetof(BPFL_UnionUI_GetUserIndexByMouseEvent, InInputEvent) == 0x000000, "Member 'BPFL_UnionUI_GetUserIndexByMouseEvent::InInputEvent' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_GetUserIndexByMouseEvent, ReturnValue) == 0x000078, "Member 'BPFL_UnionUI_GetUserIndexByMouseEvent::ReturnValue' has a wrong offset!");

// Function UnionUI.BPFL_UnionUI.GetWidgetRenderTransform
// 0x0040 (0x0040 - 0x0000)
struct BPFL_UnionUI_GetWidgetRenderTransform final
{
public:
	const class UWidget*                          InWidget;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWidgetTransform                       OutRenderTransform;                                // 0x0008(0x0038)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPFL_UnionUI_GetWidgetRenderTransform) == 0x000008, "Wrong alignment on BPFL_UnionUI_GetWidgetRenderTransform");
static_assert(sizeof(BPFL_UnionUI_GetWidgetRenderTransform) == 0x000040, "Wrong size on BPFL_UnionUI_GetWidgetRenderTransform");
static_assert(offsetof(BPFL_UnionUI_GetWidgetRenderTransform, InWidget) == 0x000000, "Member 'BPFL_UnionUI_GetWidgetRenderTransform::InWidget' has a wrong offset!");
static_assert(offsetof(BPFL_UnionUI_GetWidgetRenderTransform, OutRenderTransform) == 0x000008, "Member 'BPFL_UnionUI_GetWidgetRenderTransform::OutRenderTransform' has a wrong offset!");

// Function UnionUI.FontFunctionObject.CalcFontPoint
// 0x0010 (0x0010 - 0x0000)
struct FontFunctionObject_CalcFontPoint final
{
public:
	EFontSizeType                                 InSrcFontType;                                     // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFontSizeType                                 InDstFontType;                                     // 0x0001(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InFontPoint;                                       // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OutFontPoint;                                      // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FontFunctionObject_CalcFontPoint) == 0x000004, "Wrong alignment on FontFunctionObject_CalcFontPoint");
static_assert(sizeof(FontFunctionObject_CalcFontPoint) == 0x000010, "Wrong size on FontFunctionObject_CalcFontPoint");
static_assert(offsetof(FontFunctionObject_CalcFontPoint, InSrcFontType) == 0x000000, "Member 'FontFunctionObject_CalcFontPoint::InSrcFontType' has a wrong offset!");
static_assert(offsetof(FontFunctionObject_CalcFontPoint, InDstFontType) == 0x000001, "Member 'FontFunctionObject_CalcFontPoint::InDstFontType' has a wrong offset!");
static_assert(offsetof(FontFunctionObject_CalcFontPoint, InFontPoint) == 0x000004, "Member 'FontFunctionObject_CalcFontPoint::InFontPoint' has a wrong offset!");
static_assert(offsetof(FontFunctionObject_CalcFontPoint, bSuccess) == 0x000008, "Member 'FontFunctionObject_CalcFontPoint::bSuccess' has a wrong offset!");
static_assert(offsetof(FontFunctionObject_CalcFontPoint, OutFontPoint) == 0x00000C, "Member 'FontFunctionObject_CalcFontPoint::OutFontPoint' has a wrong offset!");

// Function UnionUI.WidgetManContainer.AddWidget
// 0x0020 (0x0020 - 0x0000)
struct WidgetManContainer_AddWidget final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvasPanelSlot*                       Slot;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                LogicObjectRef;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSucceeded;                                        // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetManContainer_AddWidget) == 0x000008, "Wrong alignment on WidgetManContainer_AddWidget");
static_assert(sizeof(WidgetManContainer_AddWidget) == 0x000020, "Wrong size on WidgetManContainer_AddWidget");
static_assert(offsetof(WidgetManContainer_AddWidget, Widget) == 0x000000, "Member 'WidgetManContainer_AddWidget::Widget' has a wrong offset!");
static_assert(offsetof(WidgetManContainer_AddWidget, Slot) == 0x000008, "Member 'WidgetManContainer_AddWidget::Slot' has a wrong offset!");
static_assert(offsetof(WidgetManContainer_AddWidget, LogicObjectRef) == 0x000010, "Member 'WidgetManContainer_AddWidget::LogicObjectRef' has a wrong offset!");
static_assert(offsetof(WidgetManContainer_AddWidget, bSucceeded) == 0x000018, "Member 'WidgetManContainer_AddWidget::bSucceeded' has a wrong offset!");

// Function UnionUI.WidgetManContainer.FindWidget
// 0x0010 (0x0010 - 0x0000)
struct WidgetManContainer_FindWidget final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFound;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetManContainer_FindWidget) == 0x000008, "Wrong alignment on WidgetManContainer_FindWidget");
static_assert(sizeof(WidgetManContainer_FindWidget) == 0x000010, "Wrong size on WidgetManContainer_FindWidget");
static_assert(offsetof(WidgetManContainer_FindWidget, Widget) == 0x000000, "Member 'WidgetManContainer_FindWidget::Widget' has a wrong offset!");
static_assert(offsetof(WidgetManContainer_FindWidget, IsFound) == 0x000008, "Member 'WidgetManContainer_FindWidget::IsFound' has a wrong offset!");
static_assert(offsetof(WidgetManContainer_FindWidget, Index_0) == 0x00000C, "Member 'WidgetManContainer_FindWidget::Index_0' has a wrong offset!");

// Function UnionUI.WidgetManContainer.GetWidgetAt
// 0x0018 (0x0018 - 0x0000)
struct WidgetManContainer_GetWidgetAt final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSucceeded;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                LogicObject;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetManContainer_GetWidgetAt) == 0x000008, "Wrong alignment on WidgetManContainer_GetWidgetAt");
static_assert(sizeof(WidgetManContainer_GetWidgetAt) == 0x000018, "Wrong size on WidgetManContainer_GetWidgetAt");
static_assert(offsetof(WidgetManContainer_GetWidgetAt, Index_0) == 0x000000, "Member 'WidgetManContainer_GetWidgetAt::Index_0' has a wrong offset!");
static_assert(offsetof(WidgetManContainer_GetWidgetAt, IsSucceeded) == 0x000004, "Member 'WidgetManContainer_GetWidgetAt::IsSucceeded' has a wrong offset!");
static_assert(offsetof(WidgetManContainer_GetWidgetAt, Widget) == 0x000008, "Member 'WidgetManContainer_GetWidgetAt::Widget' has a wrong offset!");
static_assert(offsetof(WidgetManContainer_GetWidgetAt, LogicObject) == 0x000010, "Member 'WidgetManContainer_GetWidgetAt::LogicObject' has a wrong offset!");

// Function UnionUI.WidgetManContainer.GetWidgetCount
// 0x0004 (0x0004 - 0x0000)
struct WidgetManContainer_GetWidgetCount final
{
public:
	int32                                         WidgetCount;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetManContainer_GetWidgetCount) == 0x000004, "Wrong alignment on WidgetManContainer_GetWidgetCount");
static_assert(sizeof(WidgetManContainer_GetWidgetCount) == 0x000004, "Wrong size on WidgetManContainer_GetWidgetCount");
static_assert(offsetof(WidgetManContainer_GetWidgetCount, WidgetCount) == 0x000000, "Member 'WidgetManContainer_GetWidgetCount::WidgetCount' has a wrong offset!");

// Function UnionUI.WidgetManContainer.Initialize
// 0x0028 (0x0028 - 0x0000)
struct WidgetManContainer_Initialize final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ZOrder;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       Slot;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                LogicObjectRef;                                    // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSubWidget;                                        // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WidgetManContainer_Initialize) == 0x000008, "Wrong alignment on WidgetManContainer_Initialize");
static_assert(sizeof(WidgetManContainer_Initialize) == 0x000028, "Wrong size on WidgetManContainer_Initialize");
static_assert(offsetof(WidgetManContainer_Initialize, Widget) == 0x000000, "Member 'WidgetManContainer_Initialize::Widget' has a wrong offset!");
static_assert(offsetof(WidgetManContainer_Initialize, ZOrder) == 0x000008, "Member 'WidgetManContainer_Initialize::ZOrder' has a wrong offset!");
static_assert(offsetof(WidgetManContainer_Initialize, Slot) == 0x000010, "Member 'WidgetManContainer_Initialize::Slot' has a wrong offset!");
static_assert(offsetof(WidgetManContainer_Initialize, LogicObjectRef) == 0x000018, "Member 'WidgetManContainer_Initialize::LogicObjectRef' has a wrong offset!");
static_assert(offsetof(WidgetManContainer_Initialize, bSubWidget) == 0x000020, "Member 'WidgetManContainer_Initialize::bSubWidget' has a wrong offset!");

// Function UnionUI.WidgetManContainer.IsSubWidgetContainer
// 0x0001 (0x0001 - 0x0000)
struct WidgetManContainer_IsSubWidgetContainer final
{
public:
	bool                                          bSubWidget;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetManContainer_IsSubWidgetContainer) == 0x000001, "Wrong alignment on WidgetManContainer_IsSubWidgetContainer");
static_assert(sizeof(WidgetManContainer_IsSubWidgetContainer) == 0x000001, "Wrong size on WidgetManContainer_IsSubWidgetContainer");
static_assert(offsetof(WidgetManContainer_IsSubWidgetContainer, bSubWidget) == 0x000000, "Member 'WidgetManContainer_IsSubWidgetContainer::bSubWidget' has a wrong offset!");

// Function UnionUI.WidgetManContainer.OffsetZOrder
// 0x0004 (0x0004 - 0x0000)
struct WidgetManContainer_OffsetZOrder final
{
public:
	int32                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetManContainer_OffsetZOrder) == 0x000004, "Wrong alignment on WidgetManContainer_OffsetZOrder");
static_assert(sizeof(WidgetManContainer_OffsetZOrder) == 0x000004, "Wrong size on WidgetManContainer_OffsetZOrder");
static_assert(offsetof(WidgetManContainer_OffsetZOrder, Offset) == 0x000000, "Member 'WidgetManContainer_OffsetZOrder::Offset' has a wrong offset!");

// Function UnionUI.WidgetManContainer.SetZOrder
// 0x0004 (0x0004 - 0x0000)
struct WidgetManContainer_SetZOrder final
{
public:
	int32                                         InZOrder;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WidgetManContainer_SetZOrder) == 0x000004, "Wrong alignment on WidgetManContainer_SetZOrder");
static_assert(sizeof(WidgetManContainer_SetZOrder) == 0x000004, "Wrong size on WidgetManContainer_SetZOrder");
static_assert(offsetof(WidgetManContainer_SetZOrder, InZOrder) == 0x000000, "Member 'WidgetManContainer_SetZOrder::InZOrder' has a wrong offset!");

// Function UnionUI.MenuCameraManager.CameraCharaSlide
// 0x0010 (0x0010 - 0x0000)
struct MenuCameraManager_CameraCharaSlide final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MenuCameraManager_CameraCharaSlide) == 0x000008, "Wrong alignment on MenuCameraManager_CameraCharaSlide");
static_assert(sizeof(MenuCameraManager_CameraCharaSlide) == 0x000010, "Wrong size on MenuCameraManager_CameraCharaSlide");
static_assert(offsetof(MenuCameraManager_CameraCharaSlide, Target) == 0x000000, "Member 'MenuCameraManager_CameraCharaSlide::Target' has a wrong offset!");
static_assert(offsetof(MenuCameraManager_CameraCharaSlide, Time) == 0x000008, "Member 'MenuCameraManager_CameraCharaSlide::Time' has a wrong offset!");

// Function UnionUI.MenuCameraManager.CameraMoveToTransform
// 0x0070 (0x0070 - 0x0000)
struct MenuCameraManager_CameraMoveToTransform final
{
public:
	struct FTransform                             TargetTransform;                                   // 0x0000(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MenuCameraManager_CameraMoveToTransform) == 0x000010, "Wrong alignment on MenuCameraManager_CameraMoveToTransform");
static_assert(sizeof(MenuCameraManager_CameraMoveToTransform) == 0x000070, "Wrong size on MenuCameraManager_CameraMoveToTransform");
static_assert(offsetof(MenuCameraManager_CameraMoveToTransform, TargetTransform) == 0x000000, "Member 'MenuCameraManager_CameraMoveToTransform::TargetTransform' has a wrong offset!");
static_assert(offsetof(MenuCameraManager_CameraMoveToTransform, Time) == 0x000060, "Member 'MenuCameraManager_CameraMoveToTransform::Time' has a wrong offset!");

// Function UnionUI.MenuCameraManager.CameraZoomIn
// 0x0010 (0x0010 - 0x0000)
struct MenuCameraManager_CameraZoomIn final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MenuCameraManager_CameraZoomIn) == 0x000008, "Wrong alignment on MenuCameraManager_CameraZoomIn");
static_assert(sizeof(MenuCameraManager_CameraZoomIn) == 0x000010, "Wrong size on MenuCameraManager_CameraZoomIn");
static_assert(offsetof(MenuCameraManager_CameraZoomIn, Target) == 0x000000, "Member 'MenuCameraManager_CameraZoomIn::Target' has a wrong offset!");
static_assert(offsetof(MenuCameraManager_CameraZoomIn, Time) == 0x000008, "Member 'MenuCameraManager_CameraZoomIn::Time' has a wrong offset!");

// Function UnionUI.MenuCameraManager.CameraZoomOut
// 0x0004 (0x0004 - 0x0000)
struct MenuCameraManager_CameraZoomOut final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MenuCameraManager_CameraZoomOut) == 0x000004, "Wrong alignment on MenuCameraManager_CameraZoomOut");
static_assert(sizeof(MenuCameraManager_CameraZoomOut) == 0x000004, "Wrong size on MenuCameraManager_CameraZoomOut");
static_assert(offsetof(MenuCameraManager_CameraZoomOut, Time) == 0x000000, "Member 'MenuCameraManager_CameraZoomOut::Time' has a wrong offset!");

// Function UnionUI.MenuCameraManager.SetCameraParam
// 0x0010 (0x0010 - 0x0000)
struct MenuCameraManager_SetCameraParam final
{
public:
	class AActor*                                 Camera;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEasingFunc                                   InEasingFunc;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MenuCameraManager_SetCameraParam) == 0x000008, "Wrong alignment on MenuCameraManager_SetCameraParam");
static_assert(sizeof(MenuCameraManager_SetCameraParam) == 0x000010, "Wrong size on MenuCameraManager_SetCameraParam");
static_assert(offsetof(MenuCameraManager_SetCameraParam, Camera) == 0x000000, "Member 'MenuCameraManager_SetCameraParam::Camera' has a wrong offset!");
static_assert(offsetof(MenuCameraManager_SetCameraParam, InEasingFunc) == 0x000008, "Member 'MenuCameraManager_SetCameraParam::InEasingFunc' has a wrong offset!");

// Function UnionUI.MenuCameraManager.SetLookAtRacerCameraPos
// 0x0030 (0x0030 - 0x0000)
struct MenuCameraManager_SetLookAtRacerCameraPos final
{
public:
	struct FVector                                OffsetPos;                                         // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OffsetLookAtPos;                                   // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MenuCameraManager_SetLookAtRacerCameraPos) == 0x000008, "Wrong alignment on MenuCameraManager_SetLookAtRacerCameraPos");
static_assert(sizeof(MenuCameraManager_SetLookAtRacerCameraPos) == 0x000030, "Wrong size on MenuCameraManager_SetLookAtRacerCameraPos");
static_assert(offsetof(MenuCameraManager_SetLookAtRacerCameraPos, OffsetPos) == 0x000000, "Member 'MenuCameraManager_SetLookAtRacerCameraPos::OffsetPos' has a wrong offset!");
static_assert(offsetof(MenuCameraManager_SetLookAtRacerCameraPos, OffsetLookAtPos) == 0x000018, "Member 'MenuCameraManager_SetLookAtRacerCameraPos::OffsetLookAtPos' has a wrong offset!");

// Function UnionUI.MenuCameraManager.SetManualFocusDistance
// 0x0004 (0x0004 - 0x0000)
struct MenuCameraManager_SetManualFocusDistance final
{
public:
	float                                         InManualDistance;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MenuCameraManager_SetManualFocusDistance) == 0x000004, "Wrong alignment on MenuCameraManager_SetManualFocusDistance");
static_assert(sizeof(MenuCameraManager_SetManualFocusDistance) == 0x000004, "Wrong size on MenuCameraManager_SetManualFocusDistance");
static_assert(offsetof(MenuCameraManager_SetManualFocusDistance, InManualDistance) == 0x000000, "Member 'MenuCameraManager_SetManualFocusDistance::InManualDistance' has a wrong offset!");

// Function UnionUI.MenuCameraManager.SetUpCameraFOV
// 0x0004 (0x0004 - 0x0000)
struct MenuCameraManager_SetUpCameraFOV final
{
public:
	float                                         InFOV;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MenuCameraManager_SetUpCameraFOV) == 0x000004, "Wrong alignment on MenuCameraManager_SetUpCameraFOV");
static_assert(sizeof(MenuCameraManager_SetUpCameraFOV) == 0x000004, "Wrong size on MenuCameraManager_SetUpCameraFOV");
static_assert(offsetof(MenuCameraManager_SetUpCameraFOV, InFOV) == 0x000000, "Member 'MenuCameraManager_SetUpCameraFOV::InFOV' has a wrong offset!");

// Function UnionUI.RichTextBlockRubyDecorator.UpdateOriginalTextIndex
// 0x0004 (0x0004 - 0x0000)
struct RichTextBlockRubyDecorator_UpdateOriginalTextIndex final
{
public:
	int32                                         InOriginalTextIndex;                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RichTextBlockRubyDecorator_UpdateOriginalTextIndex) == 0x000004, "Wrong alignment on RichTextBlockRubyDecorator_UpdateOriginalTextIndex");
static_assert(sizeof(RichTextBlockRubyDecorator_UpdateOriginalTextIndex) == 0x000004, "Wrong size on RichTextBlockRubyDecorator_UpdateOriginalTextIndex");
static_assert(offsetof(RichTextBlockRubyDecorator_UpdateOriginalTextIndex, InOriginalTextIndex) == 0x000000, "Member 'RichTextBlockRubyDecorator_UpdateOriginalTextIndex::InOriginalTextIndex' has a wrong offset!");

// Function UnionUI.UICapture2DTargetInterface.GetCaptureTargetActorArr
// 0x0010 (0x0010 - 0x0000)
struct UICapture2DTargetInterface_GetCaptureTargetActorArr final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UICapture2DTargetInterface_GetCaptureTargetActorArr) == 0x000008, "Wrong alignment on UICapture2DTargetInterface_GetCaptureTargetActorArr");
static_assert(sizeof(UICapture2DTargetInterface_GetCaptureTargetActorArr) == 0x000010, "Wrong size on UICapture2DTargetInterface_GetCaptureTargetActorArr");
static_assert(offsetof(UICapture2DTargetInterface_GetCaptureTargetActorArr, ReturnValue) == 0x000000, "Member 'UICapture2DTargetInterface_GetCaptureTargetActorArr::ReturnValue' has a wrong offset!");

// Function UnionUI.UnionComboBoxString.FilterOptions
// 0x0010 (0x0010 - 0x0000)
struct UnionComboBoxString_FilterOptions final
{
public:
	class FString                                 FilterText;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionComboBoxString_FilterOptions) == 0x000008, "Wrong alignment on UnionComboBoxString_FilterOptions");
static_assert(sizeof(UnionComboBoxString_FilterOptions) == 0x000010, "Wrong size on UnionComboBoxString_FilterOptions");
static_assert(offsetof(UnionComboBoxString_FilterOptions, FilterText) == 0x000000, "Member 'UnionComboBoxString_FilterOptions::FilterText' has a wrong offset!");

// Function UnionUI.UnionComboBoxString.InitializeOptions
// 0x0010 (0x0010 - 0x0000)
struct UnionComboBoxString_InitializeOptions final
{
public:
	TArray<class FString>                         Initialize;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionComboBoxString_InitializeOptions) == 0x000008, "Wrong alignment on UnionComboBoxString_InitializeOptions");
static_assert(sizeof(UnionComboBoxString_InitializeOptions) == 0x000010, "Wrong size on UnionComboBoxString_InitializeOptions");
static_assert(offsetof(UnionComboBoxString_InitializeOptions, Initialize) == 0x000000, "Member 'UnionComboBoxString_InitializeOptions::Initialize' has a wrong offset!");

// Function UnionUI.UnionFontScroll.SetIsRefreshingText
// 0x0001 (0x0001 - 0x0000)
struct UnionFontScroll_SetIsRefreshingText final
{
public:
	bool                                          Refreshing;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionFontScroll_SetIsRefreshingText) == 0x000001, "Wrong alignment on UnionFontScroll_SetIsRefreshingText");
static_assert(sizeof(UnionFontScroll_SetIsRefreshingText) == 0x000001, "Wrong size on UnionFontScroll_SetIsRefreshingText");
static_assert(offsetof(UnionFontScroll_SetIsRefreshingText, Refreshing) == 0x000000, "Member 'UnionFontScroll_SetIsRefreshingText::Refreshing' has a wrong offset!");

// Function UnionUI.UnionFontScroll.SetText
// 0x0010 (0x0010 - 0x0000)
struct UnionFontScroll_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionFontScroll_SetText) == 0x000008, "Wrong alignment on UnionFontScroll_SetText");
static_assert(sizeof(UnionFontScroll_SetText) == 0x000010, "Wrong size on UnionFontScroll_SetText");
static_assert(offsetof(UnionFontScroll_SetText, InText) == 0x000000, "Member 'UnionFontScroll_SetText::InText' has a wrong offset!");

// Function UnionUI.UnionFontScroll.UpdateText
// 0x0010 (0x0010 - 0x0000)
struct UnionFontScroll_UpdateText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionFontScroll_UpdateText) == 0x000008, "Wrong alignment on UnionFontScroll_UpdateText");
static_assert(sizeof(UnionFontScroll_UpdateText) == 0x000010, "Wrong size on UnionFontScroll_UpdateText");
static_assert(offsetof(UnionFontScroll_UpdateText, InText) == 0x000000, "Member 'UnionFontScroll_UpdateText::InText' has a wrong offset!");

// Function UnionUI.UnionFontScroll.UpdateTextWithoutStartScroll
// 0x0010 (0x0010 - 0x0000)
struct UnionFontScroll_UpdateTextWithoutStartScroll final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionFontScroll_UpdateTextWithoutStartScroll) == 0x000008, "Wrong alignment on UnionFontScroll_UpdateTextWithoutStartScroll");
static_assert(sizeof(UnionFontScroll_UpdateTextWithoutStartScroll) == 0x000010, "Wrong size on UnionFontScroll_UpdateTextWithoutStartScroll");
static_assert(offsetof(UnionFontScroll_UpdateTextWithoutStartScroll, InText) == 0x000000, "Member 'UnionFontScroll_UpdateTextWithoutStartScroll::InText' has a wrong offset!");

// Function UnionUI.UnionLoadingGauge.IsEqLoadingGaugeState
// 0x0001 (0x0001 - 0x0000)
struct UnionLoadingGauge_IsEqLoadingGaugeState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionLoadingGauge_IsEqLoadingGaugeState) == 0x000001, "Wrong alignment on UnionLoadingGauge_IsEqLoadingGaugeState");
static_assert(sizeof(UnionLoadingGauge_IsEqLoadingGaugeState) == 0x000001, "Wrong size on UnionLoadingGauge_IsEqLoadingGaugeState");
static_assert(offsetof(UnionLoadingGauge_IsEqLoadingGaugeState, ReturnValue) == 0x000000, "Member 'UnionLoadingGauge_IsEqLoadingGaugeState::ReturnValue' has a wrong offset!");

// Function UnionUI.UnionLoadingGauge.IsSkipLoadingGaugeState
// 0x0001 (0x0001 - 0x0000)
struct UnionLoadingGauge_IsSkipLoadingGaugeState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionLoadingGauge_IsSkipLoadingGaugeState) == 0x000001, "Wrong alignment on UnionLoadingGauge_IsSkipLoadingGaugeState");
static_assert(sizeof(UnionLoadingGauge_IsSkipLoadingGaugeState) == 0x000001, "Wrong size on UnionLoadingGauge_IsSkipLoadingGaugeState");
static_assert(offsetof(UnionLoadingGauge_IsSkipLoadingGaugeState, ReturnValue) == 0x000000, "Member 'UnionLoadingGauge_IsSkipLoadingGaugeState::ReturnValue' has a wrong offset!");

// Function UnionUI.UnionLoadingGauge.IsTargetStateBigger
// 0x0001 (0x0001 - 0x0000)
struct UnionLoadingGauge_IsTargetStateBigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionLoadingGauge_IsTargetStateBigger) == 0x000001, "Wrong alignment on UnionLoadingGauge_IsTargetStateBigger");
static_assert(sizeof(UnionLoadingGauge_IsTargetStateBigger) == 0x000001, "Wrong size on UnionLoadingGauge_IsTargetStateBigger");
static_assert(offsetof(UnionLoadingGauge_IsTargetStateBigger, ReturnValue) == 0x000000, "Member 'UnionLoadingGauge_IsTargetStateBigger::ReturnValue' has a wrong offset!");

// Function UnionUI.UnionLoadingGauge.UpdateLoadingGaugeTargetState
// 0x0001 (0x0001 - 0x0000)
struct UnionLoadingGauge_UpdateLoadingGaugeTargetState final
{
public:
	EUnionLoadingGaugeState                       InTargetState;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionLoadingGauge_UpdateLoadingGaugeTargetState) == 0x000001, "Wrong alignment on UnionLoadingGauge_UpdateLoadingGaugeTargetState");
static_assert(sizeof(UnionLoadingGauge_UpdateLoadingGaugeTargetState) == 0x000001, "Wrong size on UnionLoadingGauge_UpdateLoadingGaugeTargetState");
static_assert(offsetof(UnionLoadingGauge_UpdateLoadingGaugeTargetState, InTargetState) == 0x000000, "Member 'UnionLoadingGauge_UpdateLoadingGaugeTargetState::InTargetState' has a wrong offset!");

// Function UnionUI.MouseButtonBlueprintFunctionLibrary.IsEnableMouseClick
// 0x0001 (0x0001 - 0x0000)
struct MouseButtonBlueprintFunctionLibrary_IsEnableMouseClick final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MouseButtonBlueprintFunctionLibrary_IsEnableMouseClick) == 0x000001, "Wrong alignment on MouseButtonBlueprintFunctionLibrary_IsEnableMouseClick");
static_assert(sizeof(MouseButtonBlueprintFunctionLibrary_IsEnableMouseClick) == 0x000001, "Wrong size on MouseButtonBlueprintFunctionLibrary_IsEnableMouseClick");
static_assert(offsetof(MouseButtonBlueprintFunctionLibrary_IsEnableMouseClick, ReturnValue) == 0x000000, "Member 'MouseButtonBlueprintFunctionLibrary_IsEnableMouseClick::ReturnValue' has a wrong offset!");

// Function UnionUI.MouseButtonBlueprintFunctionLibrary.IsEnableMouseHover
// 0x0001 (0x0001 - 0x0000)
struct MouseButtonBlueprintFunctionLibrary_IsEnableMouseHover final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
