#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UNION

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "UnionUI_structs.hpp"
#include "UnionUI_classes.hpp"
#include "InputCore_structs.hpp"
#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionSystem_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UnionLib_structs.hpp"
#include "UnionLib_classes.hpp"
#include "UnionRun_structs.hpp"
#include "UnionRun_classes.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_classes.hpp"


namespace SDK
{

// Class UNION.LobbySequenceBase
// 0x0560 (0x08C8 - 0x0368)
class ALobbySequenceBase : public AHierarchicalStateMachine
{
public:
	uint8                                         Pad_368[0x10];                                     // 0x0368(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnGadgetCustmizeFinishedEvent;                     // 0x0378(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FLobbyInitData& Data)> OnMakeLobbyHostDataEvent;      // 0x0388(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 PlayerIndex, int32 RingIndex)> OnVoteSelectCourseEvent;      // 0x0398(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 InCourseIndex, int32 InPlayerIndex, const TArray<struct FAnotherStageLotteryResult>& InLotteryResults)> OnHostDecisionSelectCourseEvent; // 0x03A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnStartSelectCourseResultEvent;                    // 0x03B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnDebugTimeCountForceEnd;                          // 0x03C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnDebugCrownVisibleForceChange;                    // 0x03D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	EMatchingLobbyType                            LobbyType;                                         // 0x03E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOnlineSequence*                        OnlineSequence;                                    // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELobbySequenceState                           PrevSequenceState;                                 // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELobbySequenceState                           PrevFadeSequenceState;                             // 0x03F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLobbyPlayerData>               LobbyPlayerData;                                   // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 FakeLobbyPlayerIndexList;                          // 0x0410(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<EStageId>                              CourseMainID;                                      // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<EStageId>                              VisibleCourseMainId;                               // 0x0430(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   MainUISceneClass;                                  // 0x0440(0x0028)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   MainUISceneRef;                                    // 0x0468(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULobbySceneBase*                        MainUIScene;                                       // 0x0490(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   SubMenuUIClass;                                    // 0x0498(0x0028)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonMenuSubMenu*                     SubMenu;                                           // 0x04C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          EnableSubMenuInput;                                // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   SelectCourseUIClass;                               // 0x04D0(0x0028)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULobbyCourseSelectSceneBase*            CourseSelectUIScene;                               // 0x04F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   LobbyAnnounceInfoUIClass;                          // 0x0500(0x0028)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULobbyAnnounceInfo*                     LobbyAnnounceInfo;                                 // 0x0528(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOnlinePlayerNameButton*                FocusedPlayerName;                                 // 0x0530(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                 SentIndexList;                                     // 0x0538(0x0010)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsLobbySearchCancel;                              // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaMachineSelectStateBase*           CharaMachineSelectComponent;                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGadgetCustomize2State*                 CustomizeGadgetComponent;                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEmoteWheelState*                       EmoteWheelComponent;                               // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULobbyPlayerListState*                  LobbyPlayerListComponent;                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayerProfileState*                    PlayerProfileComponent;                            // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNetLobbyControlComponent*              NetLobbyControlComponent;                          // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGarageState*                           GarageComponent;                                   // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULobbySequenceP2PConnection*            P2PConnection;                                     // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuInputRecieveObject*                MenuInputReceiveObject;                            // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   CameraManagerClass;                                // 0x0598(0x0028)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AMenuCameraManager*                     CameraManager;                                     // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ACameraActor*                           CameraActor;                                       // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnotherStageLotteryWheel*              AnotherStageLotteryWheel;                          // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ALobbyTravelRingManager*                LobbyTravelRingManager;                            // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ALobbyFinishDirectingManager*           LobbyFinishedDirectingManager;                     // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LobbyHostPlayerIndex;                              // 0x05E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OwnPlayerIndex;                                    // 0x05EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CourseResultSelectedPlayerIndex;                   // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EStageId                                      CourseResultSelectedCourseId;                      // 0x05F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AlreadyReceiveDecidedCourse;                       // 0x05F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsPlaySelectCourseResult;                          // 0x05F6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F7[0x1];                                      // 0x05F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     TransformMenuRacers;                               // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          CanExitState;                                      // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsInitializedLobby;                                // 0x0609(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsReceivedLobbyHostData;                           // 0x060A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          OtherLobbyMembersReceivedHostData;                 // 0x060B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsOwnConnected;                                    // 0x060C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          RaceCycleFlag;                                     // 0x060D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          UseStateSelectCourse;                              // 0x060E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsFinishedSelectCourseResult;                      // 0x060F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsLobbySearching;                                  // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsVisibleMatchingNow;                              // 0x0611(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsCallForceBack;                                   // 0x0612(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_613[0x5];                                      // 0x0613(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIFade*                           UIFadeWidget;                                      // 0x0618(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UNetLobbyControlComponent>  NetLobbyControlComponentClass;                     // 0x0620(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ULobbySequenceP2PConnection> P2PConnectionClass;                               // 0x0628(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SubLevelName;                                      // 0x0630(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELobbyTimerType                               LobbyTimerType;                                    // 0x0638(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ELobbyTimerType, int32>                  LobbyTimerStartTimeCount;                          // 0x0640(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   LobbyTravelRingManagerPtr;                         // 0x0690(0x0028)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundAtomCue*                          MatchingConpleteQue;                               // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundAtomCue*                          MatchingWaitLoopCue;                               // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoundHandle                           MatchingWaitLoop;                                  // 0x06C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            LobbySearchCancelTimeLine;                         // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTimelineComponent*                     LongPutCancelTimeLine;                             // 0x06D8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UTimelineComponent>         LongPutCancelTimeLineClass;                        // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSendStamp;                                      // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSendHorn;                                       // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6EA[0x1DE];                                    // 0x06EA(0x01DE)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void BackSequenceStreamLevels(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo);
	static void UnLoadSubLevels(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo);

	void AfterCharaMachineSetting(bool InIsTimeUp);
	void AfterEmoteWheelSetting(bool InIsTimeUp);
	void AfterGarageSetting(bool InIsTimeUp);
	void AfterPlayerProfileSetting(bool InIsTimeUp);
	void BackStateFromPlayerList();
	void BeforeCharaMachineSetting();
	void BeforeGarageSetting();
	void BindMenuInputReceive();
	void BindPlayerName();
	void BindPlayerProfile();
	void BindSubMenu();
	void CalcDecideCourse(int32* OutSelectedPlayerIndex, EStageId* OutSelectedCourseId);
	bool CallForceBackFunction();
	void ChangeFooterParam(ELobbySequenceState InState);
	void ChangeHeaderParam(ELobbySequenceState InState);
	void CheckAndCrownSpawnOrDespawn(const int32 InRacerIndex);
	bool CheckEnableForceBackState(ELobbySequenceState InState);
	bool CheckEnableUpdateForMenuRacer();
	void CreateCameraManager();
	void CreateCourseSelectUIScene();
	class UUnionUISceneBase* CreateErrorWindow(EPopupWindowType WindowType, EPopupWindowButtonType ButtonType, bool bAttension, const class FText& Title, const class FText& Message);
	void CreateLobbyAnnounceInfo();
	void CreateLobbyTravelRingManager();
	void CreateMainUIScene();
	void DebugForceTimeOut();
	class AMenuCameraManager* GetCameraManager();
	int32 GetConvertPlayerLobbyIndex(int32 InIndex);
	ELobbySequenceState GetCurrentLobbyState();
	bool GetDebugLobbyTimeCountStop();
	class UCommonMenuFooterMenu* GetFooterMenu();
	class UCommonMenuHeaderMenu* GetHeaderMenu();
	class ULobbyAnnounceInfo* GetLobbyAnnounceInfo();
	EMatchingLobbyType GetLobbyType();
	class ULobbySceneBase* GetMainUIScene();
	class AMenuRacerLobby* GetMenuRacer(int32 InIndex);
	TArray<class AMenuRacerLobby*> GetMenuRacers();
	void GetPlayableCourseMainList(TArray<EStageId>* OutPlayableCourseMainList);
	void GetPlayerDisplayName(int32 InPlayerLobbyIndex);
	void GetPlayerSelectedCourseIds(TArray<EStageId>* OutPlayerSelectedCourseIds);
	int32 GetStartTimeCount();
	int32 GetTimeCount();
	class UOnlineTimer* GetTimer();
	void GoNextStateAfterInitialize();
	void InitializeCameraManager();
	void InitializeCourseSelectUIScene();
	void InitializeLobbyTravelRingManager();
	void InitializeMainUIScene();
	void InitializeMenuRacers();
	void InitializeSubLevelObjects();
	void InitializeSubMenu();
	void InitializeTimer();
	void InitializeTransformMenuRacers();
	bool IsCom(int32 InPlayerLobbyIndex, bool* OutIsValidLobbyContext, bool* OutIsValidMemberContext);
	bool IsSubMenuState(const ELobbySequenceState InState);
	bool IsValidPlayer(int32 InPlayerIndex);
	bool IsValidPlayerData(const struct FLobbyPlayerData& PlayerData);
	struct FLobbyInitData MakeLobbyHostData();
	void OnAddMemberInitComplete();
	void OnBackCharaMachine(EMenuSequenceSubState InState);
	void OnBackCustomizeGadget(EMenuSequenceSubState InState);
	void OnBackKeyPressedLobby(class UObject* Object);
	void OnBackPlayerProfile(EMenuSequenceSubState InState);
	void OnBackSequence(EErrorLevel ErrorLevel);
	void OnCancelGarage(EMenuSequenceSubState State);
	void OnCancelLobbySearch(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnCancelPlayerName(class UUnionUIButtonBase* InButton, int32 InButtonIndex);
	void OnCancelReturnedFromRaceToLobby(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnCancelSelectCourse(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnCancelTimeLineLobbySearch(class UObject* Object);
	void OnCancelWaitingInTheLobby(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnChangedPlayerProfile(int32 NextPlayerIndex);
	void OnChangedWaitTimerEmoteWheel(bool IsWaiting);
	void OnComebackMember(bool AllMembersInputFinished);
	void OnCompleteMatchmaking(EGameMatchmakingCompleteStatus Status, const struct FCreateOrConnectLobbyResult& Result);
	void OnDecideLobbySearch(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnDecideReturnedFromRaceToLobby(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnDecideWaitingInTheLobby(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnDecisionCharaMachine();
	void OnDecisionPlayerName(class UUnionUIButtonBase* InButton, int32 InButtonIndex);
	void OnDecisionSelectCourse(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnErrorFromNetLobbyControl(int32 ErrorCode, EAppNetErrorCode ErrorCodeEnum, const class FString& ErrorMessage);
	void OnExitEmoteWheel(EMenuSequenceSubState State);
	void OnExitFriendListl(EMenuSequenceSubState State);
	void OnExitStateCheckLobbyHost();
	void OnExitStateErrorWindow();
	void OnExitStateFixPlayerData();
	void OnExitStateLobbyFinished();
	void OnExitStateLobbySearch();
	void OnExitStateLobbySearchComplete();
	void OnExitStateReturnedFromRaceToLobby();
	void OnExitStateSelectCourse();
	void OnExitStateSelectCourseResult();
	void OnExitStateSelectCourseWait();
	void OnExitStateWaitingInTheLobby();
	void OnExitStateWaitP2PConnection();
	void OnFaceLeftPressedLobby(class UObject* Object);
	void OnFaceLeftPressedLobbySearch();
	void OnFaceLeftPressedWaitingInTheLobby();
	void OnFaceTopPressedLobby(class UObject* Object);
	void OnFaceTopPressedLobbyPlayerList();
	void OnFaceTopPressedLobbySearch();
	void OnFaceTopPressedWaitingInTheLobby();
	void OnFadeFinishedOnInitialize(EUnionUIFadeDirection InFadeDirection);
	void OnFinishedLevelSequenceLobby();
	void OnFinishedLevelSequenceSelectCourseResult();
	void OnFinishedTimeLineLobbySearch();
	void OnFinishedTimeLineReturnedFromRaceToLobby();
	void OnFocusPlayerName(class UUnionUIButtonBase* InButton, int32 InButtonIndex);
	void OnFocusSelectCourse(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnInitStateCheckLobbyHost();
	void OnInitStateCheckMembers();
	void OnInitStateErrorWindow();
	void OnInitStateExit();
	void OnInitStateFestaRentalGadgetWindow();
	void OnInitStateFestaRuleWindow();
	void OnInitStateFestaTeamDirecting();
	void OnInitStateFixPlayerData();
	void OnInitStateIdle();
	void OnInitStateLobbyFinished();
	void OnInitStateLobbyPlayerList();
	void OnInitStateLobbyRuleSetting();
	void OnInitStateLobbySearch();
	void OnInitStateLobbySearchComplete();
	void OnInitStateNotificationWindow();
	void OnInitStateReturnedFromRaceToLobby();
	void OnInitStateSelectCourse();
	void OnInitStateSelectCourseResult();
	void OnInitStateSelectCourseWait();
	void OnInitStateSelectGameMode();
	void OnInitStateShowTipsWindow();
	void OnInitStateWaitingInTheLobby();
	void OnInitStateWaitP2PConnection();
	void OnKickPlayerProfile(int32 PlayerIndex);
	void OnKickPlayerProfileResult(bool bSuccessful, const struct FLobbyOperationResult& Result);
	void OnLeftStickPressedLobby();
	void OnLobbyMemberConnect(const struct FLobbyPlayerData& InPlayerData, bool InIsOwnPlayer);
	void OnLobbyMemberDisconnect(const struct FLobbyPlayerData& InPlayerData, bool InIsOwnPlayer);
	void OnLobbySystemPreRaceFinished();
	void OnLogoutComplete(int32 LocalUserNum, bool bWasSuccessful);
	void OnPlatformEvent(const struct FUnionPlatformEventInfo& EventInfo);
	bool OnPlayerNameButtonDecideEvent(bool bIsSuccsess);
	void OnPlayLevelSequenceLobby();
	void OnPlayReverseLevelSequenceLobby();
	void OnReportPlayerProfile(int32 PlayerIndex);
	void OnRightShoulderLobbySearch(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnRightShoulderPressedLobby(class UObject* Object);
	void OnRightShoulderReturnedFromRaceToLobby(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnRightShoulderWaitingInTheLobby(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnSelectedStampEmoteWheel(int32 StampIndex);
	void OnSendNicePlayerProfile(int32 SendPlayerIndex);
	void OnShowLevelSequenceSelectCourseResultUI();
	void OnStartMatchmaking(class UCommonLobbyContext* LobbyContext);
	void OnStartMatchmakingForMember(class UCommonLobbyContext* LobbyContext);
	void OnStartSelectCourseResultEventCallback();
	void OnStartTimeLineLobbySearch();
	void OnSyncLobbyComplete(bool bSuccessful, const struct FLobbyOperationResult& Result);
	void OnTimeOutLobby();
	void OnUnFocusPlayerName(class UUnionUIButtonBase* InButton, int32 InButtonIndex);
	void OnUnFocusSelectCourse(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnUnFocusWaitingInTheLobby(class UUnionUIButtonBase* InButton, int32 InPanelIndex, int32 InButtonIndex);
	void OnUpdateStateCheckLobbyHost(float InDeltaTime);
	void OnUpdateStateErrorWindow(float InDeltaTime);
	void OnUpdateStateFixPlayerData(float InDeltaTime);
	void OnUpdateStateLobbyFinished(float InDeltaTime);
	void OnUpdateStateLobbySearch(float InDeltaTime);
	void OnUpdateStateLobbySearchComplete(float InDeltaTime);
	void OnUpdateStateSelectCourse(float InDeltaTime);
	void OnUpdateStateSelectCourseResult(float InDeltaTime);
	void OnUpdateStateSelectCourseWait(float InDeltaTime);
	void OnUpdateStateWaitingInTheLobby(float InDeltaTime);
	void OnUpdateStateWaitP2PConnection(float InDeltaTime);
	void OnUpdateTimeLineLobbySearch(float InValue);
	bool OwnPlayerIsHost();
	void PlayLobbyBgm();
	void PlaySelectCourseResult();
	void ReceiveChangedLikesCount(int32 InSendPlayerLobbyIndex, int32 OnNewLikesCount);
	void ReceiveDecidedCourse(int32 InDecidedCourseId, int32 InDecidedPlayerOnlineIndex);
	void ReceiveHorn(int32 InSendPlayerLobbyIndex);
	void ReceiveLike(int32 InSendPlayerLobbyIndex, int32 InReceivePlayerLobbyIndex);
	void ReceiveLobbyInitData(class UCommonLobbyContext* InLobbyContext, const struct FLobbyInitData& InData);
	void ReceiveStamp(int32 InSendPlayerLobbyIndex, int32 InStampIndex);
	void RecvHorn(class UCommonLobbyMemberContext* InMemberContext);
	void RecvLike(class UCommonLobbyMemberContext* InSendMemberContext, class UCommonLobbyMemberContext* InRecvMemberContext);
	void RecvSelectCourse(class UCommonLobbyMemberContext* InMemberContext, int32 courseId);
	void RecvStamp(class UCommonLobbyMemberContext* InMemberContext, int32 InStampIndex);
	void RefreshPlayerParam(const struct FLobbyPlayerData& InPlayerData, bool InIsOwnPlayer, ECommonLobbyMemberState InLobbyState);
	void RemoveLobbyWidget();
	void RemoveSelectCourseWidget();
	void SetCourseSelectSetting(EStageId InSelectedCourseId, TArray<struct FAnotherStageLotteryResult>* LotteryResults);
	void SetFooterHoldGaugeVaue(float InValue);
	void SetIsInitializedLobby(bool bNewValue);
	void SetLobbyPlayerCount(int32 InPlayerCount);
	void SetLobbySequenceType(ELobbySequenceState InNextState);
	void SetLobbyType(EMatchingLobbyType Type);
	void SetMenuRacer(int32 InPlayerLobbyIndex);
	void SetMenuRacerParam(class AMenuRacerLobby* InMenuRacerLobby, int32 InIndex);
	void SetNextLobbySequenceState(ELobbySequenceState InState, ELobbySequenceState PrevState);
	void SetNextLobbySubMenuState(class UCommonMenuButtonBase* InButton);
	void SetPlayerName(int32 InPlayerLobbyIndex, bool bInIsCom);
	void SetTimeCount(int32 InTimeCount);
	void SetUpCameraManager();
	void SetUpConvertPlayerIndexList();
	void SetupCourseSelect();
	void SetupLobby();
	void SetVisibilityValidOwnIcon(ESlateVisibility InVisibility);
	void SetVisibilityValidPlayerName(ESlateVisibility InVisibility);
	void StartFadeOnInitialize();
	void StartTimer(ELobbyTimerType InELobbyTimerType);
	void UnBindMenuInputReceive();
	void UnBindPlayerName();
	void UnBindPlayerProfile();
	void UnBindSubMenu();
	void UpdateMenuRacers();
	void UpdatePlayerName();

	class UCommonLobbyContext* CreateLobbyContext(int32 LocalUserNum) const;
	class UCommonLobbyContext* CreateLobbyContextByMatchmakingResult(int32 LocalUserNum, const struct FCreateOrConnectLobbyResult& MatchmakingResult) const;
	class UMatchmakingRequestContext* CreateMatchmakingContext(int32 LocalUserNum) const;
	void FinalizeLobbyContext() const;
	bool GetIsInitializedLobby() const;
	class UCommonLobbyContext* GetLobbyContext() const;
	class UNetLobbyControlComponent* GetNetLobbyControlComponent() const;
	class ULobbySequenceP2PConnection* GetP2PConnection() const;
	class FName GetSubLevelName() const;
	class FName GetSubLevelNameOfFesta() const;
	class FName GetSubLevelNameOfFriend() const;
	class FName GetSubLevelNameOfLegend() const;
	class FName GetSubLevelNameOfRankMatch() const;
	class FName GetSubLevelNameOfSquad() const;
	bool ShouldMatchmaking() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LobbySequenceBase">();
	}
	static class ALobbySequenceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbySequenceBase>();
	}
};
static_assert(alignof(ALobbySequenceBase) == 0x000008, "Wrong alignment on ALobbySequenceBase");
static_assert(sizeof(ALobbySequenceBase) == 0x0008C8, "Wrong size on ALobbySequenceBase");
static_assert(offsetof(ALobbySequenceBase, OnGadgetCustmizeFinishedEvent) == 0x000378, "Member 'ALobbySequenceBase::OnGadgetCustmizeFinishedEvent' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, OnMakeLobbyHostDataEvent) == 0x000388, "Member 'ALobbySequenceBase::OnMakeLobbyHostDataEvent' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, OnVoteSelectCourseEvent) == 0x000398, "Member 'ALobbySequenceBase::OnVoteSelectCourseEvent' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, OnHostDecisionSelectCourseEvent) == 0x0003A8, "Member 'ALobbySequenceBase::OnHostDecisionSelectCourseEvent' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, OnStartSelectCourseResultEvent) == 0x0003B8, "Member 'ALobbySequenceBase::OnStartSelectCourseResultEvent' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, OnDebugTimeCountForceEnd) == 0x0003C8, "Member 'ALobbySequenceBase::OnDebugTimeCountForceEnd' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, OnDebugCrownVisibleForceChange) == 0x0003D8, "Member 'ALobbySequenceBase::OnDebugCrownVisibleForceChange' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LobbyType) == 0x0003E8, "Member 'ALobbySequenceBase::LobbyType' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, OnlineSequence) == 0x0003F0, "Member 'ALobbySequenceBase::OnlineSequence' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, PrevSequenceState) == 0x0003F8, "Member 'ALobbySequenceBase::PrevSequenceState' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, PrevFadeSequenceState) == 0x0003F9, "Member 'ALobbySequenceBase::PrevFadeSequenceState' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LobbyPlayerData) == 0x000400, "Member 'ALobbySequenceBase::LobbyPlayerData' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, FakeLobbyPlayerIndexList) == 0x000410, "Member 'ALobbySequenceBase::FakeLobbyPlayerIndexList' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, CourseMainID) == 0x000420, "Member 'ALobbySequenceBase::CourseMainID' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, VisibleCourseMainId) == 0x000430, "Member 'ALobbySequenceBase::VisibleCourseMainId' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, MainUISceneClass) == 0x000440, "Member 'ALobbySequenceBase::MainUISceneClass' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, MainUISceneRef) == 0x000468, "Member 'ALobbySequenceBase::MainUISceneRef' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, MainUIScene) == 0x000490, "Member 'ALobbySequenceBase::MainUIScene' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, SubMenuUIClass) == 0x000498, "Member 'ALobbySequenceBase::SubMenuUIClass' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, SubMenu) == 0x0004C0, "Member 'ALobbySequenceBase::SubMenu' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, EnableSubMenuInput) == 0x0004C8, "Member 'ALobbySequenceBase::EnableSubMenuInput' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, SelectCourseUIClass) == 0x0004D0, "Member 'ALobbySequenceBase::SelectCourseUIClass' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, CourseSelectUIScene) == 0x0004F8, "Member 'ALobbySequenceBase::CourseSelectUIScene' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LobbyAnnounceInfoUIClass) == 0x000500, "Member 'ALobbySequenceBase::LobbyAnnounceInfoUIClass' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LobbyAnnounceInfo) == 0x000528, "Member 'ALobbySequenceBase::LobbyAnnounceInfo' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, FocusedPlayerName) == 0x000530, "Member 'ALobbySequenceBase::FocusedPlayerName' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, SentIndexList) == 0x000538, "Member 'ALobbySequenceBase::SentIndexList' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, bIsLobbySearchCancel) == 0x000548, "Member 'ALobbySequenceBase::bIsLobbySearchCancel' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, CharaMachineSelectComponent) == 0x000550, "Member 'ALobbySequenceBase::CharaMachineSelectComponent' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, CustomizeGadgetComponent) == 0x000558, "Member 'ALobbySequenceBase::CustomizeGadgetComponent' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, EmoteWheelComponent) == 0x000560, "Member 'ALobbySequenceBase::EmoteWheelComponent' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LobbyPlayerListComponent) == 0x000568, "Member 'ALobbySequenceBase::LobbyPlayerListComponent' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, PlayerProfileComponent) == 0x000570, "Member 'ALobbySequenceBase::PlayerProfileComponent' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, NetLobbyControlComponent) == 0x000578, "Member 'ALobbySequenceBase::NetLobbyControlComponent' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, GarageComponent) == 0x000580, "Member 'ALobbySequenceBase::GarageComponent' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, P2PConnection) == 0x000588, "Member 'ALobbySequenceBase::P2PConnection' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, MenuInputReceiveObject) == 0x000590, "Member 'ALobbySequenceBase::MenuInputReceiveObject' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, CameraManagerClass) == 0x000598, "Member 'ALobbySequenceBase::CameraManagerClass' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, CameraManager) == 0x0005C0, "Member 'ALobbySequenceBase::CameraManager' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, CameraActor) == 0x0005C8, "Member 'ALobbySequenceBase::CameraActor' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, AnotherStageLotteryWheel) == 0x0005D0, "Member 'ALobbySequenceBase::AnotherStageLotteryWheel' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LobbyTravelRingManager) == 0x0005D8, "Member 'ALobbySequenceBase::LobbyTravelRingManager' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LobbyFinishedDirectingManager) == 0x0005E0, "Member 'ALobbySequenceBase::LobbyFinishedDirectingManager' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LobbyHostPlayerIndex) == 0x0005E8, "Member 'ALobbySequenceBase::LobbyHostPlayerIndex' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, OwnPlayerIndex) == 0x0005EC, "Member 'ALobbySequenceBase::OwnPlayerIndex' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, CourseResultSelectedPlayerIndex) == 0x0005F0, "Member 'ALobbySequenceBase::CourseResultSelectedPlayerIndex' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, CourseResultSelectedCourseId) == 0x0005F4, "Member 'ALobbySequenceBase::CourseResultSelectedCourseId' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, AlreadyReceiveDecidedCourse) == 0x0005F5, "Member 'ALobbySequenceBase::AlreadyReceiveDecidedCourse' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, IsPlaySelectCourseResult) == 0x0005F6, "Member 'ALobbySequenceBase::IsPlaySelectCourseResult' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, TransformMenuRacers) == 0x0005F8, "Member 'ALobbySequenceBase::TransformMenuRacers' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, CanExitState) == 0x000608, "Member 'ALobbySequenceBase::CanExitState' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, IsInitializedLobby) == 0x000609, "Member 'ALobbySequenceBase::IsInitializedLobby' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, IsReceivedLobbyHostData) == 0x00060A, "Member 'ALobbySequenceBase::IsReceivedLobbyHostData' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, OtherLobbyMembersReceivedHostData) == 0x00060B, "Member 'ALobbySequenceBase::OtherLobbyMembersReceivedHostData' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, IsOwnConnected) == 0x00060C, "Member 'ALobbySequenceBase::IsOwnConnected' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, RaceCycleFlag) == 0x00060D, "Member 'ALobbySequenceBase::RaceCycleFlag' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, UseStateSelectCourse) == 0x00060E, "Member 'ALobbySequenceBase::UseStateSelectCourse' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, IsFinishedSelectCourseResult) == 0x00060F, "Member 'ALobbySequenceBase::IsFinishedSelectCourseResult' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, IsLobbySearching) == 0x000610, "Member 'ALobbySequenceBase::IsLobbySearching' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, IsVisibleMatchingNow) == 0x000611, "Member 'ALobbySequenceBase::IsVisibleMatchingNow' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, IsCallForceBack) == 0x000612, "Member 'ALobbySequenceBase::IsCallForceBack' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, UIFadeWidget) == 0x000618, "Member 'ALobbySequenceBase::UIFadeWidget' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, NetLobbyControlComponentClass) == 0x000620, "Member 'ALobbySequenceBase::NetLobbyControlComponentClass' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, P2PConnectionClass) == 0x000628, "Member 'ALobbySequenceBase::P2PConnectionClass' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, SubLevelName) == 0x000630, "Member 'ALobbySequenceBase::SubLevelName' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LobbyTimerType) == 0x000638, "Member 'ALobbySequenceBase::LobbyTimerType' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LobbyTimerStartTimeCount) == 0x000640, "Member 'ALobbySequenceBase::LobbyTimerStartTimeCount' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LobbyTravelRingManagerPtr) == 0x000690, "Member 'ALobbySequenceBase::LobbyTravelRingManagerPtr' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, MatchingConpleteQue) == 0x0006B8, "Member 'ALobbySequenceBase::MatchingConpleteQue' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, MatchingWaitLoopCue) == 0x0006C0, "Member 'ALobbySequenceBase::MatchingWaitLoopCue' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, MatchingWaitLoop) == 0x0006C8, "Member 'ALobbySequenceBase::MatchingWaitLoop' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LobbySearchCancelTimeLine) == 0x0006D0, "Member 'ALobbySequenceBase::LobbySearchCancelTimeLine' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LongPutCancelTimeLine) == 0x0006D8, "Member 'ALobbySequenceBase::LongPutCancelTimeLine' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, LongPutCancelTimeLineClass) == 0x0006E0, "Member 'ALobbySequenceBase::LongPutCancelTimeLineClass' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, bIsSendStamp) == 0x0006E8, "Member 'ALobbySequenceBase::bIsSendStamp' has a wrong offset!");
static_assert(offsetof(ALobbySequenceBase, bIsSendHorn) == 0x0006E9, "Member 'ALobbySequenceBase::bIsSendHorn' has a wrong offset!");

// Class UNION.SquadSequence
// 0x0000 (0x08C8 - 0x08C8)
class ASquadSequence final : public ALobbySequenceBase
{
public:
	void OnInitStateFriendList();
	void OnInitStatePlayerProfile();
	void OnInitStateSquadTop();
	void SetNextSquadSequenceState(ESquadSequenceState InState, ESquadSequenceState PrevState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SquadSequence">();
	}
	static class ASquadSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASquadSequence>();
	}
};
static_assert(alignof(ASquadSequence) == 0x000008, "Wrong alignment on ASquadSequence");
static_assert(sizeof(ASquadSequence) == 0x0008C8, "Wrong size on ASquadSequence");

// Class UNION.AddCharacterInfo
// 0x0020 (0x0300 - 0x02E0)
class UAddCharacterInfo : public UUserWidget
{
public:
	uint8                                         Pad_2E0[0x10];                                     // 0x02E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    SubWidgetList;                                     // 0x02F0(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void Open(EDriverId characterId);
	void SetLastCutTexture(class UTexture2D* Texture);
	void SetSubWidgetTexture(class UUserWidget* SubWidget, class UTexture2D* Texture);
	void SetText(const class FText& TopText, const class FText& BottomText, const class FText& NameText);
	void SetupCharacter(EDriverId characterId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddCharacterInfo">();
	}
	static class UAddCharacterInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddCharacterInfo>();
	}
};
static_assert(alignof(UAddCharacterInfo) == 0x000008, "Wrong alignment on UAddCharacterInfo");
static_assert(sizeof(UAddCharacterInfo) == 0x000300, "Wrong size on UAddCharacterInfo");
static_assert(offsetof(UAddCharacterInfo, SubWidgetList) == 0x0002F0, "Member 'UAddCharacterInfo::SubWidgetList' has a wrong offset!");

// Class UNION.LobbyFinishDirectingManager
// 0x0010 (0x02A0 - 0x0290)
class ALobbyFinishDirectingManager final : public AActor
{
public:
	TMulticastInlineDelegate<void()>              LobbyEndDirectingFinished;                         // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)

public:
	void OnInitialize();
	void OnSetup(EMatchingLobbyType InGameMode);
	void PlaySequenceEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LobbyFinishDirectingManager">();
	}
	static class ALobbyFinishDirectingManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbyFinishDirectingManager>();
	}
};
static_assert(alignof(ALobbyFinishDirectingManager) == 0x000008, "Wrong alignment on ALobbyFinishDirectingManager");
static_assert(sizeof(ALobbyFinishDirectingManager) == 0x0002A0, "Wrong size on ALobbyFinishDirectingManager");
static_assert(offsetof(ALobbyFinishDirectingManager, LobbyEndDirectingFinished) == 0x000290, "Member 'ALobbyFinishDirectingManager::LobbyEndDirectingFinished' has a wrong offset!");

// Class UNION.AdvertiseWidget
// 0x0008 (0x03E0 - 0x03D8)
class UAdvertiseWidget : public UUnionUISceneBase
{
public:
	class UImage*                                 Controller_Info;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AnimationIn();
	void AnimationOut();
	void FinishAdvertiseMovie();
	void InitialiseMovie(const int32 MovieListIndex);
	bool IsOfficialVersion();
	void PauseAllAdvAnimation();
	void SetStrapTexture(class UTexture2D* InStrapTexture);
	void SkipAdvertiseLogo();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AdvertiseWidget">();
	}
	static class UAdvertiseWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAdvertiseWidget>();
	}
};
static_assert(alignof(UAdvertiseWidget) == 0x000008, "Wrong alignment on UAdvertiseWidget");
static_assert(sizeof(UAdvertiseWidget) == 0x0003E0, "Wrong size on UAdvertiseWidget");
static_assert(offsetof(UAdvertiseWidget, Controller_Info) == 0x0003D8, "Member 'UAdvertiseWidget::Controller_Info' has a wrong offset!");

// Class UNION.AnotherStageLotteryWheel
// 0x1540 (0x1568 - 0x0028)
class UAnotherStageLotteryWheel final : public UObject
{
public:
	uint8                                         Pad_28[0x1530];                                    // 0x0028(0x1530)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EStageId>                              IgnoreCourses;                                     // 0x1558(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void AddIgnoreStage(EStageId IgnoreCourse);
	void AddIgnoreStages(const TArray<EStageId>& IgnoreCourses_0);
	void GetLotteryResultsStageIds(TArray<EStageId>* OutStageIds);
	const TArray<struct FAnotherStageLotteryResult> Lot(bool bUseCache, bool bIsResult);
	void Reset(int32 InSeed);
	void Setup();
	void SetupManual(const struct FAnotherStageLotteryParameter& InParameter);
	void WriteLotteryResultToSettings();

	const TArray<struct FAnotherStageLotteryResult> GetLotteryResults() const;
	int32 GetSeed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnotherStageLotteryWheel">();
	}
	static class UAnotherStageLotteryWheel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnotherStageLotteryWheel>();
	}
};
static_assert(alignof(UAnotherStageLotteryWheel) == 0x000008, "Wrong alignment on UAnotherStageLotteryWheel");
static_assert(sizeof(UAnotherStageLotteryWheel) == 0x001568, "Wrong size on UAnotherStageLotteryWheel");
static_assert(offsetof(UAnotherStageLotteryWheel, IgnoreCourses) == 0x001558, "Member 'UAnotherStageLotteryWheel::IgnoreCourses' has a wrong offset!");

// Class UNION.ContentsItemHelper
// 0x0000 (0x0028 - 0x0028)
class UContentsItemHelper final : public UBlueprintFunctionLibrary
{
public:
	static bool ForceGetIsCharacterReleased(EDriverId DriverId);
	static bool ForceGetIsGadgetReleased(EGadgetId gadgetId);
	static bool ForceGetIsHonorTitleReleased(int32 HonorTitleId);
	static void ForceGetIsItemReleased(const struct FContentItem& CheckItem, bool* IsReleased);
	static bool ForceGetIsMachineReleased(EMachineId MachineId);
	static void GetCanUseDLCStageList(TArray<struct FContentItem>* CheckItemList);
	static void GetCanUseItemList(EGameModeId GameModeID, TArray<struct FContentItem>* CheckItemList);
	static bool GetIsAuraReleased(EMachineAuraId AuraId);
	static bool GetIsCharacterReleased(EDriverId DriverId);
	static bool GetIsGadgetReleased(EGadgetId gadgetId);
	static bool GetIsHonorTitleReleased(int32 HonorTitleId);
	static bool GetIsHornReleased(EMachineHornType hornId);
	static void GetIsItemReleased(const struct FContentItem& CheckItem, bool* IsReleased);
	static bool GetIsMachineReleased(EMachineId MachineId);
	static bool GetIsStickerReleased(int32 stickerId);
	static void GetUnlockItemList(TArray<struct FContentItem>* CheckItemList);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentsItemHelper">();
	}
	static class UContentsItemHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentsItemHelper>();
	}
};
static_assert(alignof(UContentsItemHelper) == 0x000008, "Wrong alignment on UContentsItemHelper");
static_assert(sizeof(UContentsItemHelper) == 0x000028, "Wrong size on UContentsItemHelper");

// Class UNION.CorseLotteryWheelBase
// 0x13F0 (0x1418 - 0x0028)
class UCorseLotteryWheelBase : public UObject
{
public:
	uint8                                         Pad_28[0x13F0];                                    // 0x0028(0x13F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetLotteryResultsStageIds(TArray<EStageId>* OutStageIds);
	const TArray<EStageId> Lot();
	void Reset(int32 InSeed);
	void WriteLotteryResultToSettings();

	int32 GetSeed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CorseLotteryWheelBase">();
	}
	static class UCorseLotteryWheelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCorseLotteryWheelBase>();
	}
};
static_assert(alignof(UCorseLotteryWheelBase) == 0x000008, "Wrong alignment on UCorseLotteryWheelBase");
static_assert(sizeof(UCorseLotteryWheelBase) == 0x001418, "Wrong size on UCorseLotteryWheelBase");

// Class UNION.RankMatchCorseLotteryWheel
// 0x0000 (0x1418 - 0x1418)
class URankMatchCorseLotteryWheel final : public UCorseLotteryWheelBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RankMatchCorseLotteryWheel">();
	}
	static class URankMatchCorseLotteryWheel* GetDefaultObj()
	{
		return GetDefaultObjImpl<URankMatchCorseLotteryWheel>();
	}
};
static_assert(alignof(URankMatchCorseLotteryWheel) == 0x000008, "Wrong alignment on URankMatchCorseLotteryWheel");
static_assert(sizeof(URankMatchCorseLotteryWheel) == 0x001418, "Wrong size on URankMatchCorseLotteryWheel");

// Class UNION.AppCharaOpenDataAccessor
// 0x0000 (0x0028 - 0x0028)
class UAppCharaOpenDataAccessor final : public UBlueprintFunctionLibrary
{
public:
	static void GetAppCharaOpenData(struct FAppCharaOpenData* OutData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppCharaOpenDataAccessor">();
	}
	static class UAppCharaOpenDataAccessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppCharaOpenDataAccessor>();
	}
};
static_assert(alignof(UAppCharaOpenDataAccessor) == 0x000008, "Wrong alignment on UAppCharaOpenDataAccessor");
static_assert(sizeof(UAppCharaOpenDataAccessor) == 0x000028, "Wrong size on UAppCharaOpenDataAccessor");

// Class UNION.CommonShopLabel
// 0x0028 (0x0308 - 0x02E0)
class UCommonShopLabel : public UUserWidget
{
public:
	class UImage*                                 BG;                                                // 0x02E0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        WSIcons;                                           // 0x02E8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        WSLock;                                            // 0x02F0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FLinearColor>                   BGColor;                                           // 0x02F8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void OnSetPrice(int32 InPrice);
	void OnSetPriceColor(const struct FSlateColor& InColor);
	void SetupLock(bool IsLock);
	void SetupNone();
	void SetupPrice(int32 InPrice, const struct FSlateColor& InColor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommonShopLabel">();
	}
	static class UCommonShopLabel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonShopLabel>();
	}
};
static_assert(alignof(UCommonShopLabel) == 0x000008, "Wrong alignment on UCommonShopLabel");
static_assert(sizeof(UCommonShopLabel) == 0x000308, "Wrong size on UCommonShopLabel");
static_assert(offsetof(UCommonShopLabel, BG) == 0x0002E0, "Member 'UCommonShopLabel::BG' has a wrong offset!");
static_assert(offsetof(UCommonShopLabel, WSIcons) == 0x0002E8, "Member 'UCommonShopLabel::WSIcons' has a wrong offset!");
static_assert(offsetof(UCommonShopLabel, WSLock) == 0x0002F0, "Member 'UCommonShopLabel::WSLock' has a wrong offset!");
static_assert(offsetof(UCommonShopLabel, BGColor) == 0x0002F8, "Member 'UCommonShopLabel::BGColor' has a wrong offset!");

// Class UNION.AppDataManageSubsystem
// 0x08C0 (0x08F0 - 0x0030)
class UAppDataManageSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x7F0];                                     // 0x0030(0x07F0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUnionRaceResource                     RaceResource;                                      // 0x0820(0x00B0)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_8D0[0x20];                                     // 0x08D0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginDebugMode();
	void ConfirmNoticeStreamingInstall();
	void EndDebugMode();
	struct FAppCharaOpenData GetCharaOpenData();
	struct FDebugAppMenuData GetDebugAppMenuData();
	bool GetForceDisableLobbyKick();
	bool GetForceOpenCollabo();
	bool GetForceOpenFriendMatch();
	bool GetForceSkipCloseLobbyInvitationWindow();
	bool GetForceUpdateCustomRuleRaceCountMax();
	struct FAppGadgetCustomizeData GetGadgetCustomizeData();
	struct FAppMenuData GetMenuData();
	void GetOverrideDriverIds(TArray<int32>* OutDriverIds);
	struct FAppRaceConfigData GetRaceConfigData();
	struct FAppRaceCountManageData GetRaceCountManageData();
	struct FAppRaceResultData GetRaceResultData();
	bool IsAllResourcesLoaded();
	bool IsOpenFriendListInOfflineSequence();
	bool IsSafe2ndLapCourse();
	void LoadDebugSettings();
	void LoadResources();
	void OnMapLoadFinished(class UWorld* NewWorld);
	void SetCharaOpenData(const struct FAppCharaOpenData& InSrc);
	void SetDebugAppMenuData(const struct FDebugAppMenuData& InSrc);
	void SetDebugOnlineFillCom(bool flg);
	void SetEnableLobbyLeaveInReturnedFromRaceToLobby(bool InEnable);
	void SetForceDisableLobbyKick(bool InDisable);
	void SetForceOpenCollabo(bool InEnable);
	void SetForceOpenFriendMatch(bool InEnable);
	void SetForceSkipCloseLobbyInvitationWindow(bool InEnable);
	void SetForceUpdateCustomRuleRaceCountMax(bool InEnable);
	void SetGadgetCustomizeData(const struct FAppGadgetCustomizeData& InSrc);
	void SetIsSafe2ndLapCourse(bool bInSafe);
	void SetMenuData(const struct FAppMenuData& InSrc);
	void SetOpenFriendListInOfflineSequence(bool InEnable);
	void SetPrivateMatchMonkeyTestAllSet();
	void SetRaceConfigData(const struct FAppRaceConfigData& InSrc);
	void SetRaceResultData(const struct FAppRaceResultData& InSrc);
