#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnionSystem

#include "Basic.hpp"

#include "CriWareRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function UnionSystem.UnionStaticMeshComponent.ChangeMaterial
// 0x0010 (0x0010 - 0x0000)
struct UnionStaticMeshComponent_ChangeMaterial final
{
public:
	int32                                         MaterialID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bChange;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     InMaterial;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnionStaticMeshComponent_ChangeMaterial) == 0x000008, "Wrong alignment on UnionStaticMeshComponent_ChangeMaterial");
static_assert(sizeof(UnionStaticMeshComponent_ChangeMaterial) == 0x000010, "Wrong size on UnionStaticMeshComponent_ChangeMaterial");
static_assert(offsetof(UnionStaticMeshComponent_ChangeMaterial, MaterialID) == 0x000000, "Member 'UnionStaticMeshComponent_ChangeMaterial::MaterialID' has a wrong offset!");
static_assert(offsetof(UnionStaticMeshComponent_ChangeMaterial, bChange) == 0x000004, "Member 'UnionStaticMeshComponent_ChangeMaterial::bChange' has a wrong offset!");
static_assert(offsetof(UnionStaticMeshComponent_ChangeMaterial, InMaterial) == 0x000008, "Member 'UnionStaticMeshComponent_ChangeMaterial::InMaterial' has a wrong offset!");

// Function UnionSystem.UnionStaticMeshComponent.IsNotChangedMaterial
// 0x0008 (0x0008 - 0x0000)
struct UnionStaticMeshComponent_IsNotChangedMaterial final
{
public:
	int32                                         MaterialID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UnionStaticMeshComponent_IsNotChangedMaterial) == 0x000004, "Wrong alignment on UnionStaticMeshComponent_IsNotChangedMaterial");
static_assert(sizeof(UnionStaticMeshComponent_IsNotChangedMaterial) == 0x000008, "Wrong size on UnionStaticMeshComponent_IsNotChangedMaterial");
static_assert(offsetof(UnionStaticMeshComponent_IsNotChangedMaterial, MaterialID) == 0x000000, "Member 'UnionStaticMeshComponent_IsNotChangedMaterial::MaterialID' has a wrong offset!");
static_assert(offsetof(UnionStaticMeshComponent_IsNotChangedMaterial, ReturnValue) == 0x000004, "Member 'UnionStaticMeshComponent_IsNotChangedMaterial::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppControllerInputManager.GetMenuPlayerController
// 0x0010 (0x0010 - 0x0000)
struct AppControllerInputManager_GetMenuPlayerController final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuPlayerController*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppControllerInputManager_GetMenuPlayerController) == 0x000008, "Wrong alignment on AppControllerInputManager_GetMenuPlayerController");
static_assert(sizeof(AppControllerInputManager_GetMenuPlayerController) == 0x000010, "Wrong size on AppControllerInputManager_GetMenuPlayerController");
static_assert(offsetof(AppControllerInputManager_GetMenuPlayerController, PlayerControllerIndex) == 0x000000, "Member 'AppControllerInputManager_GetMenuPlayerController::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(AppControllerInputManager_GetMenuPlayerController, ReturnValue) == 0x000008, "Member 'AppControllerInputManager_GetMenuPlayerController::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppControllerInputManager.GetPlayerController
// 0x0010 (0x0010 - 0x0000)
struct AppControllerInputManager_GetPlayerController final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppControllerInputManager_GetPlayerController) == 0x000008, "Wrong alignment on AppControllerInputManager_GetPlayerController");
static_assert(sizeof(AppControllerInputManager_GetPlayerController) == 0x000010, "Wrong size on AppControllerInputManager_GetPlayerController");
static_assert(offsetof(AppControllerInputManager_GetPlayerController, PlayerControllerIndex) == 0x000000, "Member 'AppControllerInputManager_GetPlayerController::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(AppControllerInputManager_GetPlayerController, ReturnValue) == 0x000008, "Member 'AppControllerInputManager_GetPlayerController::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppControllerInputManager.IsMenuMouseInputMode
// 0x0008 (0x0008 - 0x0000)
struct AppControllerInputManager_IsMenuMouseInputMode final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AppControllerInputManager_IsMenuMouseInputMode) == 0x000004, "Wrong alignment on AppControllerInputManager_IsMenuMouseInputMode");
static_assert(sizeof(AppControllerInputManager_IsMenuMouseInputMode) == 0x000008, "Wrong size on AppControllerInputManager_IsMenuMouseInputMode");
static_assert(offsetof(AppControllerInputManager_IsMenuMouseInputMode, PlayerControllerIndex) == 0x000000, "Member 'AppControllerInputManager_IsMenuMouseInputMode::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(AppControllerInputManager_IsMenuMouseInputMode, ReturnValue) == 0x000004, "Member 'AppControllerInputManager_IsMenuMouseInputMode::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppControllerInputManager.RemovePlayer
// 0x0010 (0x0010 - 0x0000)
struct AppControllerInputManager_RemovePlayer final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyPawn;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AppControllerInputManager_RemovePlayer) == 0x000008, "Wrong alignment on AppControllerInputManager_RemovePlayer");
static_assert(sizeof(AppControllerInputManager_RemovePlayer) == 0x000010, "Wrong size on AppControllerInputManager_RemovePlayer");
static_assert(offsetof(AppControllerInputManager_RemovePlayer, PlayerController) == 0x000000, "Member 'AppControllerInputManager_RemovePlayer::PlayerController' has a wrong offset!");
static_assert(offsetof(AppControllerInputManager_RemovePlayer, bDestroyPawn) == 0x000008, "Member 'AppControllerInputManager_RemovePlayer::bDestroyPawn' has a wrong offset!");

// Function UnionSystem.AppControllerInputManager.SetTickable
// 0x0001 (0x0001 - 0x0000)
struct AppControllerInputManager_SetTickable final
{
public:
	bool                                          bTickable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppControllerInputManager_SetTickable) == 0x000001, "Wrong alignment on AppControllerInputManager_SetTickable");
static_assert(sizeof(AppControllerInputManager_SetTickable) == 0x000001, "Wrong size on AppControllerInputManager_SetTickable");
static_assert(offsetof(AppControllerInputManager_SetTickable, bTickable) == 0x000000, "Member 'AppControllerInputManager_SetTickable::bTickable' has a wrong offset!");

// Function UnionSystem.AppSequenceLogManagerSubsystem.GetBackupSequenceMainType
// 0x0001 (0x0001 - 0x0000)
struct AppSequenceLogManagerSubsystem_GetBackupSequenceMainType final
{
public:
	ESequenceMainType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppSequenceLogManagerSubsystem_GetBackupSequenceMainType) == 0x000001, "Wrong alignment on AppSequenceLogManagerSubsystem_GetBackupSequenceMainType");
static_assert(sizeof(AppSequenceLogManagerSubsystem_GetBackupSequenceMainType) == 0x000001, "Wrong size on AppSequenceLogManagerSubsystem_GetBackupSequenceMainType");
static_assert(offsetof(AppSequenceLogManagerSubsystem_GetBackupSequenceMainType, ReturnValue) == 0x000000, "Member 'AppSequenceLogManagerSubsystem_GetBackupSequenceMainType::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppSequenceLogManagerSubsystem.GetBackupSequenceSubType
// 0x0001 (0x0001 - 0x0000)
struct AppSequenceLogManagerSubsystem_GetBackupSequenceSubType final
{
public:
	ESequenceSubType                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppSequenceLogManagerSubsystem_GetBackupSequenceSubType) == 0x000001, "Wrong alignment on AppSequenceLogManagerSubsystem_GetBackupSequenceSubType");
static_assert(sizeof(AppSequenceLogManagerSubsystem_GetBackupSequenceSubType) == 0x000001, "Wrong size on AppSequenceLogManagerSubsystem_GetBackupSequenceSubType");
static_assert(offsetof(AppSequenceLogManagerSubsystem_GetBackupSequenceSubType, ReturnValue) == 0x000000, "Member 'AppSequenceLogManagerSubsystem_GetBackupSequenceSubType::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppSequenceLogManagerSubsystem.GetSequenceMainType
// 0x0001 (0x0001 - 0x0000)
struct AppSequenceLogManagerSubsystem_GetSequenceMainType final
{
public:
	ESequenceMainType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppSequenceLogManagerSubsystem_GetSequenceMainType) == 0x000001, "Wrong alignment on AppSequenceLogManagerSubsystem_GetSequenceMainType");
static_assert(sizeof(AppSequenceLogManagerSubsystem_GetSequenceMainType) == 0x000001, "Wrong size on AppSequenceLogManagerSubsystem_GetSequenceMainType");
static_assert(offsetof(AppSequenceLogManagerSubsystem_GetSequenceMainType, ReturnValue) == 0x000000, "Member 'AppSequenceLogManagerSubsystem_GetSequenceMainType::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppSequenceLogManagerSubsystem.GetSequenceSubType
// 0x0001 (0x0001 - 0x0000)
struct AppSequenceLogManagerSubsystem_GetSequenceSubType final
{
public:
	ESequenceSubType                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppSequenceLogManagerSubsystem_GetSequenceSubType) == 0x000001, "Wrong alignment on AppSequenceLogManagerSubsystem_GetSequenceSubType");
static_assert(sizeof(AppSequenceLogManagerSubsystem_GetSequenceSubType) == 0x000001, "Wrong size on AppSequenceLogManagerSubsystem_GetSequenceSubType");
static_assert(offsetof(AppSequenceLogManagerSubsystem_GetSequenceSubType, ReturnValue) == 0x000000, "Member 'AppSequenceLogManagerSubsystem_GetSequenceSubType::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppSequenceLogManagerSubsystem.SetSequenceSubType
// 0x0001 (0x0001 - 0x0000)
struct AppSequenceLogManagerSubsystem_SetSequenceSubType final
{
public:
	ESequenceSubType                              SubType;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppSequenceLogManagerSubsystem_SetSequenceSubType) == 0x000001, "Wrong alignment on AppSequenceLogManagerSubsystem_SetSequenceSubType");
static_assert(sizeof(AppSequenceLogManagerSubsystem_SetSequenceSubType) == 0x000001, "Wrong size on AppSequenceLogManagerSubsystem_SetSequenceSubType");
static_assert(offsetof(AppSequenceLogManagerSubsystem_SetSequenceSubType, SubType) == 0x000000, "Member 'AppSequenceLogManagerSubsystem_SetSequenceSubType::SubType' has a wrong offset!");

// Function UnionSystem.AppSequenceLogManagerSubsystem.SetSequenceType
// 0x0002 (0x0002 - 0x0000)
struct AppSequenceLogManagerSubsystem_SetSequenceType final
{
public:
	ESequenceMainType                             MainType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESequenceSubType                              SubType;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppSequenceLogManagerSubsystem_SetSequenceType) == 0x000001, "Wrong alignment on AppSequenceLogManagerSubsystem_SetSequenceType");
static_assert(sizeof(AppSequenceLogManagerSubsystem_SetSequenceType) == 0x000002, "Wrong size on AppSequenceLogManagerSubsystem_SetSequenceType");
static_assert(offsetof(AppSequenceLogManagerSubsystem_SetSequenceType, MainType) == 0x000000, "Member 'AppSequenceLogManagerSubsystem_SetSequenceType::MainType' has a wrong offset!");
static_assert(offsetof(AppSequenceLogManagerSubsystem_SetSequenceType, SubType) == 0x000001, "Member 'AppSequenceLogManagerSubsystem_SetSequenceType::SubType' has a wrong offset!");

// Function UnionSystem.AppSequenceLogManagerSubsystem.GetSequenceTypeNum
// 0x0004 (0x0004 - 0x0000)
struct AppSequenceLogManagerSubsystem_GetSequenceTypeNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppSequenceLogManagerSubsystem_GetSequenceTypeNum) == 0x000004, "Wrong alignment on AppSequenceLogManagerSubsystem_GetSequenceTypeNum");
static_assert(sizeof(AppSequenceLogManagerSubsystem_GetSequenceTypeNum) == 0x000004, "Wrong size on AppSequenceLogManagerSubsystem_GetSequenceTypeNum");
static_assert(offsetof(AppSequenceLogManagerSubsystem_GetSequenceTypeNum, ReturnValue) == 0x000000, "Member 'AppSequenceLogManagerSubsystem_GetSequenceTypeNum::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.GetClampUserNameLength
// 0x0004 (0x0004 - 0x0000)
struct AppFunctionLibrary_GetClampUserNameLength final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_GetClampUserNameLength) == 0x000004, "Wrong alignment on AppFunctionLibrary_GetClampUserNameLength");
static_assert(sizeof(AppFunctionLibrary_GetClampUserNameLength) == 0x000004, "Wrong size on AppFunctionLibrary_GetClampUserNameLength");
static_assert(offsetof(AppFunctionLibrary_GetClampUserNameLength, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_GetClampUserNameLength::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.GetDateString
// 0x0018 (0x0018 - 0x0000)
struct AppFunctionLibrary_GetDateString final
{
public:
	struct FDateTime                              DateTime;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_GetDateString) == 0x000008, "Wrong alignment on AppFunctionLibrary_GetDateString");
static_assert(sizeof(AppFunctionLibrary_GetDateString) == 0x000018, "Wrong size on AppFunctionLibrary_GetDateString");
static_assert(offsetof(AppFunctionLibrary_GetDateString, DateTime) == 0x000000, "Member 'AppFunctionLibrary_GetDateString::DateTime' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_GetDateString, ReturnValue) == 0x000008, "Member 'AppFunctionLibrary_GetDateString::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.GetDateTimeString
// 0x0018 (0x0018 - 0x0000)
struct AppFunctionLibrary_GetDateTimeString final
{
public:
	struct FDateTime                              DateTime;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_GetDateTimeString) == 0x000008, "Wrong alignment on AppFunctionLibrary_GetDateTimeString");
static_assert(sizeof(AppFunctionLibrary_GetDateTimeString) == 0x000018, "Wrong size on AppFunctionLibrary_GetDateTimeString");
static_assert(offsetof(AppFunctionLibrary_GetDateTimeString, DateTime) == 0x000000, "Member 'AppFunctionLibrary_GetDateTimeString::DateTime' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_GetDateTimeString, ReturnValue) == 0x000008, "Member 'AppFunctionLibrary_GetDateTimeString::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.GetDateTimeStringWithoutSecond
// 0x0018 (0x0018 - 0x0000)
struct AppFunctionLibrary_GetDateTimeStringWithoutSecond final
{
public:
	struct FDateTime                              DateTime;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_GetDateTimeStringWithoutSecond) == 0x000008, "Wrong alignment on AppFunctionLibrary_GetDateTimeStringWithoutSecond");
static_assert(sizeof(AppFunctionLibrary_GetDateTimeStringWithoutSecond) == 0x000018, "Wrong size on AppFunctionLibrary_GetDateTimeStringWithoutSecond");
static_assert(offsetof(AppFunctionLibrary_GetDateTimeStringWithoutSecond, DateTime) == 0x000000, "Member 'AppFunctionLibrary_GetDateTimeStringWithoutSecond::DateTime' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_GetDateTimeStringWithoutSecond, ReturnValue) == 0x000008, "Member 'AppFunctionLibrary_GetDateTimeStringWithoutSecond::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.GetHexString
// 0x0020 (0x0020 - 0x0000)
struct AppFunctionLibrary_GetHexString final
{
public:
	int32                                         Input;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Length;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AddZero;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_GetHexString) == 0x000008, "Wrong alignment on AppFunctionLibrary_GetHexString");
static_assert(sizeof(AppFunctionLibrary_GetHexString) == 0x000020, "Wrong size on AppFunctionLibrary_GetHexString");
static_assert(offsetof(AppFunctionLibrary_GetHexString, Input) == 0x000000, "Member 'AppFunctionLibrary_GetHexString::Input' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_GetHexString, Length) == 0x000004, "Member 'AppFunctionLibrary_GetHexString::Length' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_GetHexString, AddZero) == 0x000008, "Member 'AppFunctionLibrary_GetHexString::AddZero' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_GetHexString, ReturnValue) == 0x000010, "Member 'AppFunctionLibrary_GetHexString::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.GetLocalDateTime
// 0x0010 (0x0010 - 0x0000)
struct AppFunctionLibrary_GetLocalDateTime final
{
public:
	int64                                         UnixTimestampFromServer;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_GetLocalDateTime) == 0x000008, "Wrong alignment on AppFunctionLibrary_GetLocalDateTime");
static_assert(sizeof(AppFunctionLibrary_GetLocalDateTime) == 0x000010, "Wrong size on AppFunctionLibrary_GetLocalDateTime");
static_assert(offsetof(AppFunctionLibrary_GetLocalDateTime, UnixTimestampFromServer) == 0x000000, "Member 'AppFunctionLibrary_GetLocalDateTime::UnixTimestampFromServer' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_GetLocalDateTime, ReturnValue) == 0x000008, "Member 'AppFunctionLibrary_GetLocalDateTime::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.GetLocalDateTimeString
// 0x0018 (0x0018 - 0x0000)
struct AppFunctionLibrary_GetLocalDateTimeString final
{
public:
	int64                                         UnixTimestampFromServer;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_GetLocalDateTimeString) == 0x000008, "Wrong alignment on AppFunctionLibrary_GetLocalDateTimeString");
static_assert(sizeof(AppFunctionLibrary_GetLocalDateTimeString) == 0x000018, "Wrong size on AppFunctionLibrary_GetLocalDateTimeString");
static_assert(offsetof(AppFunctionLibrary_GetLocalDateTimeString, UnixTimestampFromServer) == 0x000000, "Member 'AppFunctionLibrary_GetLocalDateTimeString::UnixTimestampFromServer' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_GetLocalDateTimeString, ReturnValue) == 0x000008, "Member 'AppFunctionLibrary_GetLocalDateTimeString::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.GetMileStoneVersion
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_GetMileStoneVersion final
{
public:
	EMilestoneVersion                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_GetMileStoneVersion) == 0x000001, "Wrong alignment on AppFunctionLibrary_GetMileStoneVersion");
static_assert(sizeof(AppFunctionLibrary_GetMileStoneVersion) == 0x000001, "Wrong size on AppFunctionLibrary_GetMileStoneVersion");
static_assert(offsetof(AppFunctionLibrary_GetMileStoneVersion, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_GetMileStoneVersion::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.GetMileStoneVersionWithWorldContext
// 0x0010 (0x0010 - 0x0000)
struct AppFunctionLibrary_GetMileStoneVersionWithWorldContext final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMilestoneVersion                             ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AppFunctionLibrary_GetMileStoneVersionWithWorldContext) == 0x000008, "Wrong alignment on AppFunctionLibrary_GetMileStoneVersionWithWorldContext");
static_assert(sizeof(AppFunctionLibrary_GetMileStoneVersionWithWorldContext) == 0x000010, "Wrong size on AppFunctionLibrary_GetMileStoneVersionWithWorldContext");
static_assert(offsetof(AppFunctionLibrary_GetMileStoneVersionWithWorldContext, WorldContextObject) == 0x000000, "Member 'AppFunctionLibrary_GetMileStoneVersionWithWorldContext::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_GetMileStoneVersionWithWorldContext, ReturnValue) == 0x000008, "Member 'AppFunctionLibrary_GetMileStoneVersionWithWorldContext::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.GetPlatform
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_GetPlatform final
{
public:
	EAppSupportedPlatform                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_GetPlatform) == 0x000001, "Wrong alignment on AppFunctionLibrary_GetPlatform");
static_assert(sizeof(AppFunctionLibrary_GetPlatform) == 0x000001, "Wrong size on AppFunctionLibrary_GetPlatform");
static_assert(offsetof(AppFunctionLibrary_GetPlatform, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_GetPlatform::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.GetPlatformGroup
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_GetPlatformGroup final
{
public:
	ECrossplayPlatform                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_GetPlatformGroup) == 0x000001, "Wrong alignment on AppFunctionLibrary_GetPlatformGroup");
static_assert(sizeof(AppFunctionLibrary_GetPlatformGroup) == 0x000001, "Wrong size on AppFunctionLibrary_GetPlatformGroup");
static_assert(offsetof(AppFunctionLibrary_GetPlatformGroup, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_GetPlatformGroup::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.GetUtcDateTimeString
// 0x0018 (0x0018 - 0x0000)
struct AppFunctionLibrary_GetUtcDateTimeString final
{
public:
	int64                                         UnixTimestampFromServer;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_GetUtcDateTimeString) == 0x000008, "Wrong alignment on AppFunctionLibrary_GetUtcDateTimeString");
static_assert(sizeof(AppFunctionLibrary_GetUtcDateTimeString) == 0x000018, "Wrong size on AppFunctionLibrary_GetUtcDateTimeString");
static_assert(offsetof(AppFunctionLibrary_GetUtcDateTimeString, UnixTimestampFromServer) == 0x000000, "Member 'AppFunctionLibrary_GetUtcDateTimeString::UnixTimestampFromServer' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_GetUtcDateTimeString, ReturnValue) == 0x000008, "Member 'AppFunctionLibrary_GetUtcDateTimeString::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.HexToNumber
// 0x0018 (0x0018 - 0x0000)
struct AppFunctionLibrary_HexToNumber final
{
public:
	class FString                                 str;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AppFunctionLibrary_HexToNumber) == 0x000008, "Wrong alignment on AppFunctionLibrary_HexToNumber");
static_assert(sizeof(AppFunctionLibrary_HexToNumber) == 0x000018, "Wrong size on AppFunctionLibrary_HexToNumber");
static_assert(offsetof(AppFunctionLibrary_HexToNumber, str) == 0x000000, "Member 'AppFunctionLibrary_HexToNumber::str' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_HexToNumber, ReturnValue) == 0x000010, "Member 'AppFunctionLibrary_HexToNumber::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.Is2ndRom
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_Is2ndRom final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_Is2ndRom) == 0x000001, "Wrong alignment on AppFunctionLibrary_Is2ndRom");
static_assert(sizeof(AppFunctionLibrary_Is2ndRom) == 0x000001, "Wrong size on AppFunctionLibrary_Is2ndRom");
static_assert(offsetof(AppFunctionLibrary_Is2ndRom, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_Is2ndRom::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.Is2ndRomWithWorldContext
// 0x0010 (0x0010 - 0x0000)
struct AppFunctionLibrary_Is2ndRomWithWorldContext final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AppFunctionLibrary_Is2ndRomWithWorldContext) == 0x000008, "Wrong alignment on AppFunctionLibrary_Is2ndRomWithWorldContext");
static_assert(sizeof(AppFunctionLibrary_Is2ndRomWithWorldContext) == 0x000010, "Wrong size on AppFunctionLibrary_Is2ndRomWithWorldContext");
static_assert(offsetof(AppFunctionLibrary_Is2ndRomWithWorldContext, WorldContextObject) == 0x000000, "Member 'AppFunctionLibrary_Is2ndRomWithWorldContext::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_Is2ndRomWithWorldContext, ReturnValue) == 0x000008, "Member 'AppFunctionLibrary_Is2ndRomWithWorldContext::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.IsDevelopmentBuild
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_IsDevelopmentBuild final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_IsDevelopmentBuild) == 0x000001, "Wrong alignment on AppFunctionLibrary_IsDevelopmentBuild");
static_assert(sizeof(AppFunctionLibrary_IsDevelopmentBuild) == 0x000001, "Wrong size on AppFunctionLibrary_IsDevelopmentBuild");
static_assert(offsetof(AppFunctionLibrary_IsDevelopmentBuild, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_IsDevelopmentBuild::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.IsMasterLaunchOptionEnabled
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_IsMasterLaunchOptionEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_IsMasterLaunchOptionEnabled) == 0x000001, "Wrong alignment on AppFunctionLibrary_IsMasterLaunchOptionEnabled");
static_assert(sizeof(AppFunctionLibrary_IsMasterLaunchOptionEnabled) == 0x000001, "Wrong size on AppFunctionLibrary_IsMasterLaunchOptionEnabled");
static_assert(offsetof(AppFunctionLibrary_IsMasterLaunchOptionEnabled, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_IsMasterLaunchOptionEnabled::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.IsPlayInEditor
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_IsPlayInEditor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_IsPlayInEditor) == 0x000001, "Wrong alignment on AppFunctionLibrary_IsPlayInEditor");
static_assert(sizeof(AppFunctionLibrary_IsPlayInEditor) == 0x000001, "Wrong size on AppFunctionLibrary_IsPlayInEditor");
static_assert(offsetof(AppFunctionLibrary_IsPlayInEditor, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_IsPlayInEditor::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.IsPlayStation
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_IsPlayStation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_IsPlayStation) == 0x000001, "Wrong alignment on AppFunctionLibrary_IsPlayStation");
static_assert(sizeof(AppFunctionLibrary_IsPlayStation) == 0x000001, "Wrong size on AppFunctionLibrary_IsPlayStation");
static_assert(offsetof(AppFunctionLibrary_IsPlayStation, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_IsPlayStation::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.IsPre2ndRom
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_IsPre2ndRom final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_IsPre2ndRom) == 0x000001, "Wrong alignment on AppFunctionLibrary_IsPre2ndRom");
static_assert(sizeof(AppFunctionLibrary_IsPre2ndRom) == 0x000001, "Wrong size on AppFunctionLibrary_IsPre2ndRom");
static_assert(offsetof(AppFunctionLibrary_IsPre2ndRom, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_IsPre2ndRom::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.IsShippingBuild
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_IsShippingBuild final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_IsShippingBuild) == 0x000001, "Wrong alignment on AppFunctionLibrary_IsShippingBuild");
static_assert(sizeof(AppFunctionLibrary_IsShippingBuild) == 0x000001, "Wrong size on AppFunctionLibrary_IsShippingBuild");
static_assert(offsetof(AppFunctionLibrary_IsShippingBuild, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_IsShippingBuild::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.IsSupportHDVibration
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_IsSupportHDVibration final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_IsSupportHDVibration) == 0x000001, "Wrong alignment on AppFunctionLibrary_IsSupportHDVibration");
static_assert(sizeof(AppFunctionLibrary_IsSupportHDVibration) == 0x000001, "Wrong size on AppFunctionLibrary_IsSupportHDVibration");
static_assert(offsetof(AppFunctionLibrary_IsSupportHDVibration, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_IsSupportHDVibration::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.IsSwitch
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_IsSwitch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_IsSwitch) == 0x000001, "Wrong alignment on AppFunctionLibrary_IsSwitch");
static_assert(sizeof(AppFunctionLibrary_IsSwitch) == 0x000001, "Wrong size on AppFunctionLibrary_IsSwitch");
static_assert(offsetof(AppFunctionLibrary_IsSwitch, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_IsSwitch::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.IsTestBuild
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_IsTestBuild final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_IsTestBuild) == 0x000001, "Wrong alignment on AppFunctionLibrary_IsTestBuild");
static_assert(sizeof(AppFunctionLibrary_IsTestBuild) == 0x000001, "Wrong size on AppFunctionLibrary_IsTestBuild");
static_assert(offsetof(AppFunctionLibrary_IsTestBuild, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_IsTestBuild::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.IsVersionOverThan10100
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_IsVersionOverThan10100 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_IsVersionOverThan10100) == 0x000001, "Wrong alignment on AppFunctionLibrary_IsVersionOverThan10100");
static_assert(sizeof(AppFunctionLibrary_IsVersionOverThan10100) == 0x000001, "Wrong size on AppFunctionLibrary_IsVersionOverThan10100");
static_assert(offsetof(AppFunctionLibrary_IsVersionOverThan10100, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_IsVersionOverThan10100::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.IsWindows
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_IsWindows final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_IsWindows) == 0x000001, "Wrong alignment on AppFunctionLibrary_IsWindows");
static_assert(sizeof(AppFunctionLibrary_IsWindows) == 0x000001, "Wrong size on AppFunctionLibrary_IsWindows");
static_assert(offsetof(AppFunctionLibrary_IsWindows, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_IsWindows::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.IsXbox
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_IsXbox final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_IsXbox) == 0x000001, "Wrong alignment on AppFunctionLibrary_IsXbox");
static_assert(sizeof(AppFunctionLibrary_IsXbox) == 0x000001, "Wrong size on AppFunctionLibrary_IsXbox");
static_assert(offsetof(AppFunctionLibrary_IsXbox, ReturnValue) == 0x000000, "Member 'AppFunctionLibrary_IsXbox::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.OutputUE_LOG
// 0x0018 (0x0018 - 0x0000)
struct AppFunctionLibrary_OutputUE_LOG final
{
public:
	EAppLogLevel                                  InLevel;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_OutputUE_LOG) == 0x000008, "Wrong alignment on AppFunctionLibrary_OutputUE_LOG");
static_assert(sizeof(AppFunctionLibrary_OutputUE_LOG) == 0x000018, "Wrong size on AppFunctionLibrary_OutputUE_LOG");
static_assert(offsetof(AppFunctionLibrary_OutputUE_LOG, InLevel) == 0x000000, "Member 'AppFunctionLibrary_OutputUE_LOG::InLevel' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_OutputUE_LOG, Message) == 0x000008, "Member 'AppFunctionLibrary_OutputUE_LOG::Message' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.SetMilestoneVersion
// 0x0001 (0x0001 - 0x0000)
struct AppFunctionLibrary_SetMilestoneVersion final
{
public:
	EMilestoneVersion                             NewMilestoneVersion;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_SetMilestoneVersion) == 0x000001, "Wrong alignment on AppFunctionLibrary_SetMilestoneVersion");
static_assert(sizeof(AppFunctionLibrary_SetMilestoneVersion) == 0x000001, "Wrong size on AppFunctionLibrary_SetMilestoneVersion");
static_assert(offsetof(AppFunctionLibrary_SetMilestoneVersion, NewMilestoneVersion) == 0x000000, "Member 'AppFunctionLibrary_SetMilestoneVersion::NewMilestoneVersion' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.TruncateStringWithEllipsis
// 0x0028 (0x0028 - 0x0000)
struct AppFunctionLibrary_TruncateStringWithEllipsis final
{
public:
	class FString                                 str;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Length;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_TruncateStringWithEllipsis) == 0x000008, "Wrong alignment on AppFunctionLibrary_TruncateStringWithEllipsis");
static_assert(sizeof(AppFunctionLibrary_TruncateStringWithEllipsis) == 0x000028, "Wrong size on AppFunctionLibrary_TruncateStringWithEllipsis");
static_assert(offsetof(AppFunctionLibrary_TruncateStringWithEllipsis, str) == 0x000000, "Member 'AppFunctionLibrary_TruncateStringWithEllipsis::str' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_TruncateStringWithEllipsis, Length) == 0x000010, "Member 'AppFunctionLibrary_TruncateStringWithEllipsis::Length' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_TruncateStringWithEllipsis, ReturnValue) == 0x000018, "Member 'AppFunctionLibrary_TruncateStringWithEllipsis::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.TruncateTextWithEllipsis
// 0x0028 (0x0028 - 0x0000)
struct AppFunctionLibrary_TruncateTextWithEllipsis final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         Length;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_TruncateTextWithEllipsis) == 0x000008, "Wrong alignment on AppFunctionLibrary_TruncateTextWithEllipsis");
static_assert(sizeof(AppFunctionLibrary_TruncateTextWithEllipsis) == 0x000028, "Wrong size on AppFunctionLibrary_TruncateTextWithEllipsis");
static_assert(offsetof(AppFunctionLibrary_TruncateTextWithEllipsis, Text) == 0x000000, "Member 'AppFunctionLibrary_TruncateTextWithEllipsis::Text' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_TruncateTextWithEllipsis, Length) == 0x000010, "Member 'AppFunctionLibrary_TruncateTextWithEllipsis::Length' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_TruncateTextWithEllipsis, ReturnValue) == 0x000018, "Member 'AppFunctionLibrary_TruncateTextWithEllipsis::ReturnValue' has a wrong offset!");

// Function UnionSystem.AppFunctionLibrary.TryLoadAsset
// 0x0018 (0x0018 - 0x0000)
struct AppFunctionLibrary_TryLoadAsset final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppFunctionLibrary_TryLoadAsset) == 0x000008, "Wrong alignment on AppFunctionLibrary_TryLoadAsset");
static_assert(sizeof(AppFunctionLibrary_TryLoadAsset) == 0x000018, "Wrong size on AppFunctionLibrary_TryLoadAsset");
static_assert(offsetof(AppFunctionLibrary_TryLoadAsset, AssetPath) == 0x000000, "Member 'AppFunctionLibrary_TryLoadAsset::AssetPath' has a wrong offset!");
static_assert(offsetof(AppFunctionLibrary_TryLoadAsset, ReturnValue) == 0x000010, "Member 'AppFunctionLibrary_TryLoadAsset::ReturnValue' has a wrong offset!");

// Function UnionSystem.ChallengeStatsUtility.AddChallengeStats
// 0x0008 (0x0008 - 0x0000)
struct ChallengeStatsUtility_AddChallengeStats final
{
public:
	EChallengeId                                  InChallengeId;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InValue;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengeStatsUtility_AddChallengeStats) == 0x000004, "Wrong alignment on ChallengeStatsUtility_AddChallengeStats");
static_assert(sizeof(ChallengeStatsUtility_AddChallengeStats) == 0x000008, "Wrong size on ChallengeStatsUtility_AddChallengeStats");
static_assert(offsetof(ChallengeStatsUtility_AddChallengeStats, InChallengeId) == 0x000000, "Member 'ChallengeStatsUtility_AddChallengeStats::InChallengeId' has a wrong offset!");
static_assert(offsetof(ChallengeStatsUtility_AddChallengeStats, InValue) == 0x000004, "Member 'ChallengeStatsUtility_AddChallengeStats::InValue' has a wrong offset!");

// Function UnionSystem.ChallengeStatsUtility.ChallengeProgressUpdateCategory
// 0x0001 (0x0001 - 0x0000)
struct ChallengeStatsUtility_ChallengeProgressUpdateCategory final
{
public:
	EChallengeCategory                            InCategory;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengeStatsUtility_ChallengeProgressUpdateCategory) == 0x000001, "Wrong alignment on ChallengeStatsUtility_ChallengeProgressUpdateCategory");
static_assert(sizeof(ChallengeStatsUtility_ChallengeProgressUpdateCategory) == 0x000001, "Wrong size on ChallengeStatsUtility_ChallengeProgressUpdateCategory");
static_assert(offsetof(ChallengeStatsUtility_ChallengeProgressUpdateCategory, InCategory) == 0x000000, "Member 'ChallengeStatsUtility_ChallengeProgressUpdateCategory::InCategory' has a wrong offset!");

// Function UnionSystem.ChallengeStatsUtility.GetCategoryChallenge
// 0x0018 (0x0018 - 0x0000)
struct ChallengeStatsUtility_GetCategoryChallenge final
{
public:
	EChallengeCategory                            InCategory;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EChallengeId>                          ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengeStatsUtility_GetCategoryChallenge) == 0x000008, "Wrong alignment on ChallengeStatsUtility_GetCategoryChallenge");
static_assert(sizeof(ChallengeStatsUtility_GetCategoryChallenge) == 0x000018, "Wrong size on ChallengeStatsUtility_GetCategoryChallenge");
static_assert(offsetof(ChallengeStatsUtility_GetCategoryChallenge, InCategory) == 0x000000, "Member 'ChallengeStatsUtility_GetCategoryChallenge::InCategory' has a wrong offset!");
static_assert(offsetof(ChallengeStatsUtility_GetCategoryChallenge, ReturnValue) == 0x000008, "Member 'ChallengeStatsUtility_GetCategoryChallenge::ReturnValue' has a wrong offset!");

// Function UnionSystem.ChallengeStatsUtility.GetCategoryChallengeData
// 0x0018 (0x0018 - 0x0000)
struct ChallengeStatsUtility_GetCategoryChallengeData final
{
public:
	EChallengeCategory                            InCategory;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChallengeStruct>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengeStatsUtility_GetCategoryChallengeData) == 0x000008, "Wrong alignment on ChallengeStatsUtility_GetCategoryChallengeData");
static_assert(sizeof(ChallengeStatsUtility_GetCategoryChallengeData) == 0x000018, "Wrong size on ChallengeStatsUtility_GetCategoryChallengeData");
static_assert(offsetof(ChallengeStatsUtility_GetCategoryChallengeData, InCategory) == 0x000000, "Member 'ChallengeStatsUtility_GetCategoryChallengeData::InCategory' has a wrong offset!");
static_assert(offsetof(ChallengeStatsUtility_GetCategoryChallengeData, ReturnValue) == 0x000008, "Member 'ChallengeStatsUtility_GetCategoryChallengeData::ReturnValue' has a wrong offset!");

// Function UnionSystem.ChallengeStatsUtility.GetCategoryClearCount
// 0x0008 (0x0008 - 0x0000)
struct ChallengeStatsUtility_GetCategoryClearCount final
{
public:
	EChallengeCategory                            InCategory;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengeStatsUtility_GetCategoryClearCount) == 0x000004, "Wrong alignment on ChallengeStatsUtility_GetCategoryClearCount");
static_assert(sizeof(ChallengeStatsUtility_GetCategoryClearCount) == 0x000008, "Wrong size on ChallengeStatsUtility_GetCategoryClearCount");
static_assert(offsetof(ChallengeStatsUtility_GetCategoryClearCount, InCategory) == 0x000000, "Member 'ChallengeStatsUtility_GetCategoryClearCount::InCategory' has a wrong offset!");
static_assert(offsetof(ChallengeStatsUtility_GetCategoryClearCount, ReturnValue) == 0x000004, "Member 'ChallengeStatsUtility_GetCategoryClearCount::ReturnValue' has a wrong offset!");

// Function UnionSystem.ChallengeStatsUtility.GetCategoryStats
// 0x0018 (0x0018 - 0x0000)
struct ChallengeStatsUtility_GetCategoryStats final
{
public:
	EChallengeCategory                            InCategory;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChallengeStatsData>            ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChallengeStatsUtility_GetCategoryStats) == 0x000008, "Wrong alignment on ChallengeStatsUtility_GetCategoryStats");
static_assert(sizeof(ChallengeStatsUtility_GetCategoryStats) == 0x000018, "Wrong size on ChallengeStatsUtility_GetCategoryStats");
static_assert(offsetof(ChallengeStatsUtility_GetCategoryStats, InCategory) == 0x000000, "Member 'ChallengeStatsUtility_GetCategoryStats::InCategory' has a wrong offset!");
static_assert(offsetof(ChallengeStatsUtility_GetCategoryStats, ReturnValue) == 0x000008, "Member 'ChallengeStatsUtility_GetCategoryStats::ReturnValue' has a wrong offset!");

// Function UnionSystem.ChallengeStatsUtility.GetChallengeCategory
// 0x0002 (0x0002 - 0x0000)
struct ChallengeStatsUtility_GetChallengeCategory final
{
public:
	EChallengeId                                  InId;                                              // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallengeCategory                            ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
