#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ResultRate_Sub_RankUp_Pyramid

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ResultRate_Sub_RankUp_Pyramid.WBP_ResultRate_Sub_RankUp_Pyramid_C.ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid
// 0x0050 (0x0050 - 0x0000)
struct WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x004C(0x0004)()
};
static_assert(alignof(WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid) == 0x000008, "Wrong alignment on WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid");
static_assert(sizeof(WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid) == 0x000050, "Wrong size on WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid, EntryPoint) == 0x000000, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000048, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000049, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x00004A, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid, CallFunc_SoundPlay_ReturnValue) == 0x00004C, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Pyramid::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");

// Function WBP_ResultRate_Sub_RankUp_Pyramid.WBP_ResultRate_Sub_RankUp_Pyramid_C.Set Now Rank Impl
// 0x0010 (0x0010 - 0x0000)
struct WBP_ResultRate_Sub_RankUp_Pyramid_C_Set_Now_Rank_Impl final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_RankUp_Pyramid_C_Set_Now_Rank_Impl) == 0x000008, "Wrong alignment on WBP_ResultRate_Sub_RankUp_Pyramid_C_Set_Now_Rank_Impl");
static_assert(sizeof(WBP_ResultRate_Sub_RankUp_Pyramid_C_Set_Now_Rank_Impl) == 0x000010, "Wrong size on WBP_ResultRate_Sub_RankUp_Pyramid_C_Set_Now_Rank_Impl");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_Set_Now_Rank_Impl, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_Set_Now_Rank_Impl::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_Set_Now_Rank_Impl, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000008, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_Set_Now_Rank_Impl::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");

// Function WBP_ResultRate_Sub_RankUp_Pyramid.WBP_ResultRate_Sub_RankUp_Pyramid_C.SetAnimateImpl
// 0x0030 (0x0030 - 0x0000)
struct WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl final
{
public:
	ERateRank                                     NowRank_in;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERateRank                                     NextRank_in;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRateRankToIntRank_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRateRankToIntRank_ReturnValue_1;       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRateRankCategoryNo_ReturnValue;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl) == 0x000008, "Wrong alignment on WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl");
static_assert(sizeof(WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl) == 0x000030, "Wrong size on WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl, NowRank_in) == 0x000000, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl::NowRank_in' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl, NextRank_in) == 0x000001, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl::NextRank_in' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl, CallFunc_GetRateRankToIntRank_ReturnValue) == 0x000018, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl::CallFunc_GetRateRankToIntRank_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl, CallFunc_GetRateRankToIntRank_ReturnValue_1) == 0x00001C, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl::CallFunc_GetRateRankToIntRank_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl, CallFunc_GetValidValue_ReturnValue) == 0x000021, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl, CallFunc_GetRateRankCategoryNo_ReturnValue) == 0x000024, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl::CallFunc_GetRateRankCategoryNo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_SetAnimateImpl::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");

// Function WBP_ResultRate_Sub_RankUp_Pyramid.WBP_ResultRate_Sub_RankUp_Pyramid_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_ResultRate_Sub_RankUp_Pyramid_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_RankUp_Pyramid_C_Tick) == 0x000004, "Wrong alignment on WBP_ResultRate_Sub_RankUp_Pyramid_C_Tick");
static_assert(sizeof(WBP_ResultRate_Sub_RankUp_Pyramid_C_Tick) == 0x00003C, "Wrong size on WBP_ResultRate_Sub_RankUp_Pyramid_C_Tick");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_RankUp_Pyramid_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_ResultRate_Sub_RankUp_Pyramid_C_Tick::InDeltaTime' has a wrong offset!");

}

