#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSelect_Sub_Trophy

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_CourseSelect_Sub_Trophy.WBP_CourseSelect_Sub_Trophy_C.ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy
// 0x0078 (0x0078 - 0x0000)
struct WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGrandPrixId                                  Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGrandPrixId                                  K2Node_Event_InGrandPrixId;                        // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy) == 0x000008, "Wrong alignment on WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy");
static_assert(sizeof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy) == 0x000078, "Wrong size on WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, EntryPoint) == 0x000000, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, Temp_byte_Variable) == 0x000004, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, Temp_real_Variable) == 0x000010, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, Temp_real_Variable_1) == 0x000018, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, Temp_real_Variable_2) == 0x000020, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, Temp_real_Variable_3) == 0x000028, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, Temp_real_Variable_4) == 0x000030, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, Temp_real_Variable_5) == 0x000038, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, Temp_real_Variable_6) == 0x000040, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, Temp_real_Variable_7) == 0x000048, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000050, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, K2Node_Event_InGrandPrixId) == 0x000054, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::K2Node_Event_InGrandPrixId' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, CallFunc_Subtract_IntInt_ReturnValue) == 0x000058, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000060, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, K2Node_Select_Default) == 0x000068, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000070, "Member 'WBP_CourseSelect_Sub_Trophy_C_ExecuteUbergraph_WBP_CourseSelect_Sub_Trophy::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CourseSelect_Sub_Trophy.WBP_CourseSelect_Sub_Trophy_C.SetGrandPrix
// 0x0001 (0x0001 - 0x0000)
struct WBP_CourseSelect_Sub_Trophy_C_SetGrandPrix final
{
public:
	EGrandPrixId                                  InGrandprixId;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_Trophy_C_SetGrandPrix) == 0x000001, "Wrong alignment on WBP_CourseSelect_Sub_Trophy_C_SetGrandPrix");
static_assert(sizeof(WBP_CourseSelect_Sub_Trophy_C_SetGrandPrix) == 0x000001, "Wrong size on WBP_CourseSelect_Sub_Trophy_C_SetGrandPrix");
static_assert(offsetof(WBP_CourseSelect_Sub_Trophy_C_SetGrandPrix, InGrandprixId) == 0x000000, "Member 'WBP_CourseSelect_Sub_Trophy_C_SetGrandPrix::InGrandprixId' has a wrong offset!");

}

