#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_Sub_RankNum

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_Sub_RankNum.WBP_CMN_Sub_RankNum_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_CMN_Sub_RankNum_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Rank_1000;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rank_0001;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rank_0010;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rank_0100;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Num;                                               // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CMN_Sub_RankNum(int32 EntryPoint);
	void SetNum(int32 Num_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_Sub_RankNum_C">();
	}
	static class UWBP_CMN_Sub_RankNum_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_Sub_RankNum_C>();
	}
};
static_assert(alignof(UWBP_CMN_Sub_RankNum_C) == 0x000008, "Wrong alignment on UWBP_CMN_Sub_RankNum_C");
static_assert(sizeof(UWBP_CMN_Sub_RankNum_C) == 0x000310, "Wrong size on UWBP_CMN_Sub_RankNum_C");
static_assert(offsetof(UWBP_CMN_Sub_RankNum_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_CMN_Sub_RankNum_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RankNum_C, Rank_1000) == 0x0002E8, "Member 'UWBP_CMN_Sub_RankNum_C::Rank_1000' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RankNum_C, Rank_0001) == 0x0002F0, "Member 'UWBP_CMN_Sub_RankNum_C::Rank_0001' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RankNum_C, Rank_0010) == 0x0002F8, "Member 'UWBP_CMN_Sub_RankNum_C::Rank_0010' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RankNum_C, Rank_0100) == 0x000300, "Member 'UWBP_CMN_Sub_RankNum_C::Rank_0100' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RankNum_C, Num) == 0x000308, "Member 'UWBP_CMN_Sub_RankNum_C::Num' has a wrong offset!");

}

