#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetInfo_Sub_Category

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GadgetInfo_Sub_Category.WBP_GadgetInfo_Sub_Category_C
// 0x0078 (0x0358 - 0x02E0)
class UWBP_GadgetInfo_Sub_Category_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG_Header;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NGPowerMark;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Header;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Ellipses;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Title;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetIcon_Cost01_Icon_C*          WBP_GadgetIcon_Cost01_Icon_01;                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetIcon_Cost01_Icon_C*          WBP_GadgetIcon_Cost01_Icon_02;                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetIcon_Cost01_Icon_C*          WBP_GadgetIcon_Cost01_Icon_03;                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetIcon_Cost01_Icon_C*          WBP_GadgetIcon_Cost01_Icon_04;                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetIcon_Cost01_Icon_C*          WBP_GadgetIcon_Cost01_Icon_05;                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetIcon_Cost01_Icon_C*          WBP_GadgetIcon_Cost01_Icon_06;                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_GadgetIcon_Cost01_Icon_C*>  IconList;                                          // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          OverList;                                          // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_GadgetInfo_Sub_Category(int32 EntryPoint);
	void IsListOver(bool* IsOver);
	void PreConstruct(bool IsDesignTime);
	void SetIconList(TArray<int32>& GadgetIds);
	void SetModeStyle(EEventInfomationType EventInfomation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GadgetInfo_Sub_Category_C">();
	}
	static class UWBP_GadgetInfo_Sub_Category_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GadgetInfo_Sub_Category_C>();
	}
};
static_assert(alignof(UWBP_GadgetInfo_Sub_Category_C) == 0x000008, "Wrong alignment on UWBP_GadgetInfo_Sub_Category_C");
static_assert(sizeof(UWBP_GadgetInfo_Sub_Category_C) == 0x000358, "Wrong size on UWBP_GadgetInfo_Sub_Category_C");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_GadgetInfo_Sub_Category_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, BG_Header) == 0x0002E8, "Member 'UWBP_GadgetInfo_Sub_Category_C::BG_Header' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, NGPowerMark) == 0x0002F0, "Member 'UWBP_GadgetInfo_Sub_Category_C::NGPowerMark' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, PAT_Header) == 0x0002F8, "Member 'UWBP_GadgetInfo_Sub_Category_C::PAT_Header' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, TXT_Ellipses) == 0x000300, "Member 'UWBP_GadgetInfo_Sub_Category_C::TXT_Ellipses' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, TXT_Title) == 0x000308, "Member 'UWBP_GadgetInfo_Sub_Category_C::TXT_Title' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, WBP_GadgetIcon_Cost01_Icon_01) == 0x000310, "Member 'UWBP_GadgetInfo_Sub_Category_C::WBP_GadgetIcon_Cost01_Icon_01' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, WBP_GadgetIcon_Cost01_Icon_02) == 0x000318, "Member 'UWBP_GadgetInfo_Sub_Category_C::WBP_GadgetIcon_Cost01_Icon_02' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, WBP_GadgetIcon_Cost01_Icon_03) == 0x000320, "Member 'UWBP_GadgetInfo_Sub_Category_C::WBP_GadgetIcon_Cost01_Icon_03' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, WBP_GadgetIcon_Cost01_Icon_04) == 0x000328, "Member 'UWBP_GadgetInfo_Sub_Category_C::WBP_GadgetIcon_Cost01_Icon_04' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, WBP_GadgetIcon_Cost01_Icon_05) == 0x000330, "Member 'UWBP_GadgetInfo_Sub_Category_C::WBP_GadgetIcon_Cost01_Icon_05' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, WBP_GadgetIcon_Cost01_Icon_06) == 0x000338, "Member 'UWBP_GadgetInfo_Sub_Category_C::WBP_GadgetIcon_Cost01_Icon_06' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, IconList) == 0x000340, "Member 'UWBP_GadgetInfo_Sub_Category_C::IconList' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_Sub_Category_C, OverList) == 0x000350, "Member 'UWBP_GadgetInfo_Sub_Category_C::OverList' has a wrong offset!");

}

