#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo.WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C final : public UUserWidget
{
public:
	class UImage*                                 Base_Chara;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_CharaIcon;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_Rank_C*               WBP_Race_HUD_Sub_Rank;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetIcon(EDriverId newParam);
	void SetRank(int32 NewRank);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C">();
	}
	static class UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C) == 0x0002F8, "Wrong size on UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C, Base_Chara) == 0x0002E0, "Member 'UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C::Base_Chara' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C, DMY_CharaIcon) == 0x0002E8, "Member 'UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C::DMY_CharaIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C, WBP_Race_HUD_Sub_Rank) == 0x0002F0, "Member 'UWBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C::WBP_Race_HUD_Sub_Rank' has a wrong offset!");

}

