#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_Info

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Popup_Info.WBP_Popup_Info_C
// 0x0118 (0x03F8 - 0x02E0)
class UWBP_Popup_Info_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_RaceFlag;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseHeader;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseHeader_Btm;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseHeader_Top;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Chara_01;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Chara_02;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_Thumbnail;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_Thumbnail_Btn;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              DSP_Waiting_dot_Owner;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_ptcl_01;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_ptcl_02;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_ptcl_03;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_ptcl_04;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Header;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_ID;                                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Info_Image;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Info_Image_Btn;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Info_Loading;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Info_Long;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Info_Middle;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Info_Standard;                                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_InfoDetail;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Question;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_MainMenu_Btn_C*                WBP_CMN_MainMenu_Btn_01;                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_MainMenu_Btn_C*                WBP_CMN_MainMenu_Btn_02;                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Online_MatchingInfo_Sub_WaitingIcon_C* WBP_Online_MatchingInfo_Sub_WaitingIcon;       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          WBP_Popup_Sub_Btn_01;                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          WBP_Popup_Sub_Btn_02;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          WBP_Popup_Sub_Btn_03;                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          WBP_Popup_Sub_Btn_04;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_Information;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bSetButtonText;                                    // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Popup_Info(int32 EntryPoint);
	void GetButton(int32 ButtonIndex, class UUnionUIButtonBase** Button);
	void PreConstruct(bool IsDesignTime);
	void SetButtonText(const TArray<class FText>& InTextArray);
	void SetImageButtonSelectText(const class FText& InText);
	void SetImageTexture(class UTexture2D* InTexture2D);
	void SetMainMenuButtonIconIndex(int32 Btn01IconIndex, int32 Btn02IconIndex);
	void SetMessageText(const class FText& InText);
	void SwitchInfoDisplay(int32 InIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Popup_Info_C">();
	}
	static class UWBP_Popup_Info_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Popup_Info_C>();
	}
};
static_assert(alignof(UWBP_Popup_Info_C) == 0x000008, "Wrong alignment on UWBP_Popup_Info_C");
static_assert(sizeof(UWBP_Popup_Info_C) == 0x0003F8, "Wrong size on UWBP_Popup_Info_C");
static_assert(offsetof(UWBP_Popup_Info_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Popup_Info_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, base) == 0x0002E8, "Member 'UWBP_Popup_Info_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, Base_RaceFlag) == 0x0002F0, "Member 'UWBP_Popup_Info_C::Base_RaceFlag' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, BaseHeader) == 0x0002F8, "Member 'UWBP_Popup_Info_C::BaseHeader' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, BaseHeader_Btm) == 0x000300, "Member 'UWBP_Popup_Info_C::BaseHeader_Btm' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, BaseHeader_Top) == 0x000308, "Member 'UWBP_Popup_Info_C::BaseHeader_Top' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, Chara_01) == 0x000310, "Member 'UWBP_Popup_Info_C::Chara_01' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, Chara_02) == 0x000318, "Member 'UWBP_Popup_Info_C::Chara_02' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, DMY_Thumbnail) == 0x000320, "Member 'UWBP_Popup_Info_C::DMY_Thumbnail' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, DMY_Thumbnail_Btn) == 0x000328, "Member 'UWBP_Popup_Info_C::DMY_Thumbnail_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, DSP_Waiting_dot_Owner) == 0x000330, "Member 'UWBP_Popup_Info_C::DSP_Waiting_dot_Owner' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, Eff_ptcl_01) == 0x000338, "Member 'UWBP_Popup_Info_C::Eff_ptcl_01' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, Eff_ptcl_02) == 0x000340, "Member 'UWBP_Popup_Info_C::Eff_ptcl_02' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, Eff_ptcl_03) == 0x000348, "Member 'UWBP_Popup_Info_C::Eff_ptcl_03' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, Eff_ptcl_04) == 0x000350, "Member 'UWBP_Popup_Info_C::Eff_ptcl_04' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, Panel) == 0x000358, "Member 'UWBP_Popup_Info_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, TXT_Header) == 0x000360, "Member 'UWBP_Popup_Info_C::TXT_Header' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, TXT_ID) == 0x000368, "Member 'UWBP_Popup_Info_C::TXT_ID' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, TXT_Info_Image) == 0x000370, "Member 'UWBP_Popup_Info_C::TXT_Info_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, TXT_Info_Image_Btn) == 0x000378, "Member 'UWBP_Popup_Info_C::TXT_Info_Image_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, TXT_Info_Loading) == 0x000380, "Member 'UWBP_Popup_Info_C::TXT_Info_Loading' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, TXT_Info_Long) == 0x000388, "Member 'UWBP_Popup_Info_C::TXT_Info_Long' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, TXT_Info_Middle) == 0x000390, "Member 'UWBP_Popup_Info_C::TXT_Info_Middle' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, TXT_Info_Standard) == 0x000398, "Member 'UWBP_Popup_Info_C::TXT_Info_Standard' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, TXT_InfoDetail) == 0x0003A0, "Member 'UWBP_Popup_Info_C::TXT_InfoDetail' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, TXT_Question) == 0x0003A8, "Member 'UWBP_Popup_Info_C::TXT_Question' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, WBP_CMN_MainMenu_Btn_01) == 0x0003B0, "Member 'UWBP_Popup_Info_C::WBP_CMN_MainMenu_Btn_01' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, WBP_CMN_MainMenu_Btn_02) == 0x0003B8, "Member 'UWBP_Popup_Info_C::WBP_CMN_MainMenu_Btn_02' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, WBP_Online_MatchingInfo_Sub_WaitingIcon) == 0x0003C0, "Member 'UWBP_Popup_Info_C::WBP_Online_MatchingInfo_Sub_WaitingIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, WBP_Popup_Sub_Btn_01) == 0x0003C8, "Member 'UWBP_Popup_Info_C::WBP_Popup_Sub_Btn_01' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, WBP_Popup_Sub_Btn_02) == 0x0003D0, "Member 'UWBP_Popup_Info_C::WBP_Popup_Sub_Btn_02' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, WBP_Popup_Sub_Btn_03) == 0x0003D8, "Member 'UWBP_Popup_Info_C::WBP_Popup_Sub_Btn_03' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, WBP_Popup_Sub_Btn_04) == 0x0003E0, "Member 'UWBP_Popup_Info_C::WBP_Popup_Sub_Btn_04' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, WS_Information) == 0x0003E8, "Member 'UWBP_Popup_Info_C::WS_Information' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Info_C, bSetButtonText) == 0x0003F0, "Member 'UWBP_Popup_Info_C::bSetButtonText' has a wrong offset!");

}

