#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_Sub_Header_StageName

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TimeTrial_Sub_Header_StageName.WBP_TimeTrial_Sub_Header_StageName_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_TimeTrial_Sub_Header_StageName_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DMY_StageIcon;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_StageName;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName(int32 EntryPoint);
	void SetStageParam(EStageId InStageId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TimeTrial_Sub_Header_StageName_C">();
	}
	static class UWBP_TimeTrial_Sub_Header_StageName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TimeTrial_Sub_Header_StageName_C>();
	}
};
static_assert(alignof(UWBP_TimeTrial_Sub_Header_StageName_C) == 0x000008, "Wrong alignment on UWBP_TimeTrial_Sub_Header_StageName_C");
static_assert(sizeof(UWBP_TimeTrial_Sub_Header_StageName_C) == 0x0002F8, "Wrong size on UWBP_TimeTrial_Sub_Header_StageName_C");
static_assert(offsetof(UWBP_TimeTrial_Sub_Header_StageName_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_TimeTrial_Sub_Header_StageName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Header_StageName_C, DMY_StageIcon) == 0x0002E8, "Member 'UWBP_TimeTrial_Sub_Header_StageName_C::DMY_StageIcon' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Header_StageName_C, TXT_StageName) == 0x0002F0, "Member 'UWBP_TimeTrial_Sub_Header_StageName_C::TXT_StageName' has a wrong offset!");

}

