#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_SubMenu_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_SubMenu_List.WBP_CMN_SubMenu_List_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_CMN_SubMenu_List_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VerticalBox_BtnPlay;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_SubMenu_MenuBtn_C*             WBP_CMN_SubMenu_MenuBtn_CharaMachine;              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_SubMenu_MenuBtn_C*             WBP_CMN_SubMenu_MenuBtn_Etcetera;                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_SubMenu_MenuBtn_C*             WBP_CMN_SubMenu_MenuBtn_FriendList;                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_SubMenu_MenuBtn_C*             WBP_CMN_SubMenu_MenuBtn_Gadget;                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_SubMenu_MenuBtn_C*             WBP_CMN_SubMenu_MenuBtn_Garage;                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCommonMenuSubMenuButton*>       Buttons;                                           // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CMN_SubMenu_List(int32 EntryPoint);
	void GetButtons(TArray<class UCommonMenuSubMenuButton*>* Buttons_0);
	void InitializeAnimButtons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_SubMenu_List_C">();
	}
	static class UWBP_CMN_SubMenu_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_SubMenu_List_C>();
	}
};
static_assert(alignof(UWBP_CMN_SubMenu_List_C) == 0x000008, "Wrong alignment on UWBP_CMN_SubMenu_List_C");
static_assert(sizeof(UWBP_CMN_SubMenu_List_C) == 0x000328, "Wrong size on UWBP_CMN_SubMenu_List_C");
static_assert(offsetof(UWBP_CMN_SubMenu_List_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_CMN_SubMenu_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_SubMenu_List_C, VerticalBox_BtnPlay) == 0x0002E8, "Member 'UWBP_CMN_SubMenu_List_C::VerticalBox_BtnPlay' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_SubMenu_List_C, WBP_CMN_SubMenu_MenuBtn_CharaMachine) == 0x0002F0, "Member 'UWBP_CMN_SubMenu_List_C::WBP_CMN_SubMenu_MenuBtn_CharaMachine' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_SubMenu_List_C, WBP_CMN_SubMenu_MenuBtn_Etcetera) == 0x0002F8, "Member 'UWBP_CMN_SubMenu_List_C::WBP_CMN_SubMenu_MenuBtn_Etcetera' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_SubMenu_List_C, WBP_CMN_SubMenu_MenuBtn_FriendList) == 0x000300, "Member 'UWBP_CMN_SubMenu_List_C::WBP_CMN_SubMenu_MenuBtn_FriendList' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_SubMenu_List_C, WBP_CMN_SubMenu_MenuBtn_Gadget) == 0x000308, "Member 'UWBP_CMN_SubMenu_List_C::WBP_CMN_SubMenu_MenuBtn_Gadget' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_SubMenu_List_C, WBP_CMN_SubMenu_MenuBtn_Garage) == 0x000310, "Member 'UWBP_CMN_SubMenu_List_C::WBP_CMN_SubMenu_MenuBtn_Garage' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_SubMenu_List_C, Buttons) == 0x000318, "Member 'UWBP_CMN_SubMenu_List_C::Buttons' has a wrong offset!");

}

