#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FooterShortCut

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FooterShortCut.WBP_FooterShortCut_C
// 0x0038 (0x0320 - 0x02E8)
class UWBP_FooterShortCut_C final : public UCommonFooterShortCut
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FooterMenu_Out;                                    // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FooterMenu_Loop;                                   // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FooterMenu_In;                                     // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                MouseInteraction;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_FooterShortCut_MouseInteraction_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_FooterShortCut(int32 EntryPoint);
	void SetTextMainType(EFooterMainTextType InType);
	void SetTextSubType(EFooterSubTextType InType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FooterShortCut_C">();
	}
	static class UWBP_FooterShortCut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FooterShortCut_C>();
	}
};
static_assert(alignof(UWBP_FooterShortCut_C) == 0x000008, "Wrong alignment on UWBP_FooterShortCut_C");
static_assert(sizeof(UWBP_FooterShortCut_C) == 0x000320, "Wrong size on UWBP_FooterShortCut_C");
static_assert(offsetof(UWBP_FooterShortCut_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_FooterShortCut_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FooterShortCut_C, FooterMenu_Out) == 0x0002F0, "Member 'UWBP_FooterShortCut_C::FooterMenu_Out' has a wrong offset!");
static_assert(offsetof(UWBP_FooterShortCut_C, FooterMenu_Loop) == 0x0002F8, "Member 'UWBP_FooterShortCut_C::FooterMenu_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_FooterShortCut_C, FooterMenu_In) == 0x000300, "Member 'UWBP_FooterShortCut_C::FooterMenu_In' has a wrong offset!");
static_assert(offsetof(UWBP_FooterShortCut_C, MouseInteraction) == 0x000308, "Member 'UWBP_FooterShortCut_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_FooterShortCut_C, OnClicked) == 0x000310, "Member 'UWBP_FooterShortCut_C::OnClicked' has a wrong offset!");

}

