#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyRace_Sub_OptionBtn

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function WBP_PartyRace_Sub_OptionBtn.WBP_PartyRace_Sub_OptionBtn_C.ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRaceConfirmButton                       Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_5;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRaceConfirmButton                       Temp_byte_Variable_1;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_6;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_8;                              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRaceConfirmButton                       Temp_byte_Variable_2;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_9;                              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_2;                       // 0x0054(0x0008)(NoDestructor)
	int32                                         CallFunc_GetUserIndexByFocusEvent_ReturnValue;     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0070(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0078(0x0008)(NoDestructor)
	float                                         Temp_real_Variable_10;                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_11;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue;           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x00B4(0x0004)()
	float                                         K2Node_Select_Default;                             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn");
static_assert(sizeof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn) == 0x0000F8, "Wrong size on WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, EntryPoint) == 0x000000, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_real_Variable) == 0x000004, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_byte_Variable) == 0x000008, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_real_Variable_1) == 0x00000C, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_real_Variable_2) == 0x000010, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_real_Variable_3) == 0x000014, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_real_Variable_4) == 0x000018, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_bool_Has_Been_Initd_Variable) == 0x00001C, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_bool_IsClosed_Variable) == 0x00001D, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_real_Variable_5) == 0x000020, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000024, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_byte_Variable_1) == 0x000025, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_real_Variable_6) == 0x000028, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_real_Variable_7) == 0x00002C, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_bool_Has_Been_Initd_Variable_1) == 0x000030, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_real_Variable_8) == 0x000034, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_byte_Variable_2) == 0x000038, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, K2Node_Event_IsDesignTime) == 0x000039, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_HasAnyUserFocus_ReturnValue) == 0x00003A, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_real_Variable_9) == 0x00003C, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000048, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, K2Node_Event_InFocusEvent_2) == 0x000054, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::K2Node_Event_InFocusEvent_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_GetUserIndexByFocusEvent_ReturnValue) == 0x00005C, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_GetUserIndexByFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x000060, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, K2Node_Event_InFocusEvent_1) == 0x000070, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, K2Node_Event_InFocusEvent) == 0x000078, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_real_Variable_10) == 0x000080, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_real_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_real_Variable_11) == 0x000084, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_real_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000088, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x000090, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_UnregisterMainMenu_ReturnValue) == 0x000099, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_UnregisterMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_PlayAnimation_ReturnValue) == 0x0000A0, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A8, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B0, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_SoundPlay_ReturnValue) == 0x0000B4, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, K2Node_Select_Default) == 0x0000B8, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_Not_PreBool_ReturnValue) == 0x0000BC, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, Temp_bool_IsClosed_Variable_1) == 0x0000BD, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0000BE, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000C0, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x0000C8, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D0, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, K2Node_Select_Default_1) == 0x0000D8, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000E0, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, K2Node_Select_Default_2) == 0x0000E8, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x0000F0, "Member 'WBP_PartyRace_Sub_OptionBtn_C_ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");

// Function WBP_PartyRace_Sub_OptionBtn.WBP_PartyRace_Sub_OptionBtn_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_Sub_OptionBtn_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_PartyRace_Sub_OptionBtn_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_PartyRace_Sub_OptionBtn_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_PartyRace_Sub_OptionBtn_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_PartyRace_Sub_OptionBtn_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_PartyRace_Sub_OptionBtn_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_PartyRace_Sub_OptionBtn.WBP_PartyRace_Sub_OptionBtn_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_Sub_OptionBtn_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_PartyRace_Sub_OptionBtn_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_PartyRace_Sub_OptionBtn_C_OnFocusLost");
static_assert(sizeof(WBP_PartyRace_Sub_OptionBtn_C_OnFocusLost) == 0x000008, "Wrong size on WBP_PartyRace_Sub_OptionBtn_C_OnFocusLost");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_PartyRace_Sub_OptionBtn_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_PartyRace_Sub_OptionBtn.WBP_PartyRace_Sub_OptionBtn_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived");
static_assert(sizeof(WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'WBP_PartyRace_Sub_OptionBtn_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function WBP_PartyRace_Sub_OptionBtn.WBP_PartyRace_Sub_OptionBtn_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_Sub_OptionBtn_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_PartyRace_Sub_OptionBtn_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_PartyRace_Sub_OptionBtn_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_PartyRace_Sub_OptionBtn_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_PartyRace_Sub_OptionBtn_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_PartyRace_Sub_OptionBtn_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_PartyRace_Sub_OptionBtn.WBP_PartyRace_Sub_OptionBtn_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PartyRace_Sub_OptionBtn_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_OptionBtn_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PartyRace_Sub_OptionBtn_C_PreConstruct");
static_assert(sizeof(WBP_PartyRace_Sub_OptionBtn_C_PreConstruct) == 0x000001, "Wrong size on WBP_PartyRace_Sub_OptionBtn_C_PreConstruct");
static_assert(offsetof(WBP_PartyRace_Sub_OptionBtn_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PartyRace_Sub_OptionBtn_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

