#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupResult

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UnionRun_structs.hpp"


namespace SDK::Params
{

// Function WBP_GroupResult.WBP_GroupResult_C.ExecuteUbergraph_WBP_GroupResult
// 0x0770 (0x0770 - 0x0000)
struct WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0070(0x0004)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_Table_Line_C*      CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSettingMatchRule                         CallFunc_GetRaceSettingMatchRule_ReturnValue;      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSettingGrouping                          CallFunc_GetRaceSettingGrouping_ReturnValue;       // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetResultWinnerTeam_OutTeamNoList;        // 0x00A0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Count_Anim_End_bIsEnd;                 // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSettingMatchRule                         CallFunc_GetRaceSettingMatchRule_ReturnValue_1;    // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ETopCountState>                        CallFunc_GetResultTopCountStateTeam_OutTopCountStateList; // 0x00B8(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x00D0(0x0004)()
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGroupRaceRule                                CallFunc_GetGroupRaceRule_ReturnValue;             // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceUIGroupTotalTable*            CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_TeamTable_C*       K2Node_DynamicCast_AsWBP_Group_Result_Sub_Team_Table; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetResultCalcTeamPoint_OutCalcTeamPointList; // 0x0110(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetResultCalcTeamPoint_OutMaxPoint;       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x0124(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_3;                  // 0x0128(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_4;                  // 0x012C(0x0004)()
	TArray<class UUnionRaceUIGroupTotalTable*>    K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsGroupRaceFestaColor_ReturnValue;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_GroupResult_Sub_Table_Line_C*> K2Node_MakeArray_Array_1;                       // 0x0148(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_5;                  // 0x0158(0x0004)()
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerRacerIndex_ReturnValue;          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceUIGroupTotalTable*            CallFunc_Array_Get_Item_2;                         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GroupResult_Sub_TeamTable_C*       K2Node_DynamicCast_AsWBP_Group_Result_Sub_Team_Table_1; // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGroupRaceRule                                CallFunc_GetGroupRaceRuleSetting_ReturnValue;      // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0194(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuGroupRaceRuleData                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x01A0(0x00E0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_296[0x2];                                      // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGroupRaceFestaColor_ReturnValue_1;      // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSettingGrouping                          CallFunc_GetRaceSettingGrouping_ReturnValue_1;     // 0x029E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x029F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuGroupRaceBonusData                CallFunc_GetMenuGroupBonusData_ReturnValue;        // 0x02A8(0x0070)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinalRace_ReturnValue;                  // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRacePreset                              CallFunc_GetSelectedRaceParkPresetId_ReturnValue;  // 0x031B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentRaceCount_ReturnValue;          // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomRaceSetting                     CallFunc_GetCustomRaceSettingBP_OutCustomRaceSetting; // 0x0328(0x0120)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44A[0x2];                                      // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_Table_Line_C*      CallFunc_Array_Get_Item_3;                         // 0x0450(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinalRace_ReturnValue_1;                // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_2;      // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B[0x5];                                      // 0x047B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49A[0x2];                                      // 0x049A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_4;                         // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A5[0x3];                                      // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRaceUIGroupTotalTable*            CallFunc_Array_Get_Item_5;                         // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_TeamTable_C*       K2Node_DynamicCast_AsWBP_Group_Result_Sub_Team_Table_2; // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x3];                                      // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSettingGrouping                          CallFunc_GetRaceSettingGrouping_ReturnValue_2;     // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2[0x2];                                      // 0x04C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRaceUIGroupTotalTable*            CallFunc_Array_Get_Item_6;                         // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_TeamTable_C*       K2Node_DynamicCast_AsWBP_Group_Result_Sub_Team_Table_3; // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPartyResultRacer                      CallFunc_Array_Get_Item_7;                         // 0x04F0(0x0040)()
	class UWBP_GroupResult_Sub_Table_Line_C*      CallFunc_Array_Get_Item_8;                         // 0x0530(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_8;                  // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0545(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_546[0x2];                                      // 0x0546(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_8;                   // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GroupResult_Sub_Table_Line_C*      CallFunc_Array_Get_Item_9;                         // 0x0558(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_9;                  // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0564(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_565[0x3];                                      // 0x0565(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_9;                   // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceUIGroupTotalTable*            CallFunc_Array_Get_Item_10;                        // 0x0570(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_TeamTable_C*       K2Node_DynamicCast_AsWBP_Group_Result_Sub_Team_Table_4; // 0x0578(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x3];                                      // 0x0581(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_10;                 // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_10;                  // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETopCountState                                CallFunc_Array_Get_Item_11;                        // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRaceUIGroupTotalTable*            CallFunc_Array_Get_Item_12;                        // 0x0590(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GroupResult_Sub_TeamTable_C*       K2Node_DynamicCast_AsWBP_Group_Result_Sub_Team_Table_5; // 0x05A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GroupResult_Sub_TeamTable_C*       K2Node_DynamicCast_AsWBP_Group_Result_Sub_Team_Table_6; // 0x05B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x3];                                      // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_11;                  // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRaceUIGroupTotalTable*            CallFunc_Array_Get_Item_13;                        // 0x05C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_TeamTable_C*       K2Node_DynamicCast_AsWBP_Group_Result_Sub_Team_Table_7; // 0x05D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x3];                                      // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_11;                 // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_12;                 // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_11;                // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_12;                // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_12;                  // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionRaceUIGroupTotalTable*            CallFunc_Array_Get_Item_14;                        // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_TeamTable_C*       K2Node_DynamicCast_AsWBP_Group_Result_Sub_Team_Table_8; // 0x05F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x3];                                      // 0x0601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_13;                 // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_13;                  // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRaceUIGroupTotalTable*            CallFunc_Array_Get_Item_15;                        // 0x0610(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_TeamTable_C*       K2Node_DynamicCast_AsWBP_Group_Result_Sub_Team_Table_9; // 0x0618(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x3];                                      // 0x0621(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_13;                // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate;              // 0x062C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0640(0x0010)()
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651[0x7];                                      // 0x0651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFestaResultInfo                       CallFunc_GetFestaResultInfo_OutInfo;               // 0x0658(0x0040)()
	struct FFestaRacerResultInfo                  CallFunc_Array_Get_Item_16;                        // 0x0698(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x06AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AD[0x3];                                      // 0x06AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFestaTeamResultInfo                   CallFunc_Array_Get_Item_17;                        // 0x06B0(0x0014)(NoDestructor)
	struct FFestaTeamResultInfo                   CallFunc_Array_Get_Item_18;                        // 0x06C4(0x0014)(NoDestructor)
	struct FFestaTeamResultInfo                   CallFunc_Array_Get_Item_19;                        // 0x06D8(0x0014)(NoDestructor)
	struct FFestaTeamResultInfo                   CallFunc_Array_Get_Item_20;                        // 0x06EC(0x0014)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_14;                // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFestaTeamResultInfo                   CallFunc_Array_Get_Item_21;                        // 0x0704(0x0014)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_9;               // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_9;                // 0x071C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71D[0x3];                                      // 0x071D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_10;              // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_11;              // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_10;               // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_11;               // 0x0729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x072A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72B[0x1];                                      // 0x072B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_12;              // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_13;              // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_12;               // 0x0734(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_13;               // 0x0735(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_736[0x2];                                      // 0x0736(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuInputRecieveObject*                CallFunc_SpawnObject_ReturnValue;                  // 0x0740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x074C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0754(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_755[0x3];                                      // 0x0755(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_Select_Default_1;                           // 0x0758(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Set_Racer_Data_Impl_Time1st_ImplicitCast; // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult) == 0x000008, "Wrong alignment on WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult");
static_assert(sizeof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult) == 0x000770, "Wrong size on WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, EntryPoint) == 0x000000, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, Temp_int_Array_Index_Variable_1) == 0x000008, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_Event_MyGeometry) == 0x000018, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_Event_InDeltaTime) == 0x000050, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_GetPlayerController_ReturnValue) == 0x000060, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_PlayAnimation_ReturnValue_1) == 0x000068, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_SoundPlay_ReturnValue) == 0x000070, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_Array_Get_Item) == 0x000080, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, Temp_int_Variable) == 0x00008C, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000090, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_Array_Length_ReturnValue_2) == 0x000094, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_GetRaceSettingMatchRule_ReturnValue) == 0x000099, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_GetRaceSettingMatchRule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_SwitchEnum_CmpSuccess) == 0x00009A, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_GetRaceSettingGrouping_ReturnValue) == 0x00009B, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_GetRaceSettingGrouping_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_SwitchEnum_CmpSuccess_1) == 0x00009C, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_GetResultWinnerTeam_OutTeamNoList) == 0x0000A0, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_GetResultWinnerTeam_OutTeamNoList' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_Array_Length_ReturnValue_3) == 0x0000B0, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_Not_PreBool_ReturnValue) == 0x0000B4, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_Is_Count_Anim_End_bIsEnd) == 0x0000B5, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_Is_Count_Anim_End_bIsEnd' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_GetRaceSettingMatchRule_ReturnValue_1) == 0x0000B6, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_GetRaceSettingMatchRule_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_GetResultTopCountStateTeam_OutTopCountStateList) == 0x0000B8, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_GetResultTopCountStateTeam_OutTopCountStateList' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000C8, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_Array_Length_ReturnValue_4) == 0x0000CC, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_SoundPlay_ReturnValue_1) == 0x0000D0, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x0000D4, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_SwitchEnum_CmpSuccess_3) == 0x0000D5, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_SwitchEnum_CmpSuccess_4) == 0x0000D6, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_GetGroupRaceRule_ReturnValue) == 0x0000D7, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_GetGroupRaceRule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000D8, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, Temp_int_Array_Index_Variable_2) == 0x0000DC, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_DynamicCast_AsWBP_Group_Result_Sub_Team_Table) == 0x0000E8, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_DynamicCast_AsWBP_Group_Result_Sub_Team_Table' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000F1, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000F8, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_DynamicCast_As_____2D) == 0x000100, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, Temp_int_Array_Index_Variable_3) == 0x00010C, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_GetResultCalcTeamPoint_OutCalcTeamPointList) == 0x000110, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_GetResultCalcTeamPoint_OutCalcTeamPointList' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_GetResultCalcTeamPoint_OutMaxPoint) == 0x000120, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_GetResultCalcTeamPoint_OutMaxPoint' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_SoundPlay_ReturnValue_2) == 0x000124, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_SoundPlay_ReturnValue_3) == 0x000128, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_SoundPlay_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, CallFunc_SoundPlay_ReturnValue_4) == 0x00012C, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::CallFunc_SoundPlay_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult, K2Node_MakeArray_Array) == 0x000130, "Member 'WBP_GroupResult_C_ExecuteUbergraph_WBP_GroupResult::K2Node_MakeArray_Array' has a wrong offset!");
