#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_StickerRangeInfo

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_StickerRangeInfo.WBP_MachineCustom_Sub_StickerRangeInfo_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_MachineCustom_Sub_StickerRangeInfo_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       info_Init;                                         // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Info_Out;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Info_Loop;                                         // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Info_In;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExitInfo_Pict;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Info;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_StickerRangeInfo_C">();
	}
	static class UWBP_MachineCustom_Sub_StickerRangeInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_StickerRangeInfo_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_StickerRangeInfo_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_StickerRangeInfo_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_StickerRangeInfo_C) == 0x000318, "Wrong size on UWBP_MachineCustom_Sub_StickerRangeInfo_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerRangeInfo_C, info_Init) == 0x0002E0, "Member 'UWBP_MachineCustom_Sub_StickerRangeInfo_C::info_Init' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerRangeInfo_C, Info_Out) == 0x0002E8, "Member 'UWBP_MachineCustom_Sub_StickerRangeInfo_C::Info_Out' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerRangeInfo_C, Info_Loop) == 0x0002F0, "Member 'UWBP_MachineCustom_Sub_StickerRangeInfo_C::Info_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerRangeInfo_C, Info_In) == 0x0002F8, "Member 'UWBP_MachineCustom_Sub_StickerRangeInfo_C::Info_In' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerRangeInfo_C, base) == 0x000300, "Member 'UWBP_MachineCustom_Sub_StickerRangeInfo_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerRangeInfo_C, ExitInfo_Pict) == 0x000308, "Member 'UWBP_MachineCustom_Sub_StickerRangeInfo_C::ExitInfo_Pict' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerRangeInfo_C, TXT_Info) == 0x000310, "Member 'UWBP_MachineCustom_Sub_StickerRangeInfo_C::TXT_Info' has a wrong offset!");

}

