#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_TimeTrial_Time

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_TimeTrial_Time.WBP_Race_HUD_Sub_TimeTrial_Time_C
// 0x0078 (0x0398 - 0x0320)
class UWBP_Race_HUD_Sub_TimeTrial_Time_C final : public URaceUISubTimeTrialTime
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_0000001;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_0000010;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_0000100;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_0001000;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_0010000;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_0100000;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Personalbest_Base;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TargetTime_Base;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Personalbest;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_TargetTime;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_TimeTrial_LAP_Time_C* WBP_Race_HUD_Sub_TimeTrial_LAP_Time_01;            // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_TimeTrial_LAP_Time_C* WBP_Race_HUD_Sub_TimeTrial_LAP_Time_02;            // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_Time(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_TimeTrial_Time_C">();
	}
	static class UWBP_Race_HUD_Sub_TimeTrial_Time_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_TimeTrial_Time_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_TimeTrial_Time_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_TimeTrial_Time_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_TimeTrial_Time_C) == 0x000398, "Wrong size on UWBP_Race_HUD_Sub_TimeTrial_Time_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, UberGraphFrame) == 0x000320, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, base) == 0x000328, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, Icon) == 0x000330, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, NUM_0000001) == 0x000338, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::NUM_0000001' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, NUM_0000010) == 0x000340, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::NUM_0000010' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, NUM_0000100) == 0x000348, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::NUM_0000100' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, NUM_0001000) == 0x000350, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::NUM_0001000' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, NUM_0010000) == 0x000358, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::NUM_0010000' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, NUM_0100000) == 0x000360, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::NUM_0100000' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, Personalbest_Base) == 0x000368, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::Personalbest_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, TargetTime_Base) == 0x000370, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::TargetTime_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, TXT_Personalbest) == 0x000378, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::TXT_Personalbest' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, TXT_TargetTime) == 0x000380, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::TXT_TargetTime' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, WBP_Race_HUD_Sub_TimeTrial_LAP_Time_01) == 0x000388, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::WBP_Race_HUD_Sub_TimeTrial_LAP_Time_01' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_Time_C, WBP_Race_HUD_Sub_TimeTrial_LAP_Time_02) == 0x000390, "Member 'UWBP_Race_HUD_Sub_TimeTrial_Time_C::WBP_Race_HUD_Sub_TimeTrial_LAP_Time_02' has a wrong offset!");

}

