#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_CustomSticker_OperationGuide

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MachineCustom_Sub_CustomSticker_OperationGuide.WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C.ExecuteUbergraph_WBP_MachineCustom_Sub_CustomSticker_OperationGuide
// 0x0020 (0x0020 - 0x0000)
struct WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomSticker_OperationGuide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MachineCustom_Sub_CustomSticker_OperationGuideBtn_C*> K2Node_MakeArray_Array;  // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomSticker_OperationGuide) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomSticker_OperationGuide");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomSticker_OperationGuide) == 0x000020, "Wrong size on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomSticker_OperationGuide");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomSticker_OperationGuide, EntryPoint) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomSticker_OperationGuide::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomSticker_OperationGuide, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomSticker_OperationGuide::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomSticker_OperationGuide, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomSticker_OperationGuide::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomSticker_OperationGuide.WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C.PlayGuideIn
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideIn) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideIn");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideIn) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideIn");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideIn, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideIn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomSticker_OperationGuide.WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C.PlayGuideOut
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideOut final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideOut) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideOut");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideOut) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideOut");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideOut, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_PlayGuideOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomSticker_OperationGuide.WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C.SetButtonInfo
// 0x0040 (0x0040 - 0x0000)
struct WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo final
{
public:
	class UWBP_MachineCustom_Sub_CustomSticker_OperationGuideBtn_C* GuideButton;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bIsRequirePlusButton;                              // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSimultaneously;                                 // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SwitchIndex;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 ButtonIndex;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo) == 0x000040, "Wrong size on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo, GuideButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo::GuideButton' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo, ButtonText) == 0x000008, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo::ButtonText' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo, bIsRequirePlusButton) == 0x000018, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo::bIsRequirePlusButton' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo, bIsSimultaneously) == 0x000019, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo::bIsSimultaneously' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo, SwitchIndex) == 0x000020, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo::SwitchIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo, ButtonIndex) == 0x000030, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetButtonInfo::ButtonIndex' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomSticker_OperationGuide.WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C.SetGuideColor
// 0x0040 (0x0040 - 0x0000)
struct WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor final
{
public:
	class UWBP_MachineCustom_Sub_CustomSticker_OperationGuideBtn_C* Guide;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x002C(0x0014)()
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor) == 0x000040, "Wrong size on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor, Guide) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor::Guide' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor, Color) == 0x000008, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor::Color' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor, K2Node_MakeStruct_SlateColor_1) == 0x00002C, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetGuideColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomSticker_OperationGuide.WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C.SetProhibitControll
// 0x0024 (0x0024 - 0x0000)
struct WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetProhibitControll final
{
public:
	bool                                          IsFulldesign;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ActiveColor;                                       // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DeActiveColor;                                     // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetProhibitControll) == 0x000004, "Wrong alignment on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetProhibitControll");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetProhibitControll) == 0x000024, "Wrong size on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetProhibitControll");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetProhibitControll, IsFulldesign) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetProhibitControll::IsFulldesign' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetProhibitControll, ActiveColor) == 0x000004, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetProhibitControll::ActiveColor' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetProhibitControll, DeActiveColor) == 0x000014, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetProhibitControll::DeActiveColor' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomSticker_OperationGuide.WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C.SetupGuidelineButton
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetupGuidelineButton final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_1;                          // 0x0020(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array_2;                          // 0x0040(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array_3;                          // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array_4;                          // 0x0078(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array_5;                          // 0x0090(0x0010)(ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array_6;                          // 0x00A8(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array_7;                          // 0x00C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array_8;                          // 0x00E0(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_12;            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_13;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array_9;                          // 0x0100(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_10;                         // 0x0110(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_11;                         // 0x0120(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_12;                         // 0x0130(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_13;                         // 0x0140(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_14;                         // 0x0150(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_15;                         // 0x0160(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_16;                         // 0x0170(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_17;                         // 0x0180(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_18;                         // 0x0190(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_19;                         // 0x01A0(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetupGuidelineButton) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetupGuidelineButton");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetupGuidelineButton) == 0x0001B0, "Wrong size on WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetupGuidelineButton");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetupGuidelineButton, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomSticker_OperationGuide_C_SetupGuidelineButton::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
