#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Rival_RaceStart

#include "Basic.hpp"

#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_Rival_RaceStart.WBP_Race_HUD_Sub_Rival_RaceStart_C
// 0x0030 (0x0318 - 0x02E8)
class UWBP_Race_HUD_Sub_Rival_RaceStart_C final : public URaceUISubPlayerName
{
public:
	class UImage*                                 CharaHead_Rival;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RivalIcon;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RivalIcon_HighLevel;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Rank;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_RivalName;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_RivalIcon;                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetName(const class FText& CharacterName);
	void SetRank(int32 Rank);
	void SetRival(bool IsPower);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_Rival_RaceStart_C">();
	}
	static class UWBP_Race_HUD_Sub_Rival_RaceStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_Rival_RaceStart_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_Rival_RaceStart_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_Rival_RaceStart_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_Rival_RaceStart_C) == 0x000318, "Wrong size on UWBP_Race_HUD_Sub_Rival_RaceStart_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rival_RaceStart_C, CharaHead_Rival) == 0x0002E8, "Member 'UWBP_Race_HUD_Sub_Rival_RaceStart_C::CharaHead_Rival' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rival_RaceStart_C, RivalIcon) == 0x0002F0, "Member 'UWBP_Race_HUD_Sub_Rival_RaceStart_C::RivalIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rival_RaceStart_C, RivalIcon_HighLevel) == 0x0002F8, "Member 'UWBP_Race_HUD_Sub_Rival_RaceStart_C::RivalIcon_HighLevel' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rival_RaceStart_C, TXT_Rank) == 0x000300, "Member 'UWBP_Race_HUD_Sub_Rival_RaceStart_C::TXT_Rank' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rival_RaceStart_C, TXT_RivalName) == 0x000308, "Member 'UWBP_Race_HUD_Sub_Rival_RaceStart_C::TXT_RivalName' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rival_RaceStart_C, WidgetSwitcher_RivalIcon) == 0x000310, "Member 'UWBP_Race_HUD_Sub_Rival_RaceStart_C::WidgetSwitcher_RivalIcon' has a wrong offset!");

}

