#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_NumberInput_Window

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Friend_NumberInput_Window.WBP_Friend_NumberInput_Window_C
// 0x00C0 (0x04D8 - 0x0418)
class UWBP_Friend_NumberInput_Window_C final : public UFriendListNumberInputWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Popup_Out;                                         // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_Loop;                                        // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_In;                                          // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Cursor_Texture;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    DSP_TXT_Info_01;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    DSP_TXT_Info_02;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          DSP_WBP_Popup_Sub_Btn_Standard_01;                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          DSP_WBP_Popup_Sub_Btn_Standard_02;                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton;                                // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PlayerPlate;                               // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate_Base;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBase;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bTextBoxFocus;                                     // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DiffText;                                          // 0x04A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bPressedTextBox;                                   // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InputNumber;                                       // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bOpenSoftwareKeyboard;                             // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastFocusedButtonIndex;                            // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Friend_NumberInput_Window_EditableTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__WBP_Friend_NumberInput_Window_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void ClearButtonNavigation();
	void ClearTextBoxNavigation();
	void Construct();
	void ExecuteUbergraph_WBP_Friend_NumberInput_Window(int32 EntryPoint);
	class UWidget* FocusToTextBoxEvent(EUINavigation Navigation_0);
	void InitializeButtons();
	void OnAnimationInFinished();
	void OnEnterKeyFromGamePad();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInitialized();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnMouseHoverOnButtons(class UUnionUIButtonBase* Button);
	void OnMouseHoverOnTextBox();
	void OnOutAnimFinished_Impl();
	void OnPanelDecision_Impl(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void OnSelectButtonDecision(int32 InButtonIndex);
	void PlayAnimationIn();
	void Set_Button_Navigation();
	void SetButtonFocusSound(bool bInEnable);
	void SetButtonFocusType(EButtonFocusType InButtonFocusType);
	void SetButtonText(const TArray<class FText>& InButtonText);
	void SetCursorVisible(bool bInVisible);
	void SetFocusToTextBox();
	void SetMessageText(const class FText& InMessageText);
	void SetTextBoxNavigation();
	void SetTitleText(const class FText& InTitleText);
	void Setup(const class FText& InTitleText, const class FText& InMessageText, const TArray<class FText>& InButtonText);
	void SetupButtonsPanelAndButton();
	void SoftwareKeyboardInputComplete_Impl(const class FString& InputNumber_0);
	class UWidget* TextBoxBtn01NavigationEvent(EUINavigation Navigation_0);
	class UWidget* TextBoxBtn02NavigationEvent(EUINavigation Navigation_0);
	void UpdateCursorVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Friend_NumberInput_Window_C">();
	}
	static class UWBP_Friend_NumberInput_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Friend_NumberInput_Window_C>();
	}
};
static_assert(alignof(UWBP_Friend_NumberInput_Window_C) == 0x000008, "Wrong alignment on UWBP_Friend_NumberInput_Window_C");
static_assert(sizeof(UWBP_Friend_NumberInput_Window_C) == 0x0004D8, "Wrong size on UWBP_Friend_NumberInput_Window_C");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, UberGraphFrame) == 0x000418, "Member 'UWBP_Friend_NumberInput_Window_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, Popup_Out) == 0x000420, "Member 'UWBP_Friend_NumberInput_Window_C::Popup_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, Popup_Loop) == 0x000428, "Member 'UWBP_Friend_NumberInput_Window_C::Popup_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, Popup_In) == 0x000430, "Member 'UWBP_Friend_NumberInput_Window_C::Popup_In' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, CanvasPanel_0) == 0x000438, "Member 'UWBP_Friend_NumberInput_Window_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, DSP_Cursor_Texture) == 0x000440, "Member 'UWBP_Friend_NumberInput_Window_C::DSP_Cursor_Texture' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, DSP_TXT_Info_01) == 0x000448, "Member 'UWBP_Friend_NumberInput_Window_C::DSP_TXT_Info_01' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, DSP_TXT_Info_02) == 0x000450, "Member 'UWBP_Friend_NumberInput_Window_C::DSP_TXT_Info_02' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, DSP_WBP_Popup_Sub_Btn_Standard_01) == 0x000458, "Member 'UWBP_Friend_NumberInput_Window_C::DSP_WBP_Popup_Sub_Btn_Standard_01' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, DSP_WBP_Popup_Sub_Btn_Standard_02) == 0x000460, "Member 'UWBP_Friend_NumberInput_Window_C::DSP_WBP_Popup_Sub_Btn_Standard_02' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, EditableTextBox) == 0x000468, "Member 'UWBP_Friend_NumberInput_Window_C::EditableTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, MouseInteraction) == 0x000470, "Member 'UWBP_Friend_NumberInput_Window_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, OutOfContentButton) == 0x000478, "Member 'UWBP_Friend_NumberInput_Window_C::OutOfContentButton' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, Overlay_PlayerPlate) == 0x000480, "Member 'UWBP_Friend_NumberInput_Window_C::Overlay_PlayerPlate' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, Plate_Base) == 0x000488, "Member 'UWBP_Friend_NumberInput_Window_C::Plate_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, SafeZone_0) == 0x000490, "Member 'UWBP_Friend_NumberInput_Window_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, WindowBase) == 0x000498, "Member 'UWBP_Friend_NumberInput_Window_C::WindowBase' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, bTextBoxFocus) == 0x0004A0, "Member 'UWBP_Friend_NumberInput_Window_C::bTextBoxFocus' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, DiffText) == 0x0004A8, "Member 'UWBP_Friend_NumberInput_Window_C::DiffText' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, bPressedTextBox) == 0x0004B8, "Member 'UWBP_Friend_NumberInput_Window_C::bPressedTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, InputNumber) == 0x0004C0, "Member 'UWBP_Friend_NumberInput_Window_C::InputNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, bOpenSoftwareKeyboard) == 0x0004D0, "Member 'UWBP_Friend_NumberInput_Window_C::bOpenSoftwareKeyboard' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_NumberInput_Window_C, LastFocusedButtonIndex) == 0x0004D4, "Member 'UWBP_Friend_NumberInput_Window_C::LastFocusedButtonIndex' has a wrong offset!");

}

