#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_GadgetCountFullWindow

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_GadgetCountFullWindow.WBP_CMN_GadgetCountFullWindow_C.ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow
// 0x0080 (0x0080 - 0x0000)
struct WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDonpaTicketMax_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetAnimationOut_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetAnimationIn_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InStartNumber;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InEndNumber;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   K2Node_CustomEvent_InIconType;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_InIconTexture;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInCountEndOut;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_InMaxEndTime;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCountWaitByMaxEndTime_InMaxEndTime_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow) == 0x000008, "Wrong alignment on WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow");
static_assert(sizeof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow) == 0x000080, "Wrong size on WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, EntryPoint) == 0x000000, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, CallFunc_GetDonpaTicketMax_ReturnValue) == 0x000004, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::CallFunc_GetDonpaTicketMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, CallFunc_GetAnimationOut_ReturnValue) == 0x000008, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::CallFunc_GetAnimationOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, CallFunc_GetAnimationIn_ReturnValue) == 0x000010, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::CallFunc_GetAnimationIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, K2Node_CustomEvent_InStartNumber) == 0x000018, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::K2Node_CustomEvent_InStartNumber' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, K2Node_CustomEvent_InEndNumber) == 0x00001C, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::K2Node_CustomEvent_InEndNumber' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, K2Node_CustomEvent_InIconType) == 0x000020, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::K2Node_CustomEvent_InIconType' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, K2Node_CustomEvent_InIconTexture) == 0x000028, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::K2Node_CustomEvent_InIconTexture' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, K2Node_CustomEvent_bInCountEndOut) == 0x000030, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::K2Node_CustomEvent_bInCountEndOut' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, K2Node_CustomEvent_InMaxEndTime) == 0x000038, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::K2Node_CustomEvent_InMaxEndTime' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, CallFunc_Clamp_ReturnValue) == 0x000044, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow, CallFunc_SetCountWaitByMaxEndTime_InMaxEndTime_ImplicitCast) == 0x000078, "Member 'WBP_CMN_GadgetCountFullWindow_C_ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow::CallFunc_SetCountWaitByMaxEndTime_InMaxEndTime_ImplicitCast' has a wrong offset!");

// Function WBP_CMN_GadgetCountFullWindow.WBP_CMN_GadgetCountFullWindow_C.GetGadgetCountWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_GadgetCountFullWindow_C_GetGadgetCountWidget final
{
public:
	class UWBP_CMN_GadgetCount_C*                 OutGadgetCountWidget;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_GadgetCountFullWindow_C_GetGadgetCountWidget) == 0x000008, "Wrong alignment on WBP_CMN_GadgetCountFullWindow_C_GetGadgetCountWidget");
static_assert(sizeof(WBP_CMN_GadgetCountFullWindow_C_GetGadgetCountWidget) == 0x000008, "Wrong size on WBP_CMN_GadgetCountFullWindow_C_GetGadgetCountWidget");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_GetGadgetCountWidget, OutGadgetCountWidget) == 0x000000, "Member 'WBP_CMN_GadgetCountFullWindow_C_GetGadgetCountWidget::OutGadgetCountWidget' has a wrong offset!");

// Function WBP_CMN_GadgetCountFullWindow.WBP_CMN_GadgetCountFullWindow_C.SetupItemCountWidget
// 0x0028 (0x0028 - 0x0000)
struct WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget final
{
public:
	int32                                         InStartNumber;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InEndNumber;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   InIconType;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             InIconTexture;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bInCountEndOut;                                    // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InMaxEndTime;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget) == 0x000008, "Wrong alignment on WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget");
static_assert(sizeof(WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget) == 0x000028, "Wrong size on WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget, InStartNumber) == 0x000000, "Member 'WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget::InStartNumber' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget, InEndNumber) == 0x000004, "Member 'WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget::InEndNumber' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget, InIconType) == 0x000008, "Member 'WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget::InIconType' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget, InIconTexture) == 0x000010, "Member 'WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget::InIconTexture' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget, bInCountEndOut) == 0x000018, "Member 'WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget::bInCountEndOut' has a wrong offset!");
static_assert(offsetof(WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget, InMaxEndTime) == 0x000020, "Member 'WBP_CMN_GadgetCountFullWindow_C_SetupItemCountWidget::InMaxEndTime' has a wrong offset!");

}

