#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_RaceMenu_Sub_Btn

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_RaceMenu_Sub_Btn.WBP_CMN_RaceMenu_Sub_Btn_C.ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn
// 0x01F8 (0x01F8 - 0x0000)
struct WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   Temp_byte_Variable;                                // 0x0058(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   Temp_byte_Variable_1;                              // 0x0068(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIconIdAsInteger_ReturnValue;           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0088(0x0010)(ConstParm)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0098(0x0008)(ConstParm, NoDestructor)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x00A0(0x0004)()
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00A4(0x0008)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x00C4(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x00C8(0x0004)()
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue;           // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   Temp_byte_Variable_2;                              // 0x00E2(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetChangeableButtonState_ReturnValue;     // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonRaceMenuContentId                      CallFunc_GetContentId_ReturnValue;                 // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E7[0x1];                                       // 0x00E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDonpaTicket_ReturnValue;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetNeedsDonpaTicketForRaceRetry_ReturnValue; // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00F8(0x0010)()
	TArray<ERewardType>                           CallFunc_GetInGameGettingRewards_ReturnValue;      // 0x0108(0x0010)(ReferenceParm)
	TArray<ERewardType>                           CallFunc_GetInGameGettingRewards_ReturnValue_1;    // 0x0118(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGadgetPlateRankUp_ReturnValue;         // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDonpaTicket_ReturnValue_1;             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetNeedsDonpaTicketForRaceRetry_ReturnValue_1; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   Temp_byte_Variable_3;                              // 0x0139(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_3;                  // 0x013C(0x0004)()
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue_1;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   Temp_byte_Variable_4;                              // 0x0141(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_4;             // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   Temp_byte_Variable_5;                              // 0x0150(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_2;      // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_5;             // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   Temp_byte_Variable_6;                              // 0x0163(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   Temp_byte_Variable_7;                              // 0x0164(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_6;             // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_7;             // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F[0x1];                                      // 0x016F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_3;      // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetChangeableButtonState_ReturnValue_1;   // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193[0x5];                                      // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x1];                                      // 0x01A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_8;              // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn) == 0x000008, "Wrong alignment on WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn");
static_assert(sizeof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn) == 0x0001F8, "Wrong size on WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, EntryPoint) == 0x000000, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_IsValid_ReturnValue_2) == 0x000029, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00002A, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00003C, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00003D, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, Temp_byte_Variable) == 0x000058, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, Temp_byte_Variable_1) == 0x000068, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_PlayAnimation_ReturnValue_2) == 0x000070, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_PlayAnimation_ReturnValue_3) == 0x000078, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetIconIdAsInteger_ReturnValue) == 0x000080, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetIconIdAsInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetText_ReturnValue) == 0x000088, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_Event_InFocusEvent_1) == 0x000098, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_SoundPlay_ReturnValue) == 0x0000A0, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_Event_InFocusEvent) == 0x0000A4, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x0000AC, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B0, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_DynamicCast_AsApp_Player_Controller) == 0x0000B8, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_SwitchEnum_CmpSuccess) == 0x0000C1, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_SoundPlay_ReturnValue_1) == 0x0000C4, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_SoundPlay_ReturnValue_2) == 0x0000C8, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000D0, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x0000D8, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_UnregisterMainMenu_ReturnValue) == 0x0000E1, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_UnregisterMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, Temp_byte_Variable_2) == 0x0000E2, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_IsValid_ReturnValue_3) == 0x0000E3, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetChangeableButtonState_ReturnValue) == 0x0000E4, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetChangeableButtonState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetContentId_ReturnValue) == 0x0000E5, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetContentId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000E6, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetDonpaTicket_ReturnValue) == 0x0000E8, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetDonpaTicket_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetNeedsDonpaTicketForRaceRetry_ReturnValue) == 0x0000EC, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetNeedsDonpaTicketForRaceRetry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000F0, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_Event_bVisible) == 0x0000F4, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Less_IntInt_ReturnValue) == 0x0000F5, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Conv_IntToText_ReturnValue) == 0x0000F8, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetInGameGettingRewards_ReturnValue) == 0x000108, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetInGameGettingRewards_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetInGameGettingRewards_ReturnValue_1) == 0x000118, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetInGameGettingRewards_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Array_Contains_ReturnValue) == 0x000128, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Array_Contains_ReturnValue_1) == 0x000129, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Array_Contains_ReturnValue_2) == 0x00012A, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetGadgetPlateRankUp_ReturnValue) == 0x00012B, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetGadgetPlateRankUp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetDonpaTicket_ReturnValue_1) == 0x00012C, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetDonpaTicket_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetNeedsDonpaTicketForRaceRetry_ReturnValue_1) == 0x000130, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetNeedsDonpaTicketForRaceRetry_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000134, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Greater_IntInt_ReturnValue) == 0x000138, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, Temp_byte_Variable_3) == 0x000139, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Array_Contains_ReturnValue_3) == 0x00013A, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Array_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_SoundPlay_ReturnValue_3) == 0x00013C, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_SoundPlay_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_UnregisterMainMenu_ReturnValue_1) == 0x000140, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_UnregisterMainMenu_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, Temp_byte_Variable_4) == 0x000141, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Array_Contains_ReturnValue_4) == 0x000142, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Array_Contains_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000148, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, Temp_byte_Variable_5) == 0x000150, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_DynamicCast_AsApp_Player_Controller_2) == 0x000158, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_DynamicCast_AsApp_Player_Controller_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_DynamicCast_bSuccess_2) == 0x000160, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Array_Contains_ReturnValue_5) == 0x000161, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Array_Contains_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_Event_IsDesignTime) == 0x000162, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, Temp_byte_Variable_6) == 0x000163, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, Temp_byte_Variable_7) == 0x000164, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Array_Contains_ReturnValue_6) == 0x000165, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Array_Contains_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_Array_Contains_ReturnValue_7) == 0x000166, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_Array_Contains_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_BooleanOR_ReturnValue) == 0x000167, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_BooleanOR_ReturnValue_1) == 0x000168, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_BooleanOR_ReturnValue_2) == 0x000169, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_BooleanOR_ReturnValue_3) == 0x00016A, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_BooleanOR_ReturnValue_4) == 0x00016B, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_BooleanOR_ReturnValue_5) == 0x00016C, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_SwitchEnum_CmpSuccess_2) == 0x00016D, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_BooleanOR_ReturnValue_6) == 0x00016E, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetOwningPlayer_ReturnValue_3) == 0x000170, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetOwningPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_DynamicCast_AsApp_Player_Controller_3) == 0x000178, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_DynamicCast_AsApp_Player_Controller_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_DynamicCast_bSuccess_3) == 0x000180, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_PlayAnimation_ReturnValue_4) == 0x000188, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, Temp_byte_Variable_8) == 0x000190, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_GetChangeableButtonState_ReturnValue_1) == 0x000191, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_GetChangeableButtonState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, Temp_byte_Variable_9) == 0x000192, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_PlayAnimation_ReturnValue_5) == 0x000198, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, Temp_bool_Variable) == 0x0001A0, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_Select_Default) == 0x0001A1, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_SwitchEnum_CmpSuccess_3) == 0x0001A2, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001A4, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0001B8, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0001C0, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_IsValid_ReturnValue_4) == 0x0001C8, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_IsValid_ReturnValue_5) == 0x0001C9, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_PlayAnimation_ReturnValue_6) == 0x0001D0, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_PlayAnimation_ReturnValue_7) == 0x0001D8, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_IsValid_ReturnValue_6) == 0x0001E0, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, CallFunc_PlayAnimation_ReturnValue_8) == 0x0001E8, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::CallFunc_PlayAnimation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn, K2Node_SwitchEnum_CmpSuccess_4) == 0x0001F0, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");

// Function WBP_CMN_RaceMenu_Sub_Btn.WBP_CMN_RaceMenu_Sub_Btn_C.OnFocusBegin
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusBegin final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusBegin) == 0x000004, "Wrong alignment on WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusBegin");
static_assert(sizeof(WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusBegin) == 0x000008, "Wrong size on WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusBegin");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusBegin, InFocusEvent) == 0x000000, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusBegin::InFocusEvent' has a wrong offset!");

// Function WBP_CMN_RaceMenu_Sub_Btn.WBP_CMN_RaceMenu_Sub_Btn_C.OnFocusEnd
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusEnd final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusEnd) == 0x000004, "Wrong alignment on WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusEnd");
static_assert(sizeof(WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusEnd) == 0x000008, "Wrong size on WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusEnd");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusEnd, InFocusEvent) == 0x000000, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_OnFocusEnd::InFocusEvent' has a wrong offset!");

// Function WBP_CMN_RaceMenu_Sub_Btn.WBP_CMN_RaceMenu_Sub_Btn_C.PlayOutAnim
// 0x0020 (0x0020 - 0x0000)
struct WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim final
{
public:
	EUnionUIButtonAnimState                       Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim) == 0x000008, "Wrong alignment on WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim");
static_assert(sizeof(WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim) == 0x000020, "Wrong size on WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim, Temp_byte_Variable) == 0x000000, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim, K2Node_Select_Default) == 0x000018, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_PlayOutAnim::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CMN_RaceMenu_Sub_Btn.WBP_CMN_RaceMenu_Sub_Btn_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CMN_RaceMenu_Sub_Btn_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_RaceMenu_Sub_Btn_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CMN_RaceMenu_Sub_Btn_C_PreConstruct");
static_assert(sizeof(WBP_CMN_RaceMenu_Sub_Btn_C_PreConstruct) == 0x000001, "Wrong size on WBP_CMN_RaceMenu_Sub_Btn_C_PreConstruct");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CMN_RaceMenu_Sub_Btn.WBP_CMN_RaceMenu_Sub_Btn_C.SetAccept
// 0x0028 (0x0028 - 0x0000)
struct WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept final
{
public:
	bool                                          Is;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CMN_RaceMenu_Sub_Btn_C*            CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept) == 0x000008, "Wrong alignment on WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept");
static_assert(sizeof(WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept) == 0x000028, "Wrong size on WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept, Is) == 0x000000, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept::Is' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_SetAccept::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CMN_RaceMenu_Sub_Btn.WBP_CMN_RaceMenu_Sub_Btn_C.SetAcceptKeyIgnored
// 0x0001 (0x0001 - 0x0000)
struct WBP_CMN_RaceMenu_Sub_Btn_C_SetAcceptKeyIgnored final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_RaceMenu_Sub_Btn_C_SetAcceptKeyIgnored) == 0x000001, "Wrong alignment on WBP_CMN_RaceMenu_Sub_Btn_C_SetAcceptKeyIgnored");
static_assert(sizeof(WBP_CMN_RaceMenu_Sub_Btn_C_SetAcceptKeyIgnored) == 0x000001, "Wrong size on WBP_CMN_RaceMenu_Sub_Btn_C_SetAcceptKeyIgnored");
static_assert(offsetof(WBP_CMN_RaceMenu_Sub_Btn_C_SetAcceptKeyIgnored, Value) == 0x000000, "Member 'WBP_CMN_RaceMenu_Sub_Btn_C_SetAcceptKeyIgnored::Value' has a wrong offset!");

// Function WBP_CMN_RaceMenu_Sub_Btn.WBP_CMN_RaceMenu_Sub_Btn_C.SetBtnColorIndex
// 0x0020 (0x0020 - 0x0000)
struct WBP_CMN_RaceMenu_Sub_Btn_C_SetBtnColorIndex final
{
public:
