#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RaceBefore_MessageInfo

#include "Basic.hpp"

#include "UNION_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RaceBefore_MessageInfo.WBP_RaceBefore_MessageInfo_C
// 0x0070 (0x0390 - 0x0320)
class UWBP_RaceBefore_MessageInfo_C final : public UBeforeRaceMessageInfoWidget
{
public:
	class UImage*                                 Base_01;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_02;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Black;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Center;                                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               GroupRuleRoot;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_01;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_02;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Side_01;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Side_02;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Title;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsTickLock;                                       // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableFixedGadget;                                // 0x0379(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CurrentAnimation;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelfRemove;                                     // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TestIndex;                                         // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RaceBefore_MessageInfo_C">();
	}
	static class UWBP_RaceBefore_MessageInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RaceBefore_MessageInfo_C>();
	}
};
static_assert(alignof(UWBP_RaceBefore_MessageInfo_C) == 0x000008, "Wrong alignment on UWBP_RaceBefore_MessageInfo_C");
static_assert(sizeof(UWBP_RaceBefore_MessageInfo_C) == 0x000390, "Wrong size on UWBP_RaceBefore_MessageInfo_C");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, Base_01) == 0x000320, "Member 'UWBP_RaceBefore_MessageInfo_C::Base_01' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, Base_02) == 0x000328, "Member 'UWBP_RaceBefore_MessageInfo_C::Base_02' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, BG_Black) == 0x000330, "Member 'UWBP_RaceBefore_MessageInfo_C::BG_Black' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, Center) == 0x000338, "Member 'UWBP_RaceBefore_MessageInfo_C::Center' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, GroupRuleRoot) == 0x000340, "Member 'UWBP_RaceBefore_MessageInfo_C::GroupRuleRoot' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, Line_01) == 0x000348, "Member 'UWBP_RaceBefore_MessageInfo_C::Line_01' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, Line_02) == 0x000350, "Member 'UWBP_RaceBefore_MessageInfo_C::Line_02' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, RaceFlag) == 0x000358, "Member 'UWBP_RaceBefore_MessageInfo_C::RaceFlag' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, Side_01) == 0x000360, "Member 'UWBP_RaceBefore_MessageInfo_C::Side_01' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, Side_02) == 0x000368, "Member 'UWBP_RaceBefore_MessageInfo_C::Side_02' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, TXT_Title) == 0x000370, "Member 'UWBP_RaceBefore_MessageInfo_C::TXT_Title' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, bIsTickLock) == 0x000378, "Member 'UWBP_RaceBefore_MessageInfo_C::bIsTickLock' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, bEnableFixedGadget) == 0x000379, "Member 'UWBP_RaceBefore_MessageInfo_C::bEnableFixedGadget' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, CurrentAnimation) == 0x000380, "Member 'UWBP_RaceBefore_MessageInfo_C::CurrentAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, bIsSelfRemove) == 0x000388, "Member 'UWBP_RaceBefore_MessageInfo_C::bIsSelfRemove' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_MessageInfo_C, TestIndex) == 0x00038C, "Member 'UWBP_RaceBefore_MessageInfo_C::TestIndex' has a wrong offset!");

}

