#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeaderMenu_Sub_PlayerNamePlate

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_HeaderMenu_Sub_PlayerNamePlate.WBP_HeaderMenu_Sub_PlayerNamePlate_C.ExecuteUbergraph_WBP_HeaderMenu_Sub_PlayerNamePlate
// 0x0004 (0x0004 - 0x0000)
struct WBP_HeaderMenu_Sub_PlayerNamePlate_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_PlayerNamePlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_PlayerNamePlate) == 0x000004, "Wrong alignment on WBP_HeaderMenu_Sub_PlayerNamePlate_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_PlayerNamePlate");
static_assert(sizeof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_PlayerNamePlate) == 0x000004, "Wrong size on WBP_HeaderMenu_Sub_PlayerNamePlate_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_PlayerNamePlate");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_PlayerNamePlate, EntryPoint) == 0x000000, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_PlayerNamePlate::EntryPoint' has a wrong offset!");

// Function WBP_HeaderMenu_Sub_PlayerNamePlate.WBP_HeaderMenu_Sub_PlayerNamePlate_C.SetUpUserData
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData final
{
public:
	class FText                                   InUserName;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         InHonorId;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrossplayPlatform                            InPlatform;                                        // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InWinCounts;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         InRateRank;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InRankPercent;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRateRankUIData                        CallFunc_GetRateRankUIData_ReturnValue;            // 0x0034(0x000C)(NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_ByteToDouble_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_InRangeB_ImplicitCast;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_InRangeA_ImplicitCast;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData) == 0x000008, "Wrong alignment on WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData");
static_assert(sizeof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData) == 0x0000A0, "Wrong size on WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, InUserName) == 0x000000, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::InUserName' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, InHonorId) == 0x000010, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::InHonorId' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, InPlatform) == 0x000014, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::InPlatform' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, InWinCounts) == 0x000018, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::InWinCounts' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, InRateRank) == 0x00001C, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::InRateRank' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, InRankPercent) == 0x000020, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::InRankPercent' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_MakeLiteralByte_ReturnValue) == 0x000024, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_GetValidValue_ReturnValue) == 0x000025, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000028, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00002C, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_GetRateRankUIData_ReturnValue) == 0x000034, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_GetRateRankUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_Conv_ByteToDouble_ReturnValue) == 0x000048, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_Conv_ByteToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_MapRangeClamped_ReturnValue) == 0x000050, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_SelectFloat_ReturnValue) == 0x000058, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000060, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000070, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_MapRangeClamped_InRangeB_ImplicitCast) == 0x000078, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_MapRangeClamped_InRangeB_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_MapRangeClamped_InRangeA_ImplicitCast) == 0x000080, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_MapRangeClamped_InRangeA_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000088, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000090, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000098, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_SetUpUserData::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_HeaderMenu_Sub_PlayerNamePlate.WBP_HeaderMenu_Sub_PlayerNamePlate_C.UpdateUserData
// 0x0030 (0x0030 - 0x0000)
struct WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData final
{
public:
	class FText                                   InUserName;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         InHonorId;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetClampUserNameLength_ReturnValue;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TruncateTextWithEllipsis_ReturnValue;     // 0x0020(0x0010)()
};
static_assert(alignof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData) == 0x000008, "Wrong alignment on WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData");
static_assert(sizeof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData) == 0x000030, "Wrong size on WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData, InUserName) == 0x000000, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData::InUserName' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData, InHonorId) == 0x000010, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData::InHonorId' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData, CallFunc_GetClampUserNameLength_ReturnValue) == 0x000014, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData::CallFunc_GetClampUserNameLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData, CallFunc_TruncateTextWithEllipsis_ReturnValue) == 0x000020, "Member 'WBP_HeaderMenu_Sub_PlayerNamePlate_C_UpdateUserData::CallFunc_TruncateTextWithEllipsis_ReturnValue' has a wrong offset!");

}

