#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_Sub_Ranking

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TimeTrial_Sub_Ranking.WBP_TimeTrial_Sub_Ranking_C
// 0x01A0 (0x0590 - 0x03F0)
class UWBP_TimeTrial_Sub_Ranking_C final : public UTimeTrialRanking
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InLoop;                                            // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 base_1;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Window;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Window_1;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Window_02;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_UV_01;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_UV_02;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_UV_Arc;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnBase;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnBase_1;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_StageIcon;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_PlatformIcon;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_PlatformIcon_Title;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MyBestMouseButton;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Platform;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         PlatformChangeMouseButton;                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_ErrorText;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Platform;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_RankingName;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_StageName;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn;                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_Sub_SpeedClassInfo_C*          WBP_CMN_Sub_SpeedClassInfo;                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_ControllerBtn_C*    WBP_FooterMenu_Sub_ControllerBtn_L;                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_ControllerBtn_C*    WBP_FooterMenu_Sub_ControllerBtn_R;                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_System_Sub_LoadingSonic_C*         WBP_System_Sub_LoadingSonic;                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_RankingTable_C*      WBP_TimeTrial_Sub_RankingTable_10;                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_RankingTable_C*      WBP_TimeTrial_Sub_RankingTable_11;                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_RankingTable_C*      WBP_TimeTrial_Sub_RankingTable_01;                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_RankingTable_C*      WBP_TimeTrial_Sub_RankingTable_02;                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_RankingTable_C*      WBP_TimeTrial_Sub_RankingTable_03;                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_RankingTable_C*      WBP_TimeTrial_Sub_RankingTable_04;                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_RankingTable_C*      WBP_TimeTrial_Sub_RankingTable_05;                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_RankingTable_C*      WBP_TimeTrial_Sub_RankingTable_06;                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_RankingTable_C*      WBP_TimeTrial_Sub_RankingTable_07;                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_RankingTable_C*      WBP_TimeTrial_Sub_RankingTable_08;                 // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_RankingTable_C*      WBP_TimeTrial_Sub_RankingTable_09;                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_TimeTrialSequence_C*                OwnerTimeTrialSequence;                            // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EStageId                                      SelectedStageId;                                   // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         SupportedPlatform;                                 // 0x0539(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InputEnable;                                       // 0x053A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlatformFlag;                                      // 0x053B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIPopupWindowBase*                PopupWindow;                                       // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         StageIndex;                                        // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EStageId>                              StageArray;                                        // 0x0550(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRankingDataTimeTrial>          RankingTimeTrialDatas;                             // 0x0560(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              CloseEventDispatcher;                              // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              MouseClickDispatcher;                              // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Close();
	void Construct();
	void DisplayCrossplayOffMessage();
	void DisplayNetworkErrorMessage();
	void DisplayNoRankingMessage();
	void ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking(int32 EntryPoint);
	void GetInputEnable(bool* Input);
	void InitializeRanking();
	void MouseClickEvent();
	void OnDownKeyPressed();
	void OnDownKeyReleased();
	void OnEndAnimation_InAnim();
	void OnEndAnimation_OutAnim();
	void OnFaceButtonLeftPressed();
	void OnUpKeyPressed();
	void OnUpKeyReleased();
	void Open();
	void RequestRanking();
	void Set_Platform_Icon();
	void SetInputEnable(bool InEnable);
	void SetStageParam(EStageId InStageId);
	void SetupRankingParam(EStageId StageId);
	void SetupStageArray();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TimeTrial_Sub_Ranking_C">();
	}
	static class UWBP_TimeTrial_Sub_Ranking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TimeTrial_Sub_Ranking_C>();
	}
};
static_assert(alignof(UWBP_TimeTrial_Sub_Ranking_C) == 0x000008, "Wrong alignment on UWBP_TimeTrial_Sub_Ranking_C");
static_assert(sizeof(UWBP_TimeTrial_Sub_Ranking_C) == 0x000590, "Wrong size on UWBP_TimeTrial_Sub_Ranking_C");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, UberGraphFrame) == 0x0003F0, "Member 'UWBP_TimeTrial_Sub_Ranking_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, Out) == 0x0003F8, "Member 'UWBP_TimeTrial_Sub_Ranking_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, InLoop) == 0x000400, "Member 'UWBP_TimeTrial_Sub_Ranking_C::InLoop' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, base) == 0x000408, "Member 'UWBP_TimeTrial_Sub_Ranking_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, base_1) == 0x000410, "Member 'UWBP_TimeTrial_Sub_Ranking_C::base_1' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, Base_Window) == 0x000418, "Member 'UWBP_TimeTrial_Sub_Ranking_C::Base_Window' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, Base_Window_1) == 0x000420, "Member 'UWBP_TimeTrial_Sub_Ranking_C::Base_Window_1' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, Base_Window_02) == 0x000428, "Member 'UWBP_TimeTrial_Sub_Ranking_C::Base_Window_02' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, BG) == 0x000430, "Member 'UWBP_TimeTrial_Sub_Ranking_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, BG_UV_01) == 0x000438, "Member 'UWBP_TimeTrial_Sub_Ranking_C::BG_UV_01' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, BG_UV_02) == 0x000440, "Member 'UWBP_TimeTrial_Sub_Ranking_C::BG_UV_02' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, BG_UV_Arc) == 0x000448, "Member 'UWBP_TimeTrial_Sub_Ranking_C::BG_UV_Arc' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, BtnBase) == 0x000450, "Member 'UWBP_TimeTrial_Sub_Ranking_C::BtnBase' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, BtnBase_1) == 0x000458, "Member 'UWBP_TimeTrial_Sub_Ranking_C::BtnBase_1' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, DMY_StageIcon) == 0x000460, "Member 'UWBP_TimeTrial_Sub_Ranking_C::DMY_StageIcon' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, DSP_PlatformIcon) == 0x000468, "Member 'UWBP_TimeTrial_Sub_Ranking_C::DSP_PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, DSP_PlatformIcon_Title) == 0x000470, "Member 'UWBP_TimeTrial_Sub_Ranking_C::DSP_PlatformIcon_Title' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, MyBestMouseButton) == 0x000478, "Member 'UWBP_TimeTrial_Sub_Ranking_C::MyBestMouseButton' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, Overlay_Platform) == 0x000480, "Member 'UWBP_TimeTrial_Sub_Ranking_C::Overlay_Platform' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, PlatformChangeMouseButton) == 0x000488, "Member 'UWBP_TimeTrial_Sub_Ranking_C::PlatformChangeMouseButton' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, TXT_ErrorText) == 0x000490, "Member 'UWBP_TimeTrial_Sub_Ranking_C::TXT_ErrorText' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, TXT_Platform) == 0x000498, "Member 'UWBP_TimeTrial_Sub_Ranking_C::TXT_Platform' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, TXT_RankingName) == 0x0004A0, "Member 'UWBP_TimeTrial_Sub_Ranking_C::TXT_RankingName' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, TXT_StageName) == 0x0004A8, "Member 'UWBP_TimeTrial_Sub_Ranking_C::TXT_StageName' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_CMN_ControllerBtn) == 0x0004B0, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_CMN_ControllerBtn' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_CMN_Sub_SpeedClassInfo) == 0x0004B8, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_CMN_Sub_SpeedClassInfo' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_FooterMenu_Sub_ControllerBtn_L) == 0x0004C0, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_FooterMenu_Sub_ControllerBtn_L' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_FooterMenu_Sub_ControllerBtn_R) == 0x0004C8, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_FooterMenu_Sub_ControllerBtn_R' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_System_Sub_LoadingSonic) == 0x0004D0, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_System_Sub_LoadingSonic' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_TimeTrial_Sub_RankingTable_10) == 0x0004D8, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_TimeTrial_Sub_RankingTable_10' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_TimeTrial_Sub_RankingTable_11) == 0x0004E0, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_TimeTrial_Sub_RankingTable_11' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_TimeTrial_Sub_RankingTable_01) == 0x0004E8, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_TimeTrial_Sub_RankingTable_01' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_TimeTrial_Sub_RankingTable_02) == 0x0004F0, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_TimeTrial_Sub_RankingTable_02' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_TimeTrial_Sub_RankingTable_03) == 0x0004F8, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_TimeTrial_Sub_RankingTable_03' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_TimeTrial_Sub_RankingTable_04) == 0x000500, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_TimeTrial_Sub_RankingTable_04' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_TimeTrial_Sub_RankingTable_05) == 0x000508, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_TimeTrial_Sub_RankingTable_05' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_TimeTrial_Sub_RankingTable_06) == 0x000510, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_TimeTrial_Sub_RankingTable_06' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_TimeTrial_Sub_RankingTable_07) == 0x000518, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_TimeTrial_Sub_RankingTable_07' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_TimeTrial_Sub_RankingTable_08) == 0x000520, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_TimeTrial_Sub_RankingTable_08' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, WBP_TimeTrial_Sub_RankingTable_09) == 0x000528, "Member 'UWBP_TimeTrial_Sub_Ranking_C::WBP_TimeTrial_Sub_RankingTable_09' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, OwnerTimeTrialSequence) == 0x000530, "Member 'UWBP_TimeTrial_Sub_Ranking_C::OwnerTimeTrialSequence' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, SelectedStageId) == 0x000538, "Member 'UWBP_TimeTrial_Sub_Ranking_C::SelectedStageId' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, SupportedPlatform) == 0x000539, "Member 'UWBP_TimeTrial_Sub_Ranking_C::SupportedPlatform' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, InputEnable) == 0x00053A, "Member 'UWBP_TimeTrial_Sub_Ranking_C::InputEnable' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, PlatformFlag) == 0x00053B, "Member 'UWBP_TimeTrial_Sub_Ranking_C::PlatformFlag' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, PopupWindow) == 0x000540, "Member 'UWBP_TimeTrial_Sub_Ranking_C::PopupWindow' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, StageIndex) == 0x000548, "Member 'UWBP_TimeTrial_Sub_Ranking_C::StageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, StageArray) == 0x000550, "Member 'UWBP_TimeTrial_Sub_Ranking_C::StageArray' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, RankingTimeTrialDatas) == 0x000560, "Member 'UWBP_TimeTrial_Sub_Ranking_C::RankingTimeTrialDatas' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, CloseEventDispatcher) == 0x000570, "Member 'UWBP_TimeTrial_Sub_Ranking_C::CloseEventDispatcher' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Ranking_C, MouseClickDispatcher) == 0x000580, "Member 'UWBP_TimeTrial_Sub_Ranking_C::MouseClickDispatcher' has a wrong offset!");

}

