#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ResultRate_Sub_RankIcon

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ResultRate_Sub_RankIcon.WBP_ResultRate_Sub_RankIcon_C
// 0x0150 (0x0430 - 0x02E0)
class UWBP_ResultRate_Sub_RankIcon_C final : public URankIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RankIcon_RankDown;                                 // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RankIcon_RankUp;                                   // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RankIcon_Loop;                                     // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Circle_01;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Circle_02;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LEGEND_Grade01;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LEGEND_Grade02;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LEGEND_Grade03;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LEGEND_Grade04;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LEGEND_Grade05;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_LEGEND;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RankIcon_A;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RankIcon_B;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RankIcon_C;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RankIcon_D;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RankIcon_E;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RankIcon_F;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RankIcon_LEGEND;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RankIcon_None;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_01;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_02;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_03;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_04;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_05;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_LEGEND;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_LEGEND_Base_01;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_LEGEND_Base_02;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_A;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_A_Base;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_B;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_B_Base;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_C;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_C_Base;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_D;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_D_Base;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_E;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_E_Base;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_F;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_F_Base;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_LEGEND;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Rate_RankIcon;                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ResultRate_Sub_RankIcon(int32 EntryPoint);
	void Set_Rank_SText_Impl(const class FText& Num);
	void SetLegendNumHide();
	void SetRankImpl(ERateRank RateRank);
	void SetRateRank(ERateRank InRateRank);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ResultRate_Sub_RankIcon_C">();
	}
	static class UWBP_ResultRate_Sub_RankIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ResultRate_Sub_RankIcon_C>();
	}
};
static_assert(alignof(UWBP_ResultRate_Sub_RankIcon_C) == 0x000008, "Wrong alignment on UWBP_ResultRate_Sub_RankIcon_C");
static_assert(sizeof(UWBP_ResultRate_Sub_RankIcon_C) == 0x000430, "Wrong size on UWBP_ResultRate_Sub_RankIcon_C");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ResultRate_Sub_RankIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, RankIcon_RankDown) == 0x0002E8, "Member 'UWBP_ResultRate_Sub_RankIcon_C::RankIcon_RankDown' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, RankIcon_RankUp) == 0x0002F0, "Member 'UWBP_ResultRate_Sub_RankIcon_C::RankIcon_RankUp' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, RankIcon_Loop) == 0x0002F8, "Member 'UWBP_ResultRate_Sub_RankIcon_C::RankIcon_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, Circle_01) == 0x000300, "Member 'UWBP_ResultRate_Sub_RankIcon_C::Circle_01' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, Circle_02) == 0x000308, "Member 'UWBP_ResultRate_Sub_RankIcon_C::Circle_02' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, LEGEND_Grade01) == 0x000310, "Member 'UWBP_ResultRate_Sub_RankIcon_C::LEGEND_Grade01' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, LEGEND_Grade02) == 0x000318, "Member 'UWBP_ResultRate_Sub_RankIcon_C::LEGEND_Grade02' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, LEGEND_Grade03) == 0x000320, "Member 'UWBP_ResultRate_Sub_RankIcon_C::LEGEND_Grade03' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, LEGEND_Grade04) == 0x000328, "Member 'UWBP_ResultRate_Sub_RankIcon_C::LEGEND_Grade04' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, LEGEND_Grade05) == 0x000330, "Member 'UWBP_ResultRate_Sub_RankIcon_C::LEGEND_Grade05' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, Overlay_LEGEND) == 0x000338, "Member 'UWBP_ResultRate_Sub_RankIcon_C::Overlay_LEGEND' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, RankIcon_A) == 0x000340, "Member 'UWBP_ResultRate_Sub_RankIcon_C::RankIcon_A' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, RankIcon_B) == 0x000348, "Member 'UWBP_ResultRate_Sub_RankIcon_C::RankIcon_B' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, RankIcon_C) == 0x000350, "Member 'UWBP_ResultRate_Sub_RankIcon_C::RankIcon_C' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, RankIcon_D) == 0x000358, "Member 'UWBP_ResultRate_Sub_RankIcon_C::RankIcon_D' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, RankIcon_E) == 0x000360, "Member 'UWBP_ResultRate_Sub_RankIcon_C::RankIcon_E' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, RankIcon_F) == 0x000368, "Member 'UWBP_ResultRate_Sub_RankIcon_C::RankIcon_F' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, RankIcon_LEGEND) == 0x000370, "Member 'UWBP_ResultRate_Sub_RankIcon_C::RankIcon_LEGEND' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, RankIcon_None) == 0x000378, "Member 'UWBP_ResultRate_Sub_RankIcon_C::RankIcon_None' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, Star_01) == 0x000380, "Member 'UWBP_ResultRate_Sub_RankIcon_C::Star_01' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, Star_02) == 0x000388, "Member 'UWBP_ResultRate_Sub_RankIcon_C::Star_02' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, Star_03) == 0x000390, "Member 'UWBP_ResultRate_Sub_RankIcon_C::Star_03' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, Star_04) == 0x000398, "Member 'UWBP_ResultRate_Sub_RankIcon_C::Star_04' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, Star_05) == 0x0003A0, "Member 'UWBP_ResultRate_Sub_RankIcon_C::Star_05' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_LEGEND) == 0x0003A8, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_LEGEND' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_LEGEND_Base_01) == 0x0003B0, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_LEGEND_Base_01' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_LEGEND_Base_02) == 0x0003B8, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_LEGEND_Base_02' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_A) == 0x0003C0, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_A' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_A_Base) == 0x0003C8, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_A_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_B) == 0x0003D0, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_B' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_B_Base) == 0x0003D8, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_B_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_C) == 0x0003E0, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_C' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_C_Base) == 0x0003E8, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_C_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_D) == 0x0003F0, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_D' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_D_Base) == 0x0003F8, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_D_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_E) == 0x000400, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_E' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_E_Base) == 0x000408, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_E_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_F) == 0x000410, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_F' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_F_Base) == 0x000418, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_F_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, TXT_Num_LEGEND) == 0x000420, "Member 'UWBP_ResultRate_Sub_RankIcon_C::TXT_Num_LEGEND' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankIcon_C, WidgetSwitcher_Rate_RankIcon) == 0x000428, "Member 'UWBP_ResultRate_Sub_RankIcon_C::WidgetSwitcher_Rate_RankIcon' has a wrong offset!");

}

