#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_FinalCheck_2

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_FinalCheck_2.WBP_CMN_FinalCheck_2_C.ExecuteUbergraph_WBP_CMN_FinalCheck_2
// 0x0140 (0x0140 - 0x0000)
struct WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBaseCore* Button)> K2Node_CreateDelegate_OutputDelegate;      // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x002C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTextBlock*                             CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerController_C*             K2Node_DynamicCast_AsBP_Menu_Player_Controller;    // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerController_C*             K2Node_DynamicCast_AsBP_Menu_Player_Controller_1;  // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue_1;    // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBaseCore*                 K2Node_CustomEvent_Button;                         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_DynamicCast_AsUnion_UIButton_Base;          // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2) == 0x000008, "Wrong alignment on WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2");
static_assert(sizeof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2) == 0x000140, "Wrong size on WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, EntryPoint) == 0x000000, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, K2Node_Event_MyGeometry) == 0x00002C, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, K2Node_Event_InDeltaTime) == 0x000064, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000070, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000080, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, Temp_int_Array_Index_Variable) == 0x00008C, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_MakeLiteralString_ReturnValue) == 0x000090, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000A8, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000B0, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000B8, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000C0, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000C8, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_DegSin_ReturnValue) == 0x0000D0, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0000D8, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_MakeVector2D_ReturnValue) == 0x0000E0, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_GetPlayerController_ReturnValue) == 0x0000F0, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, K2Node_DynamicCast_AsBP_Menu_Player_Controller) == 0x0000F8, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::K2Node_DynamicCast_AsBP_Menu_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_GetPlayerController_ReturnValue_1) == 0x000108, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, K2Node_DynamicCast_AsBP_Menu_Player_Controller_1) == 0x000110, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::K2Node_DynamicCast_AsBP_Menu_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_UnregisterSingleSubMenu_ReturnValue) == 0x000119, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_UnregisterSingleSubMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_UnregisterSingleSubMenu_ReturnValue_1) == 0x00011A, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_UnregisterSingleSubMenu_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, K2Node_CustomEvent_Button) == 0x000120, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, K2Node_DynamicCast_AsUnion_UIButton_Base) == 0x000128, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::K2Node_DynamicCast_AsUnion_UIButton_Base' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000138, "Member 'WBP_CMN_FinalCheck_2_C_ExecuteUbergraph_WBP_CMN_FinalCheck_2::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_CMN_FinalCheck_2.WBP_CMN_FinalCheck_2_C.OnDecidedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_FinalCheck_2_C_OnDecidedEvent_Event final
{
public:
	class UUnionUIButtonBaseCore*                 Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_FinalCheck_2_C_OnDecidedEvent_Event) == 0x000008, "Wrong alignment on WBP_CMN_FinalCheck_2_C_OnDecidedEvent_Event");
static_assert(sizeof(WBP_CMN_FinalCheck_2_C_OnDecidedEvent_Event) == 0x000008, "Wrong size on WBP_CMN_FinalCheck_2_C_OnDecidedEvent_Event");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_OnDecidedEvent_Event, Button) == 0x000000, "Member 'WBP_CMN_FinalCheck_2_C_OnDecidedEvent_Event::Button' has a wrong offset!");

// Function WBP_CMN_FinalCheck_2.WBP_CMN_FinalCheck_2_C.OnFocusReceived
// 0x01D0 (0x01D0 - 0x0000)
struct WBP_CMN_FinalCheck_2_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_GetUserIndexByFocusEvent_ReturnValue;     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerController_C*             K2Node_DynamicCast_AsBP_Menu_Player_Controller;    // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0118(0x00B8)()
};
static_assert(alignof(WBP_CMN_FinalCheck_2_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_CMN_FinalCheck_2_C_OnFocusReceived");
static_assert(sizeof(WBP_CMN_FinalCheck_2_C_OnFocusReceived) == 0x0001D0, "Wrong size on WBP_CMN_FinalCheck_2_C_OnFocusReceived");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_CMN_FinalCheck_2_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_CMN_FinalCheck_2_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_CMN_FinalCheck_2_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_OnFocusReceived, CallFunc_GetUserIndexByFocusEvent_ReturnValue) == 0x0000F8, "Member 'WBP_CMN_FinalCheck_2_C_OnFocusReceived::CallFunc_GetUserIndexByFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_OnFocusReceived, CallFunc_GetPlayerController_ReturnValue) == 0x000100, "Member 'WBP_CMN_FinalCheck_2_C_OnFocusReceived::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_OnFocusReceived, K2Node_DynamicCast_AsBP_Menu_Player_Controller) == 0x000108, "Member 'WBP_CMN_FinalCheck_2_C_OnFocusReceived::K2Node_DynamicCast_AsBP_Menu_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_OnFocusReceived, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'WBP_CMN_FinalCheck_2_C_OnFocusReceived::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x000118, "Member 'WBP_CMN_FinalCheck_2_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function WBP_CMN_FinalCheck_2.WBP_CMN_FinalCheck_2_C.PlayAnimation_In_Decide_Cancel
// 0x0040 (0x0040 - 0x0000)
struct WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel final
{
public:
	int32                                         AnimIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel) == 0x000008, "Wrong alignment on WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel");
static_assert(sizeof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel) == 0x000040, "Wrong size on WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, AnimIndex) == 0x000000, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::AnimIndex' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, Time) == 0x000004, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::Time' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, Temp_byte_Variable) == 0x000008, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000009, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, Temp_byte_Variable_1) == 0x00000A, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, Temp_byte_Variable_2) == 0x00000B, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, Temp_bool_Variable) == 0x00000C, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, Temp_byte_Variable_3) == 0x00000D, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, Temp_byte_Variable_4) == 0x00000E, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, Temp_bool_Variable_1) == 0x00000F, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, K2Node_Select_Default) == 0x000010, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, Temp_byte_Variable_5) == 0x000011, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, Temp_byte_Variable_6) == 0x000012, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, K2Node_Select_Default_1) == 0x000013, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000015, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, CallFunc_GetEndTime_ReturnValue) == 0x000018, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, Temp_int_Variable) == 0x000028, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, Temp_int_Variable_1) == 0x00002C, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, K2Node_Select_Default_2) == 0x000030, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel, K2Node_Select_Default_3) == 0x000038, "Member 'WBP_CMN_FinalCheck_2_C_PlayAnimation_In_Decide_Cancel::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_CMN_FinalCheck_2.WBP_CMN_FinalCheck_2_C.SetUp Wave
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_CMN_FinalCheck_2_C_SetUp_Wave final
{
public:
	class FString                                 String_input;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         LocalTempFont;                                     // 0x0010(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         LocalTempLen;                                      // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LocalTmpStr;                                       // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0088(0x0014)()
	int32                                         Temp_int_Variable;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Mid_ReturnValue;                          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B0(0x0010)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CallFunc_SpawnObject_ReturnValue;                  // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_FinalCheck_2_C_SetUp_Wave) == 0x000008, "Wrong alignment on WBP_CMN_FinalCheck_2_C_SetUp_Wave");
static_assert(sizeof(WBP_CMN_FinalCheck_2_C_SetUp_Wave) == 0x0000E8, "Wrong size on WBP_CMN_FinalCheck_2_C_SetUp_Wave");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, String_input) == 0x000000, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::String_input' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, LocalTempFont) == 0x000010, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::LocalTempFont' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, LocalTempLen) == 0x000070, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::LocalTempLen' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, LocalTmpStr) == 0x000078, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::LocalTmpStr' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, K2Node_MakeStruct_SlateColor) == 0x000088, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, Temp_int_Variable) == 0x00009C, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, CallFunc_Mid_ReturnValue) == 0x0000A0, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::CallFunc_Mid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B0, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, CallFunc_SpawnObject_ReturnValue) == 0x0000C8, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, CallFunc_Len_ReturnValue) == 0x0000D0, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x0000D8, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000E0, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_SetUp_Wave, CallFunc_Array_Add_ReturnValue) == 0x0000E4, "Member 'WBP_CMN_FinalCheck_2_C_SetUp_Wave::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_CMN_FinalCheck_2.WBP_CMN_FinalCheck_2_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CMN_FinalCheck_2_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_FinalCheck_2_C_Tick) == 0x000004, "Wrong alignment on WBP_CMN_FinalCheck_2_C_Tick");
static_assert(sizeof(WBP_CMN_FinalCheck_2_C_Tick) == 0x00003C, "Wrong size on WBP_CMN_FinalCheck_2_C_Tick");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_CMN_FinalCheck_2_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CMN_FinalCheck_2_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_CMN_FinalCheck_2_C_Tick::InDeltaTime' has a wrong offset!");

}

