#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_Sub_Offline

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TimeTrial_Sub_Offline.WBP_TimeTrial_Sub_Offline_C
// 0x00E8 (0x04C0 - 0x03D8)
class UWBP_TimeTrial_Sub_Offline_C final : public UUnionUISceneBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TimeTrial_Offline_Out;                             // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TimeTrial_Offline_Loop;                            // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TimeTrial_Offline_In;                              // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DMY_Image_IconRank;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     WBP_PauseMenu_Sub_Option_Btn_03_01;                // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     WBP_PauseMenu_Sub_Option_Btn_03_02;                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          WBP_Popup_Sub_Btn_Standard_01;                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          WBP_Popup_Sub_Btn_Standard_02;                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_GadgetIcon_Simple_C*  WBP_Race_HUD_Sub_GadgetIcon_Simple;                // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ready_Sub_StandByText_C*           WBP_Ready_Sub_StandByText;                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_Header_StageName_C*  WBP_TimeTrial_Sub_Header_StageName;                // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_Lap_C*               WBP_TimeTrial_Sub_Lap;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_Lap_C*               WBP_TimeTrial_Sub_Lap_1;                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_Lap_C*               WBP_TimeTrial_Sub_Lap_2;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_Machine_C*           WBP_TimeTrial_Sub_Machine;                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_Offline_Ghost_C*     WBP_TimeTrial_Sub_Offline_Ghost;                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_TargetTime_C*        WBP_TimeTrial_Sub_Time;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUserTimeTrialRaceData                 UserTimeTrialRaceData;                             // 0x0468(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUnionUIButtonsPanel*                   ButtonsPanel;                                      // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TimeTrial_Sub_Offline(int32 EntryPoint);
	void SetLastFocusButton();
	void SetupOfflinePanel(EStageId InStageId, const struct FUserTimeTrialRaceData& InRaceData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TimeTrial_Sub_Offline_C">();
	}
	static class UWBP_TimeTrial_Sub_Offline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TimeTrial_Sub_Offline_C>();
	}
};
static_assert(alignof(UWBP_TimeTrial_Sub_Offline_C) == 0x000008, "Wrong alignment on UWBP_TimeTrial_Sub_Offline_C");
static_assert(sizeof(UWBP_TimeTrial_Sub_Offline_C) == 0x0004C0, "Wrong size on UWBP_TimeTrial_Sub_Offline_C");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, UberGraphFrame) == 0x0003D8, "Member 'UWBP_TimeTrial_Sub_Offline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, TimeTrial_Offline_Out) == 0x0003E0, "Member 'UWBP_TimeTrial_Sub_Offline_C::TimeTrial_Offline_Out' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, TimeTrial_Offline_Loop) == 0x0003E8, "Member 'UWBP_TimeTrial_Sub_Offline_C::TimeTrial_Offline_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, TimeTrial_Offline_In) == 0x0003F0, "Member 'UWBP_TimeTrial_Sub_Offline_C::TimeTrial_Offline_In' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, DMY_Image_IconRank) == 0x0003F8, "Member 'UWBP_TimeTrial_Sub_Offline_C::DMY_Image_IconRank' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_PauseMenu_Sub_Option_Btn_03_01) == 0x000400, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_PauseMenu_Sub_Option_Btn_03_01' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_PauseMenu_Sub_Option_Btn_03_02) == 0x000408, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_PauseMenu_Sub_Option_Btn_03_02' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_Popup_Sub_Btn_Standard_01) == 0x000410, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_Popup_Sub_Btn_Standard_01' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_Popup_Sub_Btn_Standard_02) == 0x000418, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_Popup_Sub_Btn_Standard_02' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_Race_HUD_Sub_GadgetIcon_Simple) == 0x000420, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_Race_HUD_Sub_GadgetIcon_Simple' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_Ready_Sub_StandByText) == 0x000428, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_Ready_Sub_StandByText' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_TimeTrial_Sub_Header_StageName) == 0x000430, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_TimeTrial_Sub_Header_StageName' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_TimeTrial_Sub_Lap) == 0x000438, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_TimeTrial_Sub_Lap' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_TimeTrial_Sub_Lap_1) == 0x000440, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_TimeTrial_Sub_Lap_1' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_TimeTrial_Sub_Lap_2) == 0x000448, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_TimeTrial_Sub_Lap_2' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_TimeTrial_Sub_Machine) == 0x000450, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_TimeTrial_Sub_Machine' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_TimeTrial_Sub_Offline_Ghost) == 0x000458, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_TimeTrial_Sub_Offline_Ghost' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, WBP_TimeTrial_Sub_Time) == 0x000460, "Member 'UWBP_TimeTrial_Sub_Offline_C::WBP_TimeTrial_Sub_Time' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, UserTimeTrialRaceData) == 0x000468, "Member 'UWBP_TimeTrial_Sub_Offline_C::UserTimeTrialRaceData' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_Offline_C, ButtonsPanel) == 0x0004B8, "Member 'UWBP_TimeTrial_Sub_Offline_C::ButtonsPanel' has a wrong offset!");

}

