#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_Window_Tutorial_Sub_Cover

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Popup_Window_Tutorial_Sub_Cover.WBP_Popup_Window_Tutorial_Sub_Cover_C.ExecuteUbergraph_WBP_Popup_Window_Tutorial_Sub_Cover
// 0x0018 (0x0018 - 0x0000)
struct WBP_Popup_Window_Tutorial_Sub_Cover_C_ExecuteUbergraph_WBP_Popup_Window_Tutorial_Sub_Cover final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_NewText;                        // 0x0008(0x0010)()
};
static_assert(alignof(WBP_Popup_Window_Tutorial_Sub_Cover_C_ExecuteUbergraph_WBP_Popup_Window_Tutorial_Sub_Cover) == 0x000008, "Wrong alignment on WBP_Popup_Window_Tutorial_Sub_Cover_C_ExecuteUbergraph_WBP_Popup_Window_Tutorial_Sub_Cover");
static_assert(sizeof(WBP_Popup_Window_Tutorial_Sub_Cover_C_ExecuteUbergraph_WBP_Popup_Window_Tutorial_Sub_Cover) == 0x000018, "Wrong size on WBP_Popup_Window_Tutorial_Sub_Cover_C_ExecuteUbergraph_WBP_Popup_Window_Tutorial_Sub_Cover");
static_assert(offsetof(WBP_Popup_Window_Tutorial_Sub_Cover_C_ExecuteUbergraph_WBP_Popup_Window_Tutorial_Sub_Cover, EntryPoint) == 0x000000, "Member 'WBP_Popup_Window_Tutorial_Sub_Cover_C_ExecuteUbergraph_WBP_Popup_Window_Tutorial_Sub_Cover::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Tutorial_Sub_Cover_C_ExecuteUbergraph_WBP_Popup_Window_Tutorial_Sub_Cover, K2Node_CustomEvent_NewText) == 0x000008, "Member 'WBP_Popup_Window_Tutorial_Sub_Cover_C_ExecuteUbergraph_WBP_Popup_Window_Tutorial_Sub_Cover::K2Node_CustomEvent_NewText' has a wrong offset!");

// Function WBP_Popup_Window_Tutorial_Sub_Cover.WBP_Popup_Window_Tutorial_Sub_Cover_C.SetExplanation
// 0x0010 (0x0010 - 0x0000)
struct WBP_Popup_Window_Tutorial_Sub_Cover_C_SetExplanation final
{
public:
	class FText                                   NewText;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Popup_Window_Tutorial_Sub_Cover_C_SetExplanation) == 0x000008, "Wrong alignment on WBP_Popup_Window_Tutorial_Sub_Cover_C_SetExplanation");
static_assert(sizeof(WBP_Popup_Window_Tutorial_Sub_Cover_C_SetExplanation) == 0x000010, "Wrong size on WBP_Popup_Window_Tutorial_Sub_Cover_C_SetExplanation");
static_assert(offsetof(WBP_Popup_Window_Tutorial_Sub_Cover_C_SetExplanation, NewText) == 0x000000, "Member 'WBP_Popup_Window_Tutorial_Sub_Cover_C_SetExplanation::NewText' has a wrong offset!");

}

