#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ready_Sub_StandByText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Ready_Sub_StandByText.WBP_Ready_Sub_StandByText_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_Ready_Sub_StandByText_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_Ready;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Ready;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        degree;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isWave;                                            // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     TextBlokArray;                                     // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        Speed;                                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Ready_Sub_StandByText(int32 EntryPoint);
	void SetUp_Wave(const class FString& String_input);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Ready_Sub_StandByText_C">();
	}
	static class UWBP_Ready_Sub_StandByText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Ready_Sub_StandByText_C>();
	}
};
static_assert(alignof(UWBP_Ready_Sub_StandByText_C) == 0x000008, "Wrong alignment on UWBP_Ready_Sub_StandByText_C");
static_assert(sizeof(UWBP_Ready_Sub_StandByText_C) == 0x000320, "Wrong size on UWBP_Ready_Sub_StandByText_C");
static_assert(offsetof(UWBP_Ready_Sub_StandByText_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Ready_Sub_StandByText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_StandByText_C, HorizontalBox_Ready) == 0x0002E8, "Member 'UWBP_Ready_Sub_StandByText_C::HorizontalBox_Ready' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_StandByText_C, TXT_Ready) == 0x0002F0, "Member 'UWBP_Ready_Sub_StandByText_C::TXT_Ready' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_StandByText_C, degree) == 0x0002F8, "Member 'UWBP_Ready_Sub_StandByText_C::degree' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_StandByText_C, isWave) == 0x000300, "Member 'UWBP_Ready_Sub_StandByText_C::isWave' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_StandByText_C, TextBlokArray) == 0x000308, "Member 'UWBP_Ready_Sub_StandByText_C::TextBlokArray' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_StandByText_C, Speed) == 0x000318, "Member 'UWBP_Ready_Sub_StandByText_C::Speed' has a wrong offset!");

}

