#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemSwitch_Sub_Detail

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemSwitch_Sub_Detail.WBP_ItemSwitch_Sub_Detail_C
// 0x0048 (0x0330 - 0x02E8)
class UWBP_ItemSwitch_Sub_Detail_C final : public UPartyRaceItemSwitchDetail
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG_Base;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBG_Base;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameLine;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_ItemDetail;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_ItemName;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ScrollSnapPoint_C*             WBP_CMN_ScrollSnapPoint;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_ControllerBtn_C*    WBP_FooterMenu_Sub_ControllerBtn_01;               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_ControllerBtn_C*    WBP_FooterMenu_Sub_ControllerBtn_02;               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail(int32 EntryPoint);
	void OnLoaded_CFE0274244ED98A836395491DD52B753(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void UpdateItem(EItemId InItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemSwitch_Sub_Detail_C">();
	}
	static class UWBP_ItemSwitch_Sub_Detail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemSwitch_Sub_Detail_C>();
	}
};
static_assert(alignof(UWBP_ItemSwitch_Sub_Detail_C) == 0x000008, "Wrong alignment on UWBP_ItemSwitch_Sub_Detail_C");
static_assert(sizeof(UWBP_ItemSwitch_Sub_Detail_C) == 0x000330, "Wrong size on UWBP_ItemSwitch_Sub_Detail_C");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Detail_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ItemSwitch_Sub_Detail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Detail_C, BG_Base) == 0x0002F0, "Member 'UWBP_ItemSwitch_Sub_Detail_C::BG_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Detail_C, ImageBG_Base) == 0x0002F8, "Member 'UWBP_ItemSwitch_Sub_Detail_C::ImageBG_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Detail_C, NameLine) == 0x000300, "Member 'UWBP_ItemSwitch_Sub_Detail_C::NameLine' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Detail_C, TXT_ItemDetail) == 0x000308, "Member 'UWBP_ItemSwitch_Sub_Detail_C::TXT_ItemDetail' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Detail_C, TXT_ItemName) == 0x000310, "Member 'UWBP_ItemSwitch_Sub_Detail_C::TXT_ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Detail_C, WBP_CMN_ScrollSnapPoint) == 0x000318, "Member 'UWBP_ItemSwitch_Sub_Detail_C::WBP_CMN_ScrollSnapPoint' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Detail_C, WBP_FooterMenu_Sub_ControllerBtn_01) == 0x000320, "Member 'UWBP_ItemSwitch_Sub_Detail_C::WBP_FooterMenu_Sub_ControllerBtn_01' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Detail_C, WBP_FooterMenu_Sub_ControllerBtn_02) == 0x000328, "Member 'UWBP_ItemSwitch_Sub_Detail_C::WBP_FooterMenu_Sub_ControllerBtn_02' has a wrong offset!");

}

