#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_Sub_MyLobbyId_InfoText

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Friend_Sub_MyLobbyId_InfoText.WBP_Friend_Sub_MyLobbyId_InfoText_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_Friend_Sub_MyLobbyId_InfoText_C final : public UUserWidget
{
public:
	class UThrobber*                              DSP_Throbber_dot_Sub;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_26;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Sub;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Friend_Sub_MyLobbyId_InfoText_C">();
	}
	static class UWBP_Friend_Sub_MyLobbyId_InfoText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Friend_Sub_MyLobbyId_InfoText_C>();
	}
};
static_assert(alignof(UWBP_Friend_Sub_MyLobbyId_InfoText_C) == 0x000008, "Wrong alignment on UWBP_Friend_Sub_MyLobbyId_InfoText_C");
static_assert(sizeof(UWBP_Friend_Sub_MyLobbyId_InfoText_C) == 0x0002F8, "Wrong size on UWBP_Friend_Sub_MyLobbyId_InfoText_C");
static_assert(offsetof(UWBP_Friend_Sub_MyLobbyId_InfoText_C, DSP_Throbber_dot_Sub) == 0x0002E0, "Member 'UWBP_Friend_Sub_MyLobbyId_InfoText_C::DSP_Throbber_dot_Sub' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_Sub_MyLobbyId_InfoText_C, Overlay_26) == 0x0002E8, "Member 'UWBP_Friend_Sub_MyLobbyId_InfoText_C::Overlay_26' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_Sub_MyLobbyId_InfoText_C, TXT_Sub) == 0x0002F0, "Member 'UWBP_Friend_Sub_MyLobbyId_InfoText_C::TXT_Sub' has a wrong offset!");

}

