#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_BG_FinalRound

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_BG_FinalRound.WBP_CMN_BG_FinalRound_C
// 0x0060 (0x0340 - 0x02E0)
class UWBP_CMN_BG_FinalRound_C final : public UUserWidget
{
public:
	class UImage*                                 BG_Black;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Red;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FireSpark_Left;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FireSpark_Left_BG;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FireSpark_Right;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FireSpark_Right_BG;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow_Left;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow_Right;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Left;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Right;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RivalSelect_Sub_Effects_Fire_C*    WBP_RivalSelect_Sub_Effects_Fire_Left;             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RivalSelect_Sub_Effects_Fire_C*    WBP_RivalSelect_Sub_Effects_Fire_Right;            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_BG_FinalRound_C">();
	}
	static class UWBP_CMN_BG_FinalRound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_BG_FinalRound_C>();
	}
};
static_assert(alignof(UWBP_CMN_BG_FinalRound_C) == 0x000008, "Wrong alignment on UWBP_CMN_BG_FinalRound_C");
static_assert(sizeof(UWBP_CMN_BG_FinalRound_C) == 0x000340, "Wrong size on UWBP_CMN_BG_FinalRound_C");
static_assert(offsetof(UWBP_CMN_BG_FinalRound_C, BG_Black) == 0x0002E0, "Member 'UWBP_CMN_BG_FinalRound_C::BG_Black' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_FinalRound_C, BG_Red) == 0x0002E8, "Member 'UWBP_CMN_BG_FinalRound_C::BG_Red' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_FinalRound_C, FireSpark_Left) == 0x0002F0, "Member 'UWBP_CMN_BG_FinalRound_C::FireSpark_Left' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_FinalRound_C, FireSpark_Left_BG) == 0x0002F8, "Member 'UWBP_CMN_BG_FinalRound_C::FireSpark_Left_BG' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_FinalRound_C, FireSpark_Right) == 0x000300, "Member 'UWBP_CMN_BG_FinalRound_C::FireSpark_Right' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_FinalRound_C, FireSpark_Right_BG) == 0x000308, "Member 'UWBP_CMN_BG_FinalRound_C::FireSpark_Right_BG' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_FinalRound_C, Grow_Left) == 0x000310, "Member 'UWBP_CMN_BG_FinalRound_C::Grow_Left' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_FinalRound_C, Grow_Right) == 0x000318, "Member 'UWBP_CMN_BG_FinalRound_C::Grow_Right' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_FinalRound_C, RaceFlag_Left) == 0x000320, "Member 'UWBP_CMN_BG_FinalRound_C::RaceFlag_Left' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_FinalRound_C, RaceFlag_Right) == 0x000328, "Member 'UWBP_CMN_BG_FinalRound_C::RaceFlag_Right' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_FinalRound_C, WBP_RivalSelect_Sub_Effects_Fire_Left) == 0x000330, "Member 'UWBP_CMN_BG_FinalRound_C::WBP_RivalSelect_Sub_Effects_Fire_Left' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_FinalRound_C, WBP_RivalSelect_Sub_Effects_Fire_Right) == 0x000338, "Member 'UWBP_CMN_BG_FinalRound_C::WBP_RivalSelect_Sub_Effects_Fire_Right' has a wrong offset!");

}

