#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ready_Sub_CharaWindow_P2P4

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Ready_Sub_CharaWindow_P2P4.WBP_Ready_Sub_CharaWindow_P2P4_C.ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4
// 0x0088 (0x0088 - 0x0000)
struct WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsCheck;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_texture;                              // 0x0040(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   K2Node_Event_name;                                 // 0x0068(0x0010)(ConstParm)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4) == 0x000008, "Wrong alignment on WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4");
static_assert(sizeof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4) == 0x000088, "Wrong size on WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, EntryPoint) == 0x000000, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, Temp_object_Variable) == 0x000010, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, K2Node_DynamicCast_As_____2D) == 0x000018, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, K2Node_Event_bIsCheck) == 0x000022, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::K2Node_Event_bIsCheck' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, K2Node_Event_texture) == 0x000040, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, K2Node_Event_name) == 0x000068, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_ExecuteUbergraph_WBP_Ready_Sub_CharaWindow_P2P4::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Ready_Sub_CharaWindow_P2P4.WBP_Ready_Sub_CharaWindow_P2P4_C.OnLoaded_1A052A2E46605EDA6BF87989A069EFF0
// 0x0008 (0x0008 - 0x0000)
struct WBP_Ready_Sub_CharaWindow_P2P4_C_OnLoaded_1A052A2E46605EDA6BF87989A069EFF0 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ready_Sub_CharaWindow_P2P4_C_OnLoaded_1A052A2E46605EDA6BF87989A069EFF0) == 0x000008, "Wrong alignment on WBP_Ready_Sub_CharaWindow_P2P4_C_OnLoaded_1A052A2E46605EDA6BF87989A069EFF0");
static_assert(sizeof(WBP_Ready_Sub_CharaWindow_P2P4_C_OnLoaded_1A052A2E46605EDA6BF87989A069EFF0) == 0x000008, "Wrong size on WBP_Ready_Sub_CharaWindow_P2P4_C_OnLoaded_1A052A2E46605EDA6BF87989A069EFF0");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_OnLoaded_1A052A2E46605EDA6BF87989A069EFF0, Loaded) == 0x000000, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_OnLoaded_1A052A2E46605EDA6BF87989A069EFF0::Loaded' has a wrong offset!");

// Function WBP_Ready_Sub_CharaWindow_P2P4.WBP_Ready_Sub_CharaWindow_P2P4_C.SetCharacterIconCheckMark
// 0x0001 (0x0001 - 0x0000)
struct WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconCheckMark final
{
public:
	bool                                          bIsCheck;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconCheckMark) == 0x000001, "Wrong alignment on WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconCheckMark");
static_assert(sizeof(WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconCheckMark) == 0x000001, "Wrong size on WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconCheckMark");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconCheckMark, bIsCheck) == 0x000000, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconCheckMark::bIsCheck' has a wrong offset!");

// Function WBP_Ready_Sub_CharaWindow_P2P4.WBP_Ready_Sub_CharaWindow_P2P4_C.SetCharacterIconTexture
// 0x0038 (0x0038 - 0x0000)
struct WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0028(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconTexture) == 0x000008, "Wrong alignment on WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconTexture");
static_assert(sizeof(WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconTexture) == 0x000038, "Wrong size on WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconTexture");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconTexture, Texture) == 0x000000, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconTexture::Texture' has a wrong offset!");
static_assert(offsetof(WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconTexture, Name_0) == 0x000028, "Member 'WBP_Ready_Sub_CharaWindow_P2P4_C_SetCharacterIconTexture::Name_0' has a wrong offset!");

}

