#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_Reward

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result_Reward.WBP_Result_Reward_C
// 0x0078 (0x0358 - 0x02E0)
class UWBP_Result_Reward_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InLoop;                                            // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_RacerAward;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_DonpaTicket_Details_C*  WBP_Result_Sub_DonpaTicket_Details_01;             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_DonpaTicket_Details_C*  WBP_Result_Sub_DonpaTicket_Details_02;             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_DonpaTicket_Details_C*  WBP_Result_Sub_DonpaTicket_Details_03;             // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_DonpaTicket_Details_C*  WBP_Result_Sub_DonpaTicket_Details_04;             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentItemIndex;                                  // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRewardDispFinish;                                 // 0x031C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FResultRewardItemInfo>          ItemInfos;                                         // 0x0320(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	struct FResultRewardItemInfo                  CurrentItemInfo;                                   // 0x0330(0x0020)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	class UWBP_Result_Sub_DonpaTicket_Details_C*  CurrentItemWidget;                                 // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CloseReward();
	void Construct();
	void ExecuteUbergraph_WBP_Result_Reward(int32 EntryPoint);
	void Finished_4CD729594DBA348EDC0AE5A094CC2F28();
	void Finished_5FE04722478441073E465CA7CE2C5AB5();
	void Finished_63BCFB8D460E3CE107EC0BB899C3ACB4();
	void Finished_D392C6B74ABB8831DC622AB0C5B56700();
	void Finished_FC2AD635457559839A132387D5C2AFBE();
	void GetItemWidget(int32 Index_0, class UWBP_Result_Sub_DonpaTicket_Details_C** Widget);
	void IsResultReward(bool* bIsResultReward);
	void IsRewardDispComplete(bool* bIsComplete);
	void IsVisibleRSR(bool* visisble);
	void OnTicketAnimationFinished();
	void OnTicketInAnimationFinished();
	void PlayOtherResultReward(const TArray<struct FHonorCommendationData>& HonorList, int32 Index_0);
	void PlayOtherSE(class USoundAtomCue* SoundID, int32 PlayerIndex);
	void PlayPlayerSE(class USoundAtomCue* SoundID);
	void PlayResultReward();
	void SetRewardInfo(const TArray<struct FRewardRedStarRingData>& RSRList);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Result_Reward_C">();
	}
	static class UWBP_Result_Reward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_Reward_C>();
	}
};
static_assert(alignof(UWBP_Result_Reward_C) == 0x000008, "Wrong alignment on UWBP_Result_Reward_C");
static_assert(sizeof(UWBP_Result_Reward_C) == 0x000358, "Wrong size on UWBP_Result_Reward_C");
static_assert(offsetof(UWBP_Result_Reward_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Result_Reward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Reward_C, InLoop) == 0x0002E8, "Member 'UWBP_Result_Reward_C::InLoop' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Reward_C, TXT_RacerAward) == 0x0002F0, "Member 'UWBP_Result_Reward_C::TXT_RacerAward' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Reward_C, WBP_Result_Sub_DonpaTicket_Details_01) == 0x0002F8, "Member 'UWBP_Result_Reward_C::WBP_Result_Sub_DonpaTicket_Details_01' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Reward_C, WBP_Result_Sub_DonpaTicket_Details_02) == 0x000300, "Member 'UWBP_Result_Reward_C::WBP_Result_Sub_DonpaTicket_Details_02' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Reward_C, WBP_Result_Sub_DonpaTicket_Details_03) == 0x000308, "Member 'UWBP_Result_Reward_C::WBP_Result_Sub_DonpaTicket_Details_03' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Reward_C, WBP_Result_Sub_DonpaTicket_Details_04) == 0x000310, "Member 'UWBP_Result_Reward_C::WBP_Result_Sub_DonpaTicket_Details_04' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Reward_C, CurrentItemIndex) == 0x000318, "Member 'UWBP_Result_Reward_C::CurrentItemIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Reward_C, bRewardDispFinish) == 0x00031C, "Member 'UWBP_Result_Reward_C::bRewardDispFinish' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Reward_C, ItemInfos) == 0x000320, "Member 'UWBP_Result_Reward_C::ItemInfos' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Reward_C, CurrentItemInfo) == 0x000330, "Member 'UWBP_Result_Reward_C::CurrentItemInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Reward_C, CurrentItemWidget) == 0x000350, "Member 'UWBP_Result_Reward_C::CurrentItemWidget' has a wrong offset!");

}

