#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PrivateMatch_Popup_Sub_ModeBtn_Free

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_PrivateMatch_Popup_Sub_ModeBtn_Free.WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C.ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free
// 0x0120 (0x0120 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InText_1;                             // 0x0028(0x0010)(ConstParm)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_2;                       // 0x0038(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0040(0x0008)(NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIButtonSoundSetting                    Temp_byte_Variable;                                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIButtonSoundSetting                    Temp_byte_Variable_1;                              // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x009C(0x0008)(NoDestructor)
	int32                                         CallFunc_GetUserIndexByFocusEvent_ReturnValue;     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x00B8(0x0004)()
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_2;      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x00CC(0x0004)()
	class FText                                   K2Node_Event_InText;                               // 0x00D0(0x0010)(ConstParm)
	bool                                          Temp_bool_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIButtonSoundSetting                    K2Node_Select_Default;                             // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue;           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free) == 0x000008, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free) == 0x000120, "Wrong size on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, EntryPoint) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_CustomEvent_Button) == 0x000020, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_Event_InText_1) == 0x000028, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_Event_InText_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_Event_InFocusEvent_2) == 0x000038, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_Event_InFocusEvent_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_Event_InFocusEvent_1) == 0x000040, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000050, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_SwitchEnum_CmpSuccess_1) == 0x000059, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000060, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x000068, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_PlayAnimation_ReturnValue_2) == 0x000078, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_PlayAnimation_ReturnValue_3) == 0x000090, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_SwitchEnum_CmpSuccess_2) == 0x000098, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, Temp_byte_Variable) == 0x000099, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, Temp_byte_Variable_1) == 0x00009A, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_Event_InFocusEvent) == 0x00009C, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_GetUserIndexByFocusEvent_ReturnValue) == 0x0000A4, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_GetUserIndexByFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000B0, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_SoundPlay_ReturnValue) == 0x0000B8, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_DynamicCast_AsApp_Player_Controller_2) == 0x0000C0, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_DynamicCast_AsApp_Player_Controller_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000C9, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_BooleanAND_ReturnValue) == 0x0000CA, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_SoundPlay_ReturnValue_1) == 0x0000CC, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_Event_InText) == 0x0000D0, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, Temp_bool_Variable) == 0x0000E0, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E1, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_Select_Default) == 0x0000E2, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_PlayAnimation_ReturnValue_4) == 0x0000E8, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_SwitchEnum_CmpSuccess_3) == 0x0000F0, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_UnregisterMainMenu_ReturnValue) == 0x0000F1, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_UnregisterMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, CallFunc_PlayAnimation_ReturnValue_5) == 0x0000F8, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_CreateDelegate_OutputDelegate_1) == 0x000100, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free, K2Node_CreateDelegate_OutputDelegate_2) == 0x000110, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_ModeBtn_Free::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_PrivateMatch_Popup_Sub_ModeBtn_Free.WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_PrivateMatch_Popup_Sub_ModeBtn_Free.WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C.OnFocus_Impl
// 0x0008 (0x0008 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocus_Impl final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocus_Impl) == 0x000008, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocus_Impl");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocus_Impl) == 0x000008, "Wrong size on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocus_Impl");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocus_Impl, Button) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocus_Impl::Button' has a wrong offset!");

// Function WBP_PrivateMatch_Popup_Sub_ModeBtn_Free.WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocusLost");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocusLost) == 0x000008, "Wrong size on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocusLost");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_PrivateMatch_Popup_Sub_ModeBtn_Free.WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_PrivateMatch_Popup_Sub_ModeBtn_Free.WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C.SetButtonInDetailText
// 0x0010 (0x0010 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInDetailText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInDetailText) == 0x000008, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInDetailText");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInDetailText) == 0x000010, "Wrong size on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInDetailText");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInDetailText, InText) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInDetailText::InText' has a wrong offset!");

// Function WBP_PrivateMatch_Popup_Sub_ModeBtn_Free.WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C.SetButtonInText
// 0x0010 (0x0010 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInText) == 0x000008, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInText");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInText) == 0x000010, "Wrong size on WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInText");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInText, InText) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_ModeBtn_Free_C_SetButtonInText::InText' has a wrong offset!");

}

