#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupSelect_2Layout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_GroupSelect_2Layout.WBP_GroupSelect_2Layout_C.DoCustomNavigation
// 0x0010 (0x0010 - 0x0000)
struct WBP_GroupSelect_2Layout_C_DoCustomNavigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupSelect_2Layout_C_DoCustomNavigation) == 0x000008, "Wrong alignment on WBP_GroupSelect_2Layout_C_DoCustomNavigation");
static_assert(sizeof(WBP_GroupSelect_2Layout_C_DoCustomNavigation) == 0x000010, "Wrong size on WBP_GroupSelect_2Layout_C_DoCustomNavigation");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_DoCustomNavigation, Navigation_0) == 0x000000, "Member 'WBP_GroupSelect_2Layout_C_DoCustomNavigation::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_DoCustomNavigation, ReturnValue) == 0x000008, "Member 'WBP_GroupSelect_2Layout_C_DoCustomNavigation::ReturnValue' has a wrong offset!");

// Function WBP_GroupSelect_2Layout.WBP_GroupSelect_2Layout_C.ExecuteUbergraph_WBP_GroupSelect_2Layout
// 0x0778 (0x0778 - 0x0000)
struct WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EUnionUIControlDir                            K2Node_CustomEvent_Dir;                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        K2Node_DynamicCast_AsGroup_Select_Component_Controller; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSettingCourseSelecting                   CallFunc_GetRaceSettingCourseSelecting_ReturnValue; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_1;     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_2;     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_3;     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_CreatePlayer_ReturnValue;                 // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, EUnionUIControlDir Dir)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x015F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGroupSelectComponentController*> K2Node_MakeArray_Array;                           // 0x0178(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_1;                         // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_2;                         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_3;                         // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_4;                         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue;    // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_5;                         // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLobbyIndexFromArray_ReturnValue;       // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlatformIconIndex_ReturnValue;         // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetRacerName_OutRacerName;                // 0x01F8(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetRacerDriverId_OutId;                   // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLobbyIndexFromArray_ReturnValue_1;     // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDriverData                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0238(0x0390)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetOnlineDriverIdFromArray_ReturnValue;   // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetRacerDriverId_OutId_1;                 // 0x05CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB[0x5];                                      // 0x05CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x05D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_2;         // 0x05E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E3[0x1];                                      // 0x05E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x05E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x05F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F5[0x3];                                      // 0x05F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x05F8(0x0004)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x3];                                      // 0x0601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_4;     // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_609[0x3];                                      // 0x0609(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614[0x4];                                      // 0x0614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_6;                         // 0x0618(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_6;            // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624[0x4];                                      // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GroupSelect_Sub_Table_Line_C*      K2Node_DynamicCast_AsWBP_Group_Select_Sub_Table_Line; // 0x0628(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_5;     // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_2;      // 0x063C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x063D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63E[0x2];                                      // 0x063E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0640(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C[0x4];                                      // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_2;      // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_4;        // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65A[0x2];                                      // 0x065A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAppControllerInputType BeforeType, EAppControllerInputType AfterType)> K2Node_CreateDelegate_OutputDelegate_6; // 0x065C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAppControllerInputType                       K2Node_CustomEvent_BeforeType;                     // 0x066C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppControllerInputType                       K2Node_CustomEvent_AfterType;                      // 0x066D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x066E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66F[0x1];                                      // 0x066F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocus_ReturnValue;                 // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x067A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x067B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue_1;        // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x067D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67E[0x2];                                      // 0x067E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0684(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_685[0x3];                                      // 0x0685(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694[0x4];                                      // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_7;                         // 0x0698(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      K2Node_DynamicCast_AsWBP_Group_Select_Sub_Table_Line_1; // 0x06A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x06A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AA[0x2];                                      // 0x06AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x06AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue_2;        // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x06B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x06B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x06B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_3;      // 0x06B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x06B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B7[0x1];                                      // 0x06B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   CallFunc_SpawnObject_ReturnValue;                  // 0x06B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlateMoving_ReturnValue;                // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x06C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlateMoving_ReturnValue_1;              // 0x06C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C3[0x5];                                      // 0x06C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x06D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x06E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue_3;        // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_8;                         // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_Array_Get_Item_9;                         // 0x06F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_3;         // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0701(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0702(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0703(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_4;      // 0x0704(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x0705(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0706(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x0707(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_5;      // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x070A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70B[0x1];                                      // 0x070B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_8;        // 0x070C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue_4;        // 0x071C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71D[0x3];                                      // 0x071D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_9;        // 0x0720(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_6;      // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_731[0x7];                                      // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_GetMouseControllComponent_ReturnValue;    // 0x0738(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0744(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_745[0x3];                                      // 0x0745(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x074C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEndFlag_ReturnValue;                   // 0x074D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x074E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x074F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_7;      // 0x0751(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_752[0x6];                                      // 0x0752(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_GetMouseControllComponent_ReturnValue_1;  // 0x0758(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEndFlag_ReturnValue_1;                 // 0x0761(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_13;               // 0x0762(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0763(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0764(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_765[0x3];                                      // 0x0765(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0768(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout) == 0x000008, "Wrong alignment on WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout");
static_assert(sizeof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout) == 0x000778, "Wrong size on WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, EntryPoint) == 0x000000, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetPlayerController_ReturnValue_1) == 0x000010, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetPlayerController_ReturnValue_2) == 0x000018, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_CustomEvent_Button) == 0x000020, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_CustomEvent_Dir) == 0x000028, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_CustomEvent_Dir' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetPlayerController_ReturnValue_3) == 0x000030, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_DynamicCast_AsGroup_Select_Component_Controller) == 0x000040, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_DynamicCast_AsGroup_Select_Component_Controller' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Array_Find_ReturnValue) == 0x00004C, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetPlayerController_ReturnValue_4) == 0x000060, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000070, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetIsOnlineGameMode_ReturnValue) == 0x000084, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetIsOnlineGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x000088, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00008C, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetRaceSettingCourseSelecting_ReturnValue) == 0x000090, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetRaceSettingCourseSelecting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_SwitchEnum_CmpSuccess_1) == 0x000091, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetSelectedPlayerCount_ReturnValue_1) == 0x000094, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetSelectedPlayerCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000098, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A0, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetSelectedPlayerCount_ReturnValue_2) == 0x0000AC, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetSelectedPlayerCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x0000B0, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000B4, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000B8, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetSelectedPlayerCount_ReturnValue_3) == 0x0000C4, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetSelectedPlayerCount_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C8, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Subtract_IntInt_ReturnValue_4) == 0x0000CC, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Subtract_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x0000D0, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_CustomEvent_Button_1) == 0x0000D8, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, Temp_int_Variable) == 0x0000E0, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_CreatePlayer_ReturnValue) == 0x0000E8, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_CreatePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetPlayerController_ReturnValue_5) == 0x0000F0, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_DynamicCast_AsApp_Player_Controller) == 0x0000F8, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_IsValid_ReturnValue) == 0x000101, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x000108, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_DynamicCast_bSuccess_2) == 0x000110, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000111, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Add_IntInt_ReturnValue_2) == 0x000114, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_GetPlayerController_ReturnValue_6) == 0x000118, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_CustomEvent_Button_2) == 0x000120, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_CreateDelegate_OutputDelegate) == 0x000128, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_CreateDelegate_OutputDelegate_1) == 0x000138, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, K2Node_CreateDelegate_OutputDelegate_2) == 0x000148, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Array_Length_ReturnValue_1) == 0x000158, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_Less_IntInt_ReturnValue) == 0x00015C, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x00015D, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout, CallFunc_BooleanOR_ReturnValue) == 0x00015E, "Member 'WBP_GroupSelect_2Layout_C_ExecuteUbergraph_WBP_GroupSelect_2Layout::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
