#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_SmallWindow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Friend_SmallWindow.WBP_Friend_SmallWindow_C.ExecuteUbergraph_WBP_Friend_SmallWindow
// 0x0110 (0x0110 - 0x0000)
struct WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_CustomEvent_InButtonText_1;                 // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TArray<bool>                                  K2Node_CustomEvent_bInButtonSelectable;            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	class UUnionUIButtonsPanel*                   CallFunc_CreateButtonsPanel_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InButtonNum;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_CustomEvent_InButtonText;                   // 0x0058(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWBP_Friend_Sub_Line_Btn_C*>     K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0078(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_Line_Btn_C*             CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_Line_Btn_C*             CallFunc_Array_Get_Item_2;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InButtonIndex;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  K2Node_CustomEvent_bInSelectable;                  // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Get_Item_3;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_2;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_Sub_Line_Btn_C*             CallFunc_Array_Get_Item_4;                         // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_Line_Btn_C*             CallFunc_Array_Get_Item_5;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable;                                // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable_1;                              // 0x0107(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_6;                         // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              K2Node_Select_Default;                             // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow) == 0x000008, "Wrong alignment on WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow");
static_assert(sizeof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow) == 0x000110, "Wrong size on WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, EntryPoint) == 0x000000, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, K2Node_CustomEvent_InButtonText_1) == 0x000018, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::K2Node_CustomEvent_InButtonText_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, K2Node_CustomEvent_bInButtonSelectable) == 0x000028, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::K2Node_CustomEvent_bInButtonSelectable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_CreateButtonsPanel_ReturnValue) == 0x000038, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_CreateButtonsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_MakeLiteralBool_ReturnValue) == 0x000044, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_MakeLiteralInt_ReturnValue) == 0x000048, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, Temp_int_Loop_Counter_Variable_1) == 0x00004C, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, K2Node_CustomEvent_InButtonNum) == 0x000054, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::K2Node_CustomEvent_InButtonNum' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, K2Node_CustomEvent_InButtonText) == 0x000058, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::K2Node_CustomEvent_InButtonText' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, K2Node_MakeArray_Array) == 0x000068, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Length_ReturnValue_2) == 0x00008C, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000091, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, Temp_int_Array_Index_Variable_2) == 0x000094, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000A0, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, Temp_int_Loop_Counter_Variable_2) == 0x0000A4, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Get_Item_2) == 0x0000A8, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Length_ReturnValue_3) == 0x0000B0, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B4, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000B8, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_IsNotEmpty_ReturnValue_1) == 0x0000BC, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_IsNotEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, K2Node_CustomEvent_InButtonIndex) == 0x0000C0, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::K2Node_CustomEvent_InButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, Temp_int_Loop_Counter_Variable_3) == 0x0000C4, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, K2Node_CustomEvent_bInSelectable) == 0x0000C8, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::K2Node_CustomEvent_bInSelectable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Get_Item_3) == 0x0000D8, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Length_ReturnValue_4) == 0x0000DC, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_IsNotEmpty_ReturnValue_2) == 0x0000E0, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_IsNotEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000E1, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000E2, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000E4, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, Temp_int_Array_Index_Variable_3) == 0x0000E8, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Get_Item_4) == 0x0000F0, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Get_Item_5) == 0x0000F8, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Add_ReturnValue) == 0x000100, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000104, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Less_IntInt_ReturnValue_4) == 0x000105, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, Temp_byte_Variable) == 0x000106, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, Temp_byte_Variable_1) == 0x000107, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, Temp_bool_Variable) == 0x000108, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, CallFunc_Array_Get_Item_6) == 0x000109, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow, K2Node_Select_Default) == 0x00010A, "Member 'WBP_Friend_SmallWindow_C_ExecuteUbergraph_WBP_Friend_SmallWindow::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Friend_SmallWindow.WBP_Friend_SmallWindow_C.InitializeButtons
// 0x0004 (0x0004 - 0x0000)
struct WBP_Friend_SmallWindow_C_InitializeButtons final
{
public:
	int32                                         InButtonNum;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SmallWindow_C_InitializeButtons) == 0x000004, "Wrong alignment on WBP_Friend_SmallWindow_C_InitializeButtons");
static_assert(sizeof(WBP_Friend_SmallWindow_C_InitializeButtons) == 0x000004, "Wrong size on WBP_Friend_SmallWindow_C_InitializeButtons");
static_assert(offsetof(WBP_Friend_SmallWindow_C_InitializeButtons, InButtonNum) == 0x000000, "Member 'WBP_Friend_SmallWindow_C_InitializeButtons::InButtonNum' has a wrong offset!");

// Function WBP_Friend_SmallWindow.WBP_Friend_SmallWindow_C.OnFocusReceived
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_Friend_SmallWindow_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_Sub_Line_Btn_C*             CallFunc_Array_Get_Item;                           // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SmallWindow_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Friend_SmallWindow_C_OnFocusReceived");
static_assert(sizeof(WBP_Friend_SmallWindow_C_OnFocusReceived) == 0x0001C8, "Wrong size on WBP_Friend_SmallWindow_C_OnFocusReceived");
static_assert(offsetof(WBP_Friend_SmallWindow_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Friend_SmallWindow_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Friend_SmallWindow_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Friend_SmallWindow_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'WBP_Friend_SmallWindow_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_OnFocusReceived, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0001B0, "Member 'WBP_Friend_SmallWindow_C_OnFocusReceived::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_OnFocusReceived, CallFunc_Array_Get_Item) == 0x0001B8, "Member 'WBP_Friend_SmallWindow_C_OnFocusReceived::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_OnFocusReceived, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0001C0, "Member 'WBP_Friend_SmallWindow_C_OnFocusReceived::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WBP_Friend_SmallWindow.WBP_Friend_SmallWindow_C.Set Button Navigation
// 0x0058 (0x0058 - 0x0000)
struct WBP_Friend_SmallWindow_C_Set_Button_Navigation final
{
public:
	int32                                         LocalPrevIndex;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalNextIndex;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_Line_Btn_C*             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_Sub_Line_Btn_C*             CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_Line_Btn_C*             CallFunc_Array_Get_Item_2;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SmallWindow_C_Set_Button_Navigation) == 0x000008, "Wrong alignment on WBP_Friend_SmallWindow_C_Set_Button_Navigation");
static_assert(sizeof(WBP_Friend_SmallWindow_C_Set_Button_Navigation) == 0x000058, "Wrong size on WBP_Friend_SmallWindow_C_Set_Button_Navigation");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, LocalPrevIndex) == 0x000000, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::LocalPrevIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, LocalNextIndex) == 0x000004, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::LocalNextIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, Temp_bool_True_if_break_was_hit_Variable) == 0x000024, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Not_PreBool_ReturnValue) == 0x000025, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Array_Get_Item_2) == 0x000030, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_BooleanAND_ReturnValue) == 0x00003D, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000044, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Add_IntInt_ReturnValue_2) == 0x000048, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Percent_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Set_Button_Navigation, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_Friend_SmallWindow_C_Set_Button_Navigation::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_Friend_SmallWindow.WBP_Friend_SmallWindow_C.SetButtonSelectable
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_SmallWindow_C_SetButtonSelectable final
{
public:
	TArray<bool>                                  bInSelectable;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Friend_SmallWindow_C_SetButtonSelectable) == 0x000008, "Wrong alignment on WBP_Friend_SmallWindow_C_SetButtonSelectable");
static_assert(sizeof(WBP_Friend_SmallWindow_C_SetButtonSelectable) == 0x000010, "Wrong size on WBP_Friend_SmallWindow_C_SetButtonSelectable");
static_assert(offsetof(WBP_Friend_SmallWindow_C_SetButtonSelectable, bInSelectable) == 0x000000, "Member 'WBP_Friend_SmallWindow_C_SetButtonSelectable::bInSelectable' has a wrong offset!");

// Function WBP_Friend_SmallWindow.WBP_Friend_SmallWindow_C.SetButtonText
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_SmallWindow_C_SetButtonText final
{
public:
	TArray<class FText>                           InButtonText;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Friend_SmallWindow_C_SetButtonText) == 0x000008, "Wrong alignment on WBP_Friend_SmallWindow_C_SetButtonText");
static_assert(sizeof(WBP_Friend_SmallWindow_C_SetButtonText) == 0x000010, "Wrong size on WBP_Friend_SmallWindow_C_SetButtonText");
static_assert(offsetof(WBP_Friend_SmallWindow_C_SetButtonText, InButtonText) == 0x000000, "Member 'WBP_Friend_SmallWindow_C_SetButtonText::InButtonText' has a wrong offset!");

// Function WBP_Friend_SmallWindow.WBP_Friend_SmallWindow_C.SetFocusButtonIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_Friend_SmallWindow_C_SetFocusButtonIndex final
{
public:
	int32                                         InButtonIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SmallWindow_C_SetFocusButtonIndex) == 0x000004, "Wrong alignment on WBP_Friend_SmallWindow_C_SetFocusButtonIndex");
static_assert(sizeof(WBP_Friend_SmallWindow_C_SetFocusButtonIndex) == 0x000004, "Wrong size on WBP_Friend_SmallWindow_C_SetFocusButtonIndex");
static_assert(offsetof(WBP_Friend_SmallWindow_C_SetFocusButtonIndex, InButtonIndex) == 0x000000, "Member 'WBP_Friend_SmallWindow_C_SetFocusButtonIndex::InButtonIndex' has a wrong offset!");

// Function WBP_Friend_SmallWindow.WBP_Friend_SmallWindow_C.Setup
// 0x0020 (0x0020 - 0x0000)
struct WBP_Friend_SmallWindow_C_Setup final
{
public:
	TArray<class FText>                           InButtonText;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<bool>                                  bInButtonSelectable;                               // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Friend_SmallWindow_C_Setup) == 0x000008, "Wrong alignment on WBP_Friend_SmallWindow_C_Setup");
static_assert(sizeof(WBP_Friend_SmallWindow_C_Setup) == 0x000020, "Wrong size on WBP_Friend_SmallWindow_C_Setup");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Setup, InButtonText) == 0x000000, "Member 'WBP_Friend_SmallWindow_C_Setup::InButtonText' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SmallWindow_C_Setup, bInButtonSelectable) == 0x000010, "Member 'WBP_Friend_SmallWindow_C_Setup::bInButtonSelectable' has a wrong offset!");

}

