#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_CMN_Window

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Friend_CMN_Window.WBP_Friend_CMN_Window_C
// 0x0078 (0x05E8 - 0x0570)
class UWBP_Friend_CMN_Window_C final : public UFriendListMainWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Line_01;                                      // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Line_02;                                      // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseWindow;                                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TabDecoration;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Friend_Sub_AddFriend_C*            WBP_Friend_Sub_AddFriend;                          // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Friend_Sub_AllScroll_C*            WBP_Friend_Sub_AllScroll;                          // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Friend_Sub_LobbyInvitation_C*      WBP_Friend_Sub_LobbyInvitation;                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Tab_C*           WBP_FriendList_Tab;                                // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Sub_FriendList_MyStatus_C*         WBP_Sub_FriendList_MyStatus;                       // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_System_Sub_LoadingSonic_C*         WBP_System_Sub_LoadingSonic;                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_FriendList;                         // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuInputRecieveObject*                MenuInputReceiveObject;                            // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShoulderRPressed;                                 // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeCategoryDisplay(EFriendListCategory InCategory, bool bInDataCommunicationDisplay);
	void ChangeTabWidgetCategory(EFriendListCategory InCategory);
	void ClearContentsWidgetListPlayerInfo(EFriendListCategory InCategory);
	void Construct();
	void DestroyConfirmAnimationWidget();
	void ExecuteUbergraph_WBP_Friend_CMN_Window(int32 EntryPoint);
	void ListDirectionEvent(EUnionUIControlDir Direction, class UUnionUIButtonBase* Button, TArray<class UWBP_Friend_Sub_PlayerPlate_Small_C*>& PlateWidgetArray);
	void OnBackKeyPressedEvent(class UObject* Object);
	void OnErrorPopupWindowEnd();
	void OnFaceKeyPressedEvent(class UObject* Object);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnFriendListCommandSuccess(EFriendListCommandType InCommandType);
	void OnInvitationWarningWindowEnd();
	void OnLeftShoulderKeyPressedEvent(class UObject* Object);
	void OnLobbyIdSearchSuccess(const TArray<struct FCommon_UserSearchData>& InUserSearchData, const TArray<struct FLobbyId>& InLobbyIdData, ELobbyType InLobbyType);
	void OnRightShoulderKeyPressedEvent(class UObject* Object);
	void OnShowPfProfileErrorWindowEnd();
	void OnSubWidgetDisplayEnd(EFriendListCommandType PrevWidgetCommandType);
	void OnTabClicked(EMachineCustomizeTabID InTabID);
	void OnUserSearchSuccess(const TArray<struct FCommon_UserSearchData>& InUserSearchData);
	void OnWaitWindowEnd();
	void ReflectOnlineSettingData();
	void RegisterMenuInputReceiveObject();
	void SetActiveWidgetIndexByCategory(EFriendListCategory InCategory);
	void SetButtonControlEnableCurrentWidget(bool bInEnanle);
	void SetCategoryNewIconVisible(EFriendListCategory InCategory, bool bInVisible);
	void SetDataCommunicationDisplay();
	void SetMenuInputReceiveObject();
	void SetMyListPlayerInfo(const struct FFriendListPlayerInfo& InListPlayerInfo);
	void SetMyPlayerEmpty();
	void SetMyPlayerIcon(const TSoftObjectPtr<class UTexture2D>& InIconTexture, const struct FLinearColor& InBgColor);
	void SetScrollBoxVisibility(ESlateVisibility Param);
	void SetupDataCommunicationDisplay();
	void SetupInsideListWidget(EFriendListCategory InCategory);
	void SetupTabWidget(ECrossplayPlatform InPlatformType);
	void SetWidgetFocus(class APlayerController* PlayerController);
	EFriendListCategory TabIDToCategory(EMachineCustomizeTabID Index_0);
	void UnregisterMenuInputReceiveObject();
	void UpdateFriendList(const TArray<struct FFriendListPlayerInfo>& ListPlayerInfo, bool InDataError);
	void UpdateLobbyIdDisplay(const class FString& InShortLobbyId, bool bInSuccess);
	void UpdateOnlineSettingList(const TArray<struct FFriendListOnlineSettingData>& InOnlineSettingData, bool InDataError);
	void UpdateRecentPlayerList(const TArray<struct FFriendListPlayerInfo>& ListPlayerInfo, bool InDataError);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Friend_CMN_Window_C">();
	}
	static class UWBP_Friend_CMN_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Friend_CMN_Window_C>();
	}
};
static_assert(alignof(UWBP_Friend_CMN_Window_C) == 0x000008, "Wrong alignment on UWBP_Friend_CMN_Window_C");
static_assert(sizeof(UWBP_Friend_CMN_Window_C) == 0x0005E8, "Wrong size on UWBP_Friend_CMN_Window_C");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, UberGraphFrame) == 0x000570, "Member 'UWBP_Friend_CMN_Window_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, base) == 0x000578, "Member 'UWBP_Friend_CMN_Window_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, Base_Line_01) == 0x000580, "Member 'UWBP_Friend_CMN_Window_C::Base_Line_01' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, Base_Line_02) == 0x000588, "Member 'UWBP_Friend_CMN_Window_C::Base_Line_02' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, BaseWindow) == 0x000590, "Member 'UWBP_Friend_CMN_Window_C::BaseWindow' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, TabDecoration) == 0x000598, "Member 'UWBP_Friend_CMN_Window_C::TabDecoration' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, WBP_Friend_Sub_AddFriend) == 0x0005A0, "Member 'UWBP_Friend_CMN_Window_C::WBP_Friend_Sub_AddFriend' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, WBP_Friend_Sub_AllScroll) == 0x0005A8, "Member 'UWBP_Friend_CMN_Window_C::WBP_Friend_Sub_AllScroll' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, WBP_Friend_Sub_LobbyInvitation) == 0x0005B0, "Member 'UWBP_Friend_CMN_Window_C::WBP_Friend_Sub_LobbyInvitation' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, WBP_FriendList_Tab) == 0x0005B8, "Member 'UWBP_Friend_CMN_Window_C::WBP_FriendList_Tab' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, WBP_Sub_FriendList_MyStatus) == 0x0005C0, "Member 'UWBP_Friend_CMN_Window_C::WBP_Sub_FriendList_MyStatus' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, WBP_System_Sub_LoadingSonic) == 0x0005C8, "Member 'UWBP_Friend_CMN_Window_C::WBP_System_Sub_LoadingSonic' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, WidgetSwitcher_FriendList) == 0x0005D0, "Member 'UWBP_Friend_CMN_Window_C::WidgetSwitcher_FriendList' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, MenuInputReceiveObject) == 0x0005D8, "Member 'UWBP_Friend_CMN_Window_C::MenuInputReceiveObject' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_CMN_Window_C, bShoulderRPressed) == 0x0005E0, "Member 'UWBP_Friend_CMN_Window_C::bShoulderRPressed' has a wrong offset!");

}

