#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Window_Sub_Option

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Window_Sub_Option.WBP_Window_Sub_Option_C
// 0x0068 (0x04E8 - 0x0480)
class UWBP_Window_Sub_Option_C final : public UUnionUIButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_Loop;                                       // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Loop;                                       // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DSP_TSR;                                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_OptionPict;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_OptionToggleBtn;                               // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TXT_OptionType;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x04C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4C5[0x3];                                      // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TypeText;                                          // 0x04C8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class AMenuPlayerController*                  OwnerPlayerController;                             // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LastFocusAnim;                                     // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Cancel();
	void Construct();
	void Decide();
	void ExecuteUbergraph_WBP_Window_Sub_Option(int32 EntryPoint);
	class UWidget* NavigationLeft(EUINavigation Navigation_0);
	class UWidget* NavigationRight(EUINavigation Navigation_0);
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnFocusImpl();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnFocusLostImpl();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void PlayAnimationLoop();
	void PlaySEDecide();
	void PlaySEFocus();
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& TypeText_0);
	void SetToggleBtn(bool bEnable);
	void SetupIcon();
	void SetupTSR();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Window_Sub_Option_C">();
	}
	static class UWBP_Window_Sub_Option_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Window_Sub_Option_C>();
	}
};
static_assert(alignof(UWBP_Window_Sub_Option_C) == 0x000008, "Wrong alignment on UWBP_Window_Sub_Option_C");
static_assert(sizeof(UWBP_Window_Sub_Option_C) == 0x0004E8, "Wrong size on UWBP_Window_Sub_Option_C");
static_assert(offsetof(UWBP_Window_Sub_Option_C, UberGraphFrame) == 0x000480, "Member 'UWBP_Window_Sub_Option_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Window_Sub_Option_C, Select_Loop) == 0x000488, "Member 'UWBP_Window_Sub_Option_C::Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Window_Sub_Option_C, Active_Loop) == 0x000490, "Member 'UWBP_Window_Sub_Option_C::Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Window_Sub_Option_C, DSP_TSR) == 0x000498, "Member 'UWBP_Window_Sub_Option_C::DSP_TSR' has a wrong offset!");
static_assert(offsetof(UWBP_Window_Sub_Option_C, MouseInteraction) == 0x0004A0, "Member 'UWBP_Window_Sub_Option_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_Window_Sub_Option_C, PAT_OptionPict) == 0x0004A8, "Member 'UWBP_Window_Sub_Option_C::PAT_OptionPict' has a wrong offset!");
static_assert(offsetof(UWBP_Window_Sub_Option_C, PAT_OptionToggleBtn) == 0x0004B0, "Member 'UWBP_Window_Sub_Option_C::PAT_OptionToggleBtn' has a wrong offset!");
static_assert(offsetof(UWBP_Window_Sub_Option_C, TXT_OptionType) == 0x0004B8, "Member 'UWBP_Window_Sub_Option_C::TXT_OptionType' has a wrong offset!");
static_assert(offsetof(UWBP_Window_Sub_Option_C, Index_0) == 0x0004C0, "Member 'UWBP_Window_Sub_Option_C::Index_0' has a wrong offset!");
static_assert(offsetof(UWBP_Window_Sub_Option_C, Enable) == 0x0004C4, "Member 'UWBP_Window_Sub_Option_C::Enable' has a wrong offset!");
static_assert(offsetof(UWBP_Window_Sub_Option_C, TypeText) == 0x0004C8, "Member 'UWBP_Window_Sub_Option_C::TypeText' has a wrong offset!");
static_assert(offsetof(UWBP_Window_Sub_Option_C, OwnerPlayerController) == 0x0004D8, "Member 'UWBP_Window_Sub_Option_C::OwnerPlayerController' has a wrong offset!");
static_assert(offsetof(UWBP_Window_Sub_Option_C, LastFocusAnim) == 0x0004E0, "Member 'UWBP_Window_Sub_Option_C::LastFocusAnim' has a wrong offset!");

}

