#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyRace_Sub_Option_Finalconfirm

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C
// 0x00E0 (0x04F0 - 0x0410)
class UWBP_PartyRace_Sub_Option_Finalconfirm_C final : public UPartyRaceConfirmScene
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Window_Base;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Window_Base_Outline;                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_21;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton_37;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_PresetIcon;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_PresetName;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Title_RuleEdit;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_OptionBtn_C*         WBP_PartyRace_Sub_Option_Btn_ItemSwitch;           // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_Option_Btn_OK_C*     WBP_PartyRace_Sub_Option_Btn_OK;                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_OptionBtn_C*         WBP_PartyRace_Sub_Option_Btn_RuleSetting;          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_OptionBtn_C*         WBP_PartyRace_Sub_Option_Btn_TeavelCouseSwitch;    // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_Option_Line_C*       WBP_PartyRace_Sub_Option_Line_Group;               // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_Option_Line_C*       WBP_PartyRace_Sub_Option_Line_Speed;               // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LastPanelIndex;                                    // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFirstFocus;                                       // 0x0494(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_495[0x3];                                      // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     ItemSwitchOrSettingDetail;                         // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<EPartyRacePreset, struct FPartyRacePresetSetting> PresetName_Value;                         // 0x04A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	class UWidget* CalcFocusToSetting3Menu(EUINavigation Navigation_0);
	void Construct();
	void CustomEvent(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void DoCustomNavigation(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm(int32 EntryPoint);
	void GuestEvent();
	void OnFocusCourseSwitch(class UUnionUIButtonBase* Button);
	void OnFocusEvent_Event(class UUnionUIButtonBase* Button);
	void OnFocusItemSwitch(class UUnionUIButtonBase* Button);
	void OnFocusRaceSetting(class UUnionUIButtonBase* Button);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnOkFocus(class UUnionUIButtonBase* Button);
	void SetPresetName(const class FText& InText);
	void SetPresetSettingValue(const TMap<EPartyRacePreset, struct FPartyRacePresetSetting>& PresetName_Value_0);
	void SetPresetType(EPartyRacePreset InPreset);
	void SetRomMode(bool Default);
	void SetSpeedClassSelect(int32 Index_0);
	class UWidget* ToFocusOKNavigationEvent(EUINavigation Navigation_0);
	class UWidget* UpFromItemSwitch(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyRace_Sub_Option_Finalconfirm_C">();
	}
	static class UWBP_PartyRace_Sub_Option_Finalconfirm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyRace_Sub_Option_Finalconfirm_C>();
	}
};
static_assert(alignof(UWBP_PartyRace_Sub_Option_Finalconfirm_C) == 0x000008, "Wrong alignment on UWBP_PartyRace_Sub_Option_Finalconfirm_C");
static_assert(sizeof(UWBP_PartyRace_Sub_Option_Finalconfirm_C) == 0x0004F0, "Wrong size on UWBP_PartyRace_Sub_Option_Finalconfirm_C");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, UberGraphFrame) == 0x000410, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, BG) == 0x000418, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, BG_Window_Base) == 0x000420, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::BG_Window_Base' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, BG_Window_Base_Outline) == 0x000428, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::BG_Window_Base_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, CanvasPanel_21) == 0x000430, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::CanvasPanel_21' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, OutOfContentButton_37) == 0x000438, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::OutOfContentButton_37' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, PAT_PresetIcon) == 0x000440, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::PAT_PresetIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, SafeZone) == 0x000448, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, TXT_PresetName) == 0x000450, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::TXT_PresetName' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, TXT_Title_RuleEdit) == 0x000458, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::TXT_Title_RuleEdit' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, WBP_PartyRace_Sub_Option_Btn_ItemSwitch) == 0x000460, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::WBP_PartyRace_Sub_Option_Btn_ItemSwitch' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, WBP_PartyRace_Sub_Option_Btn_OK) == 0x000468, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::WBP_PartyRace_Sub_Option_Btn_OK' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, WBP_PartyRace_Sub_Option_Btn_RuleSetting) == 0x000470, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::WBP_PartyRace_Sub_Option_Btn_RuleSetting' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, WBP_PartyRace_Sub_Option_Btn_TeavelCouseSwitch) == 0x000478, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::WBP_PartyRace_Sub_Option_Btn_TeavelCouseSwitch' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, WBP_PartyRace_Sub_Option_Line_Group) == 0x000480, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::WBP_PartyRace_Sub_Option_Line_Group' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, WBP_PartyRace_Sub_Option_Line_Speed) == 0x000488, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::WBP_PartyRace_Sub_Option_Line_Speed' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, LastPanelIndex) == 0x000490, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::LastPanelIndex' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, bFirstFocus) == 0x000494, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::bFirstFocus' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, ItemSwitchOrSettingDetail) == 0x000498, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::ItemSwitchOrSettingDetail' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Finalconfirm_C, PresetName_Value) == 0x0004A0, "Member 'UWBP_PartyRace_Sub_Option_Finalconfirm_C::PresetName_Value' has a wrong offset!");

}

