#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_Sticker_PresetWindow

#include "Basic.hpp"

#include "UnionUI_structs.hpp"
#include "ST_StickerPresetPageItemData_structs.hpp"


namespace SDK::Params
{

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.BuildNavigation
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation final
{
public:
	bool                                          bInWrapLeftRight;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSimpleCustom;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemNumInRow_Value;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_StickerPresetPageItemData          CallFunc_GetItemData_ItemData;                     // 0x0050(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUnionUIControlDir InDirection, class UUnionUIButtonBase* InButton, int32 InRowIndex, int32 InColumnIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EUnionUIControlDir InDirection, class UUnionUIButtonBase* InButton, int32 InRowIndex, int32 InColumnIndex)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation");
static_assert(sizeof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation) == 0x0000C8, "Wrong size on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, bInWrapLeftRight) == 0x000000, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::bInWrapLeftRight' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, IsSimpleCustom) == 0x000001, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::IsSimpleCustom' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, CallFunc_GetItemNumInRow_Value) == 0x000010, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::CallFunc_GetItemNumInRow_Value' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, CallFunc_Divide_IntInt_ReturnValue) == 0x000014, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, CallFunc_Percent_IntInt_ReturnValue) == 0x000028, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon) == 0x000040, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, CallFunc_GetItemData_ItemData) == 0x000050, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::CallFunc_GetItemData_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A0, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, K2Node_CreateDelegate_OutputDelegate) == 0x0000A4, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B4, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_BuildNavigation::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.ExecuteUbergraph_WBP_MachineCustom_Sub_Sticker_PresetWindow
// 0x0010 (0x0010 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_ExecuteUbergraph_WBP_MachineCustom_Sub_Sticker_PresetWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIGridNavigationBuilder*          CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_ExecuteUbergraph_WBP_MachineCustom_Sub_Sticker_PresetWindow) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_ExecuteUbergraph_WBP_MachineCustom_Sub_Sticker_PresetWindow");
static_assert(sizeof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_ExecuteUbergraph_WBP_MachineCustom_Sub_Sticker_PresetWindow) == 0x000010, "Wrong size on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_ExecuteUbergraph_WBP_MachineCustom_Sub_Sticker_PresetWindow");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_ExecuteUbergraph_WBP_MachineCustom_Sub_Sticker_PresetWindow, EntryPoint) == 0x000000, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_ExecuteUbergraph_WBP_MachineCustom_Sub_Sticker_PresetWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_ExecuteUbergraph_WBP_MachineCustom_Sub_Sticker_PresetWindow, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_ExecuteUbergraph_WBP_MachineCustom_Sub_Sticker_PresetWindow::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.GridNavigationBuilder_OnSideNavigationCustom
// 0x0018 (0x0018 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom final
{
public:
	EUnionUIControlDir                            InDirection;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     InButton;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         InRowIndex;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InColumnIndex;                                     // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom");
static_assert(sizeof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom) == 0x000018, "Wrong size on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom, InDirection) == 0x000000, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom::InDirection' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom, InButton) == 0x000008, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom::InButton' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom, InRowIndex) == 0x000010, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom::InRowIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom, InColumnIndex) == 0x000014, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_GridNavigationBuilder_OnSideNavigationCustom::InColumnIndex' has a wrong offset!");

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.HideBalloon
// 0x0048 (0x0048 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon");
static_assert(sizeof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon) == 0x000048, "Wrong size on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon) == 0x000038, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_HideBalloon::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.Item on Left Shoulder
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Left_Shoulder final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Left_Shoulder) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Left_Shoulder");
static_assert(sizeof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Left_Shoulder) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Left_Shoulder");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Left_Shoulder, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Left_Shoulder::Button' has a wrong offset!");

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.Item on Right Shoulder
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Right_Shoulder final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Right_Shoulder) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Right_Shoulder");
static_assert(sizeof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Right_Shoulder) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Right_Shoulder");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Right_Shoulder, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_on_Right_Shoulder::Button' has a wrong offset!");

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.Item_OnCancel
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnCancel final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnCancel) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnCancel");
static_assert(sizeof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnCancel) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnCancel");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnCancel, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnCancel::InButton' has a wrong offset!");

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.Item_OnDecision
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     Button;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDonpaTicket_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_StickerPresetPageItemData          CallFunc_GetItemData_ItemData;                     // 0x0058(0x0050)(HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision");
static_assert(sizeof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision) == 0x0000B0, "Wrong size on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::InButton' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, Button) == 0x000008, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::Button' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, CallFunc_GetDonpaTicket_ReturnValue) == 0x00001C, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::CallFunc_GetDonpaTicket_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, CallFunc_GetChildIndex_ReturnValue) == 0x000020, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon) == 0x000048, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000052, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, CallFunc_GetItemData_ItemData) == 0x000058, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::CallFunc_GetItemData_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000A8, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A9, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000AA, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnDecision::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.Item_OnFocused
// 0x0058 (0x0058 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon_1; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused");
static_assert(sizeof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused) == 0x000058, "Wrong size on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused::InButton' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon) == 0x000008, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon_1) == 0x000040, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_Item_OnFocused::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.PlayPurchaseAnim
// 0x0020 (0x0020 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim final
{
public:
	int32                                         InItemIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim");
static_assert(sizeof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim) == 0x000020, "Wrong size on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim, InItemIndex) == 0x000000, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim::InItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon) == 0x000010, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_PlayPurchaseAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.SetButtonsPanel
// 0x0058 (0x0058 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel final
{
public:
	class UUnionUIButtonsPanel*                   InButtonsPanel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   ButtonPanel;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel");
static_assert(sizeof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel) == 0x000058, "Wrong size on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel, InButtonsPanel) == 0x000000, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel::InButtonsPanel' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel, ButtonPanel) == 0x000008, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel::ButtonPanel' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon) == 0x000048, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetButtonsPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.SetItems
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems final
{
public:
	TArray<struct FST_StickerPresetPageItemData>  InItemDataList;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_StickerPresetPageItemData          CallFunc_Array_Get_Item;                           // 0x0028(0x0050)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon_1; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems");
static_assert(sizeof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems) == 0x0000D0, "Wrong size on WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, InItemDataList) == 0x000000, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::InItemDataList' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, CallFunc_GetChildAt_ReturnValue) == 0x000080, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon) == 0x000088, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, CallFunc_GetAllChildren_ReturnValue) == 0x000098, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B8, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon_1) == 0x0000C0, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetItems::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C.SetupItems
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_MachineCustom_Sub_Sticker_PresetWindow_C_SetupItems final
{
public:
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* Icon;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;          // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemNumInRow_Value;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_2;        // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_3;        // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_5;        // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
