#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyRace_Sub_Option_Finalconfirm

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.CalcFocusToSetting3Menu
// 0x0020 (0x0020 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPartyRaceConfirmButton                       Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu) == 0x000020, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu, Navigation_0) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu, ReturnValue) == 0x000008, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu, Temp_byte_Variable) == 0x000010, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu, K2Node_Select_Default) == 0x000018, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_CalcFocusToSetting3Menu::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.CustomEvent
// 0x0010 (0x0010 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_CustomEvent final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_CustomEvent) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_CustomEvent");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_CustomEvent) == 0x000010, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_CustomEvent");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_CustomEvent, Button) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_CustomEvent::Button' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_CustomEvent, ButtonIndex) == 0x000008, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_CustomEvent::ButtonIndex' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.DoCustomNavigation
// 0x0001 (0x0001 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_DoCustomNavigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_DoCustomNavigation) == 0x000001, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_DoCustomNavigation");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_DoCustomNavigation) == 0x000001, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_DoCustomNavigation");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_DoCustomNavigation, Navigation_0) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_DoCustomNavigation::Navigation_0' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm
// 0x0158 (0x0158 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0004(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0008(0x0004)()
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;          // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x001C(0x0004)()
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_5;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_4;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_3;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_2;        // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_3;                  // 0x0088(0x0004)()
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SelectedIndex)>          K2Node_CreateDelegate_OutputDelegate_3;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SelectedIndex)>          K2Node_CreateDelegate_OutputDelegate_4;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPartyRaceSubOptionBtn*                 CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InText;                               // 0x00D8(0x0010)(ConstParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPartyRaceSubOptionBtn*>         K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_5;        // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_6;        // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0130(0x0010)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   CallFunc_SpawnObject_ReturnValue;                  // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm) == 0x000158, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, EntryPoint) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_SoundPlay_ReturnValue) == 0x000004, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_SoundPlay_ReturnValue_1) == 0x000008, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_SoundPlay_ReturnValue_2) == 0x00001C, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_MakeLiteralByte_ReturnValue) == 0x000030, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000031, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CustomEvent_Button_5) == 0x000038, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CustomEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CustomEvent_Button_4) == 0x000040, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CustomEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, Temp_int_Variable) == 0x000048, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CustomEvent_Button_3) == 0x000050, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CustomEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CustomEvent_ButtonIndex) == 0x000058, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CreateDelegate_OutputDelegate_2) == 0x00005C, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00006D, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_Select_Default) == 0x000078, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_SoundPlay_ReturnValue_3) == 0x000088, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_SoundPlay_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CustomEvent_Button_2) == 0x000090, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CreateDelegate_OutputDelegate_3) == 0x000098, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A8, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0000B8, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000B9, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CustomEvent_Button_1) == 0x0000C0, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, Temp_int_Array_Index_Variable) == 0x0000C8, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_Event_InText) == 0x0000D8, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0000E8, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_MakeArray_Array) == 0x0000F0, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000100, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CustomEvent_Button) == 0x000108, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CreateDelegate_OutputDelegate_5) == 0x000110, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, K2Node_CreateDelegate_OutputDelegate_6) == 0x000120, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_MakeLiteralText_ReturnValue) == 0x000130, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000140, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_SpawnObject_ReturnValue) == 0x000148, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x000150, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ExecuteUbergraph_WBP_PartyRace_Sub_Option_Finalconfirm::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.OnFocusCourseSwitch
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusCourseSwitch final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusCourseSwitch) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusCourseSwitch");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusCourseSwitch) == 0x000008, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusCourseSwitch");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusCourseSwitch, Button) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusCourseSwitch::Button' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.OnFocusEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusEvent_Event final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusEvent_Event) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusEvent_Event");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusEvent_Event) == 0x000008, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusEvent_Event");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusEvent_Event, Button) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusEvent_Event::Button' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.OnFocusItemSwitch
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusItemSwitch final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusItemSwitch) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusItemSwitch");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusItemSwitch) == 0x000008, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusItemSwitch");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusItemSwitch, Button) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusItemSwitch::Button' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.OnFocusRaceSetting
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusRaceSetting final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusRaceSetting) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusRaceSetting");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusRaceSetting) == 0x000008, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusRaceSetting");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusRaceSetting, Button) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusRaceSetting::Button' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.OnFocusReceived
// 0x01E0 (0x01E0 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetLastFocusedButton_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPartyRaceSubOptionBtn*                 CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0128(0x00B8)()
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived) == 0x0001E0, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived, CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex) == 0x0000FC, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived::CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived, CallFunc_GetLastFocusedButton_ReturnValue) == 0x000100, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived::CallFunc_GetLastFocusedButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived, CallFunc_IsValid_ReturnValue_1) == 0x000108, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived, CallFunc_Array_Get_Item) == 0x000110, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived, CallFunc_GetPlayerController_ReturnValue) == 0x000118, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived, CallFunc_GetPlayerController_ReturnValue_1) == 0x000120, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x000128, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.OnOkFocus
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_OnOkFocus final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnOkFocus) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_OnOkFocus");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnOkFocus) == 0x000008, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_OnOkFocus");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_OnOkFocus, Button) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_OnOkFocus::Button' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.SetPresetName
// 0x0010 (0x0010 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetName final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetName) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetName");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetName) == 0x000010, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetName");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetName, InText) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetName::InText' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.SetPresetSettingValue
// 0x0050 (0x0050 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetSettingValue final
{
public:
	TMap<EPartyRacePreset, struct FPartyRacePresetSetting> PresetName_Value_0;                       // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetSettingValue) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetSettingValue");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetSettingValue) == 0x000050, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetSettingValue");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetSettingValue, PresetName_Value_0) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetSettingValue::PresetName_Value_0' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.SetPresetType
// 0x0120 (0x0120 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType final
{
public:
	EPartyRacePreset                              InPreset;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRacePreset                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_8;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_9;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_10;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_11;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_12;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_13;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_14;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_15;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_16;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_17;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPartyRacePresetSetting                CallFunc_Map_Find_Value;                           // 0x0060(0x00B8)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType) == 0x000120, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, InPreset) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::InPreset' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_byte_Variable) == 0x000001, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable) == 0x000004, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_1) == 0x000008, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_2) == 0x00000C, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_3) == 0x000010, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_4) == 0x000014, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_5) == 0x000018, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_6) == 0x00001C, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_7) == 0x000020, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_8) == 0x000024, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_9) == 0x000028, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_10) == 0x00002C, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_11) == 0x000030, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_12) == 0x000034, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_13) == 0x000038, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_14) == 0x00003C, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_15) == 0x000040, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_16) == 0x000044, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, Temp_real_Variable_17) == 0x000048, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::Temp_real_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, K2Node_Select_Default) == 0x000058, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, CallFunc_Map_Find_Value) == 0x000060, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType, CallFunc_Map_Find_ReturnValue) == 0x000118, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetPresetType::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.SetRomMode
// 0x0034 (0x0034 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode final
{
public:
	bool                                          Default;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemSwitchSettingMenuEnable_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_2;                  // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode) == 0x000004, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode) == 0x000034, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode, Default) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode::Default' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode, CallFunc_IsItemSwitchSettingMenuEnable_ReturnValue) == 0x000001, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode::CallFunc_IsItemSwitchSettingMenuEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode, CallFunc_MakeColor_ReturnValue) == 0x000004, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode, CallFunc_MakeColor_ReturnValue_1) == 0x000014, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode, CallFunc_MakeColor_ReturnValue_2) == 0x000024, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetRomMode::CallFunc_MakeColor_ReturnValue_2' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.SetSpeedClassSelect
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect) == 0x000004, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect) == 0x000008, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect, Index_0) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect, CallFunc_Conv_IntToByte_ReturnValue) == 0x000004, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000005, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000006, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_SetSpeedClassSelect::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.ToFocusOKNavigationEvent
// 0x0010 (0x0010 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_ToFocusOKNavigationEvent final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ToFocusOKNavigationEvent) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_ToFocusOKNavigationEvent");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ToFocusOKNavigationEvent) == 0x000010, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_ToFocusOKNavigationEvent");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ToFocusOKNavigationEvent, Navigation_0) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ToFocusOKNavigationEvent::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_ToFocusOKNavigationEvent, ReturnValue) == 0x000008, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_ToFocusOKNavigationEvent::ReturnValue' has a wrong offset!");

// Function WBP_PartyRace_Sub_Option_Finalconfirm.WBP_PartyRace_Sub_Option_Finalconfirm_C.UpFromItemSwitch
// 0x0010 (0x0010 - 0x0000)
struct WBP_PartyRace_Sub_Option_Finalconfirm_C_UpFromItemSwitch final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_Sub_Option_Finalconfirm_C_UpFromItemSwitch) == 0x000008, "Wrong alignment on WBP_PartyRace_Sub_Option_Finalconfirm_C_UpFromItemSwitch");
static_assert(sizeof(WBP_PartyRace_Sub_Option_Finalconfirm_C_UpFromItemSwitch) == 0x000010, "Wrong size on WBP_PartyRace_Sub_Option_Finalconfirm_C_UpFromItemSwitch");
static_assert(offsetof(WBP_PartyRace_Sub_Option_Finalconfirm_C_UpFromItemSwitch, Navigation_0) == 0x000000, "Member 'WBP_PartyRace_Sub_Option_Finalconfirm_C_UpFromItemSwitch::Navigation_0' has a wrong offset!");
