#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_ColorPicker

#include "Basic.hpp"

#include "ST_ColorDetailWindowColorItemData_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_PullDownMenuItemData_structs.hpp"
#include "ST_ColorDetailWindowData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EColorDetailWindowMode_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C
// 0x0200 (0x05D8 - 0x03D8)
class UWBP_MachineCustom_Sub_ColorPicker_C final : public UUnionUISceneBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ColorPicker_Out;                                   // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ColorPicker_Loop;                                  // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ColorPicker_In;                                    // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Texture;                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Cursor_Texture;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_SetTexture;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_Line_Btn_C*                    WBP_CMN_Line_Btn;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PullDownMenu_C*                WBP_CMN_PullDownMenu;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_Liquid;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ColorItemNumPerRow;                                // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C*> ColorItems;                       // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMulticastInlineDelegate<void()>              OnCancel;                                          // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         LastColumnIndex;                                   // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIGridNavigationBuilder*          GridNavigationBuilder;                             // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FST_ColorDetailWindowData              WindowData;                                        // 0x0468(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FST_ColorDetailWindowColorItemData& InItemData)> OnColorItemFocused; // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FST_ColorDetailWindowColorItemData& InItemData)> OnColorItemSelected; // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FST_PullDownMenuItemData& InItemData)> OnSurfaceItemFocused; // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<EColorDetailWindowMode, int32>           ColorItemNumMap;                                   // 0x04D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EColorDetailWindowMode, struct FVector2D> InnerSlotPaddingMap;                              // 0x0520(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EColorDetailWindowMode, struct FVector2D> WrapBoxPositionMap;                               // 0x0570(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APlayerController*                      PlayerController;                                  // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FST_PullDownMenuItemData& InItemData)> OnSurfaceItemSelected; // 0x05C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Bind();
	void ButtonsPanel0_OnDecision(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void ButtonsPanel0_OnFocus(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void ClosePullDownMenu();
	void Construct();
	void CreatePanel();
	void ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker(int32 EntryPoint);
	void HidePullDownMenu();
	void OpenPullDownMenu();
	void PullDownMenu_OnCancel();
	void PullDownMenu_OnClose();
	void PullDownMenu_OnItemFocused(const struct FST_PullDownMenuItemData& InItemData);
	void PullDownMenu_OnItemSelected(const struct FST_PullDownMenuItemData& InItemData);
	void Scene_OnCancel(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void SetInitialFocus(class APlayerController* InPlayerController);
	void SetIsPlaySound(bool bIsPlay);
	void Setup(const struct FST_ColorDetailWindowData& InWindowData);
	void SetupPullDownMenu(const struct FST_PullDownMenuData& InMenuData);
	void SetVisibleCursor(bool IsVisible_0);
	void SetVisibleOutOfContentButton(bool IsVisible_0);
	void SetVisiblePullDownMenu(bool IsVisible_0);
	void ShowPullDownMenu();
	void SurfaceButton_OnDecision(class UUnionUIButtonBase* Button);
	void SurfaceButton_OnFocus(class UUnionUIButtonBase* Button);
	void SurfaceButton_OnUnFocus(class UUnionUIButtonBase* Button);
	void UpdateSurfaceButtonText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_ColorPicker_C">();
	}
	static class UWBP_MachineCustom_Sub_ColorPicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_ColorPicker_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_ColorPicker_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_ColorPicker_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_ColorPicker_C) == 0x0005D8, "Wrong size on UWBP_MachineCustom_Sub_ColorPicker_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, UberGraphFrame) == 0x0003D8, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, ColorPicker_Out) == 0x0003E0, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::ColorPicker_Out' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, ColorPicker_Loop) == 0x0003E8, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::ColorPicker_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, ColorPicker_In) == 0x0003F0, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::ColorPicker_In' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, CanvasPanel_Texture) == 0x0003F8, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::CanvasPanel_Texture' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, DSP_Cursor_Texture) == 0x000400, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::DSP_Cursor_Texture' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, OutOfContentButton) == 0x000408, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::OutOfContentButton' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, TXT_SetTexture) == 0x000410, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::TXT_SetTexture' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, WBP_CMN_Line_Btn) == 0x000418, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::WBP_CMN_Line_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, WBP_CMN_PullDownMenu) == 0x000420, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::WBP_CMN_PullDownMenu' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, WrapBox_Liquid) == 0x000428, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::WrapBox_Liquid' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, ColorItemNumPerRow) == 0x000430, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::ColorItemNumPerRow' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, ColorItems) == 0x000438, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::ColorItems' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, OnCancel) == 0x000448, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::OnCancel' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, LastColumnIndex) == 0x000458, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::LastColumnIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, GridNavigationBuilder) == 0x000460, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::GridNavigationBuilder' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, WindowData) == 0x000468, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::WindowData' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, OnColorItemFocused) == 0x0004A0, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::OnColorItemFocused' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, OnColorItemSelected) == 0x0004B0, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::OnColorItemSelected' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, OnSurfaceItemFocused) == 0x0004C0, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::OnSurfaceItemFocused' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, ColorItemNumMap) == 0x0004D0, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::ColorItemNumMap' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, InnerSlotPaddingMap) == 0x000520, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::InnerSlotPaddingMap' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, WrapBoxPositionMap) == 0x000570, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::WrapBoxPositionMap' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, PlayerController) == 0x0005C0, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_C, OnSurfaceItemSelected) == 0x0005C8, "Member 'UWBP_MachineCustom_Sub_ColorPicker_C::OnSurfaceItemSelected' has a wrong offset!");

}

