#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02.WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C.StartAnimation
// 0x0030 (0x0030 - 0x0000)
struct WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation final
{
public:
	bool                                          Normal;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Special;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          End;                                               // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0010(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation) == 0x000008, "Wrong alignment on WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation");
static_assert(sizeof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation) == 0x000030, "Wrong size on WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation");
static_assert(offsetof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation, Normal) == 0x000000, "Member 'WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation::Normal' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation, Special) == 0x000001, "Member 'WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation::Special' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation, End) == 0x000002, "Member 'WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation::End' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation, CallFunc_MakeLiteralText_ReturnValue) == 0x000010, "Member 'WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_02_C_StartAnimation::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

}

