#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupSelect_Sub_Table

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GroupSelect_Sub_Table.WBP_GroupSelect_Sub_Table_C
// 0x0088 (0x0398 - 0x0310)
class UWBP_GroupSelect_Sub_Table_C final : public UGroupSelectComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Non_Active_Loop;                                   // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FourP_Loop;                                        // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ThreeP_Loop;                                       // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TwoP_Loop;                                         // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OneP_Loop;                                         // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NPC_Loop;                                          // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BaseWhite;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharaFaceIcon;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlatformIcon;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RivalIcon;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Table_Base;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Title_Plate;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Name;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_C*                WBP_CMN_PlayerNumber;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_DSP;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_GroupSelect_Sub_Table(int32 EntryPoint);
	void OnLoaded_A0E7741E4B2AD52F64A354BC16363AAD(class UObject* Loaded);
	void SetCharacter(EDriverId InDriverId);
	void SetGroupIndex(int32 InGroupIndex);
	void SetIconIndex(int32 IconIndex);
	void SetLocalPlayerInfo(bool bInLocalPlayer, int32 InLocalPlayerIndex);
	void SetPlatformIconIndex(int32 InPlatformIconIndex);
	void SetPlayerNameString(const class FString& InPlayerNameString);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GroupSelect_Sub_Table_C">();
	}
	static class UWBP_GroupSelect_Sub_Table_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GroupSelect_Sub_Table_C>();
	}
};
static_assert(alignof(UWBP_GroupSelect_Sub_Table_C) == 0x000008, "Wrong alignment on UWBP_GroupSelect_Sub_Table_C");
static_assert(sizeof(UWBP_GroupSelect_Sub_Table_C) == 0x000398, "Wrong size on UWBP_GroupSelect_Sub_Table_C");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, UberGraphFrame) == 0x000310, "Member 'UWBP_GroupSelect_Sub_Table_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, Non_Active_Loop) == 0x000318, "Member 'UWBP_GroupSelect_Sub_Table_C::Non_Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, FourP_Loop) == 0x000320, "Member 'UWBP_GroupSelect_Sub_Table_C::FourP_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, ThreeP_Loop) == 0x000328, "Member 'UWBP_GroupSelect_Sub_Table_C::ThreeP_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, TwoP_Loop) == 0x000330, "Member 'UWBP_GroupSelect_Sub_Table_C::TwoP_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, OneP_Loop) == 0x000338, "Member 'UWBP_GroupSelect_Sub_Table_C::OneP_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, NPC_Loop) == 0x000340, "Member 'UWBP_GroupSelect_Sub_Table_C::NPC_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, BaseWhite) == 0x000348, "Member 'UWBP_GroupSelect_Sub_Table_C::BaseWhite' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, CharaFaceIcon) == 0x000350, "Member 'UWBP_GroupSelect_Sub_Table_C::CharaFaceIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, PlatformIcon) == 0x000358, "Member 'UWBP_GroupSelect_Sub_Table_C::PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, RivalIcon) == 0x000360, "Member 'UWBP_GroupSelect_Sub_Table_C::RivalIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, Table_Base) == 0x000368, "Member 'UWBP_GroupSelect_Sub_Table_C::Table_Base' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, Title_Plate) == 0x000370, "Member 'UWBP_GroupSelect_Sub_Table_C::Title_Plate' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, TXT_Name) == 0x000378, "Member 'UWBP_GroupSelect_Sub_Table_C::TXT_Name' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, WBP_CMN_PlayerNumber) == 0x000380, "Member 'UWBP_GroupSelect_Sub_Table_C::WBP_CMN_PlayerNumber' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, WidgetSwitcher_0) == 0x000388, "Member 'UWBP_GroupSelect_Sub_Table_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_Sub_Table_C, WidgetSwitcher_DSP) == 0x000390, "Member 'UWBP_GroupSelect_Sub_Table_C::WidgetSwitcher_DSP' has a wrong offset!");

}

