#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DonpaTicketApp_Sub_TicketNumber_OnBtn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DonpaTicketApp_Sub_TicketNumber_OnBtn.WBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Text_NG;                                           // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Text_Nomal;                                        // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_DonpaTicket01;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_DonpaTicket01_1;                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_DonpaTicketApp_Sub_TicketNumber_OnBtn(int32 EntryPoint);
	void SetRedText();
	void SetTicketCount(const class FText& Current, const class FText& After);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C">();
	}
	static class UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C>();
	}
};
static_assert(alignof(UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C) == 0x000008, "Wrong alignment on UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C");
static_assert(sizeof(UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C) == 0x000308, "Wrong size on UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C");
static_assert(offsetof(UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C, Text_NG) == 0x0002E8, "Member 'UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C::Text_NG' has a wrong offset!");
static_assert(offsetof(UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C, Text_Nomal) == 0x0002F0, "Member 'UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C::Text_Nomal' has a wrong offset!");
static_assert(offsetof(UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C, TXT_Num_DonpaTicket01) == 0x0002F8, "Member 'UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C::TXT_Num_DonpaTicket01' has a wrong offset!");
static_assert(offsetof(UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C, TXT_Num_DonpaTicket01_1) == 0x000300, "Member 'UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C::TXT_Num_DonpaTicket01_1' has a wrong offset!");

}

