#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_HitInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionRun_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_HitInfo.WBP_Race_HUD_Sub_HitInfo_C
// 0x00B8 (0x03F8 - 0x0340)
class UWBP_Race_HUD_Sub_HitInfo_C final : public UUnionRaceHitInfoGroup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Arrow;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_ItemIcon;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DMY_ItemIconShadow;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    DSP_TXT_Multistext;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Base;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_HitInfo_Character_C*  WBP_Race_HUD_Sub_HitInfo_Character_01;             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mat_CharaIcon;                                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EItemId                                       ItemId;                                            // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ESoundPan                                     SoundPan;                                          // 0x0381(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_382[0x6];                                      // 0x0382(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Race_HUD_Sub_HitInfo_Character_C*> HitIconList;                                // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         ReadyCount;                                        // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacerStatusObject*                HighestRankChara;                                  // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<EItemId, class UTexture2D*>              ItemIdTextureMap;                                  // 0x03A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo(int32 EntryPoint);
	void FinishedAnim();
	void FireAnimationEvent(int32 DispType, EItemId AnotherItem);
	void FireAttackAnimation(int32 Type, EItemId AnotherItem);
	void FireAttackHitIconAnim(int32 ToPlayerIndex, int32 CharaId, int32 ItemId_0);
	void PlayHitSE(int32 PlayerIndex, int32 HitNum, bool IsSplit);
	void PlayLostItem();
	void PlayShuffleItem();
	void PreConstruct(bool IsDesignTime);
	void ResetHitInfo();
	void SetCharaIndex(int32 CharacterIndex, bool IsRival);
	void SetCrown(bool IsTop);
	void SetHighRank(TArray<int32>& RacerList);
	void SetHitNum(int32 HitNum);
	void SetIconBackColorByGroupIndex(int32 TargetGroupIndex);
	void SetItemIndex(int32 InIndex);
	void SetLocalPlayerNumber(int32 PlayerIndex, bool IsLocalPlayer);
	void SetLostItemId(EItemId ItemId_0);
	void SetOnlinePlayerName(class UUnionRacerStatusObject* HitStatusObj);
	void SetPlatformIcon(ECrossplayPlatform Platform);
	void SetVisibleIcon(int32 HitNum);
	void SwitchBaseUI(bool IsRival, bool IsPowerRival);
	void WidgetInit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_HitInfo_C">();
	}
	static class UWBP_Race_HUD_Sub_HitInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_HitInfo_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_HitInfo_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_HitInfo_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_HitInfo_C) == 0x0003F8, "Wrong size on UWBP_Race_HUD_Sub_HitInfo_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, UberGraphFrame) == 0x000340, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, Arrow) == 0x000348, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, DMY_ItemIcon) == 0x000350, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::DMY_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, DMY_ItemIconShadow) == 0x000358, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::DMY_ItemIconShadow' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, DSP_TXT_Multistext) == 0x000360, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::DSP_TXT_Multistext' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, Overlay_Base) == 0x000368, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::Overlay_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, WBP_Race_HUD_Sub_HitInfo_Character_01) == 0x000370, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::WBP_Race_HUD_Sub_HitInfo_Character_01' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, Mat_CharaIcon) == 0x000378, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::Mat_CharaIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, ItemId) == 0x000380, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::ItemId' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, SoundPan) == 0x000381, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::SoundPan' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, HitIconList) == 0x000388, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::HitIconList' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, ReadyCount) == 0x000398, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::ReadyCount' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, HighestRankChara) == 0x0003A0, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::HighestRankChara' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_HitInfo_C, ItemIdTextureMap) == 0x0003A8, "Member 'UWBP_Race_HUD_Sub_HitInfo_C::ItemIdTextureMap' has a wrong offset!");

}

