#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_ListTable

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_ListTable.WBP_MachineCustom_Sub_ListTable_C
// 0x0020 (0x0558 - 0x0538)
class UWBP_MachineCustom_Sub_ListTable_C final : public UMachineCustomizeCustomListItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_Loop;                                       // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Loop;                                       // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Playback;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MachineCustom_Sub_ListTable(int32 EntryPoint);
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnLeftStickButtonPressed();
	void PlayAnimationActiveLoop();
	void PlayAnimationSelectLoop();
	void PlaySECancel();
	void PlaySEDecision();
	void PlaySEFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_ListTable_C">();
	}
	static class UWBP_MachineCustom_Sub_ListTable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_ListTable_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_ListTable_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_ListTable_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_ListTable_C) == 0x000558, "Wrong size on UWBP_MachineCustom_Sub_ListTable_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_ListTable_C, UberGraphFrame) == 0x000538, "Member 'UWBP_MachineCustom_Sub_ListTable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ListTable_C, Select_Loop) == 0x000540, "Member 'UWBP_MachineCustom_Sub_ListTable_C::Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ListTable_C, Active_Loop) == 0x000548, "Member 'UWBP_MachineCustom_Sub_ListTable_C::Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ListTable_C, Playback) == 0x000550, "Member 'UWBP_MachineCustom_Sub_ListTable_C::Playback' has a wrong offset!");

}

