#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_SubMenu_List

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CMN_SubMenu_List.WBP_CMN_SubMenu_List_C.ExecuteUbergraph_WBP_CMN_SubMenu_List
// 0x0070 (0x0070 - 0x0000)
struct WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonMenuSubMenuButton*               CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonMenuSubMenuButton*               K2Node_DynamicCast_AsCommon_Menu_Sub_Menu_Button;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List) == 0x000008, "Wrong alignment on WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List");
static_assert(sizeof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List) == 0x000070, "Wrong size on WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, EntryPoint) == 0x000000, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, CallFunc_GetAllChildren_ReturnValue) == 0x000038, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, K2Node_DynamicCast_AsCommon_Menu_Sub_Menu_Button) == 0x000058, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::K2Node_DynamicCast_AsCommon_Menu_Sub_Menu_Button' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, CallFunc_Less_IntInt_ReturnValue_1) == 0x000061, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List, CallFunc_Array_Add_ReturnValue) == 0x000068, "Member 'WBP_CMN_SubMenu_List_C_ExecuteUbergraph_WBP_CMN_SubMenu_List::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_CMN_SubMenu_List.WBP_CMN_SubMenu_List_C.GetButtons
// 0x0010 (0x0010 - 0x0000)
struct WBP_CMN_SubMenu_List_C_GetButtons final
{
public:
	TArray<class UCommonMenuSubMenuButton*>       Buttons_0;                                         // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_CMN_SubMenu_List_C_GetButtons) == 0x000008, "Wrong alignment on WBP_CMN_SubMenu_List_C_GetButtons");
static_assert(sizeof(WBP_CMN_SubMenu_List_C_GetButtons) == 0x000010, "Wrong size on WBP_CMN_SubMenu_List_C_GetButtons");
static_assert(offsetof(WBP_CMN_SubMenu_List_C_GetButtons, Buttons_0) == 0x000000, "Member 'WBP_CMN_SubMenu_List_C_GetButtons::Buttons_0' has a wrong offset!");

}

