#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate.WBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C
// 0x00B8 (0x0398 - 0x02E0)
class UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C final : public UUserWidget
{
public:
	class UImage*                                 DMY_GadgetPlate;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_GadgetType;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_GadgetIcon_Simple_C*  WBP_Race_HUD_Sub_GadgetIcon_Simple;                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<ERivalTeamId, class UTexture2D*>         PlateMap;                                          // 0x02F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ERivalTeamId, class FName>               RowNameMap;                                        // 0x0348(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Set_UpGadgetPlate(ERivalTeamId RivalTeamId, TArray<TSoftObjectPtr<class UTexture2D>>* OutGadgetIconSoftTextures);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C">();
	}
	static class UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C>();
	}
};
static_assert(alignof(UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C) == 0x000008, "Wrong alignment on UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C");
static_assert(sizeof(UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C) == 0x000398, "Wrong size on UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C");
static_assert(offsetof(UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C, DMY_GadgetPlate) == 0x0002E0, "Member 'UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C::DMY_GadgetPlate' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C, TXT_GadgetType) == 0x0002E8, "Member 'UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C::TXT_GadgetType' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C, WBP_Race_HUD_Sub_GadgetIcon_Simple) == 0x0002F0, "Member 'UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C::WBP_Race_HUD_Sub_GadgetIcon_Simple' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C, PlateMap) == 0x0002F8, "Member 'UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C::PlateMap' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C, RowNameMap) == 0x000348, "Member 'UWBP_PartyRace_RivalTeamSelect_Sub_GadgetPlate_C::RowNameMap' has a wrong offset!");

}

