#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EndMenu_Sub_GadgetLv_Gauge

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_EndMenu_Sub_GadgetLv_Gauge.WBP_EndMenu_Sub_GadgetLv_Gauge_C.ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Now;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Next;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Low;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0038(0x0010)()
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_Int64ToString_ReturnValue;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0010)()
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge) == 0x000008, "Wrong alignment on WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge");
static_assert(sizeof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge) == 0x0000A0, "Wrong size on WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, EntryPoint) == 0x000000, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, K2Node_CustomEvent_Now) == 0x000008, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::K2Node_CustomEvent_Now' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, K2Node_CustomEvent_Next) == 0x000010, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::K2Node_CustomEvent_Next' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, K2Node_CustomEvent_Low) == 0x000018, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::K2Node_CustomEvent_Low' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, CallFunc_FMin_ReturnValue) == 0x000030, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000038, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, CallFunc_Conv_DoubleToInt64_ReturnValue) == 0x000060, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::CallFunc_Conv_DoubleToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, CallFunc_Conv_Int64ToString_ReturnValue) == 0x000068, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::CallFunc_Conv_Int64ToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, CallFunc_Concat_StrStr_ReturnValue) == 0x000078, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000098, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_EndMenu_Sub_GadgetLv_Gauge.WBP_EndMenu_Sub_GadgetLv_Gauge_C.SetGauge
// 0x0018 (0x0018 - 0x0000)
struct WBP_EndMenu_Sub_GadgetLv_Gauge_C_SetGauge final
{
public:
	double                                        Now;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Next;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Low;                                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_SetGauge) == 0x000008, "Wrong alignment on WBP_EndMenu_Sub_GadgetLv_Gauge_C_SetGauge");
static_assert(sizeof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_SetGauge) == 0x000018, "Wrong size on WBP_EndMenu_Sub_GadgetLv_Gauge_C_SetGauge");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_SetGauge, Now) == 0x000000, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_SetGauge::Now' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_SetGauge, Next) == 0x000008, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_SetGauge::Next' has a wrong offset!");
static_assert(offsetof(WBP_EndMenu_Sub_GadgetLv_Gauge_C_SetGauge, Low) == 0x000010, "Member 'WBP_EndMenu_Sub_GadgetLv_Gauge_C_SetGauge::Low' has a wrong offset!");

}

