#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PrivateMatch_Popup_Sub_LobbyBtn

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PrivateMatch_Popup_Sub_LobbyBtn.WBP_PrivateMatch_Popup_Sub_LobbyBtn_C
// 0x0078 (0x04F8 - 0x0480)
class UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C final : public UPrivateMatchButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Active_Out;                                    // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_Out;                                    // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_to_Active;                              // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_to_Select;                              // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_Loop;                                   // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_Loop;                                   // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BtnBase;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NonActiveCover;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainMenu_Cursor;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_BtnPict;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Btn;                                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundAtomCue*                          DecisionSound;                                     // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ButtonGrayOut(bool bGrayOut);
	void Construct();
	void ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_LobbyBtn(int32 EntryPoint);
	void OnAcceptKeyPressed();
	void OnActiveToSelectAnimFinished();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnBackKeyPressed();
	void OnDecisionAnimFinished();
	void OnDecisionAnimStart();
	void OnFocus_Impl(class UUnionUIButtonBase* Button);
	void OnFocusAnimStart();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnSelectToActiveAnimFinished();
	void OnUnFocusAnimStart();
	void SetButtonIcon(int32 IconIndex);
	void SetButtonInText(const class FText& InText);
	void SetupButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PrivateMatch_Popup_Sub_LobbyBtn_C">();
	}
	static class UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C>();
	}
};
static_assert(alignof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C) == 0x000008, "Wrong alignment on UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C");
static_assert(sizeof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C) == 0x0004F8, "Wrong size on UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, UberGraphFrame) == 0x000480, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, Btn_Active_Out) == 0x000488, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::Btn_Active_Out' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, Btn_Select_Out) == 0x000490, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::Btn_Select_Out' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, Btn_Select_to_Active) == 0x000498, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::Btn_Select_to_Active' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, Btn_Active_to_Select) == 0x0004A0, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::Btn_Active_to_Select' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, Btn_Select_Loop) == 0x0004A8, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::Btn_Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, Btn_Active_Loop) == 0x0004B0, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::Btn_Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, BtnBase) == 0x0004B8, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::BtnBase' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, DSP_NonActiveCover) == 0x0004C0, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::DSP_NonActiveCover' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, MainMenu_Cursor) == 0x0004C8, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::MainMenu_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, MouseInteraction) == 0x0004D0, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, PAT_BtnPict) == 0x0004D8, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::PAT_BtnPict' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, RaceFlag) == 0x0004E0, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::RaceFlag' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, TXT_Btn) == 0x0004E8, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::TXT_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C, DecisionSound) == 0x0004F0, "Member 'UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C::DecisionSound' has a wrong offset!");

}

