#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GrandPrix_SpeechBelt

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GrandPrix_SpeechBelt.WBP_GrandPrix_SpeechBelt_C.ExecuteUbergraph_WBP_GrandPrix_SpeechBelt
// 0x0028 (0x0028 - 0x0000)
struct WBP_GrandPrix_SpeechBelt_C_ExecuteUbergraph_WBP_GrandPrix_SpeechBelt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0018(0x0010)()
};
static_assert(alignof(WBP_GrandPrix_SpeechBelt_C_ExecuteUbergraph_WBP_GrandPrix_SpeechBelt) == 0x000008, "Wrong alignment on WBP_GrandPrix_SpeechBelt_C_ExecuteUbergraph_WBP_GrandPrix_SpeechBelt");
static_assert(sizeof(WBP_GrandPrix_SpeechBelt_C_ExecuteUbergraph_WBP_GrandPrix_SpeechBelt) == 0x000028, "Wrong size on WBP_GrandPrix_SpeechBelt_C_ExecuteUbergraph_WBP_GrandPrix_SpeechBelt");
static_assert(offsetof(WBP_GrandPrix_SpeechBelt_C_ExecuteUbergraph_WBP_GrandPrix_SpeechBelt, EntryPoint) == 0x000000, "Member 'WBP_GrandPrix_SpeechBelt_C_ExecuteUbergraph_WBP_GrandPrix_SpeechBelt::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GrandPrix_SpeechBelt_C_ExecuteUbergraph_WBP_GrandPrix_SpeechBelt, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WBP_GrandPrix_SpeechBelt_C_ExecuteUbergraph_WBP_GrandPrix_SpeechBelt::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GrandPrix_SpeechBelt_C_ExecuteUbergraph_WBP_GrandPrix_SpeechBelt, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000018, "Member 'WBP_GrandPrix_SpeechBelt_C_ExecuteUbergraph_WBP_GrandPrix_SpeechBelt::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");

}

