#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DonpaTicketApp

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_DonpaTicketApp.WBP_DonpaTicketApp_C.ExecuteUbergraph_WBP_DonpaTicketApp
// 0x0018 (0x0018 - 0x0000)
struct WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp) == 0x000008, "Wrong alignment on WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp");
static_assert(sizeof(WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp) == 0x000018, "Wrong size on WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp");
static_assert(offsetof(WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp, EntryPoint) == 0x000000, "Member 'WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp, K2Node_Event_Animation) == 0x000008, "Member 'WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000011, "Member 'WBP_DonpaTicketApp_C_ExecuteUbergraph_WBP_DonpaTicketApp::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function WBP_DonpaTicketApp.WBP_DonpaTicketApp_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_DonpaTicketApp_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DonpaTicketApp_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_DonpaTicketApp_C_OnAnimationFinished");
static_assert(sizeof(WBP_DonpaTicketApp_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_DonpaTicketApp_C_OnAnimationFinished");
static_assert(offsetof(WBP_DonpaTicketApp_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_DonpaTicketApp_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_DonpaTicketApp.WBP_DonpaTicketApp_C.PlayAnimationIn
// 0x0008 (0x0008 - 0x0000)
struct WBP_DonpaTicketApp_C_PlayAnimationIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DonpaTicketApp_C_PlayAnimationIn) == 0x000008, "Wrong alignment on WBP_DonpaTicketApp_C_PlayAnimationIn");
static_assert(sizeof(WBP_DonpaTicketApp_C_PlayAnimationIn) == 0x000008, "Wrong size on WBP_DonpaTicketApp_C_PlayAnimationIn");
static_assert(offsetof(WBP_DonpaTicketApp_C_PlayAnimationIn, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_DonpaTicketApp_C_PlayAnimationIn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_DonpaTicketApp.WBP_DonpaTicketApp_C.PlayAnimationLoop
// 0x0008 (0x0008 - 0x0000)
struct WBP_DonpaTicketApp_C_PlayAnimationLoop final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DonpaTicketApp_C_PlayAnimationLoop) == 0x000008, "Wrong alignment on WBP_DonpaTicketApp_C_PlayAnimationLoop");
static_assert(sizeof(WBP_DonpaTicketApp_C_PlayAnimationLoop) == 0x000008, "Wrong size on WBP_DonpaTicketApp_C_PlayAnimationLoop");
static_assert(offsetof(WBP_DonpaTicketApp_C_PlayAnimationLoop, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_DonpaTicketApp_C_PlayAnimationLoop::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_DonpaTicketApp.WBP_DonpaTicketApp_C.PlayAnimationOut
// 0x0008 (0x0008 - 0x0000)
struct WBP_DonpaTicketApp_C_PlayAnimationOut final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DonpaTicketApp_C_PlayAnimationOut) == 0x000008, "Wrong alignment on WBP_DonpaTicketApp_C_PlayAnimationOut");
static_assert(sizeof(WBP_DonpaTicketApp_C_PlayAnimationOut) == 0x000008, "Wrong size on WBP_DonpaTicketApp_C_PlayAnimationOut");
static_assert(offsetof(WBP_DonpaTicketApp_C_PlayAnimationOut, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_DonpaTicketApp_C_PlayAnimationOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

