#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RivalSelect_Sub_GetInfo

#include "Basic.hpp"

#include "UNION_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RivalSelect_Sub_GetInfo.WBP_RivalSelect_Sub_GetInfo_C
// 0x0028 (0x0328 - 0x0300)
class UWBP_RivalSelect_Sub_GetInfo_C final : public URivalSelectBonusProgressWidget
{
public:
	class UImage*                                 Base_Class;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_GetInfo;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Class;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_GetInfo;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ItemIcon_C*                    WBP_CMN_ItemIcon;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RivalSelect_Sub_GetInfo_C">();
	}
	static class UWBP_RivalSelect_Sub_GetInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RivalSelect_Sub_GetInfo_C>();
	}
};
static_assert(alignof(UWBP_RivalSelect_Sub_GetInfo_C) == 0x000008, "Wrong alignment on UWBP_RivalSelect_Sub_GetInfo_C");
static_assert(sizeof(UWBP_RivalSelect_Sub_GetInfo_C) == 0x000328, "Wrong size on UWBP_RivalSelect_Sub_GetInfo_C");
static_assert(offsetof(UWBP_RivalSelect_Sub_GetInfo_C, Base_Class) == 0x000300, "Member 'UWBP_RivalSelect_Sub_GetInfo_C::Base_Class' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_Sub_GetInfo_C, Base_GetInfo) == 0x000308, "Member 'UWBP_RivalSelect_Sub_GetInfo_C::Base_GetInfo' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_Sub_GetInfo_C, TXT_Class) == 0x000310, "Member 'UWBP_RivalSelect_Sub_GetInfo_C::TXT_Class' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_Sub_GetInfo_C, TXT_GetInfo) == 0x000318, "Member 'UWBP_RivalSelect_Sub_GetInfo_C::TXT_GetInfo' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_Sub_GetInfo_C, WBP_CMN_ItemIcon) == 0x000320, "Member 'UWBP_RivalSelect_Sub_GetInfo_C::WBP_CMN_ItemIcon' has a wrong offset!");

}

