#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_PlayerIconWindow

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Friend_PlayerIconWindow.WBP_Friend_PlayerIconWindow_C
// 0x0038 (0x04A8 - 0x0470)
class UWBP_Friend_PlayerIconWindow_C final : public UOnlineSettingPlayerIconSelectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SmallWindowBase;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox;                                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Friend_PlayerIcon_C*>       PlayerIconWidgetArray;                             // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void EndDisplay();
	void ExecuteUbergraph_WBP_Friend_PlayerIconWindow(int32 EntryPoint);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnUISceneCancel(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnUISceneDecisionDown(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void SetButtonNavigation();
	void SetButtonNavigationDown(int32 InIndex);
	void SetButtonNavigationLeft(int32 InIndex);
	void SetButtonNavigationRight(int32 InIndex);
	void SetButtonNavigationUp(int32 InIndex);
	void SetButtonsPanel();
	void SetInitialSelectIndexById(int32 InInitialSelectId);
	void Setup(int32 InIconId, int32 InBgColorId, bool bInIconSelect);
	void SetupBgColor(int32 InIconId);
	void SetupPlayerIcon(int32 InBgColorId);
	void SetupPlayerIconWidget(class UWBP_Friend_PlayerIcon_C* InPlayerIconWIdget, TSoftObjectPtr<class UTexture2D> InIconTexture, const struct FLinearColor& InBgColor);
	void SetWidgetFocus();
	void StartDisplay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Friend_PlayerIconWindow_C">();
	}
	static class UWBP_Friend_PlayerIconWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Friend_PlayerIconWindow_C>();
	}
};
static_assert(alignof(UWBP_Friend_PlayerIconWindow_C) == 0x000008, "Wrong alignment on UWBP_Friend_PlayerIconWindow_C");
static_assert(sizeof(UWBP_Friend_PlayerIconWindow_C) == 0x0004A8, "Wrong size on UWBP_Friend_PlayerIconWindow_C");
static_assert(offsetof(UWBP_Friend_PlayerIconWindow_C, UberGraphFrame) == 0x000470, "Member 'UWBP_Friend_PlayerIconWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_PlayerIconWindow_C, CanvasPanel_1) == 0x000478, "Member 'UWBP_Friend_PlayerIconWindow_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_PlayerIconWindow_C, OutOfContentButton) == 0x000480, "Member 'UWBP_Friend_PlayerIconWindow_C::OutOfContentButton' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_PlayerIconWindow_C, SmallWindowBase) == 0x000488, "Member 'UWBP_Friend_PlayerIconWindow_C::SmallWindowBase' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_PlayerIconWindow_C, WrapBox) == 0x000490, "Member 'UWBP_Friend_PlayerIconWindow_C::WrapBox' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_PlayerIconWindow_C, PlayerIconWidgetArray) == 0x000498, "Member 'UWBP_Friend_PlayerIconWindow_C::PlayerIconWidgetArray' has a wrong offset!");

}

