#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_RewardGetDisplay

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result_RewardGetDisplay.WBP_Result_RewardGetDisplay_C
// 0x0020 (0x0370 - 0x0350)
class UWBP_Result_RewardGetDisplay_C final : public URewardGetDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         RateRank;                                          // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RankTitleText;                                     // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CreateRewardGetWindow(bool bInSetFocus);
	void ExecuteUbergraph_WBP_Result_RewardGetDisplay(int32 EntryPoint);
	void SetMachinePartsNewFlag();
	void SetModeTitleText(const class FText& InRankUpTitleText, const class FText& InRewardGetTitleText, const class FText& InCompleteTitleText);
	void SetupResultRankRewardGetWindow(bool bInSetFocus);
	void SetWindowParamForResult(class URewardGetWindow* InRewardGetWindow, uint8 InRateRank, const TArray<struct FRewardGetWindowParam>& InRewardGetWindowParam, const bool bInWindowTimeClose, int32 InWindowZOrder);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Result_RewardGetDisplay_C">();
	}
	static class UWBP_Result_RewardGetDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_RewardGetDisplay_C>();
	}
};
static_assert(alignof(UWBP_Result_RewardGetDisplay_C) == 0x000008, "Wrong alignment on UWBP_Result_RewardGetDisplay_C");
static_assert(sizeof(UWBP_Result_RewardGetDisplay_C) == 0x000370, "Wrong size on UWBP_Result_RewardGetDisplay_C");
static_assert(offsetof(UWBP_Result_RewardGetDisplay_C, UberGraphFrame) == 0x000350, "Member 'UWBP_Result_RewardGetDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Result_RewardGetDisplay_C, RateRank) == 0x000358, "Member 'UWBP_Result_RewardGetDisplay_C::RateRank' has a wrong offset!");
static_assert(offsetof(UWBP_Result_RewardGetDisplay_C, RankTitleText) == 0x000360, "Member 'UWBP_Result_RewardGetDisplay_C::RankTitleText' has a wrong offset!");

}

