#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FestaResult_ContributionRate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FestaResult_ContributionRate.WBP_FestaResult_ContributionRate_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_FestaResult_ContributionRate_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_29;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FestaResult_Sub_ContributionRate_Table_C* WBP_FestaResult_Sub_ContributionRate_Table_01; // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FestaResult_Sub_ContributionRate_Table_C* WBP_FestaResult_Sub_ContributionRate_Table_02; // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FestaResult_Sub_ContributionRate_Table_C* WBP_FestaResult_Sub_ContributionRate_Table_03; // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FestaResult_Sub_ContributionRate_Table_C* WBP_FestaResult_Sub_ContributionRate_Table_04; // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_FestaResult_Sub_ContributionRate_Table_C*> WBP_List;                           // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Close();
	void Construct();
	void ExecuteUbergraph_WBP_FestaResult_ContributionRate(int32 EntryPoint);
	void Open();
	void PreConstruct(bool IsDesignTime);
	void SetRacerDataAll(const TArray<struct FFestaRacerContribution>& list);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FestaResult_ContributionRate_C">();
	}
	static class UWBP_FestaResult_ContributionRate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FestaResult_ContributionRate_C>();
	}
};
static_assert(alignof(UWBP_FestaResult_ContributionRate_C) == 0x000008, "Wrong alignment on UWBP_FestaResult_ContributionRate_C");
static_assert(sizeof(UWBP_FestaResult_ContributionRate_C) == 0x000328, "Wrong size on UWBP_FestaResult_ContributionRate_C");
static_assert(offsetof(UWBP_FestaResult_ContributionRate_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_FestaResult_ContributionRate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_ContributionRate_C, Out) == 0x0002E8, "Member 'UWBP_FestaResult_ContributionRate_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_ContributionRate_C, CanvasPanel_29) == 0x0002F0, "Member 'UWBP_FestaResult_ContributionRate_C::CanvasPanel_29' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_ContributionRate_C, WBP_FestaResult_Sub_ContributionRate_Table_01) == 0x0002F8, "Member 'UWBP_FestaResult_ContributionRate_C::WBP_FestaResult_Sub_ContributionRate_Table_01' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_ContributionRate_C, WBP_FestaResult_Sub_ContributionRate_Table_02) == 0x000300, "Member 'UWBP_FestaResult_ContributionRate_C::WBP_FestaResult_Sub_ContributionRate_Table_02' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_ContributionRate_C, WBP_FestaResult_Sub_ContributionRate_Table_03) == 0x000308, "Member 'UWBP_FestaResult_ContributionRate_C::WBP_FestaResult_Sub_ContributionRate_Table_03' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_ContributionRate_C, WBP_FestaResult_Sub_ContributionRate_Table_04) == 0x000310, "Member 'UWBP_FestaResult_ContributionRate_C::WBP_FestaResult_Sub_ContributionRate_Table_04' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_ContributionRate_C, WBP_List) == 0x000318, "Member 'UWBP_FestaResult_ContributionRate_C::WBP_List' has a wrong offset!");

}

