#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PauseMenu_Sub_Option_Btn_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PauseMenu_Sub_Option_Btn_02.WBP_PauseMenu_Sub_Option_Btn_02_C
// 0x0088 (0x0508 - 0x0480)
class UWBP_PauseMenu_Sub_Option_Btn_02_C final : public UUnionUIButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Active_to_NonActive;                               // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Set_In_Loop;                                       // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Loop;                                       // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NonActive_Loop;                                    // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_Active;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Set;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_Cursor_Base;                                   // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Parts_AutoItem;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Parts_DrivingAssist;                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Parts_Gyro;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlagWave;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_AUTOText;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_OptionName;                                    // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn;                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ToggleIsOn;                                        // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_PauseMenu_Sub_Option_Btn_02(int32 EntryPoint);
	class UObject* GetFooter();
	class UObject* GetOwnerMenuSequence();
	void PlayAnimationActiveToNonActive();
	void PlayAnimationNonActiveToActive();
	void SetToggle(bool on);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PauseMenu_Sub_Option_Btn_02_C">();
	}
	static class UWBP_PauseMenu_Sub_Option_Btn_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PauseMenu_Sub_Option_Btn_02_C>();
	}
};
static_assert(alignof(UWBP_PauseMenu_Sub_Option_Btn_02_C) == 0x000008, "Wrong alignment on UWBP_PauseMenu_Sub_Option_Btn_02_C");
static_assert(sizeof(UWBP_PauseMenu_Sub_Option_Btn_02_C) == 0x000508, "Wrong size on UWBP_PauseMenu_Sub_Option_Btn_02_C");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, UberGraphFrame) == 0x000480, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, Active_to_NonActive) == 0x000488, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::Active_to_NonActive' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, Set_In_Loop) == 0x000490, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::Set_In_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, Active_Loop) == 0x000498, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, NonActive_Loop) == 0x0004A0, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::NonActive_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, Base_Active) == 0x0004A8, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::Base_Active' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, Base_Set) == 0x0004B0, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::Base_Set' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, Btn_Cursor_Base) == 0x0004B8, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::Btn_Cursor_Base' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, DSP_Parts_AutoItem) == 0x0004C0, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::DSP_Parts_AutoItem' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, DSP_Parts_DrivingAssist) == 0x0004C8, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::DSP_Parts_DrivingAssist' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, DSP_Parts_Gyro) == 0x0004D0, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::DSP_Parts_Gyro' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, RaceFlagWave) == 0x0004D8, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::RaceFlagWave' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, TXT_AUTOText) == 0x0004E0, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::TXT_AUTOText' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, TXT_OptionName) == 0x0004E8, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::TXT_OptionName' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, WBP_CMN_ControllerBtn) == 0x0004F0, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::WBP_CMN_ControllerBtn' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, WidgetSwitcher) == 0x0004F8, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_02_C, ToggleIsOn) == 0x000500, "Member 'UWBP_PauseMenu_Sub_Option_Btn_02_C::ToggleIsOn' has a wrong offset!");

}

