#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ready_Sub_Gadget

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Ready_Sub_Gadget.WBP_Ready_Sub_Gadget_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_Ready_Sub_Gadget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InAnimation;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_GadgetPlate_C*    WBP_GadgetCustom_Sub_GadgetPlate;                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_SkillPlate_C*     WBP_GadgetCustom_Sub_SkillPlate;                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     WBP_PauseMenu_Sub_Option_Btn_03_01;                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CaptionEvent();
	void Construct();
	void ExecuteUbergraph_WBP_Ready_Sub_Gadget(int32 EntryPoint);
	void HiddenCaptionEvent(bool bIsHidden);
	void SetGadgetCaptionEvent(int32 PlayerIndex_0, int32 SlotState, int32 SlotIndex);
	void UpdateGadgetDetail(int32 InGadgetId);
	void UpdatePlayerIndex();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Ready_Sub_Gadget_C">();
	}
	static class UWBP_Ready_Sub_Gadget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Ready_Sub_Gadget_C>();
	}
};
static_assert(alignof(UWBP_Ready_Sub_Gadget_C) == 0x000008, "Wrong alignment on UWBP_Ready_Sub_Gadget_C");
static_assert(sizeof(UWBP_Ready_Sub_Gadget_C) == 0x000310, "Wrong size on UWBP_Ready_Sub_Gadget_C");
static_assert(offsetof(UWBP_Ready_Sub_Gadget_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Ready_Sub_Gadget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_Gadget_C, InAnimation) == 0x0002E8, "Member 'UWBP_Ready_Sub_Gadget_C::InAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_Gadget_C, WBP_GadgetCustom_Sub_GadgetPlate) == 0x0002F0, "Member 'UWBP_Ready_Sub_Gadget_C::WBP_GadgetCustom_Sub_GadgetPlate' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_Gadget_C, WBP_GadgetCustom_Sub_SkillPlate) == 0x0002F8, "Member 'UWBP_Ready_Sub_Gadget_C::WBP_GadgetCustom_Sub_SkillPlate' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_Gadget_C, WBP_PauseMenu_Sub_Option_Btn_03_01) == 0x000300, "Member 'UWBP_Ready_Sub_Gadget_C::WBP_PauseMenu_Sub_Option_Btn_03_01' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_Gadget_C, PlayerIndex) == 0x000308, "Member 'UWBP_Ready_Sub_Gadget_C::PlayerIndex' has a wrong offset!");

}

