#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu_Sub_Icon_PlayBonus

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TopMenu_Sub_Icon_PlayBonus.WBP_TopMenu_Sub_Icon_PlayBonus_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_TopMenu_Sub_Icon_PlayBonus_C final : public UUserWidget
{
public:
	class UImage*                                 base;                                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DonpaTicket;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TopMenu_Sub_Icon_PlayBonus_C">();
	}
	static class UWBP_TopMenu_Sub_Icon_PlayBonus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TopMenu_Sub_Icon_PlayBonus_C>();
	}
};
static_assert(alignof(UWBP_TopMenu_Sub_Icon_PlayBonus_C) == 0x000008, "Wrong alignment on UWBP_TopMenu_Sub_Icon_PlayBonus_C");
static_assert(sizeof(UWBP_TopMenu_Sub_Icon_PlayBonus_C) == 0x0002F8, "Wrong size on UWBP_TopMenu_Sub_Icon_PlayBonus_C");
static_assert(offsetof(UWBP_TopMenu_Sub_Icon_PlayBonus_C, base) == 0x0002E0, "Member 'UWBP_TopMenu_Sub_Icon_PlayBonus_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_Icon_PlayBonus_C, DonpaTicket) == 0x0002E8, "Member 'UWBP_TopMenu_Sub_Icon_PlayBonus_C::DonpaTicket' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_Icon_PlayBonus_C, Effect) == 0x0002F0, "Member 'UWBP_TopMenu_Sub_Icon_PlayBonus_C::Effect' has a wrong offset!");

}

