#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FooterMenu

#include "Basic.hpp"

#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function WBP_FooterMenu.WBP_FooterMenu_C.ExecuteUbergraph_WBP_FooterMenu
// 0x0190 (0x0190 - 0x0000)
struct WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FooterMenu_Sub_CommonBtn_C*        K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FooterMenu_Sub_CommonBtn_C*        K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_1; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FooterMenu_Sub_CommonBtn_C*        K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_2; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FooterMenu_Sub_CommonBtn_C*        K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_3; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FooterMenu_Sub_CommonBtn_C*        K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_4; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FooterMenu_Sub_CommonBtn_C*        K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_5; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFooterMenuWidgetArray                 K2Node_MakeStruct_FooterMenuWidgetArray;           // 0x0078(0x0010)(ContainsInstancedReference)
	TArray<class UWidget*>                        K2Node_MakeArray_Array_1;                          // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFooterMenuWidgetArray                 K2Node_MakeStruct_FooterMenuWidgetArray_1;         // 0x0098(0x0010)(ContainsInstancedReference)
	TArray<class UWidget*>                        K2Node_MakeArray_Array_2;                          // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFooterMenuWidgetArray                 K2Node_MakeStruct_FooterMenuWidgetArray_2;         // 0x00B8(0x0010)(ContainsInstancedReference)
	TArray<class UWidget*>                        K2Node_MakeArray_Array_3;                          // 0x00C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFooterMenuWidgetArray                 K2Node_MakeStruct_FooterMenuWidgetArray_3;         // 0x00D8(0x0010)(ContainsInstancedReference)
	TArray<class UWidget*>                        K2Node_MakeArray_Array_4;                          // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFooterMenuWidgetArray                 K2Node_MakeStruct_FooterMenuWidgetArray_4;         // 0x00F8(0x0010)(ContainsInstancedReference)
	TArray<class UWidget*>                        K2Node_MakeArray_Array_5;                          // 0x0108(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFooterMenuWidgetArray                 K2Node_MakeStruct_FooterMenuWidgetArray_5;         // 0x0118(0x0010)(ContainsInstancedReference)
	TArray<class UWidget*>                        K2Node_MakeArray_Array_6;                          // 0x0128(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFooterMenuWidgetArray>         K2Node_MakeArray_Array_7;                          // 0x0138(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFooterMenuWidgetArray                 K2Node_MakeStruct_FooterMenuWidgetArray_6;         // 0x0148(0x0010)(ContainsInstancedReference)
	TArray<class UWidget*>                        K2Node_MakeArray_Array_8;                          // 0x0158(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFooterMenuWidgetArray                 K2Node_MakeStruct_FooterMenuWidgetArray_7;         // 0x0168(0x0010)(ContainsInstancedReference)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFooterMenuWidgetArray>         K2Node_MakeArray_Array_9;                          // 0x0180(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu) == 0x000008, "Wrong alignment on WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu");
static_assert(sizeof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu) == 0x000190, "Wrong size on WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, EntryPoint) == 0x000000, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn) == 0x000008, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_1) == 0x000018, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_1' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_2) == 0x000028, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_2' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_3) == 0x000038, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_3' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_DynamicCast_bSuccess_3) == 0x000040, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_4) == 0x000048, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_4' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_DynamicCast_bSuccess_4) == 0x000050, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_5) == 0x000058, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Common_Btn_5' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_DynamicCast_bSuccess_5) == 0x000060, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeArray_Array) == 0x000068, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeStruct_FooterMenuWidgetArray) == 0x000078, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeStruct_FooterMenuWidgetArray' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeArray_Array_1) == 0x000088, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeStruct_FooterMenuWidgetArray_1) == 0x000098, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeStruct_FooterMenuWidgetArray_1' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeArray_Array_2) == 0x0000A8, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeStruct_FooterMenuWidgetArray_2) == 0x0000B8, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeStruct_FooterMenuWidgetArray_2' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeArray_Array_3) == 0x0000C8, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeStruct_FooterMenuWidgetArray_3) == 0x0000D8, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeStruct_FooterMenuWidgetArray_3' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeArray_Array_4) == 0x0000E8, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeStruct_FooterMenuWidgetArray_4) == 0x0000F8, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeStruct_FooterMenuWidgetArray_4' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeArray_Array_5) == 0x000108, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeStruct_FooterMenuWidgetArray_5) == 0x000118, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeStruct_FooterMenuWidgetArray_5' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeArray_Array_6) == 0x000128, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeArray_Array_7) == 0x000138, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeStruct_FooterMenuWidgetArray_6) == 0x000148, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeStruct_FooterMenuWidgetArray_6' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeArray_Array_8) == 0x000158, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeStruct_FooterMenuWidgetArray_7) == 0x000168, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeStruct_FooterMenuWidgetArray_7' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000178, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu, K2Node_MakeArray_Array_9) == 0x000180, "Member 'WBP_FooterMenu_C_ExecuteUbergraph_WBP_FooterMenu::K2Node_MakeArray_Array_9' has a wrong offset!");

// Function WBP_FooterMenu.WBP_FooterMenu_C.OnHovered
// 0x0018 (0x0018 - 0x0000)
struct WBP_FooterMenu_C_OnHovered final
{
public:
	class UButton*                                HoveredObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAppControllerInputManager*             CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FooterMenu_C_OnHovered) == 0x000008, "Wrong alignment on WBP_FooterMenu_C_OnHovered");
static_assert(sizeof(WBP_FooterMenu_C_OnHovered) == 0x000018, "Wrong size on WBP_FooterMenu_C_OnHovered");
static_assert(offsetof(WBP_FooterMenu_C_OnHovered, HoveredObject) == 0x000000, "Member 'WBP_FooterMenu_C_OnHovered::HoveredObject' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_OnHovered, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'WBP_FooterMenu_C_OnHovered::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_C_OnHovered, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_FooterMenu_C_OnHovered::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function WBP_FooterMenu.WBP_FooterMenu_C.PlayAnimIn
// 0x0008 (0x0008 - 0x0000)
struct WBP_FooterMenu_C_PlayAnimIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FooterMenu_C_PlayAnimIn) == 0x000008, "Wrong alignment on WBP_FooterMenu_C_PlayAnimIn");
static_assert(sizeof(WBP_FooterMenu_C_PlayAnimIn) == 0x000008, "Wrong size on WBP_FooterMenu_C_PlayAnimIn");
static_assert(offsetof(WBP_FooterMenu_C_PlayAnimIn, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_FooterMenu_C_PlayAnimIn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_FooterMenu.WBP_FooterMenu_C.PlayAnimOut
// 0x0008 (0x0008 - 0x0000)
struct WBP_FooterMenu_C_PlayAnimOut final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FooterMenu_C_PlayAnimOut) == 0x000008, "Wrong alignment on WBP_FooterMenu_C_PlayAnimOut");
static_assert(sizeof(WBP_FooterMenu_C_PlayAnimOut) == 0x000008, "Wrong size on WBP_FooterMenu_C_PlayAnimOut");
static_assert(offsetof(WBP_FooterMenu_C_PlayAnimOut, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_FooterMenu_C_PlayAnimOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

