#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TopMenu.WBP_TopMenu_C
// 0x0060 (0x04C0 - 0x0460)
class UWBP_TopMenu_C final : public UTopMenuScene
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_TopMenu;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopMenu_Sub_BtnPlay_Offline_C*     WBP_TopMenu_Sub_BtnPlay_Offline;                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopMenu_Sub_BtnPlay_Online_C*      WBP_TopMenu_Sub_BtnPlay_Online;                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopMenu_Sub_BtnPlay_Wireless_C*    WBP_TopMenu_Sub_BtnPlay_Wireless;                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopMenu_Sub_ModeMenu_C*            WBP_TopMenu_Sub_ModeMenu;                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     DesignationFocuButton;                             // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BackFocuｓEvent(class UUnionUIButtonsPanel* ButtonsPanel);
	void Button_Setting(class UCommonMenuSubMenu* Sub_Menu);
	void ExecuteUbergraph_WBP_TopMenu(int32 EntryPoint);
	void Finished_177C5CB140E58384F738E89F82C61AA8();
	void Finished_1E175CCC473196656C07A2B0A365A421();
	void InitializeGameMode(const ETopMenuPlayMode PlayMode, const TArray<ETopMenuGameMode>& BeltButtonTypeArr, ETopMenuSequenceState PrevState);
	void InitializePlayerNum();
	void InitializePlayMode(ETopMenuSequenceState PrevState);
	void InitializeTopMenu(ETopMenuSequenceState InitState);
	void IsPlayerNumButtonAnimationPlaying(bool* PlayingAnimation);
	void OnCancelSubMenu(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnDecisionSubMenu(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void PlayAnimationIn();
	void PlayAnimationLoop();
	void PlayAnimationNumActivePlayerNum(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void SetButtonVisible(ESlateVisibility Visibility_0, ETopMenuSequenceState BackState);
	void SetIconGameMode(const ETopMenuPlayMode PlayMode);
	void SetTextGameModeTitle(const ETopMenuPlayMode PlayMode);
	void SetupGameMode();
	void SetupPlayerNum();
	void SetupPlayMode(const TArray<ETopMenuPlayMode>& TopMenuPlayModeArr);
	void UnbindAllEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TopMenu_C">();
	}
	static class UWBP_TopMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TopMenu_C>();
	}
};
static_assert(alignof(UWBP_TopMenu_C) == 0x000008, "Wrong alignment on UWBP_TopMenu_C");
static_assert(sizeof(UWBP_TopMenu_C) == 0x0004C0, "Wrong size on UWBP_TopMenu_C");
static_assert(offsetof(UWBP_TopMenu_C, UberGraphFrame) == 0x000460, "Member 'UWBP_TopMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_C, base) == 0x000468, "Member 'UWBP_TopMenu_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_C, CanvasPanel) == 0x000470, "Member 'UWBP_TopMenu_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_C, Line) == 0x000478, "Member 'UWBP_TopMenu_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_C, Panel) == 0x000480, "Member 'UWBP_TopMenu_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_C, SafeZone_TopMenu) == 0x000488, "Member 'UWBP_TopMenu_C::SafeZone_TopMenu' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_C, Shadow) == 0x000490, "Member 'UWBP_TopMenu_C::Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_C, WBP_TopMenu_Sub_BtnPlay_Offline) == 0x000498, "Member 'UWBP_TopMenu_C::WBP_TopMenu_Sub_BtnPlay_Offline' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_C, WBP_TopMenu_Sub_BtnPlay_Online) == 0x0004A0, "Member 'UWBP_TopMenu_C::WBP_TopMenu_Sub_BtnPlay_Online' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_C, WBP_TopMenu_Sub_BtnPlay_Wireless) == 0x0004A8, "Member 'UWBP_TopMenu_C::WBP_TopMenu_Sub_BtnPlay_Wireless' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_C, WBP_TopMenu_Sub_ModeMenu) == 0x0004B0, "Member 'UWBP_TopMenu_C::WBP_TopMenu_Sub_ModeMenu' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_C, DesignationFocuButton) == 0x0004B8, "Member 'UWBP_TopMenu_C::DesignationFocuButton' has a wrong offset!");

}

