#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_GadgetCount

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_GadgetCount.WBP_CMN_GadgetCount_C
// 0x0050 (0x0368 - 0x0318)
class UWBP_CMN_GadgetCount_C final : public UCommonCountNumberWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GadgetCount_NumCount;                              // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GadgetCount_Out;                                   // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GadgetCount_Loop;                                  // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GadgetCount_In;                                    // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Line;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      UnionUITextBlock_1;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ItemIcon_C*                    WBP_CMN_ItemIcon;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BindAnimationEvent();
	void Construct();
	void ExecuteUbergraph_WBP_CMN_GadgetCount(int32 EntryPoint);
	class UWidgetAnimation* GetAnimationCount();
	class UWidgetAnimation* GetAnimationIn();
	class UWidgetAnimation* GetAnimationLoop();
	class UWidgetAnimation* GetAnimationOut();
	void OnInAnimFinished_SelfEvent();
	void PlayAnimationCount();
	void PlayAnimationIn();
	void PlayAnimationLoop();
	void PlayAnimationOut();
	void SetIconTexture(const class UTexture2D* InIconTexture);
	void SetIconType(ERewardType InRewardType);
	void StopAnimationCount();
	void UnbindAllEvent();
	void UpdateNumberDisplay(int32 InNumber);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_GadgetCount_C">();
	}
	static class UWBP_CMN_GadgetCount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_GadgetCount_C>();
	}
};
static_assert(alignof(UWBP_CMN_GadgetCount_C) == 0x000008, "Wrong alignment on UWBP_CMN_GadgetCount_C");
static_assert(sizeof(UWBP_CMN_GadgetCount_C) == 0x000368, "Wrong size on UWBP_CMN_GadgetCount_C");
static_assert(offsetof(UWBP_CMN_GadgetCount_C, UberGraphFrame) == 0x000318, "Member 'UWBP_CMN_GadgetCount_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCount_C, GadgetCount_NumCount) == 0x000320, "Member 'UWBP_CMN_GadgetCount_C::GadgetCount_NumCount' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCount_C, GadgetCount_Out) == 0x000328, "Member 'UWBP_CMN_GadgetCount_C::GadgetCount_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCount_C, GadgetCount_Loop) == 0x000330, "Member 'UWBP_CMN_GadgetCount_C::GadgetCount_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCount_C, GadgetCount_In) == 0x000338, "Member 'UWBP_CMN_GadgetCount_C::GadgetCount_In' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCount_C, base) == 0x000340, "Member 'UWBP_CMN_GadgetCount_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCount_C, Base_Line) == 0x000348, "Member 'UWBP_CMN_GadgetCount_C::Base_Line' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCount_C, CanvasPanel_0) == 0x000350, "Member 'UWBP_CMN_GadgetCount_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCount_C, UnionUITextBlock_1) == 0x000358, "Member 'UWBP_CMN_GadgetCount_C::UnionUITextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCount_C, WBP_CMN_ItemIcon) == 0x000360, "Member 'UWBP_CMN_GadgetCount_C::WBP_CMN_ItemIcon' has a wrong offset!");

}

