#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ResultRate_Sub_RankBand

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ResultRate_Sub_RankBand.WBP_ResultRate_Sub_RankBand_C
// 0x0078 (0x0360 - 0x02E8)
class UWBP_ResultRate_Sub_RankBand_C final : public UResultRateRankBand
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PRM_Cursor;                                        // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_A;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_B;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_C;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_D;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_E;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_LEGEND;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RankBand_Base;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RateGaugeArrow_01;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ResultRate_Sub_RankIcon_C*         WBP_ResultRate_Sub_RankIcon;                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ERateRank                                     NowRank;                                           // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERateRank                                     NextRank;                                          // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NowPosition;                                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EndPosition;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimStart;                                         // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ResultRate_Sub_RankBand(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void RateNotice(double Current);
	void SequenceEvent__ENTRYPOINTWBP_ResultRate_Sub_RankBand();
	void SequenceEvent__ENTRYPOINTWBP_ResultRate_Sub_RankBand_0();
	void SequenceEvent__ENTRYPOINTWBP_ResultRate_Sub_RankBand_1();
	void SequenceEvent__ENTRYPOINTWBP_ResultRate_Sub_RankBand_2();
	void SequenceEvent__ENTRYPOINTWBP_ResultRate_Sub_RankBand_3();
	void SequenceEvent__ENTRYPOINTWBP_ResultRate_Sub_RankBand_4();
	void SetAnimateImpl(ERateRank NowRank_in, ERateRank NextRank_in);
	void SetNextRankImpl(ERateRank NextRank_0);
	void SetNowRankImpl(ERateRank NowRank_0);
	void StartRankAnim(ERateRank End, bool bRankUp);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ResultRate_Sub_RankBand_C">();
	}
	static class UWBP_ResultRate_Sub_RankBand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ResultRate_Sub_RankBand_C>();
	}
};
static_assert(alignof(UWBP_ResultRate_Sub_RankBand_C) == 0x000008, "Wrong alignment on UWBP_ResultRate_Sub_RankBand_C");
static_assert(sizeof(UWBP_ResultRate_Sub_RankBand_C) == 0x000360, "Wrong size on UWBP_ResultRate_Sub_RankBand_C");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ResultRate_Sub_RankBand_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, PRM_Cursor) == 0x0002F0, "Member 'UWBP_ResultRate_Sub_RankBand_C::PRM_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, Base_A) == 0x0002F8, "Member 'UWBP_ResultRate_Sub_RankBand_C::Base_A' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, Base_B) == 0x000300, "Member 'UWBP_ResultRate_Sub_RankBand_C::Base_B' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, Base_C) == 0x000308, "Member 'UWBP_ResultRate_Sub_RankBand_C::Base_C' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, Base_D) == 0x000310, "Member 'UWBP_ResultRate_Sub_RankBand_C::Base_D' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, Base_E) == 0x000318, "Member 'UWBP_ResultRate_Sub_RankBand_C::Base_E' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, Base_LEGEND) == 0x000320, "Member 'UWBP_ResultRate_Sub_RankBand_C::Base_LEGEND' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, RankBand_Base) == 0x000328, "Member 'UWBP_ResultRate_Sub_RankBand_C::RankBand_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, RateGaugeArrow_01) == 0x000330, "Member 'UWBP_ResultRate_Sub_RankBand_C::RateGaugeArrow_01' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, WBP_ResultRate_Sub_RankIcon) == 0x000338, "Member 'UWBP_ResultRate_Sub_RankBand_C::WBP_ResultRate_Sub_RankIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, NowRank) == 0x000340, "Member 'UWBP_ResultRate_Sub_RankBand_C::NowRank' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, NextRank) == 0x000341, "Member 'UWBP_ResultRate_Sub_RankBand_C::NextRank' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, NowPosition) == 0x000348, "Member 'UWBP_ResultRate_Sub_RankBand_C::NowPosition' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, EndPosition) == 0x000350, "Member 'UWBP_ResultRate_Sub_RankBand_C::EndPosition' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, NewVar) == 0x000358, "Member 'UWBP_ResultRate_Sub_RankBand_C::NewVar' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankBand_C, AnimStart) == 0x000359, "Member 'UWBP_ResultRate_Sub_RankBand_C::AnimStart' has a wrong offset!");

}

