#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_Window_Error

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Popup_Window_Error.WBP_Popup_Window_Error_C.AddFocusButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_Popup_Window_Error_C_AddFocusButton final
{
public:
	TArray<class UUnionUIButtonBase*>             InButtonArray;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_Popup_Window_Error_C_AddFocusButton) == 0x000008, "Wrong alignment on WBP_Popup_Window_Error_C_AddFocusButton");
static_assert(sizeof(WBP_Popup_Window_Error_C_AddFocusButton) == 0x000010, "Wrong size on WBP_Popup_Window_Error_C_AddFocusButton");
static_assert(offsetof(WBP_Popup_Window_Error_C_AddFocusButton, InButtonArray) == 0x000000, "Member 'WBP_Popup_Window_Error_C_AddFocusButton::InButtonArray' has a wrong offset!");

// Function WBP_Popup_Window_Error.WBP_Popup_Window_Error_C.ExecuteUbergraph_WBP_Popup_Window_Error
// 0x0490 (0x0490 - 0x0000)
struct WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_27;             // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_26;             // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_25;             // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_24;             // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_23;             // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_22;             // 0x0034(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_21;             // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_20;             // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_19;             // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_18;             // 0x0044(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_17;             // 0x0048(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_16;             // 0x004C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_15;             // 0x0050(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_14;             // 0x0054(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Value_3;                              // 0x0058(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Value_2;                              // 0x0068(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_13;             // 0x0078(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_12;             // 0x007C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_11;             // 0x0080(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_10;             // 0x0084(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_9;              // 0x0088(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_8;              // 0x008C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_7;              // 0x0090(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_Value_1;                              // 0x0098(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Value;                                // 0x00A8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_6;              // 0x00B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_5;              // 0x00BC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_4;              // 0x00C0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_3;              // 0x00C4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_2;              // 0x00C8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_1;              // 0x00CC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex;                // 0x00D0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOnce;                                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InTime;                               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InDisplay;                            // 0x00DC(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_CurrentCount;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_AfterCount;                           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InEnable;                             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_BtnIconIndex;                         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_BtnIconType;                          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_BtnText;                              // 0x00F8(0x0010)(ConstParm)
	int32                                         K2Node_Event_Index;                                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Btn01IconIndex;                       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Btn02IconIndex;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text_1;                               // 0x0118(0x0010)(ConstParm)
	class FText                                   K2Node_Event_Text;                                 // 0x0128(0x0010)(ConstParm)
	bool                                          K2Node_Event_Attension;                            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupWindowButtonType                        K2Node_Event_ButtonType;                           // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0168(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x016C(0x0004)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_Event_BtnTextArray;                         // 0x0188(0x0010)(ConstParm, ReferenceParm)
	class UUnionUIButtonsPanel*                   CallFunc_CreateButtonsPanel_ReturnValue;           // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUnionUIButtonBase*>             K2Node_CustomEvent_InButtonArray;                  // 0x01B8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item;                           // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button;                       // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button;                      // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UTexture2D*                       K2Node_Event_Texture2D;                            // 0x01F0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUnionUIButtonBase*>             K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0208(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SetImage;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText;                               // 0x0220(0x0010)(ConstParm)
	int32                                         Temp_int_Variable;                                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_1;                     // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_1;                    // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_Select_Default;                             // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0250(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_Array_Get_Item_1;                         // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InButtonIndex;                        // 0x027C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              K2Node_CustomEvent_InButtonFocusType;              // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_2;                     // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_2;                    // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_3;                    // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_3;                     // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x2];                                      // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_4;                     // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_4;                    // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_5;                     // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_5;                    // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_6;                     // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_6;                    // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_7;                     // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_7;                    // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_8;                     // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_8;                    // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_9;                     // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_9;                    // 0x0328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_10;                    // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_10;                   // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_11;                    // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_11;                   // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_12;                    // 0x0350(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_12;                   // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_13;                    // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetNoButton_Button_14;                    // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_13;                   // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetYesButton_Button_14;                   // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x038D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38E[0x2];                                      // 0x038E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_InDeltaTime;                    // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x03A8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0400(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue;           // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_Array_Get_Item_2;                         // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_3;                         // 0x0428(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupWindowButtonType                        Temp_byte_Variable;                                // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442[0x2];                                      // 0x0442(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_3;                           // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_2;      // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x045C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUISubsystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPopupWindowType                              CallFunc_GetPopupWindowType_ReturnValue;           // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0480(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateButtonControlDelay_InDeltaTime_ImplicitCast; // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error) == 0x000008, "Wrong alignment on WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error");
static_assert(sizeof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error) == 0x000490, "Wrong size on WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, EntryPoint) == 0x000000, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, Temp_int_Array_Index_Variable_1) == 0x000008, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, Temp_int_Array_Index_Variable_2) == 0x000014, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_27) == 0x000020, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_27' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_26) == 0x000024, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_26' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_25) == 0x000028, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_25' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_24) == 0x00002C, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_24' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_23) == 0x000030, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_23' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_22) == 0x000034, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_22' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_21) == 0x000038, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_21' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_20) == 0x00003C, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_20' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_19) == 0x000040, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_19' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_18) == 0x000044, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_18' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_17) == 0x000048, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_17' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_16) == 0x00004C, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_16' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_15) == 0x000050, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_15' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_14) == 0x000054, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_14' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_Value_3) == 0x000058, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_Value_2) == 0x000068, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_13) == 0x000078, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_13' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_12) == 0x00007C, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_12' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_11) == 0x000080, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_11' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_10) == 0x000084, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_10' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_9) == 0x000088, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_9' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_8) == 0x00008C, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_8' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_7) == 0x000090, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_7' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_Value_1) == 0x000098, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_Value) == 0x0000A8, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_6) == 0x0000B8, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_6' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_5) == 0x0000BC, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_5' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_4) == 0x0000C0, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_4' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_3) == 0x0000C4, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_3' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_2) == 0x0000C8, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_2' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex_1) == 0x0000CC, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_PlayerControllerIndex) == 0x0000D0, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_bOnce) == 0x0000D4, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_bOnce' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_InTime) == 0x0000D8, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_InTime' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_InDisplay) == 0x0000DC, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_InDisplay' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_CurrentCount) == 0x0000E0, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_CurrentCount' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_AfterCount) == 0x0000E4, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_AfterCount' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_InEnable) == 0x0000E8, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_InEnable' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_BtnIconIndex) == 0x0000EC, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_BtnIconIndex' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_BtnIconType) == 0x0000F0, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_BtnIconType' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_BtnText) == 0x0000F8, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_BtnText' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_Index) == 0x000108, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_Btn01IconIndex) == 0x00010C, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_Btn01IconIndex' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_Btn02IconIndex) == 0x000110, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_Btn02IconIndex' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_Text_1) == 0x000118, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_Text) == 0x000128, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_Attension) == 0x000138, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_Attension' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_ButtonType) == 0x000139, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_ButtonType' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_CreateDelegate_OutputDelegate) == 0x00013C, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_PlayAnimation_ReturnValue) == 0x000150, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_PlayAnimation_ReturnValue_1) == 0x000158, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_PlayAnimation_ReturnValue_2) == 0x000160, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_SoundPlay_ReturnValue) == 0x000168, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_SoundPlay_ReturnValue_1) == 0x00016C, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_GetPlayerController_ReturnValue) == 0x000170, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000178, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_BtnTextArray) == 0x000188, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_BtnTextArray' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_CreateButtonsPanel_ReturnValue) == 0x000198, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_CreateButtonsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_MakeLiteralBool_ReturnValue) == 0x0001A0, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_MakeLiteralInt_ReturnValue) == 0x0001A4, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A8, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_CustomEvent_InButtonArray) == 0x0001B8, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_CustomEvent_InButtonArray' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_Array_Get_Item) == 0x0001C8, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_Array_Length_ReturnValue) == 0x0001D0, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_GetNoButton_Button) == 0x0001D8, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_GetNoButton_Button' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_SwitchEnum_CmpSuccess) == 0x0001E0, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_GetYesButton_Button) == 0x0001E8, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_GetYesButton_Button' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_Texture2D) == 0x0001F0, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_Texture2D' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_MakeArray_Array) == 0x0001F8, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_CreateDelegate_OutputDelegate_2) == 0x000208, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_CustomEvent_SetImage) == 0x000218, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_CustomEvent_SetImage' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Event_InText) == 0x000220, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, Temp_int_Variable) == 0x000230, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_GetNoButton_Button_1) == 0x000238, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_GetNoButton_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_GetYesButton_Button_1) == 0x000240, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_GetYesButton_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_Select_Default) == 0x000248, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_CreateDelegate_OutputDelegate_3) == 0x000250, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_CustomEvent_Button_1) == 0x000260, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, K2Node_CustomEvent_ButtonIndex) == 0x000268, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_Array_LastIndex_ReturnValue) == 0x00026C, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, CallFunc_Array_Get_Item_1) == 0x000270, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error, Temp_int_Variable_1) == 0x000278, "Member 'WBP_Popup_Window_Error_C_ExecuteUbergraph_WBP_Popup_Window_Error::Temp_int_Variable_1' has a wrong offset!");
