#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetCustom_Sub_Tab

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GadgetCustom_Sub_Tab.WBP_GadgetCustom_Sub_Tab_C.ExecuteUbergraph_WBP_GadgetCustom_Sub_Tab
// 0x000C (0x000C - 0x0000)
struct WBP_GadgetCustom_Sub_Tab_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_Tab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InPlayerIndex;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_Tab_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_Tab) == 0x000004, "Wrong alignment on WBP_GadgetCustom_Sub_Tab_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_Tab");
static_assert(sizeof(WBP_GadgetCustom_Sub_Tab_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_Tab) == 0x00000C, "Wrong size on WBP_GadgetCustom_Sub_Tab_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_Tab");
static_assert(offsetof(WBP_GadgetCustom_Sub_Tab_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_Tab, EntryPoint) == 0x000000, "Member 'WBP_GadgetCustom_Sub_Tab_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_Tab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_Tab_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_Tab, K2Node_Event_InPlayerIndex) == 0x000004, "Member 'WBP_GadgetCustom_Sub_Tab_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_Tab::K2Node_Event_InPlayerIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_Tab_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_Tab, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_GadgetCustom_Sub_Tab_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_Tab::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_Tab.WBP_GadgetCustom_Sub_Tab_C.OnConstTabButtons
// 0x0010 (0x0010 - 0x0000)
struct WBP_GadgetCustom_Sub_Tab_C_OnConstTabButtons final
{
public:
	TArray<class UGadgetCustomTabButton*>         K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_GadgetCustom_Sub_Tab_C_OnConstTabButtons) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_Tab_C_OnConstTabButtons");
static_assert(sizeof(WBP_GadgetCustom_Sub_Tab_C_OnConstTabButtons) == 0x000010, "Wrong size on WBP_GadgetCustom_Sub_Tab_C_OnConstTabButtons");
static_assert(offsetof(WBP_GadgetCustom_Sub_Tab_C_OnConstTabButtons, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_GadgetCustom_Sub_Tab_C_OnConstTabButtons::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_Tab.WBP_GadgetCustom_Sub_Tab_C.OnConstTexts
// 0x0010 (0x0010 - 0x0000)
struct WBP_GadgetCustom_Sub_Tab_C_OnConstTexts final
{
public:
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_GadgetCustom_Sub_Tab_C_OnConstTexts) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_Tab_C_OnConstTexts");
static_assert(sizeof(WBP_GadgetCustom_Sub_Tab_C_OnConstTexts) == 0x000010, "Wrong size on WBP_GadgetCustom_Sub_Tab_C_OnConstTexts");
static_assert(offsetof(WBP_GadgetCustom_Sub_Tab_C_OnConstTexts, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_GadgetCustom_Sub_Tab_C_OnConstTexts::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_Tab.WBP_GadgetCustom_Sub_Tab_C.SetPlayerIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_GadgetCustom_Sub_Tab_C_SetPlayerIndex final
{
public:
	int32                                         InPlayerIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_Tab_C_SetPlayerIndex) == 0x000004, "Wrong alignment on WBP_GadgetCustom_Sub_Tab_C_SetPlayerIndex");
static_assert(sizeof(WBP_GadgetCustom_Sub_Tab_C_SetPlayerIndex) == 0x000004, "Wrong size on WBP_GadgetCustom_Sub_Tab_C_SetPlayerIndex");
static_assert(offsetof(WBP_GadgetCustom_Sub_Tab_C_SetPlayerIndex, InPlayerIndex) == 0x000000, "Member 'WBP_GadgetCustom_Sub_Tab_C_SetPlayerIndex::InPlayerIndex' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_Tab.WBP_GadgetCustom_Sub_Tab_C.SetupTabButtons
// 0x0008 (0x0008 - 0x0000)
struct WBP_GadgetCustom_Sub_Tab_C_SetupTabButtons final
{
public:
	int32                                         InTabNum;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InOpenRentalGadget;                                // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_Tab_C_SetupTabButtons) == 0x000004, "Wrong alignment on WBP_GadgetCustom_Sub_Tab_C_SetupTabButtons");
static_assert(sizeof(WBP_GadgetCustom_Sub_Tab_C_SetupTabButtons) == 0x000008, "Wrong size on WBP_GadgetCustom_Sub_Tab_C_SetupTabButtons");
static_assert(offsetof(WBP_GadgetCustom_Sub_Tab_C_SetupTabButtons, InTabNum) == 0x000000, "Member 'WBP_GadgetCustom_Sub_Tab_C_SetupTabButtons::InTabNum' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_Tab_C_SetupTabButtons, InOpenRentalGadget) == 0x000004, "Member 'WBP_GadgetCustom_Sub_Tab_C_SetupTabButtons::InOpenRentalGadget' has a wrong offset!");

}

