#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_Sub_RankingTable_Crown

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result_Sub_RankingTable_Crown.WBP_Result_Sub_RankingTable_Crown_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_Result_Sub_RankingTable_Crown_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Crown_Out;                                         // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Crown_Loop;                                        // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Crown_In;                                          // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Crwon;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Result_Sub_RankingTable_Crown_C">();
	}
	static class UWBP_Result_Sub_RankingTable_Crown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_Sub_RankingTable_Crown_C>();
	}
};
static_assert(alignof(UWBP_Result_Sub_RankingTable_Crown_C) == 0x000008, "Wrong alignment on UWBP_Result_Sub_RankingTable_Crown_C");
static_assert(sizeof(UWBP_Result_Sub_RankingTable_Crown_C) == 0x000300, "Wrong size on UWBP_Result_Sub_RankingTable_Crown_C");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Crown_C, Crown_Out) == 0x0002E0, "Member 'UWBP_Result_Sub_RankingTable_Crown_C::Crown_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Crown_C, Crown_Loop) == 0x0002E8, "Member 'UWBP_Result_Sub_RankingTable_Crown_C::Crown_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Crown_C, Crown_In) == 0x0002F0, "Member 'UWBP_Result_Sub_RankingTable_Crown_C::Crown_In' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Crown_C, Crwon) == 0x0002F8, "Member 'UWBP_Result_Sub_RankingTable_Crown_C::Crwon' has a wrong offset!");

}

