#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu_Btnmode_Sub_Offine_Party

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TopMenu_Btnmode_Sub_Offine_Party.WBP_TopMenu_Btnmode_Sub_Offine_Party_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_TopMenu_Btnmode_Sub_Offine_Party_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Loop;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_image;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_WinInfo;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_Count;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_Win_Count;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_WIN;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party(int32 EntryPoint);
	void UpdateProgress(int32 NumEliminatedRivalTeams, int32 NumRivalTeams);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TopMenu_Btnmode_Sub_Offine_Party_C">();
	}
	static class UWBP_TopMenu_Btnmode_Sub_Offine_Party_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TopMenu_Btnmode_Sub_Offine_Party_C>();
	}
};
static_assert(alignof(UWBP_TopMenu_Btnmode_Sub_Offine_Party_C) == 0x000008, "Wrong alignment on UWBP_TopMenu_Btnmode_Sub_Offine_Party_C");
static_assert(sizeof(UWBP_TopMenu_Btnmode_Sub_Offine_Party_C) == 0x000328, "Wrong size on UWBP_TopMenu_Btnmode_Sub_Offine_Party_C");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_Party_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_Party_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_Party_C, Btn_Loop) == 0x0002E8, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_Party_C::Btn_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_Party_C, base) == 0x0002F0, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_Party_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_Party_C, Btn_image) == 0x0002F8, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_Party_C::Btn_image' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_Party_C, DSP_WinInfo) == 0x000300, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_Party_C::DSP_WinInfo' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_Party_C, Panel) == 0x000308, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_Party_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_Party_C, TXT_Num_Count) == 0x000310, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_Party_C::TXT_Num_Count' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_Party_C, TXT_Num_Win_Count) == 0x000318, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_Party_C::TXT_Num_Win_Count' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_Party_C, TXT_WIN) == 0x000320, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_Party_C::TXT_WIN' has a wrong offset!");

}

