#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu_Sub_Btn_Player_Offline

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TopMenu_Sub_Btn_Player_Offline.WBP_TopMenu_Sub_Btn_Player_Offline_C
// 0x0060 (0x0538 - 0x04D8)
class UWBP_TopMenu_Sub_Btn_Player_Offline_C final : public UTopMenuPlayerNumButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BtnCursor;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_BtnBase;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlagWave;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SelectBright;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 TXT_Player_Active;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 TXT_Player_Select;                                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        NewVar_0;                                          // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   PlayerCountText;                                   // 0x0528(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ChangeSelectColor(bool bSelect);
	void Construct();
	void ExecuteUbergraph_WBP_TopMenu_Sub_Btn_Player_Offline(int32 EntryPoint);
	void OnAcceptKeyPressed();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnBackKeyPressed();
	void OnDecisionDown_Impl(class UUnionUIButtonBase* Button);
	void OnDecisionDownFinished();
	void OnFocus_Impl(class UUnionUIButtonBase* Button);
	void OnFocusAnimFinished();
	void OnFocusAnimStart();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnUnFocus_Impl(class UUnionUIWidgetBase* Button);
	void OnUnFocusAnimFinished();
	void OnUnFocusAnimStart();
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent__ENTRYPOINTWBP_TopMenu_Sub_Btn_Player_Offline();
	void SequenceEvent__ENTRYPOINTWBP_TopMenu_Sub_Btn_Player_Offline_0();
	void SequenceEvent__ENTRYPOINTWBP_TopMenu_Sub_Btn_Player_Offline_1();
	void SequenceEvent__ENTRYPOINTWBP_TopMenu_Sub_Btn_Player_Offline_2();
	void SequenceEvent__ENTRYPOINTWBP_TopMenu_Sub_Btn_Player_Offline_3();
	void SequenceEvent__ENTRYPOINTWBP_TopMenu_Sub_Btn_Player_Offline_4();
	void SequenceEvent__ENTRYPOINTWBP_TopMenu_Sub_Btn_Player_Offline_5();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TopMenu_Sub_Btn_Player_Offline_C">();
	}
	static class UWBP_TopMenu_Sub_Btn_Player_Offline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TopMenu_Sub_Btn_Player_Offline_C>();
	}
};
static_assert(alignof(UWBP_TopMenu_Sub_Btn_Player_Offline_C) == 0x000008, "Wrong alignment on UWBP_TopMenu_Sub_Btn_Player_Offline_C");
static_assert(sizeof(UWBP_TopMenu_Sub_Btn_Player_Offline_C) == 0x000538, "Wrong size on UWBP_TopMenu_Sub_Btn_Player_Offline_C");
static_assert(offsetof(UWBP_TopMenu_Sub_Btn_Player_Offline_C, UberGraphFrame) == 0x0004D8, "Member 'UWBP_TopMenu_Sub_Btn_Player_Offline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_Btn_Player_Offline_C, BtnCursor) == 0x0004E0, "Member 'UWBP_TopMenu_Sub_Btn_Player_Offline_C::BtnCursor' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_Btn_Player_Offline_C, MouseInteraction) == 0x0004E8, "Member 'UWBP_TopMenu_Sub_Btn_Player_Offline_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_Btn_Player_Offline_C, PAT_BtnBase) == 0x0004F0, "Member 'UWBP_TopMenu_Sub_Btn_Player_Offline_C::PAT_BtnBase' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_Btn_Player_Offline_C, RaceFlagWave) == 0x0004F8, "Member 'UWBP_TopMenu_Sub_Btn_Player_Offline_C::RaceFlagWave' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_Btn_Player_Offline_C, SelectBright) == 0x000500, "Member 'UWBP_TopMenu_Sub_Btn_Player_Offline_C::SelectBright' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_Btn_Player_Offline_C, Shadow) == 0x000508, "Member 'UWBP_TopMenu_Sub_Btn_Player_Offline_C::Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_Btn_Player_Offline_C, TXT_Player_Active) == 0x000510, "Member 'UWBP_TopMenu_Sub_Btn_Player_Offline_C::TXT_Player_Active' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_Btn_Player_Offline_C, TXT_Player_Select) == 0x000518, "Member 'UWBP_TopMenu_Sub_Btn_Player_Offline_C::TXT_Player_Select' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_Btn_Player_Offline_C, NewVar_0) == 0x000520, "Member 'UWBP_TopMenu_Sub_Btn_Player_Offline_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_Btn_Player_Offline_C, PlayerCountText) == 0x000528, "Member 'UWBP_TopMenu_Sub_Btn_Player_Offline_C::PlayerCountText' has a wrong offset!");

}

