#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu_Sub_BtnPlay_Offline

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_TopMenu_Sub_BtnPlay_Offline.WBP_TopMenu_Sub_BtnPlay_Offline_C.ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline
// 0x0098 (0x0098 - 0x0000)
struct WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStaySceneMonkeyTesting_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMilestoneVersion                             CallFunc_GetMileStoneVersion_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0010(0x0010)()
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0028(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0040(0x0008)(NoDestructor)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0048(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x004C(0x0004)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0054(0x0008)(NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTopMenuPlayerNumButton*>        K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x007C(0x0004)()
	bool                                          K2Node_Event_IsEnable;                             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              K2Node_Select_Default;                             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMilestoneVersion                             CallFunc_GetMileStoneVersion_ReturnValue_1;        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline) == 0x000008, "Wrong alignment on WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline");
static_assert(sizeof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline) == 0x000098, "Wrong size on WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, EntryPoint) == 0x000000, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_GetStaySceneMonkeyTesting_ReturnValue) == 0x000004, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_GetStaySceneMonkeyTesting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_GetMileStoneVersion_ReturnValue) == 0x000006, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_GetMileStoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000007, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, Temp_byte_Variable) == 0x000008, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, Temp_byte_Variable_1) == 0x000009, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_MakeLiteralText_ReturnValue) == 0x000010, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_IsShippingBuild_ReturnValue) == 0x000020, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_IsShippingBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000028, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, K2Node_Event_InFocusEvent_1) == 0x000040, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_SoundPlay_ReturnValue) == 0x000048, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_SoundPlay_ReturnValue_1) == 0x00004C, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, K2Node_Event_InFocusEvent) == 0x000054, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, Temp_bool_Variable) == 0x000078, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_SoundPlay_ReturnValue_2) == 0x00007C, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, K2Node_Event_IsEnable) == 0x000080, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::K2Node_Event_IsEnable' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, K2Node_Select_Default) == 0x000081, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_PlayAnimation_ReturnValue_1) == 0x000088, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_GetMileStoneVersion_ReturnValue_1) == 0x000090, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_GetMileStoneVersion_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000091, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Offline::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function WBP_TopMenu_Sub_BtnPlay_Offline.WBP_TopMenu_Sub_BtnPlay_Offline_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLost");
static_assert(sizeof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLost) == 0x000008, "Wrong size on WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLost");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_TopMenu_Sub_BtnPlay_Offline.WBP_TopMenu_Sub_BtnPlay_Offline_C.OnFocusLostImpl
// 0x0008 (0x0008 - 0x0000)
struct WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLostImpl final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLostImpl) == 0x000004, "Wrong alignment on WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLostImpl");
static_assert(sizeof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLostImpl) == 0x000008, "Wrong size on WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLostImpl");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLostImpl, InFocusEvent) == 0x000000, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusLostImpl::InFocusEvent' has a wrong offset!");

// Function WBP_TopMenu_Sub_BtnPlay_Offline.WBP_TopMenu_Sub_BtnPlay_Offline_C.OnFocusReceived
// 0x0268 (0x0268 - 0x0000)
struct WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_OnFocusReceived_ReturnValue;              // 0x00F8(0x00B8)()
	struct FEventReply                            CallFunc_OnFocusReceivedImpl_ReturnValue;          // 0x01B0(0x00B8)()
};
static_assert(alignof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived");
static_assert(sizeof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived) == 0x000268, "Wrong size on WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived, CallFunc_OnFocusReceived_ReturnValue) == 0x0000F8, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived::CallFunc_OnFocusReceived_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived, CallFunc_OnFocusReceivedImpl_ReturnValue) == 0x0001B0, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_OnFocusReceived::CallFunc_OnFocusReceivedImpl_ReturnValue' has a wrong offset!");

// Function WBP_TopMenu_Sub_BtnPlay_Offline.WBP_TopMenu_Sub_BtnPlay_Offline_C.SetEnableButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_TopMenu_Sub_BtnPlay_Offline_C_SetEnableButton final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TopMenu_Sub_BtnPlay_Offline_C_SetEnableButton) == 0x000001, "Wrong alignment on WBP_TopMenu_Sub_BtnPlay_Offline_C_SetEnableButton");
static_assert(sizeof(WBP_TopMenu_Sub_BtnPlay_Offline_C_SetEnableButton) == 0x000001, "Wrong size on WBP_TopMenu_Sub_BtnPlay_Offline_C_SetEnableButton");
static_assert(offsetof(WBP_TopMenu_Sub_BtnPlay_Offline_C_SetEnableButton, IsEnable) == 0x000000, "Member 'WBP_TopMenu_Sub_BtnPlay_Offline_C_SetEnableButton::IsEnable' has a wrong offset!");

}

