#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RivalSelect

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RivalSelect.WBP_RivalSelect_C
// 0x00D0 (0x0548 - 0x0478)
class UWBP_RivalSelect_C final : public URivalSelectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Base_AllWinInfo;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_WinComplete;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Main;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharaIcon;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_AllWinInfo;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FooterBtnCover;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow_01;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow_02;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Complete;                                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate_RivalLevel;                                  // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_AllWinInfo;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharaSelect_Sub_Window_C*          WBP_CharaSelect_Sub_Window;                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn_L;                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn_R;                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_RivalLevel_C*                  WBP_CMN_RivalLevel;                                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GrandPrixTips_Sub_BG_Red_C*        WBP_GrandPrixTips_Sub_BG_Red;                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RivalSelect_Sub_CharaCutIn_C*      WBP_RivalSelect_Sub_CharaCutIn;                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RivalSelect_Sub_CharaInfo_C*       WBP_RivalSelect_Sub_CharaInfo;                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RivalSelect_Sub_Effects_Fire_C*    WBP_RivalSelect_Sub_Effects_Fire_01;               // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RivalSelect_Sub_Effects_Fire_C*    WBP_RivalSelect_Sub_Effects_Fire_02;               // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RivalSelect_Sub_GetInfo_C*         WBP_RivalSelect_Sub_GetInfo;                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RivalSelect_Sub_NextRival_C*       WBP_RivalSelect_Sub_NextRival;                     // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RivalSelect_Sub_WinInfo_C*         WBP_RivalSelect_Sub_WinInfo;                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<ESlateVisibility>                      DefaultChildVisibilitys;                           // 0x0538(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BeginBattleResultAnim();
	void BeginGrandPrixBattleResult();
	void BindButtonEvent();
	void Construct();
	void CustomEvent();
	void ExecuteUbergraph_WBP_RivalSelect(int32 EntryPoint);
	void Finished_D938AB0840BC40149C3764AAF92FD143();
	void GetStickerDataTable(class UDataTable** Sticker_Data_Table);
	void InitDefaultVisibility();
	void OnDisplayBattleResult();
	void OnFinishRivalIconInAnim();
	void PreConstruct(bool IsDesignTime);
	void SetChildrenOfHidden();
	void SetDebugFlags(const bool SetEnabled, const bool SetPlayRivalIconMax);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RivalSelect_C">();
	}
	static class UWBP_RivalSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RivalSelect_C>();
	}
};
static_assert(alignof(UWBP_RivalSelect_C) == 0x000008, "Wrong alignment on UWBP_RivalSelect_C");
static_assert(sizeof(UWBP_RivalSelect_C) == 0x000548, "Wrong size on UWBP_RivalSelect_C");
static_assert(offsetof(UWBP_RivalSelect_C, UberGraphFrame) == 0x000478, "Member 'UWBP_RivalSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, Base_AllWinInfo) == 0x000480, "Member 'UWBP_RivalSelect_C::Base_AllWinInfo' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, Base_WinComplete) == 0x000488, "Member 'UWBP_RivalSelect_C::Base_WinComplete' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, CanvasPanel_Main) == 0x000490, "Member 'UWBP_RivalSelect_C::CanvasPanel_Main' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, CharaIcon) == 0x000498, "Member 'UWBP_RivalSelect_C::CharaIcon' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, DSP_AllWinInfo) == 0x0004A0, "Member 'UWBP_RivalSelect_C::DSP_AllWinInfo' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, FooterBtnCover) == 0x0004A8, "Member 'UWBP_RivalSelect_C::FooterBtnCover' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, Grow_01) == 0x0004B0, "Member 'UWBP_RivalSelect_C::Grow_01' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, Grow_02) == 0x0004B8, "Member 'UWBP_RivalSelect_C::Grow_02' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, Icon_Complete) == 0x0004C0, "Member 'UWBP_RivalSelect_C::Icon_Complete' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, Plate_RivalLevel) == 0x0004C8, "Member 'UWBP_RivalSelect_C::Plate_RivalLevel' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, TXT_AllWinInfo) == 0x0004D0, "Member 'UWBP_RivalSelect_C::TXT_AllWinInfo' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, WBP_CharaSelect_Sub_Window) == 0x0004D8, "Member 'UWBP_RivalSelect_C::WBP_CharaSelect_Sub_Window' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, WBP_CMN_ControllerBtn_L) == 0x0004E0, "Member 'UWBP_RivalSelect_C::WBP_CMN_ControllerBtn_L' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, WBP_CMN_ControllerBtn_R) == 0x0004E8, "Member 'UWBP_RivalSelect_C::WBP_CMN_ControllerBtn_R' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, WBP_CMN_RivalLevel) == 0x0004F0, "Member 'UWBP_RivalSelect_C::WBP_CMN_RivalLevel' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, WBP_GrandPrixTips_Sub_BG_Red) == 0x0004F8, "Member 'UWBP_RivalSelect_C::WBP_GrandPrixTips_Sub_BG_Red' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, WBP_RivalSelect_Sub_CharaCutIn) == 0x000500, "Member 'UWBP_RivalSelect_C::WBP_RivalSelect_Sub_CharaCutIn' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, WBP_RivalSelect_Sub_CharaInfo) == 0x000508, "Member 'UWBP_RivalSelect_C::WBP_RivalSelect_Sub_CharaInfo' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, WBP_RivalSelect_Sub_Effects_Fire_01) == 0x000510, "Member 'UWBP_RivalSelect_C::WBP_RivalSelect_Sub_Effects_Fire_01' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, WBP_RivalSelect_Sub_Effects_Fire_02) == 0x000518, "Member 'UWBP_RivalSelect_C::WBP_RivalSelect_Sub_Effects_Fire_02' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, WBP_RivalSelect_Sub_GetInfo) == 0x000520, "Member 'UWBP_RivalSelect_C::WBP_RivalSelect_Sub_GetInfo' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, WBP_RivalSelect_Sub_NextRival) == 0x000528, "Member 'UWBP_RivalSelect_C::WBP_RivalSelect_Sub_NextRival' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, WBP_RivalSelect_Sub_WinInfo) == 0x000530, "Member 'UWBP_RivalSelect_C::WBP_RivalSelect_Sub_WinInfo' has a wrong offset!");
static_assert(offsetof(UWBP_RivalSelect_C, DefaultChildVisibilitys) == 0x000538, "Member 'UWBP_RivalSelect_C::DefaultChildVisibilitys' has a wrong offset!");

}

