#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSwitch

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CourseSwitch.WBP_CourseSwitch_C
// 0x00B8 (0x0400 - 0x0348)
class UWBP_CourseSwitch_C final : public UPartyRaceCourseSwitch
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CourseSwitch_Out;                                  // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CourseSwitch_Loop;                                 // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CourseSwitch_In;                                   // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_Black;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton_215;                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_93;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_BG_01_C*                       WBP_CMN_BG_01;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSwitch_Sub_DetailAnother_C*  WBP_CourseSwitch_Sub_DetailAnother;                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSwitch_Sub_DetailMain_C*     WBP_CourseSwitch_Sub_DetailMain;                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSwitch_ThumbWindow_C*        WBP_CourseSwitch_ThumbWindow;                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_Option_Btn_OK_C*     WBP_PartyRace_Sub_Option_Btn_OK;                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsOpen;                                           // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   ButtonPanel;                                       // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsClose;                                          // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnClosed;                                          // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUnionUIPopupWindowBase*                PopupWindow;                                       // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnCancel;                                          // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsGuest;                                           // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeTagImpl(EPartyRaceCourseSwitchTag Tag, EPartyRaceCourseSwitchBtnType NowBtnType);
	void ChangeTagImplEvent(EPartyRaceCourseSwitchTag Tag);
	void CheckIsGuest(bool IsGuest_0);
	void Construct();
	void CreatePopupWindow();
	void DestroyQuitConfirmWidget();
	void ExecuteUbergraph_WBP_CourseSwitch(int32 EntryPoint);
	void FadeInOutAnim(bool IsOut);
	void Finished_35AE12B14FF36FA8F2ABD3A181F28E68();
	void Finished_4C1273804AB7B4EDF40589B2D63D05AA();
	void FinishInAnimation();
	void OnCancelEvent_Event(class UUnionUIButtonBase* Button);
	void OnCourseIconCancelEvent(class UUnionUIButtonBase* Button);
	void OnCourseiconDecision(class UUnionUIButtonBase* Button);
	void OnCourseSwitchClose(bool IsCancel);
	void OnDecisionEvent_Event(class UUnionUIButtonBase* Button);
	void OnTagChangeLeft(class UUnionUIButtonBase* Button);
	void OnTagChangeRight(class UUnionUIButtonBase* Button);
	void OnUISceneDecisionEvent_Impl(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void PreConstruct(bool IsDesignTime);
	void UpdateDetail(const struct FStageDataAssetTableRow& Table);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CourseSwitch_C">();
	}
	static class UWBP_CourseSwitch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CourseSwitch_C>();
	}
};
static_assert(alignof(UWBP_CourseSwitch_C) == 0x000008, "Wrong alignment on UWBP_CourseSwitch_C");
static_assert(sizeof(UWBP_CourseSwitch_C) == 0x000400, "Wrong size on UWBP_CourseSwitch_C");
static_assert(offsetof(UWBP_CourseSwitch_C, UberGraphFrame) == 0x000348, "Member 'UWBP_CourseSwitch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, CourseSwitch_Out) == 0x000350, "Member 'UWBP_CourseSwitch_C::CourseSwitch_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, CourseSwitch_Loop) == 0x000358, "Member 'UWBP_CourseSwitch_C::CourseSwitch_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, CourseSwitch_In) == 0x000360, "Member 'UWBP_CourseSwitch_C::CourseSwitch_In' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, BG_Black) == 0x000368, "Member 'UWBP_CourseSwitch_C::BG_Black' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, OutOfContentButton_215) == 0x000370, "Member 'UWBP_CourseSwitch_C::OutOfContentButton_215' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, Panel) == 0x000378, "Member 'UWBP_CourseSwitch_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, SafeZone_93) == 0x000380, "Member 'UWBP_CourseSwitch_C::SafeZone_93' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, WBP_CMN_BG_01) == 0x000388, "Member 'UWBP_CourseSwitch_C::WBP_CMN_BG_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, WBP_CourseSwitch_Sub_DetailAnother) == 0x000390, "Member 'UWBP_CourseSwitch_C::WBP_CourseSwitch_Sub_DetailAnother' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, WBP_CourseSwitch_Sub_DetailMain) == 0x000398, "Member 'UWBP_CourseSwitch_C::WBP_CourseSwitch_Sub_DetailMain' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, WBP_CourseSwitch_ThumbWindow) == 0x0003A0, "Member 'UWBP_CourseSwitch_C::WBP_CourseSwitch_ThumbWindow' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, WBP_PartyRace_Sub_Option_Btn_OK) == 0x0003A8, "Member 'UWBP_CourseSwitch_C::WBP_PartyRace_Sub_Option_Btn_OK' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, WidgetSwitcher) == 0x0003B0, "Member 'UWBP_CourseSwitch_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, bIsOpen) == 0x0003B8, "Member 'UWBP_CourseSwitch_C::bIsOpen' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, ButtonPanel) == 0x0003C0, "Member 'UWBP_CourseSwitch_C::ButtonPanel' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, bIsClose) == 0x0003C8, "Member 'UWBP_CourseSwitch_C::bIsClose' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, OnClosed) == 0x0003D0, "Member 'UWBP_CourseSwitch_C::OnClosed' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, PopupWindow) == 0x0003E0, "Member 'UWBP_CourseSwitch_C::PopupWindow' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, OnCancel) == 0x0003E8, "Member 'UWBP_CourseSwitch_C::OnCancel' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_C, IsGuest) == 0x0003F8, "Member 'UWBP_CourseSwitch_C::IsGuest' has a wrong offset!");

}

