#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemGet_WindowMini

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemGet_WindowMini.WBP_ItemGet_WindowMini_C.ExecuteUbergraph_WBP_ItemGet_WindowMini
// 0x05A0 (0x05A0 - 0x0000)
struct WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRewardGetWindowParam>          K2Node_Event_InDisplayParamArray;                  // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_InWindowZOrder;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   K2Node_CustomEvent_InRewardType_5;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   K2Node_CustomEvent_InRewardType_4;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInVisible_1;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_GetItemIconImageWidget_OutImageWidget;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveWidgetIndexByRewardType_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetItemCountWidgetIconTexture_OutIconTexture; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRewardItemCount_ReturnValue;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetRewardItemIconTexture_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDisplayReward_ReturnValue;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckRewardItemCountDisplay_ReturnValue;  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_GetItemIconImageWidget_OutImageWidget_1;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   K2Node_CustomEvent_InRewardType_3;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InRewardId_2;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_2;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2; // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_3; // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x01B0(0x0004)()
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InRankTitleText;                // 0x01D0(0x0010)()
	class FText                                   K2Node_CustomEvent_InRewardTitleText;              // 0x01E0(0x0010)()
	bool                                          CallFunc_UnregisterSingleMenu_ReturnValue;         // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRewardDisplay;                 // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x01F4(0x0004)()
	ERateRank                                     K2Node_CustomEvent_InRateRank;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRewardGetWindowParam>          K2Node_CustomEvent_InRewardParam;                  // 0x0200(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_CustomEvent_InWindowZOrder;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x0217(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InItemNum;                      // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InItemGetNum;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   K2Node_CustomEvent_InRewardType_2;                 // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_InIconTexture;                  // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable;                              // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_1;                            // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInVisible;                     // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253[0x1];                                      // 0x0253(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x025E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25F[0x1];                                      // 0x025F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0260(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CMN_GadgetCountFullWindow_C*       CallFunc_Create_ReturnValue;                       // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A3[0x1];                                      // 0x02A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x02C0(0x0010)(ConstParm)
	class FText                                   K2Node_CustomEvent_InText_1;                       // 0x02D0(0x0010)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x02E8(0x0010)()
	ERewardType                                   K2Node_CustomEvent_InRewardType_1;                 // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InRewardId_1;                   // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InRewardNum;                    // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRewardItemNameText_ReturnValue;        // 0x0308(0x0010)()
	class FText                                   CallFunc_GetRewardTypeText_ReturnValue;            // 0x0318(0x0010)()
	int32                                         Temp_int_Variable_2;                               // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardType                                   K2Node_CustomEvent_InRewardType;                   // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InRewardId;                     // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_3;              // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x033B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachinePartsData                      CallFunc_GetMachinePartsDataById_OutMachinePartsData; // 0x0340(0x01F8)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0539(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x053A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x053B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetAnimationIn_OutAnimationIn;            // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetAnimationIn_OutAnimationIn_1;          // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetAnimationOut_OutAnimationOut;          // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetAnimationIn_OutAnimationIn_2;          // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_GetAnimationIn_OutAnimationIn_3;          // 0x0580(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRateRankLegend_ReturnValue;             // 0x058A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x058B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          K2Node_Select_Default_4;                           // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x0598(0x0004)()
};
static_assert(alignof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini) == 0x000008, "Wrong alignment on WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini");
static_assert(sizeof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini) == 0x0005A0, "Wrong size on WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, EntryPoint) == 0x000000, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_byte_Variable) == 0x000004, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_Event_InDisplayParamArray) == 0x000008, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_Event_InDisplayParamArray' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_Event_InWindowZOrder) == 0x000018, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_Event_InWindowZOrder' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRewardType_5) == 0x00001C, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRewardType_5' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRewardType_4) == 0x00001D, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRewardType_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_bInVisible_1) == 0x00001E, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_bInVisible_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetItemIconImageWidget_OutImageWidget) == 0x000020, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetItemIconImageWidget_OutImageWidget' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_SetActiveWidgetIndexByRewardType_ReturnValue) == 0x000028, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_SetActiveWidgetIndexByRewardType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000030, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetItemCountWidgetIconTexture_OutIconTexture) == 0x000038, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetItemCountWidgetIconTexture_OutIconTexture' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetRewardItemCount_ReturnValue) == 0x000040, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetRewardItemCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetRewardItemIconTexture_ReturnValue) == 0x000048, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetRewardItemIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_CheckDisplayReward_ReturnValue) == 0x000051, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_CheckDisplayReward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_CheckRewardItemCountDisplay_ReturnValue) == 0x000052, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_CheckRewardItemCountDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetItemIconImageWidget_OutImageWidget_1) == 0x000058, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetItemIconImageWidget_OutImageWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRewardType_3) == 0x000060, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRewardType_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRewardId_2) == 0x000064, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRewardId_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_bool_Variable) == 0x000068, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Conv_IntToByte_ReturnValue) == 0x000069, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetValidValue_ReturnValue) == 0x00006A, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetValidValue_ReturnValue_1) == 0x00006B, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000070, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000080, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetValidValue_ReturnValue_2) == 0x000090, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetValidValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Conv_ByteToString_ReturnValue) == 0x000098, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2) == 0x0000A8, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_3) == 0x0000B8, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_SwitchEnum_CmpSuccess) == 0x0000C8, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_MakeLiteralString_ReturnValue) == 0x0000D0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue) == 0x0000E0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000F0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000100, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000110, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000120, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000130, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000140, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000150, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000160, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000170, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000180, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue_11) == 0x000190, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Concat_StrStr_ReturnValue_12) == 0x0001A0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Concat_StrStr_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_SoundPlay_ReturnValue) == 0x0001B0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetPlayerController_ReturnValue) == 0x0001B8, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_DynamicCast_AsApp_Player_Controller) == 0x0001C0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRankTitleText) == 0x0001D0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRankTitleText' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRewardTitleText) == 0x0001E0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRewardTitleText' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_UnregisterSingleMenu_ReturnValue) == 0x0001F0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_UnregisterSingleMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_bRewardDisplay) == 0x0001F1, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_bRewardDisplay' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_SoundPlay_ReturnValue_1) == 0x0001F4, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRateRank) == 0x0001F8, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRateRank' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRewardParam) == 0x000200, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRewardParam' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InWindowZOrder) == 0x000210, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InWindowZOrder' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_SwitchInteger_CmpSuccess) == 0x000214, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000215, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_SwitchInteger_CmpSuccess_1) == 0x000216, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Array_IsNotEmpty_ReturnValue_1) == 0x000217, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Array_IsNotEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000218, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_SwitchInteger_CmpSuccess_2) == 0x000219, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_SwitchInteger_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InItemNum) == 0x00021C, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InItemNum' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InItemGetNum) == 0x000220, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InItemGetNum' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRewardType_2) == 0x000224, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRewardType_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InIconTexture) == 0x000228, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InIconTexture' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_int_Variable) == 0x000230, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Subtract_IntInt_ReturnValue) == 0x000234, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000238, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Max_ReturnValue) == 0x00023C, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_object_Variable) == 0x000240, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_object_Variable_1) == 0x000248, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_bool_Variable_1) == 0x000250, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_bInVisible) == 0x000251, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_bInVisible' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_IsVisible_ReturnValue) == 0x000252, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Array_Length_ReturnValue) == 0x000254, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Add_IntInt_ReturnValue_1) == 0x000258, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_IsValid_ReturnValue_1) == 0x00025C, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_IsValid_ReturnValue_2) == 0x00025D, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_IsValid_ReturnValue_3) == 0x00025E, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CreateDelegate_OutputDelegate) == 0x000260, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CreateDelegate_OutputDelegate_1) == 0x000270, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetPlayerController_ReturnValue_1) == 0x000280, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x000288, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_DynamicCast_bSuccess_1) == 0x000290, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Create_ReturnValue) == 0x000298, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_byte_Variable_1) == 0x0002A0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_byte_Variable_2) == 0x0002A1, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_bool_Variable_2) == 0x0002A2, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002A4, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_Select_Default) == 0x0002B4, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_int_Variable_1) == 0x0002B8, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_Select_Default_1) == 0x0002C0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InText_1) == 0x0002D0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InText_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_TextIsEmpty_ReturnValue) == 0x0002E0, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InVisibility) == 0x0002E1, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InText) == 0x0002E8, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRewardType_1) == 0x0002F8, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRewardType_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRewardId_1) == 0x0002FC, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRewardId_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRewardNum) == 0x000300, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRewardNum' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetRewardItemNameText_ReturnValue) == 0x000308, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetRewardItemNameText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetRewardTypeText_ReturnValue) == 0x000318, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetRewardTypeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_int_Variable_2) == 0x000328, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRewardType) == 0x00032C, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRewardType' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, K2Node_CustomEvent_InRewardId) == 0x000330, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::K2Node_CustomEvent_InRewardId' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_int_Variable_3) == 0x000334, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000338, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetValidValue_ReturnValue_3) == 0x000339, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetValidValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00033A, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00033B, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_GetMachinePartsDataById_OutMachinePartsData) == 0x000340, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_GetMachinePartsDataById_OutMachinePartsData' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_BooleanOR_ReturnValue) == 0x000538, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000539, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, CallFunc_BooleanOR_ReturnValue_1) == 0x00053A, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini, Temp_bool_Variable_3) == 0x00053B, "Member 'WBP_ItemGet_WindowMini_C_ExecuteUbergraph_WBP_ItemGet_WindowMini::Temp_bool_Variable_3' has a wrong offset!");
