#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSwitch_Sub_CourseIcon

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CourseSwitch_Sub_CourseIcon.WBP_CourseSwitch_Sub_CourseIcon_C
// 0x0098 (0x0530 - 0x0498)
class UWBP_CourseSwitch_Sub_CourseIcon_C final : public UPartyRaceCourseIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_Loop;                                       // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Loop;                                       // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CourseThumbnail;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CourseThumbnail_Base;                              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_ItemsSwitch;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_Select;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NewIconWave;                                   // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lock_Icon;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Off_Cover;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Off_Cover_DLC;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Off_Cover_Lock;                                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 On_Cover;                                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_DLC;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsFocus;                                          // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ターゲット;                                        // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         SoundOffCount;                                     // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGuest;                                           // 0x052C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void Construct();
	void OnFocus_Imp(class UUnionUIButtonBase* Button);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnBackKeyPressed();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnAcceptKeyPressed();
	void OnLeftShoulderPressed();
	void OnMouseDown();
	void SetFocusBP(bool bIsFocus_0);
	void SetSelectBP(bool bIsSelect);
	void FocusLost();
	void SetDecision();
	void OnUpdatedBP();
	void OnRightShoulderPressed();
	void SetSelectSoundOffCountBP(int32 Count);
	void CheckIsGuest(bool IsGuest_0);
	void ExecuteUbergraph_WBP_CourseSwitch_Sub_CourseIcon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CourseSwitch_Sub_CourseIcon_C">();
	}
	static class UWBP_CourseSwitch_Sub_CourseIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CourseSwitch_Sub_CourseIcon_C>();
	}
};
static_assert(alignof(UWBP_CourseSwitch_Sub_CourseIcon_C) == 0x000008, "Wrong alignment on UWBP_CourseSwitch_Sub_CourseIcon_C");
static_assert(sizeof(UWBP_CourseSwitch_Sub_CourseIcon_C) == 0x000530, "Wrong size on UWBP_CourseSwitch_Sub_CourseIcon_C");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, UberGraphFrame) == 0x000498, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, Select_Loop) == 0x0004A0, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, Active_Loop) == 0x0004A8, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, CourseThumbnail) == 0x0004B0, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::CourseThumbnail' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, CourseThumbnail_Base) == 0x0004B8, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::CourseThumbnail_Base' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, Cursor_ItemsSwitch) == 0x0004C0, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::Cursor_ItemsSwitch' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, Cursor_Select) == 0x0004C8, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::Cursor_Select' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, DSP_NewIconWave) == 0x0004D0, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::DSP_NewIconWave' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, Lock_Icon) == 0x0004D8, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::Lock_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, MouseInteraction) == 0x0004E0, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, Off_Cover) == 0x0004E8, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::Off_Cover' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, Off_Cover_DLC) == 0x0004F0, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::Off_Cover_DLC' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, Off_Cover_Lock) == 0x0004F8, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::Off_Cover_Lock' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, On_Cover) == 0x000500, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::On_Cover' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, TXT_DLC) == 0x000508, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::TXT_DLC' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, WidgetSwitcher) == 0x000510, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, bIsFocus) == 0x000518, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::bIsFocus' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, ターゲット) == 0x000520, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::ターゲット' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, SoundOffCount) == 0x000528, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::SoundOffCount' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_CourseIcon_C, IsGuest) == 0x00052C, "Member 'UWBP_CourseSwitch_Sub_CourseIcon_C::IsGuest' has a wrong offset!");

}

