#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FontScroll

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FontScroll.WBP_FontScroll_C
// 0x0040 (0x0700 - 0x06C0)
class UWBP_FontScroll_C final : public UUnionFontScroll
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UpdateTime;                                        // 0x06C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox;                                       // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Default;                                       // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        base;                                              // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Translation;                                       // 0x06F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_FontScroll(int32 EntryPoint);
	void RefreshText();
	void VisibilityChangedEvent(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FontScroll_C">();
	}
	static class UWBP_FontScroll_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FontScroll_C>();
	}
};
static_assert(alignof(UWBP_FontScroll_C) == 0x000010, "Wrong alignment on UWBP_FontScroll_C");
static_assert(sizeof(UWBP_FontScroll_C) == 0x000700, "Wrong size on UWBP_FontScroll_C");
static_assert(offsetof(UWBP_FontScroll_C, UberGraphFrame) == 0x0006C0, "Member 'UWBP_FontScroll_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FontScroll_C, UpdateTime) == 0x0006C8, "Member 'UWBP_FontScroll_C::UpdateTime' has a wrong offset!");
static_assert(offsetof(UWBP_FontScroll_C, Overlay_1) == 0x0006D0, "Member 'UWBP_FontScroll_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWBP_FontScroll_C, RetainerBox) == 0x0006D8, "Member 'UWBP_FontScroll_C::RetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_FontScroll_C, TXT_Default) == 0x0006E0, "Member 'UWBP_FontScroll_C::TXT_Default' has a wrong offset!");
static_assert(offsetof(UWBP_FontScroll_C, base) == 0x0006E8, "Member 'UWBP_FontScroll_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_FontScroll_C, Translation) == 0x0006F0, "Member 'UWBP_FontScroll_C::Translation' has a wrong offset!");

}

