#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ResultRate

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function WBP_ResultRate.WBP_ResultRate_C.ExecuteUbergraph_WBP_ResultRate
// 0x0170 (0x0170 - 0x0000)
struct WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOnlineRating_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBonusDispEndImpl_bIsEnd;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRateRankUIData                        CallFunc_GetRateRankUIData_ReturnValue;            // 0x0034(0x000C)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERateRank                                     CallFunc_GetRateRankNext_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x005C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRateRankBonus                         CallFunc_Array_Get_Item;                           // 0x00A0(0x0018)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRateRankUIData                        CallFunc_GetRateRankUIData_ReturnValue_1;          // 0x0108(0x000C)(NoDestructor)
	bool                                          CallFunc_GetRateRankBonusList_Get_bIsGetReward;    // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRateRankBonusList                     CallFunc_GetRateRankBonusList_ReturnValue;         // 0x0118(0x0010)()
	int32                                         CallFunc_GetOnlineRatingPrev_ReturnValue;          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERateRank                                     CallFunc_GetRateToRank_ReturnValue;                // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x013C(0x0004)()
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_RankUpRate_ImplicitCast;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_RankDownRate_ImplicitCast;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayRateRank_GaugeUpDownVoice_Bonus_ImplicitCast; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayRateRank_GaugeUpDownVoice_NowRate_ImplicitCast; // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayRateRank_GaugeUpDownVoice_NextRate_ImplicitCast; // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate) == 0x000008, "Wrong alignment on WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate");
static_assert(sizeof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate) == 0x000170, "Wrong size on WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, EntryPoint) == 0x000000, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_GetOnlineRating_ReturnValue) == 0x000004, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_GetOnlineRating_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_IsBonusDispEndImpl_bIsEnd) == 0x000009, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_IsBonusDispEndImpl_bIsEnd' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, K2Node_SwitchEnum_CmpSuccess_1) == 0x000031, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_GetRateRankUIData_ReturnValue) == 0x000034, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_GetRateRankUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_GetRateRankNext_ReturnValue) == 0x000058, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_GetRateRankNext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, K2Node_Event_MyGeometry) == 0x00005C, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, K2Node_Event_InDeltaTime) == 0x000094, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, Temp_int_Array_Index_Variable) == 0x000098, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000B8, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0000C0, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000C8, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D0, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000D8, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000E0, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, K2Node_CreateDelegate_OutputDelegate) == 0x0000F0, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000100, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, Temp_int_Variable) == 0x000104, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_GetRateRankUIData_ReturnValue_1) == 0x000108, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_GetRateRankUIData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_GetRateRankBonusList_Get_bIsGetReward) == 0x000114, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_GetRateRankBonusList_Get_bIsGetReward' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_GetRateRankBonusList_ReturnValue) == 0x000118, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_GetRateRankBonusList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_GetOnlineRatingPrev_ReturnValue) == 0x000128, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_GetOnlineRatingPrev_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_GetRateToRank_ReturnValue) == 0x00012C, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_GetRateToRank_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000130, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000138, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_SoundPlay_ReturnValue) == 0x00013C, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_Conv_ByteToString_ReturnValue) == 0x000140, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, K2Node_VariableSet_RankUpRate_ImplicitCast) == 0x000150, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::K2Node_VariableSet_RankUpRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, K2Node_VariableSet_RankDownRate_ImplicitCast) == 0x000158, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::K2Node_VariableSet_RankDownRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_PlayRateRank_GaugeUpDownVoice_Bonus_ImplicitCast) == 0x000160, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_PlayRateRank_GaugeUpDownVoice_Bonus_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_PlayRateRank_GaugeUpDownVoice_NowRate_ImplicitCast) == 0x000164, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_PlayRateRank_GaugeUpDownVoice_NowRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate, CallFunc_PlayRateRank_GaugeUpDownVoice_NextRate_ImplicitCast) == 0x000168, "Member 'WBP_ResultRate_C_ExecuteUbergraph_WBP_ResultRate::CallFunc_PlayRateRank_GaugeUpDownVoice_NextRate_ImplicitCast' has a wrong offset!");

// Function WBP_ResultRate.WBP_ResultRate_C.SetOpenTipsWindow
// 0x0001 (0x0001 - 0x0000)
struct WBP_ResultRate_C_SetOpenTipsWindow final
{
public:
	bool                                          InOpenWindow;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_C_SetOpenTipsWindow) == 0x000001, "Wrong alignment on WBP_ResultRate_C_SetOpenTipsWindow");
static_assert(sizeof(WBP_ResultRate_C_SetOpenTipsWindow) == 0x000001, "Wrong size on WBP_ResultRate_C_SetOpenTipsWindow");
static_assert(offsetof(WBP_ResultRate_C_SetOpenTipsWindow, InOpenWindow) == 0x000000, "Member 'WBP_ResultRate_C_SetOpenTipsWindow::InOpenWindow' has a wrong offset!");

// Function WBP_ResultRate.WBP_ResultRate_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_ResultRate_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_C_Tick) == 0x000004, "Wrong alignment on WBP_ResultRate_C_Tick");
static_assert(sizeof(WBP_ResultRate_C_Tick) == 0x00003C, "Wrong size on WBP_ResultRate_C_Tick");
static_assert(offsetof(WBP_ResultRate_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_ResultRate_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_ResultRate_C_Tick::InDeltaTime' has a wrong offset!");

}

