#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusInfo_Sub_Ranking

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_StatusInfo_Sub_Ranking.WBP_StatusInfo_Sub_Ranking_C.ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking
// 0x0090 (0x0090 - 0x0000)
struct WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPrivaliegeErrorMessage_ReturnValue;    // 0x0008(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0028(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0038(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0048(0x0010)()
	bool                                          K2Node_Event_IsVisible;                            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0060(0x0010)()
	class FText                                   CallFunc_GetTerminologyTextByText_ReturnValue;     // 0x0070(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0080(0x0010)()
};
static_assert(alignof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking) == 0x000008, "Wrong alignment on WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking");
static_assert(sizeof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking) == 0x000090, "Wrong size on WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, EntryPoint) == 0x000000, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, CallFunc_GetPrivaliegeErrorMessage_ReturnValue) == 0x000008, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::CallFunc_GetPrivaliegeErrorMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, Temp_bool_Variable) == 0x000018, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, Temp_byte_Variable) == 0x000019, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, Temp_byte_Variable_1) == 0x00001A, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, Temp_bool_Variable_1) == 0x00001B, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, Temp_byte_Variable_2) == 0x00001C, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, Temp_byte_Variable_3) == 0x00001D, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue) == 0x000028, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000038, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000048, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, K2Node_Event_IsVisible) == 0x000058, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::K2Node_Event_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, K2Node_Select_Default) == 0x000059, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, K2Node_Select_Default_1) == 0x00005A, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000060, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, CallFunc_GetTerminologyTextByText_ReturnValue) == 0x000070, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::CallFunc_GetTerminologyTextByText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_4) == 0x000080, "Member 'WBP_StatusInfo_Sub_Ranking_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");

// Function WBP_StatusInfo_Sub_Ranking.WBP_StatusInfo_Sub_Ranking_C.SetPlatformButtonVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_StatusInfo_Sub_Ranking_C_SetPlatformButtonVisible final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusInfo_Sub_Ranking_C_SetPlatformButtonVisible) == 0x000001, "Wrong alignment on WBP_StatusInfo_Sub_Ranking_C_SetPlatformButtonVisible");
static_assert(sizeof(WBP_StatusInfo_Sub_Ranking_C_SetPlatformButtonVisible) == 0x000001, "Wrong size on WBP_StatusInfo_Sub_Ranking_C_SetPlatformButtonVisible");
static_assert(offsetof(WBP_StatusInfo_Sub_Ranking_C_SetPlatformButtonVisible, IsVisible_0) == 0x000000, "Member 'WBP_StatusInfo_Sub_Ranking_C_SetPlatformButtonVisible::IsVisible_0' has a wrong offset!");

}

