#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupSelect_3Layout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_GroupSelect_3Layout.WBP_GroupSelect_3Layout_C.DoCustomNavigation
// 0x0010 (0x0010 - 0x0000)
struct WBP_GroupSelect_3Layout_C_DoCustomNavigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupSelect_3Layout_C_DoCustomNavigation) == 0x000008, "Wrong alignment on WBP_GroupSelect_3Layout_C_DoCustomNavigation");
static_assert(sizeof(WBP_GroupSelect_3Layout_C_DoCustomNavigation) == 0x000010, "Wrong size on WBP_GroupSelect_3Layout_C_DoCustomNavigation");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_DoCustomNavigation, Navigation_0) == 0x000000, "Member 'WBP_GroupSelect_3Layout_C_DoCustomNavigation::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_DoCustomNavigation, ReturnValue) == 0x000008, "Member 'WBP_GroupSelect_3Layout_C_DoCustomNavigation::ReturnValue' has a wrong offset!");

// Function WBP_GroupSelect_3Layout.WBP_GroupSelect_3Layout_C.ExecuteUbergraph_WBP_GroupSelect_3Layout
// 0x0780 (0x0780 - 0x0000)
struct WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EUnionUIControlDir                            K2Node_CustomEvent_Dir;                            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        K2Node_DynamicCast_AsGroup_Select_Component_Controller; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_1;     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSettingCourseSelecting                   CallFunc_GetRaceSettingCourseSelecting_ReturnValue; // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_2;     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_3;     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_4;     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;          // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, EUnionUIControlDir Dir)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_1;                         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GroupSelect_Sub_Table_Line_C*      K2Node_DynamicCast_AsWBP_Group_Select_Sub_Table_Line; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_2;                         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_3;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_4;                         // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_5;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UGroupSelectComponentController*> K2Node_MakeArray_Array;                           // 0x0178(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x019C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_6;                         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_Array_Get_Item_7;                         // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x01C8(0x0004)()
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_SpawnObject_ReturnValue;                  // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0204(0x0004)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20E[0x2];                                      // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_5;     // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_2;      // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue_1;        // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_236[0x2];                                      // 0x0236(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_6;            // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue_2;        // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0247(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_3;      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B[0x1];                                      // 0x024B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_256[0x2];                                      // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlateMoving_ReturnValue;                // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlateMoving_ReturnValue_1;              // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_CreatePlayer_ReturnValue;                 // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_2;      // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x2];                                      // 0x02BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_4;        // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_8;                         // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLobbyIndexFromArray_ReturnValue;       // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlatformIconIndex_ReturnValue;         // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRacerName_OutRacerName;                // 0x02E8(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetRacerDriverId_OutId;                   // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLobbyIndexFromArray_ReturnValue_1;     // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetOnlineDriverIdFromArray_ReturnValue;   // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDriverData                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0328(0x0390)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetRacerDriverId_OutId_1;                 // 0x06B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BA[0x6];                                      // 0x06BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x06C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_9;                         // 0x06D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x06DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x06DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue_3;        // 0x06DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_2;         // 0x06DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x06E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x06E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_4;      // 0x06E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x06E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x06E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x06E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_5;      // 0x06E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x06EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ED[0x3];                                      // 0x06ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_Array_Get_Item_10;                        // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      K2Node_DynamicCast_AsWBP_Group_Select_Sub_Table_Line_1; // 0x06F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_6;      // 0x0701(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x0702(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0703(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x0704(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_705[0x3];                                      // 0x0705(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_7;        // 0x0708(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue_4;        // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x3];                                      // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_8;        // 0x071C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_7;      // 0x072C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72D[0x3];                                      // 0x072D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_GetMouseControllComponent_ReturnValue;    // 0x0730(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_8;      // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_739[0x7];                                      // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_GetMouseControllComponent_ReturnValue_1;  // 0x0740(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEndFlag_ReturnValue;                   // 0x0749(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x074A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x074B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x074C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x074D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEndFlag_ReturnValue_1;                 // 0x074E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_13;               // 0x074F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0751(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_9;      // 0x0752(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_753[0x5];                                      // 0x0753(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupSelectComponentController*        CallFunc_GetMouseControllComponent_ReturnValue_2;  // 0x0758(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEndFlag_ReturnValue_2;                 // 0x0761(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_14;               // 0x0762(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0763(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0764(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_765[0x3];                                      // 0x0765(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0768(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x0770(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout) == 0x000008, "Wrong alignment on WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout");
static_assert(sizeof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout) == 0x000780, "Wrong size on WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, EntryPoint) == 0x000000, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_CustomEvent_Button) == 0x000010, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_CustomEvent_Dir) == 0x000018, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_CustomEvent_Dir' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetPlayerController_ReturnValue_1) == 0x000020, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_DynamicCast_AsGroup_Select_Component_Controller) == 0x000030, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_DynamicCast_AsGroup_Select_Component_Controller' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetPlayerController_ReturnValue_2) == 0x000040, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Array_Find_ReturnValue) == 0x000048, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetPlayerController_ReturnValue_3) == 0x000058, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetPlayerController_ReturnValue_4) == 0x000060, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, Temp_int_Array_Index_Variable) == 0x000070, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetIsOnlineGameMode_ReturnValue) == 0x000078, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetIsOnlineGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x00007C, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000080, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000084, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetSelectedPlayerCount_ReturnValue_1) == 0x000088, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetSelectedPlayerCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetRaceSettingCourseSelecting_ReturnValue) == 0x00008C, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetRaceSettingCourseSelecting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_SwitchEnum_CmpSuccess_1) == 0x00008D, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetSelectedPlayerCount_ReturnValue_2) == 0x000090, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetSelectedPlayerCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_PlayAnimation_ReturnValue_1) == 0x000098, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetSelectedPlayerCount_ReturnValue_3) == 0x0000A0, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetSelectedPlayerCount_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0000A4, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_CustomEvent_Button_1) == 0x0000B0, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_CustomEvent_Button_2) == 0x0000B8, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetPlayerController_ReturnValue_5) == 0x0000C0, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GetSelectedPlayerCount_ReturnValue_4) == 0x0000C8, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GetSelectedPlayerCount_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x0000CC, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000D0, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_CreateDelegate_OutputDelegate) == 0x0000D4, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E4, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_BooleanOR_ReturnValue) == 0x0000F4, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_BooleanOR_ReturnValue_1) == 0x0000F5, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Not_PreBool_ReturnValue) == 0x0000F6, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x0000F7, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, Temp_int_Variable) == 0x0000F8, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000FC, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Array_Get_Item) == 0x000110, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000119, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Add_IntInt_ReturnValue_1) == 0x00011C, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Array_Get_Item_1) == 0x000120, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Array_Length_ReturnValue_1) == 0x000128, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_DynamicCast_AsWBP_Group_Select_Sub_Table_Line) == 0x000130, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_DynamicCast_AsWBP_Group_Select_Sub_Table_Line' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout, CallFunc_Array_LastIndex_ReturnValue) == 0x00013C, "Member 'WBP_GroupSelect_3Layout_C_ExecuteUbergraph_WBP_GroupSelect_3Layout::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
