#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSwitch

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function WBP_CourseSwitch.WBP_CourseSwitch_C.ChangeTagImpl
// 0x0002 (0x0002 - 0x0000)
struct WBP_CourseSwitch_C_ChangeTagImpl final
{
public:
	EPartyRaceCourseSwitchTag                     Tag;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRaceCourseSwitchBtnType                 NowBtnType;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSwitch_C_ChangeTagImpl) == 0x000001, "Wrong alignment on WBP_CourseSwitch_C_ChangeTagImpl");
static_assert(sizeof(WBP_CourseSwitch_C_ChangeTagImpl) == 0x000002, "Wrong size on WBP_CourseSwitch_C_ChangeTagImpl");
static_assert(offsetof(WBP_CourseSwitch_C_ChangeTagImpl, Tag) == 0x000000, "Member 'WBP_CourseSwitch_C_ChangeTagImpl::Tag' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ChangeTagImpl, NowBtnType) == 0x000001, "Member 'WBP_CourseSwitch_C_ChangeTagImpl::NowBtnType' has a wrong offset!");

// Function WBP_CourseSwitch.WBP_CourseSwitch_C.ChangeTagImplEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_CourseSwitch_C_ChangeTagImplEvent final
{
public:
	EPartyRaceCourseSwitchTag                     Tag;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSwitch_C_ChangeTagImplEvent) == 0x000001, "Wrong alignment on WBP_CourseSwitch_C_ChangeTagImplEvent");
static_assert(sizeof(WBP_CourseSwitch_C_ChangeTagImplEvent) == 0x000001, "Wrong size on WBP_CourseSwitch_C_ChangeTagImplEvent");
static_assert(offsetof(WBP_CourseSwitch_C_ChangeTagImplEvent, Tag) == 0x000000, "Member 'WBP_CourseSwitch_C_ChangeTagImplEvent::Tag' has a wrong offset!");

// Function WBP_CourseSwitch.WBP_CourseSwitch_C.CheckIsGuest
// 0x0001 (0x0001 - 0x0000)
struct WBP_CourseSwitch_C_CheckIsGuest final
{
public:
	bool                                          IsGuest_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSwitch_C_CheckIsGuest) == 0x000001, "Wrong alignment on WBP_CourseSwitch_C_CheckIsGuest");
static_assert(sizeof(WBP_CourseSwitch_C_CheckIsGuest) == 0x000001, "Wrong size on WBP_CourseSwitch_C_CheckIsGuest");
static_assert(offsetof(WBP_CourseSwitch_C_CheckIsGuest, IsGuest_0) == 0x000000, "Member 'WBP_CourseSwitch_C_CheckIsGuest::IsGuest_0' has a wrong offset!");

// Function WBP_CourseSwitch.WBP_CourseSwitch_C.ExecuteUbergraph_WBP_CourseSwitch
// 0x03C0 (0x03C0 - 0x0000)
struct WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_6;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsCancel;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_5;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPartyRaceCourseSwitchTag                     K2Node_CustomEvent_Tag;                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRaceCourseSwitchBtnType                 K2Node_CustomEvent_NowBtnType;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_4;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_3;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStageDataAssetTableRow                K2Node_CustomEvent_Table;                          // 0x0040(0x00E0)()
	bool                                          CallFunc_SetDecisionLastSelect_ReturnValue;        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0124(0x0004)()
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;          // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0160(0x0010)()
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0178(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0188(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0198(0x0010)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x01A8(0x0004)()
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x01B0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_GetCursorIndex_ReturnValue;               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x01C4(0x0004)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPartyRaceCourseIcon*                   CallFunc_Array_Get_Item;                           // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x01DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_2;        // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsGuest;                              // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIsSameSetting_ReturnValue;           // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226[0x2];                                      // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_3;                  // 0x0228(0x0004)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCursorIndex_ReturnValue_1;             // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPartyRaceCourseIcon*                   CallFunc_GetCourseIcon_ReturnValue;                // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface; // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1; // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2; // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3; // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4; // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIsSameSetting_ReturnValue_1;         // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x02B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x02B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_5;        // 0x02BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_6;        // 0x0310(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowBase*                CallFunc_CreatePopupWindow_ReturnValue;            // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x0328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_4;                  // 0x0330(0x0004)()
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue;           // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_353[0x1];                                      // 0x0353(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_7;        // 0x0354(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCursorIndex_ReturnValue_2;             // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_5;                  // 0x0374(0x0004)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   CallFunc_SpawnObject_ReturnValue;                  // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_2;         // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x038B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x038D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRaceCourseSwitchTag                     K2Node_Event_Tag;                                  // 0x038E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x038F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_8; // 0x0390(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x03A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch) == 0x000008, "Wrong alignment on WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch");
static_assert(sizeof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch) == 0x0003C0, "Wrong size on WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, EntryPoint) == 0x000000, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_Button_6) == 0x000008, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, Temp_bool_IsClosed_Variable) == 0x000010, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_IsCancel) == 0x000018, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_IsCancel' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_Button_5) == 0x000020, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_Tag) == 0x000028, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_NowBtnType) == 0x000029, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_NowBtnType' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_SwitchEnum_CmpSuccess_1) == 0x00002A, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_Button_4) == 0x000030, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_Button_3) == 0x000038, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_Table) == 0x000040, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_Table' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_SetDecisionLastSelect_ReturnValue) == 0x000120, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_SetDecisionLastSelect_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_SoundPlay_ReturnValue) == 0x000124, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, Temp_bool_Has_Been_Initd_Variable) == 0x000128, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_Button_2) == 0x000130, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_PanelIndex) == 0x000138, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_ButtonIndex) == 0x00013C, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_SwitchInteger_CmpSuccess) == 0x000140, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CreateDelegate_OutputDelegate) == 0x000144, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, Temp_int_Loop_Counter_Variable) == 0x000154, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Less_IntInt_ReturnValue) == 0x000158, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Add_IntInt_ReturnValue) == 0x00015C, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_MakeLiteralText_ReturnValue) == 0x000160, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000170, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000178, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000188, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000198, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_SoundPlay_ReturnValue_1) == 0x0001A8, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_MakeArray_Array) == 0x0001B0, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_GetCursorIndex_ReturnValue) == 0x0001C0, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_GetCursorIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_SoundPlay_ReturnValue_2) == 0x0001C4, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, Temp_int_Array_Index_Variable) == 0x0001C8, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Array_Get_Item) == 0x0001D0, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001D8, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001DC, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_IsValid_ReturnValue) == 0x0001EC, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_IsInViewport_ReturnValue) == 0x0001ED, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_IsValid_ReturnValue_1) == 0x0001EE, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_IsValid_ReturnValue_2) == 0x0001EF, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001F0, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CreateDelegate_OutputDelegate_3) == 0x000200, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000210, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Not_PreBool_ReturnValue) == 0x000211, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_Event_IsGuest) == 0x000212, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_Event_IsGuest' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_CheckIsSameSetting_ReturnValue) == 0x000213, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_CheckIsSameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CreateDelegate_OutputDelegate_4) == 0x000214, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Not_PreBool_ReturnValue_1) == 0x000224, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_MakeLiteralByte_ReturnValue) == 0x000225, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_SoundPlay_ReturnValue_3) == 0x000228, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_SoundPlay_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00022C, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_GetCursorIndex_ReturnValue_1) == 0x000230, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_GetCursorIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_GetCourseIcon_ReturnValue) == 0x000238, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_GetCourseIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_DynamicCast_AsMenu_Popup_Window_Interface) == 0x000240, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_DynamicCast_AsMenu_Popup_Window_Interface' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_DynamicCast_bSuccess) == 0x000250, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1) == 0x000258, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_DynamicCast_bSuccess_1) == 0x000268, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2) == 0x000270, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_DynamicCast_bSuccess_2) == 0x000280, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3) == 0x000288, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_DynamicCast_bSuccess_3) == 0x000298, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4) == 0x0002A0, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_DynamicCast_bSuccess_4) == 0x0002B0, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_CheckIsSameSetting_ReturnValue_1) == 0x0002B1, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_CheckIsSameSetting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Not_PreBool_ReturnValue_2) == 0x0002B2, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Not_PreBool_ReturnValue_3) == 0x0002B3, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_BooleanAND_ReturnValue) == 0x0002B4, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x0002B5, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Not_PreBool_ReturnValue_4) == 0x0002B6, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Not_PreBool_ReturnValue_5) == 0x0002B7, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_BooleanAND_ReturnValue_1) == 0x0002B8, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002BC, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0002D0, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0002D8, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_IsValid_ReturnValue_3) == 0x0002E0, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x0002E8, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x0002F0, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_IsValid_ReturnValue_4) == 0x0002F8, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_GetOwningPlayer_ReturnValue) == 0x000300, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000308, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CreateDelegate_OutputDelegate_6) == 0x000310, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_CreatePopupWindow_ReturnValue) == 0x000320, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_CreatePopupWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_Button_1) == 0x000328, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_SoundPlay_ReturnValue_4) == 0x000330, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_SoundPlay_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000338, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_HasAnyUserFocus_ReturnValue) == 0x000340, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000348, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_DynamicCast_bSuccess_5) == 0x000350, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Not_PreBool_ReturnValue_6) == 0x000351, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_UnregisterMainMenu_ReturnValue) == 0x000352, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_UnregisterMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CreateDelegate_OutputDelegate_7) == 0x000354, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CustomEvent_Button) == 0x000368, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_GetCursorIndex_ReturnValue_2) == 0x000370, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_GetCursorIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_SoundPlay_ReturnValue_5) == 0x000374, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_SoundPlay_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Not_PreBool_ReturnValue_7) == 0x000378, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Not_PreBool_ReturnValue_8) == 0x000379, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_SpawnObject_ReturnValue) == 0x000380, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_IsAnimationPlaying_ReturnValue_2) == 0x000388, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_IsAnimationPlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Not_PreBool_ReturnValue_9) == 0x000389, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Not_PreBool_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Not_PreBool_ReturnValue_10) == 0x00038A, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Not_PreBool_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_IsValid_ReturnValue_5) == 0x00038B, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_BooleanAND_ReturnValue_2) == 0x00038C, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_Not_PreBool_ReturnValue_11) == 0x00038D, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_Not_PreBool_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_Event_Tag) == 0x00038E, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_Event_Tag' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_BooleanAND_ReturnValue_3) == 0x00038F, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CreateDelegate_OutputDelegate_8) == 0x000390, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, CallFunc_GetPlayerController_ReturnValue) == 0x0003A0, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_CreateDelegate_OutputDelegate_9) == 0x0003A8, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch, K2Node_SwitchEnum_CmpSuccess_2) == 0x0003B8, "Member 'WBP_CourseSwitch_C_ExecuteUbergraph_WBP_CourseSwitch::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");

// Function WBP_CourseSwitch.WBP_CourseSwitch_C.FadeInOutAnim
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_CourseSwitch_C_FadeInOutAnim final
{
public:
	bool                                          IsOut;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStageDataAssetTableRow                CallFunc_GetDataTable_ReturnValue;                 // 0x0008(0x00E0)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSwitch_C_FadeInOutAnim) == 0x000008, "Wrong alignment on WBP_CourseSwitch_C_FadeInOutAnim");
static_assert(sizeof(WBP_CourseSwitch_C_FadeInOutAnim) == 0x0000F8, "Wrong size on WBP_CourseSwitch_C_FadeInOutAnim");
static_assert(offsetof(WBP_CourseSwitch_C_FadeInOutAnim, IsOut) == 0x000000, "Member 'WBP_CourseSwitch_C_FadeInOutAnim::IsOut' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_FadeInOutAnim, CallFunc_GetDataTable_ReturnValue) == 0x000008, "Member 'WBP_CourseSwitch_C_FadeInOutAnim::CallFunc_GetDataTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_FadeInOutAnim, CallFunc_PlayAnimation_ReturnValue) == 0x0000E8, "Member 'WBP_CourseSwitch_C_FadeInOutAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSwitch_C_FadeInOutAnim, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000F0, "Member 'WBP_CourseSwitch_C_FadeInOutAnim::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_CourseSwitch.WBP_CourseSwitch_C.OnCancelEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_CourseSwitch_C_OnCancelEvent_Event final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSwitch_C_OnCancelEvent_Event) == 0x000008, "Wrong alignment on WBP_CourseSwitch_C_OnCancelEvent_Event");
static_assert(sizeof(WBP_CourseSwitch_C_OnCancelEvent_Event) == 0x000008, "Wrong size on WBP_CourseSwitch_C_OnCancelEvent_Event");
static_assert(offsetof(WBP_CourseSwitch_C_OnCancelEvent_Event, Button) == 0x000000, "Member 'WBP_CourseSwitch_C_OnCancelEvent_Event::Button' has a wrong offset!");

// Function WBP_CourseSwitch.WBP_CourseSwitch_C.OnCourseIconCancelEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_CourseSwitch_C_OnCourseIconCancelEvent final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSwitch_C_OnCourseIconCancelEvent) == 0x000008, "Wrong alignment on WBP_CourseSwitch_C_OnCourseIconCancelEvent");
static_assert(sizeof(WBP_CourseSwitch_C_OnCourseIconCancelEvent) == 0x000008, "Wrong size on WBP_CourseSwitch_C_OnCourseIconCancelEvent");
static_assert(offsetof(WBP_CourseSwitch_C_OnCourseIconCancelEvent, Button) == 0x000000, "Member 'WBP_CourseSwitch_C_OnCourseIconCancelEvent::Button' has a wrong offset!");

// Function WBP_CourseSwitch.WBP_CourseSwitch_C.OnCourseiconDecision
// 0x0008 (0x0008 - 0x0000)
struct WBP_CourseSwitch_C_OnCourseiconDecision final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSwitch_C_OnCourseiconDecision) == 0x000008, "Wrong alignment on WBP_CourseSwitch_C_OnCourseiconDecision");
static_assert(sizeof(WBP_CourseSwitch_C_OnCourseiconDecision) == 0x000008, "Wrong size on WBP_CourseSwitch_C_OnCourseiconDecision");
static_assert(offsetof(WBP_CourseSwitch_C_OnCourseiconDecision, Button) == 0x000000, "Member 'WBP_CourseSwitch_C_OnCourseiconDecision::Button' has a wrong offset!");

// Function WBP_CourseSwitch.WBP_CourseSwitch_C.OnCourseSwitchClose
// 0x0001 (0x0001 - 0x0000)
struct WBP_CourseSwitch_C_OnCourseSwitchClose final
{
public:
	bool                                          IsCancel;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSwitch_C_OnCourseSwitchClose) == 0x000001, "Wrong alignment on WBP_CourseSwitch_C_OnCourseSwitchClose");
