#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupResult_Sub_TeamTable

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_GroupResult_Sub_TeamTable.WBP_GroupResult_Sub_TeamTable_C.ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable
// 0x0248 (0x0248 - 0x0000)
struct WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0050(0x0010)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFestaUIDataAsset*                      K2Node_DynamicCast_AsFesta_UIData_Asset;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0090(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0094(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x0098(0x0004)()
	struct FSoundHandle                           CallFunc_Stop_ReturnValue;                         // 0x009C(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_3;                  // 0x00A0(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_4;                  // 0x00A4(0x0004)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ColorIndex;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetFestaMainColor_ReturnValue;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x00BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Point_1;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0118(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_5;                  // 0x0134(0x0004)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Point;                          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_6;                  // 0x0144(0x0004)()
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0168(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0178(0x0010)()
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceSettingGrouping                          CallFunc_GetRaceSettingGrouping_ReturnValue;       // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x1];                                      // 0x01A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFestaIdUtil_ReturnValue;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFestaTeamUIData>               CallFunc_GetFestaUITableDataTeamUIDataArray_ReturnValue; // 0x01A8(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFestaTeamUIData                       CallFunc_Array_Get_Item;                           // 0x01C0(0x0078)()
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable) == 0x000008, "Wrong alignment on WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable");
static_assert(sizeof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable) == 0x000248, "Wrong size on WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, EntryPoint) == 0x000000, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000004, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, K2Node_Event_MyGeometry) == 0x000010, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_MakeLiteralText_ReturnValue) == 0x000050, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000068, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000070, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_IsValid_ReturnValue_1) == 0x000072, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, K2Node_DynamicCast_AsFesta_UIData_Asset) == 0x000078, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::K2Node_DynamicCast_AsFesta_UIData_Asset' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_SoundPlay_ReturnValue) == 0x000090, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_SoundPlay_ReturnValue_1) == 0x000094, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_SoundPlay_ReturnValue_2) == 0x000098, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_Stop_ReturnValue) == 0x00009C, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_SoundPlay_ReturnValue_3) == 0x0000A0, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_SoundPlay_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_SoundPlay_ReturnValue_4) == 0x0000A4, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_SoundPlay_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A8, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, K2Node_CustomEvent_ColorIndex) == 0x0000B0, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::K2Node_CustomEvent_ColorIndex' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, K2Node_CustomEvent_Index) == 0x0000B4, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_GetFestaMainColor_ReturnValue) == 0x0000B8, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_GetFestaMainColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x0000BC, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000D0, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x0000D8, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, K2Node_CustomEvent_Point_1) == 0x0000E0, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::K2Node_CustomEvent_Point_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000E8, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_Conv_IntToString_ReturnValue) == 0x0000F8, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_Concat_StrStr_ReturnValue) == 0x000108, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_Conv_StringToText_ReturnValue) == 0x000118, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_PlayAnimation_ReturnValue_2) == 0x000128, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000130, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_SoundPlay_ReturnValue_5) == 0x000134, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_SoundPlay_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000138, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000139, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00013A, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_BooleanOR_ReturnValue) == 0x00013B, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_BooleanOR_ReturnValue_1) == 0x00013C, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00013D, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, K2Node_CustomEvent_Point) == 0x000140, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::K2Node_CustomEvent_Point' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_SoundPlay_ReturnValue_6) == 0x000144, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_SoundPlay_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, Temp_struct_Variable) == 0x000148, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, Temp_struct_Variable_1) == 0x000158, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000168, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000178, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_GetSelectedGameModeId_ReturnValue_1) == 0x000188, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_GetSelectedGameModeId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_GetRaceSettingGrouping_ReturnValue) == 0x000189, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_GetRaceSettingGrouping_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00018A, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00018B, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x00018C, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x00018D, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, Temp_struct_Variable_2) == 0x000190, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_BooleanOR_ReturnValue_2) == 0x0001A0, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_BooleanOR_ReturnValue_3) == 0x0001A1, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_BooleanAND_ReturnValue) == 0x0001A2, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_GetFestaIdUtil_ReturnValue) == 0x0001A4, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_GetFestaIdUtil_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_GetFestaUITableDataTeamUIDataArray_ReturnValue) == 0x0001A8, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_GetFestaUITableDataTeamUIDataArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, Temp_int_Variable) == 0x0001B8, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, CallFunc_Array_Get_Item) == 0x0001C0, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable, K2Node_Select_Default) == 0x000238, "Member 'WBP_GroupResult_Sub_TeamTable_C_ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GroupResult_Sub_TeamTable.WBP_GroupResult_Sub_TeamTable_C.OpenFestaBonusIconTeamTotal
// 0x0004 (0x0004 - 0x0000)
struct WBP_GroupResult_Sub_TeamTable_C_OpenFestaBonusIconTeamTotal final
{
public:
	int32                                         Point;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_TeamTable_C_OpenFestaBonusIconTeamTotal) == 0x000004, "Wrong alignment on WBP_GroupResult_Sub_TeamTable_C_OpenFestaBonusIconTeamTotal");
static_assert(sizeof(WBP_GroupResult_Sub_TeamTable_C_OpenFestaBonusIconTeamTotal) == 0x000004, "Wrong size on WBP_GroupResult_Sub_TeamTable_C_OpenFestaBonusIconTeamTotal");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_OpenFestaBonusIconTeamTotal, Point) == 0x000000, "Member 'WBP_GroupResult_Sub_TeamTable_C_OpenFestaBonusIconTeamTotal::Point' has a wrong offset!");

// Function WBP_GroupResult_Sub_TeamTable.WBP_GroupResult_Sub_TeamTable_C.PlayAddPoint
// 0x0004 (0x0004 - 0x0000)
struct WBP_GroupResult_Sub_TeamTable_C_PlayAddPoint final
{
public:
	int32                                         Point;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_TeamTable_C_PlayAddPoint) == 0x000004, "Wrong alignment on WBP_GroupResult_Sub_TeamTable_C_PlayAddPoint");
static_assert(sizeof(WBP_GroupResult_Sub_TeamTable_C_PlayAddPoint) == 0x000004, "Wrong size on WBP_GroupResult_Sub_TeamTable_C_PlayAddPoint");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_PlayAddPoint, Point) == 0x000000, "Member 'WBP_GroupResult_Sub_TeamTable_C_PlayAddPoint::Point' has a wrong offset!");

// Function WBP_GroupResult_Sub_TeamTable.WBP_GroupResult_Sub_TeamTable_C.Set Point Impl
// 0x0020 (0x0020 - 0x0000)
struct WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl final
{
public:
	int32                                         Point;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl) == 0x000008, "Wrong alignment on WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl");
static_assert(sizeof(WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl) == 0x000020, "Wrong size on WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl, Point) == 0x000000, "Member 'WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl::Point' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000018, "Member 'WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl, K2Node_SwitchInteger_CmpSuccess) == 0x00001C, "Member 'WBP_GroupResult_Sub_TeamTable_C_Set_Point_Impl::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_GroupResult_Sub_TeamTable.WBP_GroupResult_Sub_TeamTable_C.SetFestaTeamIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_GroupResult_Sub_TeamTable_C_SetFestaTeamIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_TeamTable_C_SetFestaTeamIndex) == 0x000004, "Wrong alignment on WBP_GroupResult_Sub_TeamTable_C_SetFestaTeamIndex");
static_assert(sizeof(WBP_GroupResult_Sub_TeamTable_C_SetFestaTeamIndex) == 0x000004, "Wrong size on WBP_GroupResult_Sub_TeamTable_C_SetFestaTeamIndex");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_SetFestaTeamIndex, Index_0) == 0x000000, "Member 'WBP_GroupResult_Sub_TeamTable_C_SetFestaTeamIndex::Index_0' has a wrong offset!");

// Function WBP_GroupResult_Sub_TeamTable.WBP_GroupResult_Sub_TeamTable_C.SetPartyColorIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_GroupResult_Sub_TeamTable_C_SetPartyColorIndex final
{
public:
	int32                                         ColorIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_TeamTable_C_SetPartyColorIndex) == 0x000004, "Wrong alignment on WBP_GroupResult_Sub_TeamTable_C_SetPartyColorIndex");
static_assert(sizeof(WBP_GroupResult_Sub_TeamTable_C_SetPartyColorIndex) == 0x000004, "Wrong size on WBP_GroupResult_Sub_TeamTable_C_SetPartyColorIndex");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_SetPartyColorIndex, ColorIndex) == 0x000000, "Member 'WBP_GroupResult_Sub_TeamTable_C_SetPartyColorIndex::ColorIndex' has a wrong offset!");

// Function WBP_GroupResult_Sub_TeamTable.WBP_GroupResult_Sub_TeamTable_C.SetPointAnimationImpl
// 0x0008 (0x0008 - 0x0000)
struct WBP_GroupResult_Sub_TeamTable_C_SetPointAnimationImpl final
{
public:
	int32                                         NextPoint;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewPoint;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_TeamTable_C_SetPointAnimationImpl) == 0x000004, "Wrong alignment on WBP_GroupResult_Sub_TeamTable_C_SetPointAnimationImpl");
static_assert(sizeof(WBP_GroupResult_Sub_TeamTable_C_SetPointAnimationImpl) == 0x000008, "Wrong size on WBP_GroupResult_Sub_TeamTable_C_SetPointAnimationImpl");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_SetPointAnimationImpl, NextPoint) == 0x000000, "Member 'WBP_GroupResult_Sub_TeamTable_C_SetPointAnimationImpl::NextPoint' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_SetPointAnimationImpl, NewPoint) == 0x000004, "Member 'WBP_GroupResult_Sub_TeamTable_C_SetPointAnimationImpl::NewPoint' has a wrong offset!");

// Function WBP_GroupResult_Sub_TeamTable.WBP_GroupResult_Sub_TeamTable_C.SetTimeAnimationImpl
// 0x0010 (0x0010 - 0x0000)
struct WBP_GroupResult_Sub_TeamTable_C_SetTimeAnimationImpl final
{
public:
	double                                        NextTime;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NowTime_0;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_TeamTable_C_SetTimeAnimationImpl) == 0x000008, "Wrong alignment on WBP_GroupResult_Sub_TeamTable_C_SetTimeAnimationImpl");
static_assert(sizeof(WBP_GroupResult_Sub_TeamTable_C_SetTimeAnimationImpl) == 0x000010, "Wrong size on WBP_GroupResult_Sub_TeamTable_C_SetTimeAnimationImpl");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_SetTimeAnimationImpl, NextTime) == 0x000000, "Member 'WBP_GroupResult_Sub_TeamTable_C_SetTimeAnimationImpl::NextTime' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_SetTimeAnimationImpl, NowTime_0) == 0x000008, "Member 'WBP_GroupResult_Sub_TeamTable_C_SetTimeAnimationImpl::NowTime_0' has a wrong offset!");

// Function WBP_GroupResult_Sub_TeamTable.WBP_GroupResult_Sub_TeamTable_C.SetTimeImpl
// 0x0038 (0x0038 - 0x0000)
struct WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_TimeSecondsToString_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TimeSecondsToString_InSeconds_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl) == 0x000008, "Wrong alignment on WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl");
static_assert(sizeof(WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl) == 0x000038, "Wrong size on WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl, Time) == 0x000000, "Member 'WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl::Time' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl, CallFunc_TimeSecondsToString_ReturnValue) == 0x000008, "Member 'WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl::CallFunc_TimeSecondsToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000028, "Member 'WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl, K2Node_SwitchInteger_CmpSuccess) == 0x00002C, "Member 'WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl, CallFunc_TimeSecondsToString_InSeconds_ImplicitCast) == 0x000030, "Member 'WBP_GroupResult_Sub_TeamTable_C_SetTimeImpl::CallFunc_TimeSecondsToString_InSeconds_ImplicitCast' has a wrong offset!");

// Function WBP_GroupResult_Sub_TeamTable.WBP_GroupResult_Sub_TeamTable_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_GroupResult_Sub_TeamTable_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_TeamTable_C_Tick) == 0x000004, "Wrong alignment on WBP_GroupResult_Sub_TeamTable_C_Tick");
static_assert(sizeof(WBP_GroupResult_Sub_TeamTable_C_Tick) == 0x00003C, "Wrong size on WBP_GroupResult_Sub_TeamTable_C_Tick");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_GroupResult_Sub_TeamTable_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_TeamTable_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_GroupResult_Sub_TeamTable_C_Tick::InDeltaTime' has a wrong offset!");

}

