#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Festa_TeamGroup_P1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_Festa_TeamGroup_P1.WBP_Race_HUD_Sub_Festa_TeamGroup_P1_C
// 0x0050 (0x0340 - 0x02F0)
class UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C final : public URaceUISubTeamGroupAll
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Race_HUD_Sub_Festa_TeamGroup_C*    WBP_Race_HUD_Sub_Festa_TeamGroup_01;               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_Festa_TeamGroup_C*    WBP_Race_HUD_Sub_Festa_TeamGroup_02;               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_Festa_TeamGroup_C*    WBP_Race_HUD_Sub_Festa_TeamGroup_03;               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_Festa_TeamGroup_C*    WBP_Race_HUD_Sub_Festa_TeamGroup_04;               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_Festa_TeamGroup_C*    WBP_Race_HUD_Sub_Festa_TeamGroup_05;               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_Festa_TeamGroup_C*    WBP_Race_HUD_Sub_Festa_TeamGroup_06;               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C* WBP_Race_HUD_Sub_Festa_TeamGroup_Rank;           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Race_HUD_Sub_Festa_TeamGroup_C*> TeamGroupArr;                                 // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup_P1(int32 EntryPoint);
	void GetSingle(int32 ArrIndex, class UWBP_Race_HUD_Sub_Festa_TeamGroup_C** GroupPanelHUD);
	void PlayChargeEffect(int32 ChildIndex);
	void SetBaseColor(const struct FLinearColor& Color);
	void SetRight(bool IsRight);
	void SetRightStart();
	void SetSingle(bool isSingle);
	void SetTeamMemberNum(int32 MemberNum);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_Festa_TeamGroup_P1_C">();
	}
	static class UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C) == 0x000340, "Wrong size on UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C, WBP_Race_HUD_Sub_Festa_TeamGroup_01) == 0x0002F8, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C::WBP_Race_HUD_Sub_Festa_TeamGroup_01' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C, WBP_Race_HUD_Sub_Festa_TeamGroup_02) == 0x000300, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C::WBP_Race_HUD_Sub_Festa_TeamGroup_02' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C, WBP_Race_HUD_Sub_Festa_TeamGroup_03) == 0x000308, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C::WBP_Race_HUD_Sub_Festa_TeamGroup_03' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C, WBP_Race_HUD_Sub_Festa_TeamGroup_04) == 0x000310, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C::WBP_Race_HUD_Sub_Festa_TeamGroup_04' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C, WBP_Race_HUD_Sub_Festa_TeamGroup_05) == 0x000318, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C::WBP_Race_HUD_Sub_Festa_TeamGroup_05' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C, WBP_Race_HUD_Sub_Festa_TeamGroup_06) == 0x000320, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C::WBP_Race_HUD_Sub_Festa_TeamGroup_06' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C, WBP_Race_HUD_Sub_Festa_TeamGroup_Rank) == 0x000328, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C::WBP_Race_HUD_Sub_Festa_TeamGroup_Rank' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C, TeamGroupArr) == 0x000330, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_P1_C::TeamGroupArr' has a wrong offset!");

}

