#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_CurrentWindow

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_CurrentWindow.WBP_MachineCustom_Sub_CurrentWindow_C
// 0x0060 (0x0358 - 0x02F8)
class UWBP_MachineCustom_Sub_CurrentWindow_C final : public UMachineCustomInfoWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Window_Out;                                        // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Window_Loop;                                       // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Window_In;                                         // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Info;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnInAnimFinished;                                  // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnOutAnimFinished;                                 // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsVisible_;                                        // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_MachineCustom_Sub_CurrentWindow_WBP_FooterShortCut_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_MachineCustom_Sub_CurrentWindow(int32 EntryPoint);
	void PlayAnimIn();
	void PlayAnimLoop();
	void PlayAnimOut();
	void WidgetAnimationEvt_Window_In_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_Window_Out_K2Node_WidgetAnimationEvent_2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_CurrentWindow_C">();
	}
	static class UWBP_MachineCustom_Sub_CurrentWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_CurrentWindow_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_CurrentWindow_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_CurrentWindow_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_CurrentWindow_C) == 0x000358, "Wrong size on UWBP_MachineCustom_Sub_CurrentWindow_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_CurrentWindow_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_MachineCustom_Sub_CurrentWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CurrentWindow_C, Window_Out) == 0x000300, "Member 'UWBP_MachineCustom_Sub_CurrentWindow_C::Window_Out' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CurrentWindow_C, Window_Loop) == 0x000308, "Member 'UWBP_MachineCustom_Sub_CurrentWindow_C::Window_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CurrentWindow_C, Window_In) == 0x000310, "Member 'UWBP_MachineCustom_Sub_CurrentWindow_C::Window_In' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CurrentWindow_C, WidgetSwitcher_Info) == 0x000318, "Member 'UWBP_MachineCustom_Sub_CurrentWindow_C::WidgetSwitcher_Info' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CurrentWindow_C, OnInAnimFinished) == 0x000320, "Member 'UWBP_MachineCustom_Sub_CurrentWindow_C::OnInAnimFinished' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CurrentWindow_C, OnOutAnimFinished) == 0x000330, "Member 'UWBP_MachineCustom_Sub_CurrentWindow_C::OnOutAnimFinished' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CurrentWindow_C, IsVisible_) == 0x000340, "Member 'UWBP_MachineCustom_Sub_CurrentWindow_C::IsVisible_' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CurrentWindow_C, OnClicked) == 0x000348, "Member 'UWBP_MachineCustom_Sub_CurrentWindow_C::OnClicked' has a wrong offset!");

}

