#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_Sub_MatchingState_CharaIcon

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_Sub_MatchingState_CharaIcon.WBP_CMN_Sub_MatchingState_CharaIcon_C
// 0x0058 (0x0448 - 0x03F0)
class UWBP_CMN_Sub_MatchingState_CharaIcon_C final : public ULobbyMatchingCharaIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Waiting;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_CharaIcon;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        DSP_WS_Status_Icon;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logout;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MLC_PlayerColor;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OK;                                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Waiting_dot;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_CharaIcon;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               M_CharaIcon;                                       // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon(int32 EntryPoint);
	void OnLoaded_059828894949E7A9162E1F8DAA9DD74A(class UObject* Loaded);
	void OnSetUpCharaIconEvent(EDriverId InDriverId, const TSoftObjectPtr<class UTexture2D>& InTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_Sub_MatchingState_CharaIcon_C">();
	}
	static class UWBP_CMN_Sub_MatchingState_CharaIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_Sub_MatchingState_CharaIcon_C>();
	}
};
static_assert(alignof(UWBP_CMN_Sub_MatchingState_CharaIcon_C) == 0x000008, "Wrong alignment on UWBP_CMN_Sub_MatchingState_CharaIcon_C");
static_assert(sizeof(UWBP_CMN_Sub_MatchingState_CharaIcon_C) == 0x000448, "Wrong size on UWBP_CMN_Sub_MatchingState_CharaIcon_C");
static_assert(offsetof(UWBP_CMN_Sub_MatchingState_CharaIcon_C, UberGraphFrame) == 0x0003F0, "Member 'UWBP_CMN_Sub_MatchingState_CharaIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_MatchingState_CharaIcon_C, base) == 0x0003F8, "Member 'UWBP_CMN_Sub_MatchingState_CharaIcon_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_MatchingState_CharaIcon_C, Base_Waiting) == 0x000400, "Member 'UWBP_CMN_Sub_MatchingState_CharaIcon_C::Base_Waiting' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_MatchingState_CharaIcon_C, DMY_CharaIcon) == 0x000408, "Member 'UWBP_CMN_Sub_MatchingState_CharaIcon_C::DMY_CharaIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_MatchingState_CharaIcon_C, DSP_WS_Status_Icon) == 0x000410, "Member 'UWBP_CMN_Sub_MatchingState_CharaIcon_C::DSP_WS_Status_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_MatchingState_CharaIcon_C, Logout) == 0x000418, "Member 'UWBP_CMN_Sub_MatchingState_CharaIcon_C::Logout' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_MatchingState_CharaIcon_C, MLC_PlayerColor) == 0x000420, "Member 'UWBP_CMN_Sub_MatchingState_CharaIcon_C::MLC_PlayerColor' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_MatchingState_CharaIcon_C, OK) == 0x000428, "Member 'UWBP_CMN_Sub_MatchingState_CharaIcon_C::OK' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_MatchingState_CharaIcon_C, Waiting_dot) == 0x000430, "Member 'UWBP_CMN_Sub_MatchingState_CharaIcon_C::Waiting_dot' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_MatchingState_CharaIcon_C, WS_CharaIcon) == 0x000438, "Member 'UWBP_CMN_Sub_MatchingState_CharaIcon_C::WS_CharaIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_MatchingState_CharaIcon_C, M_CharaIcon) == 0x000440, "Member 'UWBP_CMN_Sub_MatchingState_CharaIcon_C::M_CharaIcon' has a wrong offset!");

}

