#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSelect_Sub_RivalCutin

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CourseSelect_Sub_RivalCutin.WBP_CourseSelect_Sub_RivalCutin_C
// 0x0160 (0x04B0 - 0x0350)
class UWBP_CourseSelect_Sub_RivalCutin_C final : public UCourseSelectRivalCutinWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Base_Rival;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cover;                                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire01_01;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire01_02;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire01_03;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire01_04;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire02_01;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire02_03;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire_Back_01_01;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire_Back_01_02;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire_Back_01_03;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire_Back_02_01;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire_Back_02_02;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire_Back_03_01;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire_Back_03_02;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire_Back_04_01;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire_Back_04_02;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire_Back_05_01;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire_Back_05_02;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FooterBtnCover;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow_Back_01;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow_Back_02;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow_Front;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_01;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_02;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_03;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_CharaIcon;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_CharaIcon_Shadow;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RivalIcon;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sparks_01;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sparks_01_Normal;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sparks_02;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sparks_02_Normal;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sparks_03;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sparks_03_Normal;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_CharaName;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Rival;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_RivalLevel_C*                  WBP_CMN_RivalLevel;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaceBefore_RivalRacer_TopEffects_Parts_C* WBP_RaceBefore_RivalRacer_TopEffects_Parts_6; // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaceBefore_RivalRacer_TopEffects_Parts_C* WBP_RaceBefore_RivalRacer_TopEffects_Parts_7; // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaceBefore_RivalRacer_TopEffects_Parts_C* WBP_RaceBefore_RivalRacer_TopEffects_Parts_8; // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_RivalChoice_C*    WBP_CourseSelectRivalChoice;                       // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AnimEvent_LevelIconStart();
	void AnimEvent_RivalChoiceIn();
	void Construct();
	void ExecuteUbergraph_WBP_CourseSelect_Sub_RivalCutin(int32 EntryPoint);
	void Init_RivalChoice_UI_Setting();
	void Init_RivalLevel_UI_Setting();
	void Init_RivalLevelupText();
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent__ENTRYPOINTWBP_CourseSelect_Sub_RivalCutin();
	void SequenceEvent__ENTRYPOINTWBP_CourseSelect_Sub_RivalCutin_0();
	void SequenceEvent__ENTRYPOINTWBP_CourseSelect_Sub_RivalCutin_1();
	void SequenceEvent_PlayVoiceNormal();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CourseSelect_Sub_RivalCutin_C">();
	}
	static class UWBP_CourseSelect_Sub_RivalCutin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CourseSelect_Sub_RivalCutin_C>();
	}
};
static_assert(alignof(UWBP_CourseSelect_Sub_RivalCutin_C) == 0x000008, "Wrong alignment on UWBP_CourseSelect_Sub_RivalCutin_C");
static_assert(sizeof(UWBP_CourseSelect_Sub_RivalCutin_C) == 0x0004B0, "Wrong size on UWBP_CourseSelect_Sub_RivalCutin_C");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, UberGraphFrame) == 0x000350, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Base_Rival) == 0x000358, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Base_Rival' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Cover) == 0x000360, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Cover' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire01_01) == 0x000368, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire01_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire01_02) == 0x000370, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire01_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire01_03) == 0x000378, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire01_03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire01_04) == 0x000380, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire01_04' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire02_01) == 0x000388, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire02_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire02_03) == 0x000390, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire02_03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire_Back_01_01) == 0x000398, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire_Back_01_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire_Back_01_02) == 0x0003A0, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire_Back_01_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire_Back_01_03) == 0x0003A8, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire_Back_01_03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire_Back_02_01) == 0x0003B0, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire_Back_02_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire_Back_02_02) == 0x0003B8, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire_Back_02_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire_Back_03_01) == 0x0003C0, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire_Back_03_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire_Back_03_02) == 0x0003C8, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire_Back_03_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire_Back_04_01) == 0x0003D0, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire_Back_04_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire_Back_04_02) == 0x0003D8, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire_Back_04_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire_Back_05_01) == 0x0003E0, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire_Back_05_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Fire_Back_05_02) == 0x0003E8, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Fire_Back_05_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, FooterBtnCover) == 0x0003F0, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::FooterBtnCover' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Grow_Back_01) == 0x0003F8, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Grow_Back_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Grow_Back_02) == 0x000400, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Grow_Back_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Grow_Front) == 0x000408, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Grow_Front' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Line_01) == 0x000410, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Line_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Line_02) == 0x000418, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Line_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Line_03) == 0x000420, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Line_03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Panel) == 0x000428, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, PAT_CharaIcon) == 0x000430, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::PAT_CharaIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, PAT_CharaIcon_Shadow) == 0x000438, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::PAT_CharaIcon_Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, RivalIcon) == 0x000440, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::RivalIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Sparks_01) == 0x000448, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Sparks_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Sparks_01_Normal) == 0x000450, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Sparks_01_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Sparks_02) == 0x000458, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Sparks_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Sparks_02_Normal) == 0x000460, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Sparks_02_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Sparks_03) == 0x000468, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Sparks_03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, Sparks_03_Normal) == 0x000470, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::Sparks_03_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, TXT_CharaName) == 0x000478, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::TXT_CharaName' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, TXT_Rival) == 0x000480, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::TXT_Rival' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, WBP_CMN_RivalLevel) == 0x000488, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::WBP_CMN_RivalLevel' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, WBP_RaceBefore_RivalRacer_TopEffects_Parts_6) == 0x000490, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::WBP_RaceBefore_RivalRacer_TopEffects_Parts_6' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, WBP_RaceBefore_RivalRacer_TopEffects_Parts_7) == 0x000498, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::WBP_RaceBefore_RivalRacer_TopEffects_Parts_7' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, WBP_RaceBefore_RivalRacer_TopEffects_Parts_8) == 0x0004A0, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::WBP_RaceBefore_RivalRacer_TopEffects_Parts_8' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalCutin_C, WBP_CourseSelectRivalChoice) == 0x0004A8, "Member 'UWBP_CourseSelect_Sub_RivalCutin_C::WBP_CourseSelectRivalChoice' has a wrong offset!");

}

