#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_Sub_RivalReward

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_Sub_RivalReward.WBP_CMN_Sub_RivalReward_C
// 0x0058 (0x0390 - 0x0338)
class UWBP_CMN_Sub_RivalReward_C final : public UCommonRivalRewardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Achievement_TimeAttack;                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Eff_Achievement_TimeAttack;                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_Count_1;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_Get_Count_1;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_REWARD;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_WIN;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ItemIcon_C*                    WBP_CMN_ItemIcon;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        MedalIconMipLevel;                                 // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CMN_Sub_RivalReward(int32 EntryPoint);
	void SetDetailTextIndex(const int32& Index_0);
	void SetupTimeTrialReward(int32 MedalCount, int32 MedalMax, const struct FTimeTrialResultRewardTableData& RewardData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_Sub_RivalReward_C">();
	}
	static class UWBP_CMN_Sub_RivalReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_Sub_RivalReward_C>();
	}
};
static_assert(alignof(UWBP_CMN_Sub_RivalReward_C) == 0x000008, "Wrong alignment on UWBP_CMN_Sub_RivalReward_C");
static_assert(sizeof(UWBP_CMN_Sub_RivalReward_C) == 0x000390, "Wrong size on UWBP_CMN_Sub_RivalReward_C");
static_assert(offsetof(UWBP_CMN_Sub_RivalReward_C, UberGraphFrame) == 0x000338, "Member 'UWBP_CMN_Sub_RivalReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RivalReward_C, base) == 0x000340, "Member 'UWBP_CMN_Sub_RivalReward_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RivalReward_C, DSP_PAT_Achievement_TimeAttack) == 0x000348, "Member 'UWBP_CMN_Sub_RivalReward_C::DSP_PAT_Achievement_TimeAttack' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RivalReward_C, PAT_Eff_Achievement_TimeAttack) == 0x000350, "Member 'UWBP_CMN_Sub_RivalReward_C::PAT_Eff_Achievement_TimeAttack' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RivalReward_C, TXT_Num_Count_1) == 0x000358, "Member 'UWBP_CMN_Sub_RivalReward_C::TXT_Num_Count_1' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RivalReward_C, TXT_Num_Get_Count_1) == 0x000360, "Member 'UWBP_CMN_Sub_RivalReward_C::TXT_Num_Get_Count_1' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RivalReward_C, TXT_REWARD) == 0x000368, "Member 'UWBP_CMN_Sub_RivalReward_C::TXT_REWARD' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RivalReward_C, TXT_WIN) == 0x000370, "Member 'UWBP_CMN_Sub_RivalReward_C::TXT_WIN' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RivalReward_C, WBP_CMN_ItemIcon) == 0x000378, "Member 'UWBP_CMN_Sub_RivalReward_C::WBP_CMN_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RivalReward_C, WidgetSwitcher_0) == 0x000380, "Member 'UWBP_CMN_Sub_RivalReward_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_RivalReward_C, MedalIconMipLevel) == 0x000388, "Member 'UWBP_CMN_Sub_RivalReward_C::MedalIconMipLevel' has a wrong offset!");

}

