#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StasusIfo_Sub_RaceRuleDetail_Text

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StasusIfo_Sub_RaceRuleDetail_Text.WBP_StasusIfo_Sub_RaceRuleDetail_Text_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C final : public UUserWidget
{
public:
	class UImage*                                 Base_02;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleBase_02;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Title;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Title_Detail;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StasusIfo_Sub_RaceRuleDetail_Text_C">();
	}
	static class UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C>();
	}
};
static_assert(alignof(UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C) == 0x000008, "Wrong alignment on UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C");
static_assert(sizeof(UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C) == 0x000300, "Wrong size on UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C");
static_assert(offsetof(UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C, Base_02) == 0x0002E0, "Member 'UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C::Base_02' has a wrong offset!");
static_assert(offsetof(UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C, TitleBase_02) == 0x0002E8, "Member 'UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C::TitleBase_02' has a wrong offset!");
static_assert(offsetof(UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C, TXT_Title) == 0x0002F0, "Member 'UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C::TXT_Title' has a wrong offset!");
static_assert(offsetof(UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C, TXT_Title_Detail) == 0x0002F8, "Member 'UWBP_StasusIfo_Sub_RaceRuleDetail_Text_C::TXT_Title_Detail' has a wrong offset!");

}

