#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopInfo_Sub_Category

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TopInfo_Sub_Category.WBP_TopInfo_Sub_Category_C
// 0x0060 (0x0358 - 0x02F8)
class UWBP_TopInfo_Sub_Category_C final : public UTopInfoWidgetSubCategoryBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DSP_NewIcon;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BonusInfo_C*                       WBP_BonusInfo;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CollaboInfo_C*                     WBP_CollaboInfo;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DLCInfo_C*                         WBP_DLCInfo;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FestaInfo_C*                       WBP_FestaInfo;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_CommonBtn_C*        WBP_FooterMenu_Sub_CommonBtn;                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetInfo_C*                      WBP_GadgetInfo;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LegendInfo_C*                      WBP_LegendInfo;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          WBP_Popup_Sub_Btn_Standard;                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WorldMatchInfo_C*                  WBP_WorldMatchInfo;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_TopInfo_Sub_Category(int32 EntryPoint);
	void OnInitialized();
	void SetSwitcherIndex(int32 Index_0);
	void Setup_Gudget_Info(int32 DetailTextIndex, TArray<int32>& DisableGadgetIdRankMatch, TArray<int32>& DisableGadgetIdFesta, TArray<int32>& DisableGadgetIdLegendCompe);
	void SetupDLCInfo(const class FText& Title, const class FText& Schedule, class UTexture2D* Texture, bool IsButtonEnable);
	void SetupFestaInfo(const class FText& Title, const class FText& Schedule, class UTexture2D* Texture);
	void SetupFreecontentInfo(const class FText& Title, const class FText& Schedule, class UTexture2D* Texture);
	void SetupWorldMatchInfo();
	void UpdateButtonAnim(bool IsWorldMatch, bool IsSelect);
	void UpdateButtonFocus(ETopInfoWidgetPageCategory PageCategory, bool ButtonFocus);
	void UpdatePageDisplay(ETopInfoWidgetPageCategory PageCategory, bool ButtonFocus, bool IsNew);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TopInfo_Sub_Category_C">();
	}
	static class UWBP_TopInfo_Sub_Category_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TopInfo_Sub_Category_C>();
	}
};
static_assert(alignof(UWBP_TopInfo_Sub_Category_C) == 0x000008, "Wrong alignment on UWBP_TopInfo_Sub_Category_C");
static_assert(sizeof(UWBP_TopInfo_Sub_Category_C) == 0x000358, "Wrong size on UWBP_TopInfo_Sub_Category_C");
static_assert(offsetof(UWBP_TopInfo_Sub_Category_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_TopInfo_Sub_Category_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TopInfo_Sub_Category_C, DSP_NewIcon) == 0x000300, "Member 'UWBP_TopInfo_Sub_Category_C::DSP_NewIcon' has a wrong offset!");
static_assert(offsetof(UWBP_TopInfo_Sub_Category_C, WBP_BonusInfo) == 0x000308, "Member 'UWBP_TopInfo_Sub_Category_C::WBP_BonusInfo' has a wrong offset!");
static_assert(offsetof(UWBP_TopInfo_Sub_Category_C, WBP_CollaboInfo) == 0x000310, "Member 'UWBP_TopInfo_Sub_Category_C::WBP_CollaboInfo' has a wrong offset!");
static_assert(offsetof(UWBP_TopInfo_Sub_Category_C, WBP_DLCInfo) == 0x000318, "Member 'UWBP_TopInfo_Sub_Category_C::WBP_DLCInfo' has a wrong offset!");
static_assert(offsetof(UWBP_TopInfo_Sub_Category_C, WBP_FestaInfo) == 0x000320, "Member 'UWBP_TopInfo_Sub_Category_C::WBP_FestaInfo' has a wrong offset!");
static_assert(offsetof(UWBP_TopInfo_Sub_Category_C, WBP_FooterMenu_Sub_CommonBtn) == 0x000328, "Member 'UWBP_TopInfo_Sub_Category_C::WBP_FooterMenu_Sub_CommonBtn' has a wrong offset!");
static_assert(offsetof(UWBP_TopInfo_Sub_Category_C, WBP_GadgetInfo) == 0x000330, "Member 'UWBP_TopInfo_Sub_Category_C::WBP_GadgetInfo' has a wrong offset!");
static_assert(offsetof(UWBP_TopInfo_Sub_Category_C, WBP_LegendInfo) == 0x000338, "Member 'UWBP_TopInfo_Sub_Category_C::WBP_LegendInfo' has a wrong offset!");
static_assert(offsetof(UWBP_TopInfo_Sub_Category_C, WBP_Popup_Sub_Btn_Standard) == 0x000340, "Member 'UWBP_TopInfo_Sub_Category_C::WBP_Popup_Sub_Btn_Standard' has a wrong offset!");
static_assert(offsetof(UWBP_TopInfo_Sub_Category_C, WBP_WorldMatchInfo) == 0x000348, "Member 'UWBP_TopInfo_Sub_Category_C::WBP_WorldMatchInfo' has a wrong offset!");
static_assert(offsetof(UWBP_TopInfo_Sub_Category_C, WidgetSwitcher_0) == 0x000350, "Member 'UWBP_TopInfo_Sub_Category_C::WidgetSwitcher_0' has a wrong offset!");

}

