#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupResult_Sub_TeamTable

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GroupResult_Sub_TeamTable.WBP_GroupResult_Sub_TeamTable_C
// 0x0148 (0x0440 - 0x02F8)
class UWBP_GroupResult_Sub_TeamTable_C final : public UUnionRaceUIGroupTotalTable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Get_Add_NumPoint;                                  // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Get_BonusMedal;                                    // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_B_Delete;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_R_Delete;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Y_Delete;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_Festa_TeamIcon;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_FestaHeader;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_BonusCountIcon_C*       DSP_WBP_Result_Sub_BonusCountIcon;                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_Base_01;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_Base_02;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_01;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_02;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_03;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Light;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Light_1;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Light_2;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Light_01;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MLC_Base;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MLC_Festa_TeamName;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_WIN;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Team_Icon_Blue_Delete;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Team_Icon_Red_1_Delete;                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Team_Icon_Yellow_1_Delete;                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Add_NumPoint;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Award_01;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Award_02;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_AwardBase;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Festa_TeamName;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_Point;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_Time;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_BonusIcon_C*            WBP_Result_Sub_BonusIcon;                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_MatchPoint_C* WBP_Result_Sub_RankingTable_MatchPoint;         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_NumText;                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_TeamIcon;                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        LastTime;                                          // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NowTime;                                           // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMainLoop;                                       // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastPoint;                                         // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NowPoint;                                          // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAnimEnd;                                        // 0x042C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42D[0x3];                                      // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           SeHandle;                                          // 0x0430(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsAnimStart;                                      // 0x0434(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_435[0x3];                                      // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlateColor;                                        // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CloseFestaBonusIcon();
	void Construct();
	void ExecuteUbergraph_WBP_GroupResult_Sub_TeamTable(int32 EntryPoint);
	void OpenFestaBonusIconTeamTotal(int32 Point);
	void PlayAddPoint(int32 Point);
	void PlayCongratulations();
	void PlayMatchPoint();
	void PlayTeamMVP();
	void Set_Point_Impl(int32 Point);
	void SetFestaTeamIndex(int32 Index_0);
	void SetPartyColorIndex(int32 ColorIndex);
	void SetPointAnimationImpl(int32 NextPoint, int32 NewPoint);
	void SetTimeAnimationImpl(double NextTime, double NowTime_0);
	void SetTimeImpl(double Time);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GroupResult_Sub_TeamTable_C">();
	}
	static class UWBP_GroupResult_Sub_TeamTable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GroupResult_Sub_TeamTable_C>();
	}
};
static_assert(alignof(UWBP_GroupResult_Sub_TeamTable_C) == 0x000008, "Wrong alignment on UWBP_GroupResult_Sub_TeamTable_C");
static_assert(sizeof(UWBP_GroupResult_Sub_TeamTable_C) == 0x000440, "Wrong size on UWBP_GroupResult_Sub_TeamTable_C");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_GroupResult_Sub_TeamTable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Get_Add_NumPoint) == 0x000300, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Get_Add_NumPoint' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Get_BonusMedal) == 0x000308, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Get_BonusMedal' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Base_B_Delete) == 0x000310, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Base_B_Delete' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Base_R_Delete) == 0x000318, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Base_R_Delete' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Base_Y_Delete) == 0x000320, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Base_Y_Delete' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, DMY_Festa_TeamIcon) == 0x000328, "Member 'UWBP_GroupResult_Sub_TeamTable_C::DMY_Festa_TeamIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, DSP_FestaHeader) == 0x000330, "Member 'UWBP_GroupResult_Sub_TeamTable_C::DSP_FestaHeader' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, DSP_WBP_Result_Sub_BonusCountIcon) == 0x000338, "Member 'UWBP_GroupResult_Sub_TeamTable_C::DSP_WBP_Result_Sub_BonusCountIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Effect_Base_01) == 0x000340, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Effect_Base_01' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Effect_Base_02) == 0x000348, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Effect_Base_02' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Icon_01) == 0x000350, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Icon_01' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Icon_02) == 0x000358, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Icon_02' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Icon_03) == 0x000360, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Icon_03' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Light) == 0x000368, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Light' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Light_1) == 0x000370, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Light_1' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Light_2) == 0x000378, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Light_2' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Light_01) == 0x000380, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Light_01' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, MLC_Base) == 0x000388, "Member 'UWBP_GroupResult_Sub_TeamTable_C::MLC_Base' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, MLC_Festa_TeamName) == 0x000390, "Member 'UWBP_GroupResult_Sub_TeamTable_C::MLC_Festa_TeamName' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Overlay_WIN) == 0x000398, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Overlay_WIN' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Team_Icon_Blue_Delete) == 0x0003A0, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Team_Icon_Blue_Delete' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Team_Icon_Red_1_Delete) == 0x0003A8, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Team_Icon_Red_1_Delete' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, Team_Icon_Yellow_1_Delete) == 0x0003B0, "Member 'UWBP_GroupResult_Sub_TeamTable_C::Team_Icon_Yellow_1_Delete' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, TXT_Add_NumPoint) == 0x0003B8, "Member 'UWBP_GroupResult_Sub_TeamTable_C::TXT_Add_NumPoint' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, TXT_Award_01) == 0x0003C0, "Member 'UWBP_GroupResult_Sub_TeamTable_C::TXT_Award_01' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, TXT_Award_02) == 0x0003C8, "Member 'UWBP_GroupResult_Sub_TeamTable_C::TXT_Award_02' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, TXT_AwardBase) == 0x0003D0, "Member 'UWBP_GroupResult_Sub_TeamTable_C::TXT_AwardBase' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, TXT_Festa_TeamName) == 0x0003D8, "Member 'UWBP_GroupResult_Sub_TeamTable_C::TXT_Festa_TeamName' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, TXT_Num_Point) == 0x0003E0, "Member 'UWBP_GroupResult_Sub_TeamTable_C::TXT_Num_Point' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, TXT_Num_Time) == 0x0003E8, "Member 'UWBP_GroupResult_Sub_TeamTable_C::TXT_Num_Time' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, WBP_Result_Sub_BonusIcon) == 0x0003F0, "Member 'UWBP_GroupResult_Sub_TeamTable_C::WBP_Result_Sub_BonusIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, WBP_Result_Sub_RankingTable_MatchPoint) == 0x0003F8, "Member 'UWBP_GroupResult_Sub_TeamTable_C::WBP_Result_Sub_RankingTable_MatchPoint' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, WidgetSwitcher_NumText) == 0x000400, "Member 'UWBP_GroupResult_Sub_TeamTable_C::WidgetSwitcher_NumText' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, WidgetSwitcher_TeamIcon) == 0x000408, "Member 'UWBP_GroupResult_Sub_TeamTable_C::WidgetSwitcher_TeamIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, LastTime) == 0x000410, "Member 'UWBP_GroupResult_Sub_TeamTable_C::LastTime' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, NowTime) == 0x000418, "Member 'UWBP_GroupResult_Sub_TeamTable_C::NowTime' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, bIsMainLoop) == 0x000420, "Member 'UWBP_GroupResult_Sub_TeamTable_C::bIsMainLoop' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, LastPoint) == 0x000424, "Member 'UWBP_GroupResult_Sub_TeamTable_C::LastPoint' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, NowPoint) == 0x000428, "Member 'UWBP_GroupResult_Sub_TeamTable_C::NowPoint' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, bIsAnimEnd) == 0x00042C, "Member 'UWBP_GroupResult_Sub_TeamTable_C::bIsAnimEnd' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, SeHandle) == 0x000430, "Member 'UWBP_GroupResult_Sub_TeamTable_C::SeHandle' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, bIsAnimStart) == 0x000434, "Member 'UWBP_GroupResult_Sub_TeamTable_C::bIsAnimStart' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_TeamTable_C, PlateColor) == 0x000438, "Member 'UWBP_GroupResult_Sub_TeamTable_C::PlateColor' has a wrong offset!");

}

