#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_Sticker_PresetIcon

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "ST_StickerPresetPageItemData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "EStickerPresetSelectPageItemType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_Sticker_PresetIcon.WBP_MachineCustom_Sub_Sticker_PresetIcon_C
// 0x00C0 (0x05D0 - 0x0510)
class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C final : public UMachineStickerSelectPresetIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_Loop;                                      // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnLock_Inout;                                      // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DSP_EX_Icon;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_Lock;                                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_Ticket;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_ItemCount_Num;                                 // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SetColorIndex;                                     // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_StickerPresetPageItemData          ItemData;                                          // 0x0558(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   TextColors;                                        // 0x05A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnPurchaseAnimFinished;                            // 0x05B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         PlayerIndex;                                       // 0x05C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_MachineCustom_Sub_Sticker_PresetIcon(int32 EntryPoint);
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnDownKeyPressed();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnLeftKeyPressed();
	void OnLeftShoulderPressed();
	void OnRightKeyPressed();
	void OnRightShoulderPressed();
	void OnUpKeyPressed();
	void PlayPurchaseAnim();
	void ResetType();
	void SetBalloonPattern(int32 InPatternIndex);
	void SetBalloonText(const struct FST_StickerPresetPageItemData& InItem);
	void SetButtonColor(EStickerPresetSelectPageItemType StickerType);
	void SetExIconVisible(bool IsVisible_0);
	void SetLockVisible(bool IsVisible_0);
	void SetPlayerIndex(int32 PlayerIndex_0);
	void SetPresetIcon(int32 InIndex, bool IsVisible_0);
	void SetPresetIconTexture(const struct FST_StickerPresetPageItemData& InItem);
	void SetTicketVisible(bool IsVisible_0);
	void SetupType(const struct FST_StickerPresetPageItemData& InItemData);
	void StopPurchaseAnim();
	void UpdateNum();
	void UpdateNumColor();
	void WidgetAnimationEvt_UnLock_Inout_K2Node_WidgetAnimationEvent_0();

	void GetItemData(struct FST_StickerPresetPageItemData* ItemData_0) const;
	void GetPlayerController(class APlayerController** PlayerController) const;
	void GetPlayerIndex(int32* PlayerIndex_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_Sticker_PresetIcon_C">();
	}
	static class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_Sticker_PresetIcon_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_Sticker_PresetIcon_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C) == 0x0005D0, "Wrong size on UWBP_MachineCustom_Sub_Sticker_PresetIcon_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, UberGraphFrame) == 0x000510, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, Default_Loop) == 0x000518, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::Default_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, UnLock_Inout) == 0x000520, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::UnLock_Inout' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, DSP_EX_Icon) == 0x000528, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::DSP_EX_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, DSP_Lock) == 0x000530, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::DSP_Lock' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, DSP_Ticket) == 0x000538, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::DSP_Ticket' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, MouseInteraction) == 0x000540, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, TXT_ItemCount_Num) == 0x000548, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::TXT_ItemCount_Num' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, SetColorIndex) == 0x000550, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::SetColorIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, ItemData) == 0x000558, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::ItemData' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, TextColors) == 0x0005A8, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::TextColors' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, OnPurchaseAnimFinished) == 0x0005B8, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::OnPurchaseAnimFinished' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetIcon_C, PlayerIndex) == 0x0005C8, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetIcon_C::PlayerIndex' has a wrong offset!");

}

