#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_Sticker_PresetWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_Sticker_PresetWindow.WBP_MachineCustom_Sub_Sticker_PresetWindow_C
// 0x0090 (0x0370 - 0x02E0)
class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWrapBox*                               WrapBox;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIGridNavigationBuilder*          GridNavigationBuilder;                             // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemNumInRow;                                      // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSelectedIndex;                                 // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UUnionUIButtonBase* InButton)> OnItemCancel;                 // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UUnionUIButtonBase* InButton)> OnItemSelected;               // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UUnionUIButtonBase* InButton)> OnItemFocused;                // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(EUnionUIControlDir Direction, class UUnionUIButtonBase* Button, int32 RowIndex, int32 ColumnIndex)> OnSideNavigationCustom; // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPurchaseAnimFinished;                            // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UUnionUIButtonBase* InButton)> OnItemLeftShoulder;           // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UUnionUIButtonBase* Button)> OnItemRightShoulder;            // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BuildNavigation(bool bInWrapLeftRight, bool IsSimpleCustom);
	void Construct();
	void ExecuteUbergraph_WBP_MachineCustom_Sub_Sticker_PresetWindow(int32 EntryPoint);
	void GridNavigationBuilder_OnSideNavigationCustom(EUnionUIControlDir InDirection, class UUnionUIButtonBase* InButton, int32 InRowIndex, int32 InColumnIndex);
	void HideBalloon();
	void Item_on_Left_Shoulder(class UUnionUIButtonBase* Button);
	void Item_on_Right_Shoulder(class UUnionUIButtonBase* Button);
	void Item_OnCancel(class UUnionUIButtonBase* InButton);
	void Item_OnDecision(class UUnionUIButtonBase* InButton);
	void Item_OnFocused(class UUnionUIButtonBase* InButton);
	void Item_OnPurchaseAnimFinished();
	void PlayPurchaseAnim(int32 InItemIndex);
	void SetButtonsPanel(class UUnionUIButtonsPanel* InButtonsPanel);
	void SetItems(TArray<struct FST_StickerPresetPageItemData>& InItemDataList);
	void SetupItems();
	void StopPurchaseAnim();
	void UpdateNumColor();

	void GetItemNumInRow(int32* Value) const;
	void GetItems(TArray<class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C*>* Items) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_Sticker_PresetWindow_C">();
	}
	static class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_Sticker_PresetWindow_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_Sticker_PresetWindow_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C) == 0x000370, "Wrong size on UWBP_MachineCustom_Sub_Sticker_PresetWindow_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C, WrapBox) == 0x0002E8, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetWindow_C::WrapBox' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C, GridNavigationBuilder) == 0x0002F0, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetWindow_C::GridNavigationBuilder' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C, ItemNumInRow) == 0x0002F8, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetWindow_C::ItemNumInRow' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C, LastSelectedIndex) == 0x0002FC, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetWindow_C::LastSelectedIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C, OnItemCancel) == 0x000300, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetWindow_C::OnItemCancel' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C, OnItemSelected) == 0x000310, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetWindow_C::OnItemSelected' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C, OnItemFocused) == 0x000320, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetWindow_C::OnItemFocused' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C, OnSideNavigationCustom) == 0x000330, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetWindow_C::OnSideNavigationCustom' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C, OnPurchaseAnimFinished) == 0x000340, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetWindow_C::OnPurchaseAnimFinished' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C, OnItemLeftShoulder) == 0x000350, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetWindow_C::OnItemLeftShoulder' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Sticker_PresetWindow_C, OnItemRightShoulder) == 0x000360, "Member 'UWBP_MachineCustom_Sub_Sticker_PresetWindow_C::OnItemRightShoulder' has a wrong offset!");

}

