#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Rank

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_Rank.WBP_Race_HUD_Sub_Rank_C
// 0x00E8 (0x03C8 - 0x02E0)
class UWBP_Race_HUD_Sub_Rank_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Rank_Out;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Rank_Change;                                       // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Rank_in;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Rank_Loop;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Twond;                                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Threerd;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_4_12th;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_Rank1_C*              WBP_Race_HUD_Sub_Rank1;                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Rank;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_4_12;                                           // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         RankIndex;                                         // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UDataTable>              RankOtherDataTable;                                // 0x0340(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_3rd;                                            // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_2nd;                                            // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              Rank3rdDataTable;                                  // 0x0378(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              Rank2ndDataTable;                                  // 0x03A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_Rank(int32 EntryPoint);
	void FireRankChangeAnim(int32 Amount);
	void GetRankIndex(int32* RankIndex_0);
	void PreConstruct(bool IsDesignTime);
	void SetRankByIndex(int32 InRank);
	void SetRankByIndexTo4_12Material(int32 Index_0);
	void UpdateLocalizeTexture();
	void WidgetInit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_Rank_C">();
	}
	static class UWBP_Race_HUD_Sub_Rank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_Rank_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_Rank_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_Rank_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_Rank_C) == 0x0003C8, "Wrong size on UWBP_Race_HUD_Sub_Rank_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Race_HUD_Sub_Rank_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, Rank_Out) == 0x0002E8, "Member 'UWBP_Race_HUD_Sub_Rank_C::Rank_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, Rank_Change) == 0x0002F0, "Member 'UWBP_Race_HUD_Sub_Rank_C::Rank_Change' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, Rank_in) == 0x0002F8, "Member 'UWBP_Race_HUD_Sub_Rank_C::Rank_in' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, Rank_Loop) == 0x000300, "Member 'UWBP_Race_HUD_Sub_Rank_C::Rank_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, Twond) == 0x000308, "Member 'UWBP_Race_HUD_Sub_Rank_C::Twond' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, Threerd) == 0x000310, "Member 'UWBP_Race_HUD_Sub_Rank_C::Threerd' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, PAT_4_12th) == 0x000318, "Member 'UWBP_Race_HUD_Sub_Rank_C::PAT_4_12th' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, WBP_Race_HUD_Sub_Rank1) == 0x000320, "Member 'UWBP_Race_HUD_Sub_Rank_C::WBP_Race_HUD_Sub_Rank1' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, WidgetSwitcher_Rank) == 0x000328, "Member 'UWBP_Race_HUD_Sub_Rank_C::WidgetSwitcher_Rank' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, MI_4_12) == 0x000330, "Member 'UWBP_Race_HUD_Sub_Rank_C::MI_4_12' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, RankIndex) == 0x000338, "Member 'UWBP_Race_HUD_Sub_Rank_C::RankIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, RankOtherDataTable) == 0x000340, "Member 'UWBP_Race_HUD_Sub_Rank_C::RankOtherDataTable' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, MI_3rd) == 0x000368, "Member 'UWBP_Race_HUD_Sub_Rank_C::MI_3rd' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, MI_2nd) == 0x000370, "Member 'UWBP_Race_HUD_Sub_Rank_C::MI_2nd' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, Rank3rdDataTable) == 0x000378, "Member 'UWBP_Race_HUD_Sub_Rank_C::Rank3rdDataTable' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank_C, Rank2ndDataTable) == 0x0003A0, "Member 'UWBP_Race_HUD_Sub_Rank_C::Rank2ndDataTable' has a wrong offset!");

}

