#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Festa_PointReward_Sub_Object

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Festa_PointReward_Sub_Object.WBP_Festa_PointReward_Sub_Object_C
// 0x0160 (0x0588 - 0x0428)
class UWBP_Festa_PointReward_Sub_Object_C final : public UFestaRewardWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PointReward_Out;                                   // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PointReward_Loop;                                  // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PointReward_In;                                    // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_10;                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_11;                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_12;                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_13;                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_14;                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_15;                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_16;                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_17;                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_18;                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_19;                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_20;                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_21;                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_22;                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_23;                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_24;                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_25;                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_26;                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_27;                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_28;                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_29;                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_30;                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_01;                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_02;                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_03;                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_04;                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_05;                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_06;                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_07;                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_08;                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_ItemBtn_C*   Festa_Reward_Sub_ItemBtn_09;                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gage_Line;                                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_PointReward;                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Festa_PointReward_Sub_ItemBtn_C*> ItemButtonArray;                             // 0x0550(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         SelectItemIndex;                                   // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseResultConstruct;                                // 0x0564(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_565[0x3];                                      // 0x0565(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectDataIndex;                                   // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastGetDataIndex;                                  // 0x056C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ViewTopDataIndex;                                  // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsForceDesableInput;                              // 0x0574(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsResult;                                         // 0x0575(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_576[0x2];                                      // 0x0576(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectRewardIndex;                                 // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CenterItemIndex;                                   // 0x057C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastViewItemIndex;                                 // 0x0580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectViewIndex;                                   // 0x0584(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CloseWindow();
	void Construct();
	void ExecuteUbergraph_WBP_Festa_PointReward_Sub_Object(int32 EntryPoint);
	void GetItemButton(int32 InButtonIndex, class UWBP_Festa_PointReward_Sub_ItemBtn_C** OutItemButton);
	void GetItemIconImageObject(class UWBP_CMN_ItemIcon_C* InItemIconWidget, ERewardType InRewardType, class UImage** OutImageObject);
	void GetSelectRewardData(ERewardType* rewardType, int32* rewardId, int32* DonpaTicketNum);
	void InitializeItemButtonArray();
	void OnAcceptKeyPressed();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInAnimFinished();
	void OnOutAnimFinished();
	void OnUISceneDecisionDown_Event(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnUISceneFocus_Event(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OpenWindow();
	void ResultConstruct();
	void Select_Result_Point_Reward(int32 SelectDataIndex_0);
	void SelectNextReward();
	void SelectPointReward(int32 SelectDataIndex_0);
	void SelectPrevReward();
	void Set_Gauge_Param();
	void SetAnimationDelegate();
	void SetButtonsPanel(const TArray<class UUnionUIButtonBase*>& ButtonArray);
	void SetEventInfoDisplayData(const TArray<struct FFestaPointRewardUIData>& InRewardUIDataArray, int32 InPlayerFestaPoint);
	void SetGagePosition(double IconPosi);
	void SetItemButtonNavigation();
	void SetItemButtonNavigationSingle(class UWBP_Festa_PointReward_Sub_ItemBtn_C* InIconButton, class UUserWidget* InWidgetL, class UUserWidget* InWidgetR);
	void SetItemGetAnim(const int32 ItemIndex);
	void SetItemSelect(int32 ItemIndex, bool bIsSelect);
	void SetResultInfoDisplayData(TArray<struct FFestaPointRewardUIData>& RewardUIDataArray);
	void SetScrollOffset(double ScrollOffset);
	void SetUISceneDelegate();
	void SetupPlayerFestaPoint();
	void SetupResultPointReward(int32 SelectDataIndex_0);
	void ShowPointRewardItemButton(int32 RewardItemButtonIndex, int32 DataIndex, int32 InPlayerFestaPoint);
	void StopAnim(int32 ItemIndex);
	void UpdateGauge();
	void UpdateResultDisplay(const TArray<struct FFestaPointRewardUIData>& rewardList, int32 festaPoint);
	void UpdateRewardButton();
	void UpdateSelectItemDisplay(int32 InSelectItemButtonIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Festa_PointReward_Sub_Object_C">();
	}
	static class UWBP_Festa_PointReward_Sub_Object_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Festa_PointReward_Sub_Object_C>();
	}
};
static_assert(alignof(UWBP_Festa_PointReward_Sub_Object_C) == 0x000008, "Wrong alignment on UWBP_Festa_PointReward_Sub_Object_C");
static_assert(sizeof(UWBP_Festa_PointReward_Sub_Object_C) == 0x000588, "Wrong size on UWBP_Festa_PointReward_Sub_Object_C");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, UberGraphFrame) == 0x000428, "Member 'UWBP_Festa_PointReward_Sub_Object_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, PointReward_Out) == 0x000430, "Member 'UWBP_Festa_PointReward_Sub_Object_C::PointReward_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, PointReward_Loop) == 0x000438, "Member 'UWBP_Festa_PointReward_Sub_Object_C::PointReward_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, PointReward_In) == 0x000440, "Member 'UWBP_Festa_PointReward_Sub_Object_C::PointReward_In' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, CanvasPanel_1) == 0x000448, "Member 'UWBP_Festa_PointReward_Sub_Object_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_10) == 0x000450, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_10' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_11) == 0x000458, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_11' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_12) == 0x000460, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_12' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_13) == 0x000468, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_13' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_14) == 0x000470, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_14' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_15) == 0x000478, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_15' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_16) == 0x000480, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_16' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_17) == 0x000488, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_17' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_18) == 0x000490, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_18' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_19) == 0x000498, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_19' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_20) == 0x0004A0, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_20' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_21) == 0x0004A8, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_21' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_22) == 0x0004B0, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_22' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_23) == 0x0004B8, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_23' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_24) == 0x0004C0, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_24' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_25) == 0x0004C8, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_25' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_26) == 0x0004D0, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_26' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_27) == 0x0004D8, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_27' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_28) == 0x0004E0, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_28' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_29) == 0x0004E8, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_29' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_30) == 0x0004F0, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_30' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_01) == 0x0004F8, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_01' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_02) == 0x000500, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_02' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_03) == 0x000508, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_03' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_04) == 0x000510, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_04' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_05) == 0x000518, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_05' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_06) == 0x000520, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_06' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_07) == 0x000528, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_07' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_08) == 0x000530, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_08' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Festa_Reward_Sub_ItemBtn_09) == 0x000538, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Festa_Reward_Sub_ItemBtn_09' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, Gage_Line) == 0x000540, "Member 'UWBP_Festa_PointReward_Sub_Object_C::Gage_Line' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, ScrollBox_PointReward) == 0x000548, "Member 'UWBP_Festa_PointReward_Sub_Object_C::ScrollBox_PointReward' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, ItemButtonArray) == 0x000550, "Member 'UWBP_Festa_PointReward_Sub_Object_C::ItemButtonArray' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, SelectItemIndex) == 0x000560, "Member 'UWBP_Festa_PointReward_Sub_Object_C::SelectItemIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, UseResultConstruct) == 0x000564, "Member 'UWBP_Festa_PointReward_Sub_Object_C::UseResultConstruct' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, SelectDataIndex) == 0x000568, "Member 'UWBP_Festa_PointReward_Sub_Object_C::SelectDataIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, LastGetDataIndex) == 0x00056C, "Member 'UWBP_Festa_PointReward_Sub_Object_C::LastGetDataIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, ViewTopDataIndex) == 0x000570, "Member 'UWBP_Festa_PointReward_Sub_Object_C::ViewTopDataIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, bIsForceDesableInput) == 0x000574, "Member 'UWBP_Festa_PointReward_Sub_Object_C::bIsForceDesableInput' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, bIsResult) == 0x000575, "Member 'UWBP_Festa_PointReward_Sub_Object_C::bIsResult' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, SelectRewardIndex) == 0x000578, "Member 'UWBP_Festa_PointReward_Sub_Object_C::SelectRewardIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, CenterItemIndex) == 0x00057C, "Member 'UWBP_Festa_PointReward_Sub_Object_C::CenterItemIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, LastViewItemIndex) == 0x000580, "Member 'UWBP_Festa_PointReward_Sub_Object_C::LastViewItemIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_Object_C, SelectViewIndex) == 0x000584, "Member 'UWBP_Festa_PointReward_Sub_Object_C::SelectViewIndex' has a wrong offset!");

}

