#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_DonpaTicket

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result_DonpaTicket.WBP_Result_DonpaTicket_C
// 0x00B8 (0x0450 - 0x0398)
class UWBP_Result_DonpaTicket_C final : public UResultDonpaTicket
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow01;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Normal;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DonpaTicket;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DonpaTicket_Effect;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_Overlay_BonusGet;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 flag;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NumberBase01;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NumberBase02;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NumberBaseGrow;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RivalIcon;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_AddPoint;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_BonusGet;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_DonpaTicket01;                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_DonpaTicket02;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         RivalDonpaTicketCnt;                               // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayInFinished;                                   // 0x0444(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_445[0x3];                                      // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ForceCount;                                        // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddOpen(int32 AddNum, bool bIsCountUp);
	void AddOpenForRival(int32 AddNum);
	void CalculateRivalDonpaTicket();
	void Close();
	void CloseAnimation();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Result_DonpaTicket(int32 EntryPoint);
	void Finished_12A3240A4E6E31B1AC0B098D850CEABC();
	void Finished_3AE9A873467218F0098981868CA7376C();
	void Finished_B4AD38E8499BA0BDE52A1C863B3C94CA();
	void GetAddPoint(int32* AddPoint);
	int32 GetAddTicketCount();
	void OnAcceptKeyPressed();
	void OnFullScreenMouseClick();
	void OnInEnd();
	void OnOutEnd();
	void Open();
	void PlayAnimOnBPFromRivalLevel();
	void SetAddDonpaTicket();
	void SetAddDonpaTicketForRival(int32 AddAmt);
	void SetAddDonpaTicketNum(int32 AddTicketNum, bool bIsTicketUpdate);
	void SetForceCloseTime(float InTime);
	void SetForceCloseTime_Imp(double Time);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Result_DonpaTicket_C">();
	}
	static class UWBP_Result_DonpaTicket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_DonpaTicket_C>();
	}
};
static_assert(alignof(UWBP_Result_DonpaTicket_C) == 0x000008, "Wrong alignment on UWBP_Result_DonpaTicket_C");
static_assert(sizeof(UWBP_Result_DonpaTicket_C) == 0x000450, "Wrong size on UWBP_Result_DonpaTicket_C");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, UberGraphFrame) == 0x000398, "Member 'UWBP_Result_DonpaTicket_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, Out) == 0x0003A0, "Member 'UWBP_Result_DonpaTicket_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, Loop) == 0x0003A8, "Member 'UWBP_Result_DonpaTicket_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, In) == 0x0003B0, "Member 'UWBP_Result_DonpaTicket_C::In' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, Arrow01) == 0x0003B8, "Member 'UWBP_Result_DonpaTicket_C::Arrow01' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, base) == 0x0003C0, "Member 'UWBP_Result_DonpaTicket_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, Base_Normal) == 0x0003C8, "Member 'UWBP_Result_DonpaTicket_C::Base_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, DonpaTicket) == 0x0003D0, "Member 'UWBP_Result_DonpaTicket_C::DonpaTicket' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, DonpaTicket_Effect) == 0x0003D8, "Member 'UWBP_Result_DonpaTicket_C::DonpaTicket_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, DSP_Overlay_BonusGet) == 0x0003E0, "Member 'UWBP_Result_DonpaTicket_C::DSP_Overlay_BonusGet' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, flag) == 0x0003E8, "Member 'UWBP_Result_DonpaTicket_C::flag' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, NumberBase01) == 0x0003F0, "Member 'UWBP_Result_DonpaTicket_C::NumberBase01' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, NumberBase02) == 0x0003F8, "Member 'UWBP_Result_DonpaTicket_C::NumberBase02' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, NumberBaseGrow) == 0x000400, "Member 'UWBP_Result_DonpaTicket_C::NumberBaseGrow' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, OutOfContentButton) == 0x000408, "Member 'UWBP_Result_DonpaTicket_C::OutOfContentButton' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, Panel) == 0x000410, "Member 'UWBP_Result_DonpaTicket_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, RivalIcon) == 0x000418, "Member 'UWBP_Result_DonpaTicket_C::RivalIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, TXT_AddPoint) == 0x000420, "Member 'UWBP_Result_DonpaTicket_C::TXT_AddPoint' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, TXT_BonusGet) == 0x000428, "Member 'UWBP_Result_DonpaTicket_C::TXT_BonusGet' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, TXT_Num_DonpaTicket01) == 0x000430, "Member 'UWBP_Result_DonpaTicket_C::TXT_Num_DonpaTicket01' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, TXT_Num_DonpaTicket02) == 0x000438, "Member 'UWBP_Result_DonpaTicket_C::TXT_Num_DonpaTicket02' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, RivalDonpaTicketCnt) == 0x000440, "Member 'UWBP_Result_DonpaTicket_C::RivalDonpaTicketCnt' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, bPlayInFinished) == 0x000444, "Member 'UWBP_Result_DonpaTicket_C::bPlayInFinished' has a wrong offset!");
static_assert(offsetof(UWBP_Result_DonpaTicket_C, ForceCount) == 0x000448, "Member 'UWBP_Result_DonpaTicket_C::ForceCount' has a wrong offset!");

}

