#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SelectBG_M4

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SelectBG_M4.WBP_SelectBG_M4_C
// 0x0078 (0x0358 - 0x02E0)
class UWBP_SelectBG_M4_C final : public UUserWidget
{
public:
	class UImage*                                 FooterBtnCover;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 G_Left_Blue;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 G_Left_Green;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 G_Right_Red;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 G_Right_Yellow;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Left;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Right;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WhiteLine_H;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WhiteLine_V;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Left;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Left_1;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Left_2;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Right;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Right_1;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Right_2;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SelectBG_M4_C">();
	}
	static class UWBP_SelectBG_M4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SelectBG_M4_C>();
	}
};
static_assert(alignof(UWBP_SelectBG_M4_C) == 0x000008, "Wrong alignment on UWBP_SelectBG_M4_C");
static_assert(sizeof(UWBP_SelectBG_M4_C) == 0x000358, "Wrong size on UWBP_SelectBG_M4_C");
static_assert(offsetof(UWBP_SelectBG_M4_C, FooterBtnCover) == 0x0002E0, "Member 'UWBP_SelectBG_M4_C::FooterBtnCover' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, G_Left_Blue) == 0x0002E8, "Member 'UWBP_SelectBG_M4_C::G_Left_Blue' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, G_Left_Green) == 0x0002F0, "Member 'UWBP_SelectBG_M4_C::G_Left_Green' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, G_Right_Red) == 0x0002F8, "Member 'UWBP_SelectBG_M4_C::G_Right_Red' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, G_Right_Yellow) == 0x000300, "Member 'UWBP_SelectBG_M4_C::G_Right_Yellow' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, RaceFlag_Left) == 0x000308, "Member 'UWBP_SelectBG_M4_C::RaceFlag_Left' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, RaceFlag_Right) == 0x000310, "Member 'UWBP_SelectBG_M4_C::RaceFlag_Right' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, WhiteLine_H) == 0x000318, "Member 'UWBP_SelectBG_M4_C::WhiteLine_H' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, WhiteLine_V) == 0x000320, "Member 'UWBP_SelectBG_M4_C::WhiteLine_V' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, YellowLine_Left) == 0x000328, "Member 'UWBP_SelectBG_M4_C::YellowLine_Left' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, YellowLine_Left_1) == 0x000330, "Member 'UWBP_SelectBG_M4_C::YellowLine_Left_1' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, YellowLine_Left_2) == 0x000338, "Member 'UWBP_SelectBG_M4_C::YellowLine_Left_2' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, YellowLine_Right) == 0x000340, "Member 'UWBP_SelectBG_M4_C::YellowLine_Right' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, YellowLine_Right_1) == 0x000348, "Member 'UWBP_SelectBG_M4_C::YellowLine_Right_1' has a wrong offset!");
static_assert(offsetof(UWBP_SelectBG_M4_C, YellowLine_Right_2) == 0x000350, "Member 'UWBP_SelectBG_M4_C::YellowLine_Right_2' has a wrong offset!");

}

