#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DLCInfo

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_DLCInfo.WBP_DLCInfo_C.SetSchedule
// 0x0010 (0x0010 - 0x0000)
struct WBP_DLCInfo_C_SetSchedule final
{
public:
	class FText                                   Schedule;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_DLCInfo_C_SetSchedule) == 0x000008, "Wrong alignment on WBP_DLCInfo_C_SetSchedule");
static_assert(sizeof(WBP_DLCInfo_C_SetSchedule) == 0x000010, "Wrong size on WBP_DLCInfo_C_SetSchedule");
static_assert(offsetof(WBP_DLCInfo_C_SetSchedule, Schedule) == 0x000000, "Member 'WBP_DLCInfo_C_SetSchedule::Schedule' has a wrong offset!");

// Function WBP_DLCInfo.WBP_DLCInfo_C.SetTextureBG
// 0x0010 (0x0010 - 0x0000)
struct WBP_DLCInfo_C_SetTextureBG final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DLCInfo_C_SetTextureBG) == 0x000008, "Wrong alignment on WBP_DLCInfo_C_SetTextureBG");
static_assert(sizeof(WBP_DLCInfo_C_SetTextureBG) == 0x000010, "Wrong size on WBP_DLCInfo_C_SetTextureBG");
static_assert(offsetof(WBP_DLCInfo_C_SetTextureBG, Texture) == 0x000000, "Member 'WBP_DLCInfo_C_SetTextureBG::Texture' has a wrong offset!");
static_assert(offsetof(WBP_DLCInfo_C_SetTextureBG, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_DLCInfo_C_SetTextureBG::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_DLCInfo.WBP_DLCInfo_C.SetTitle
// 0x0010 (0x0010 - 0x0000)
struct WBP_DLCInfo_C_SetTitle final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_DLCInfo_C_SetTitle) == 0x000008, "Wrong alignment on WBP_DLCInfo_C_SetTitle");
static_assert(sizeof(WBP_DLCInfo_C_SetTitle) == 0x000010, "Wrong size on WBP_DLCInfo_C_SetTitle");
static_assert(offsetof(WBP_DLCInfo_C_SetTitle, Title) == 0x000000, "Member 'WBP_DLCInfo_C_SetTitle::Title' has a wrong offset!");

}

