#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSelect_Sub_RivalChoice_Btn_Right

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CourseSelect_Sub_RivalChoice_Btn_Right.WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C.ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right
// 0x0050 (0x0050 - 0x0000)
struct WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	int32                                         CallFunc_GetUserIndexByFocusEvent_ReturnValue;     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x002C(0x0008)(NoDestructor)
	TDelegate<void(EUINavigation Navigation)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUserIndexByFocusEvent_ReturnValue_1;   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right) == 0x000008, "Wrong alignment on WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right");
static_assert(sizeof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right) == 0x000050, "Wrong size on WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right, EntryPoint) == 0x000000, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right, CallFunc_GetUserIndexByFocusEvent_ReturnValue) == 0x00000C, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right::CallFunc_GetUserIndexByFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right, CallFunc_GetPlayerController_ReturnValue_1) == 0x000018, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000020, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right, K2Node_Event_InFocusEvent) == 0x00002C, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right, CallFunc_GetUserIndexByFocusEvent_ReturnValue_1) == 0x000044, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right::CallFunc_GetUserIndexByFocusEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right, CallFunc_GetPlayerController_ReturnValue_2) == 0x000048, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Right::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");

// Function WBP_CourseSelect_Sub_RivalChoice_Btn_Right.WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_CourseSelect_Sub_RivalChoice_Btn_Right.WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C.OnNavigationLeft
// 0x0010 (0x0010 - 0x0000)
struct WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnNavigationLeft final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnNavigationLeft) == 0x000008, "Wrong alignment on WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnNavigationLeft");
static_assert(sizeof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnNavigationLeft) == 0x000010, "Wrong size on WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnNavigationLeft");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnNavigationLeft, Navigation_0) == 0x000000, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnNavigationLeft::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnNavigationLeft, ReturnValue) == 0x000008, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnNavigationLeft::ReturnValue' has a wrong offset!");

// Function WBP_CourseSelect_Sub_RivalChoice_Btn_Right.WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_CourseSelect_Sub_RivalChoice_Btn_Right.WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C.SetupLV
// 0x0014 (0x0014 - 0x0000)
struct WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV final
{
public:
	int32                                         InMaxRivalLevel;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InRivalLevel;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InBlankIconHideCount;                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRivalPowerFlag;                                 // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetMenuDataBaseRivalLevel_ReturnValue;    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV) == 0x000004, "Wrong alignment on WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV");
static_assert(sizeof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV) == 0x000014, "Wrong size on WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV, InMaxRivalLevel) == 0x000000, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV::InMaxRivalLevel' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV, InRivalLevel) == 0x000004, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV::InRivalLevel' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV, InBlankIconHideCount) == 0x000008, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV::InBlankIconHideCount' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV, bIsRivalPowerFlag) == 0x00000C, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV::bIsRivalPowerFlag' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV, CallFunc_GetMenuDataBaseRivalLevel_ReturnValue) == 0x00000D, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV::CallFunc_GetMenuDataBaseRivalLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WBP_CourseSelect_Sub_RivalChoice_Btn_Right_C_SetupLV::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

}

