#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RaceBefore_BasicRound

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RaceBefore_BasicRound.WBP_RaceBefore_BasicRound_C
// 0x0068 (0x0348 - 0x02E0)
class UWBP_RaceBefore_BasicRound_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RaceBefore_Out;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RaceBefore_InLoop;                                 // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_Sub_SpeedClassInfo_C*          WBP_CMN_Sub_SpeedClassInfo;                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaceBefore_Sub_BasicRoundInfo_C*   WBP_RaceBefore_Sub_BasicRoundInfo;                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnRemoved;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftObjectPtr<class UTexture2D>              PanelDebugTexture;                                 // 0x0320(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_RaceBefore_BasicRound(int32 EntryPoint);
	void FireAnimation(bool In);
	void OnOutAnimFinished();
	void PreConstruct(bool IsDesignTime);
	void SetGrandPrix(EGrandPrixId newParam);
	void SetRoundAndStageName(const class FText& InRoundName, const class FText& InStageName);
	void SetStageIconTexture(class UTexture2D* Texture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RaceBefore_BasicRound_C">();
	}
	static class UWBP_RaceBefore_BasicRound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RaceBefore_BasicRound_C>();
	}
};
static_assert(alignof(UWBP_RaceBefore_BasicRound_C) == 0x000008, "Wrong alignment on UWBP_RaceBefore_BasicRound_C");
static_assert(sizeof(UWBP_RaceBefore_BasicRound_C) == 0x000348, "Wrong size on UWBP_RaceBefore_BasicRound_C");
static_assert(offsetof(UWBP_RaceBefore_BasicRound_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_RaceBefore_BasicRound_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_BasicRound_C, RaceBefore_Out) == 0x0002E8, "Member 'UWBP_RaceBefore_BasicRound_C::RaceBefore_Out' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_BasicRound_C, RaceBefore_InLoop) == 0x0002F0, "Member 'UWBP_RaceBefore_BasicRound_C::RaceBefore_InLoop' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_BasicRound_C, Line) == 0x0002F8, "Member 'UWBP_RaceBefore_BasicRound_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_BasicRound_C, WBP_CMN_Sub_SpeedClassInfo) == 0x000300, "Member 'UWBP_RaceBefore_BasicRound_C::WBP_CMN_Sub_SpeedClassInfo' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_BasicRound_C, WBP_RaceBefore_Sub_BasicRoundInfo) == 0x000308, "Member 'UWBP_RaceBefore_BasicRound_C::WBP_RaceBefore_Sub_BasicRoundInfo' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_BasicRound_C, OnRemoved) == 0x000310, "Member 'UWBP_RaceBefore_BasicRound_C::OnRemoved' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_BasicRound_C, PanelDebugTexture) == 0x000320, "Member 'UWBP_RaceBefore_BasicRound_C::PanelDebugTexture' has a wrong offset!");

}

