#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_StickerColorPicker

#include "Basic.hpp"

#include "ST_ColorDetailWindowColorItemData_structs.hpp"
#include "Engine_structs.hpp"
#include "EColorDetailWindowMode_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_StickerColorPicker.WBP_MachineCustom_Sub_StickerColorPicker_C
// 0x0420 (0x07F8 - 0x03D8)
class UWBP_MachineCustom_Sub_StickerColorPicker_C final : public UUnionUISceneBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BaseWindow;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_01;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_02;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Color;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Texture;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_10; // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_11; // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_12; // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_13; // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_14; // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_15; // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_16; // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_17; // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_18; // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_19; // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_20; // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_21; // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_22; // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_23; // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_24; // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_25; // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_26; // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_27; // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_28; // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_29; // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_30; // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_31; // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_32; // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_33; // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_34; // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_35; // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_36; // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_37; // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_38; // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_39; // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_40; // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_41; // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_42; // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_43; // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_44; // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_45; // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_46; // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_47; // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_48; // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_49; // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_50; // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_51; // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_52; // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_53; // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_54; // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_55; // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_56; // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_57; // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_58; // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_59; // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_60; // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_61; // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_62; // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_63; // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_64; // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_65; // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_66; // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_67; // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_68; // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_69; // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_70; // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_71; // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_72; // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_73; // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_74; // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_75; // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_76; // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_77; // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_78; // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_79; // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_80; // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_01; // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_02; // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_03; // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_04; // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_05; // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_06; // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_07; // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_08; // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_09; // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_Texture_C* WBP_MachineCustom_Sub_ColorPicker_Texture;   // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_0;                                         // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsWindowOpen;                                      // 0x06B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EColorDetailWindowMode, int32>           ColorItemNumMap;                                   // 0x06B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EColorDetailWindowMode, struct FVector2D> InnerSlotPaddingMap;                              // 0x0708(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EColorDetailWindowMode, struct FVector2D> WrapBoxPositionMap;                               // 0x0758(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUnionUIGridNavigationBuilder*          GridNavigationBuilder;                             // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C*> ColorItems;                       // 0x07B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMulticastInlineDelegate<void(const struct FST_ColorDetailWindowColorItemData& InItemData)> OnColorItemFocused; // 0x07C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         ColorItemNumPerRow;                                // 0x07D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastColumnIndex;                                   // 0x07D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FST_ColorDetailWindowColorItemData& InItemData)> OnColorItemSelected; // 0x07D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnCancel;                                          // 0x07E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ButtonsPanel_OnDecision(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void ButtonsPanel_OnFocus(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void Construct();
	void ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker(int32 EntryPoint);
	void PlayColorPickerIn();
	void PlayColorPickerOut();
	void Scene_OnCancel(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void Setup(const struct FST_ColorDetailWindowData& InWindowData);
	void SurfaceButton_OnFocus(class UUnionUIButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_StickerColorPicker_C">();
	}
	static class UWBP_MachineCustom_Sub_StickerColorPicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_StickerColorPicker_C>();
	}
};
