#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_ColorPicker_LiquidIcon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_ColorDetailWindowColorItemData_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_MachineCustom_Sub_ColorPicker_LiquidIcon.WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C.ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon
// 0x0014 (0x0014 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0004(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0008(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x000C(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_3;                  // 0x0010(0x0004)()
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon) == 0x000004, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon) == 0x000014, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon, EntryPoint) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon, CallFunc_SoundPlay_ReturnValue) == 0x000004, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon, CallFunc_SoundPlay_ReturnValue_1) == 0x000008, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon, CallFunc_SoundPlay_ReturnValue_2) == 0x00000C, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon, CallFunc_SoundPlay_ReturnValue_3) == 0x000010, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon::CallFunc_SoundPlay_ReturnValue_3' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker_LiquidIcon.WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C.GetItemData
// 0x0018 (0x0018 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_GetItemData final
{
public:
	struct FST_ColorDetailWindowColorItemData     OutItemData;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_GetItemData) == 0x000004, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_GetItemData");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_GetItemData) == 0x000018, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_GetItemData");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_GetItemData, OutItemData) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_GetItemData::OutItemData' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker_LiquidIcon.WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusLost");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusLost) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusLost");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker_LiquidIcon.WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker_LiquidIcon.WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C.OnFocusReceivedInternal
// 0x0060 (0x0060 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         CallFunc_GetUserIndexByFocusEvent_ReturnValue;     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0044(0x0004)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMenuPlayerController*                  K2Node_DynamicCast_AsMenu_Player_Controller;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal) == 0x000060, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal, MyGeometry) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal, InFocusEvent) == 0x000038, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal, CallFunc_GetUserIndexByFocusEvent_ReturnValue) == 0x000040, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal::CallFunc_GetUserIndexByFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal, CallFunc_SoundPlay_ReturnValue) == 0x000044, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal, K2Node_DynamicCast_AsMenu_Player_Controller) == 0x000050, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal::K2Node_DynamicCast_AsMenu_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_OnFocusReceivedInternal::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker_LiquidIcon.WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C.SetColor
// 0x0018 (0x0018 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetColor final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetColor) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetColor");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetColor) == 0x000018, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetColor");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetColor, InColor) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetColor::InColor' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker_LiquidIcon.WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C.SetCursorVisible
// 0x0018 (0x0018 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible final
{
public:
	bool                                          bInIsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible) == 0x000018, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible, bInIsVisible) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible::bInIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible, Temp_bool_Variable) == 0x000001, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible, K2Node_Select_Default) == 0x000008, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetCursorVisible::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker_LiquidIcon.WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C.SetSelectIconVisible
// 0x0005 (0x0005 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible final
{
public:
	bool                                          bInIsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible) == 0x000001, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible) == 0x000005, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible, bInIsVisible) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible::bInIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible, Temp_bool_Variable) == 0x000001, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible, Temp_byte_Variable) == 0x000002, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible, K2Node_Select_Default) == 0x000004, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_SetSelectIconVisible::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker_LiquidIcon.WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C.Setup
// 0x0018 (0x0018 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_Setup final
{
public:
	struct FST_ColorDetailWindowColorItemData     InItemData;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_Setup) == 0x000004, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_Setup");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_Setup) == 0x000018, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_Setup");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_Setup, InItemData) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C_Setup::InItemData' has a wrong offset!");

}

