#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PauseMenu_Sub_Option_Btn_03

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PauseMenu_Sub_Option_Btn_03.WBP_PauseMenu_Sub_Option_Btn_03_C
// 0x0058 (0x0338 - 0x02E0)
class UWBP_PauseMenu_Sub_Option_Btn_03_C final : public UReadyOption
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OFF_Loop;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ON_Loop;                                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_Btn;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_OptionPict;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_OptionType;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EControllerButtonTextureIndex                 Controller_Button_Index;                           // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UWBP_PauseMenu_Sub_Option_Btn_03_C* InButton)> OnClicked;    // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_PauseMenu_Sub_Option_Btn_03_MouseInteraction_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_PauseMenu_Sub_Option_Btn_03(int32 EntryPoint);
	void PlayOnOffAnimation(bool bIsOn, bool SeEnabled);
	void PlaySeOnOff(int32 PlayerCount, int32 PlayerIndex);
	void SetControlerButtonIndex(EControllerButtonTextureIndex In_Controller_Button_Index);
	void SetIcon(double Index_0);
	void SetInputVisible(bool bIsVisible);
	void SetIsGamePadButton(bool bIsGamePad);
	void SetOnOffNoSE(bool IsOn);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PauseMenu_Sub_Option_Btn_03_C">();
	}
	static class UWBP_PauseMenu_Sub_Option_Btn_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PauseMenu_Sub_Option_Btn_03_C>();
	}
};
static_assert(alignof(UWBP_PauseMenu_Sub_Option_Btn_03_C) == 0x000008, "Wrong alignment on UWBP_PauseMenu_Sub_Option_Btn_03_C");
static_assert(sizeof(UWBP_PauseMenu_Sub_Option_Btn_03_C) == 0x000338, "Wrong size on UWBP_PauseMenu_Sub_Option_Btn_03_C");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_03_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_PauseMenu_Sub_Option_Btn_03_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_03_C, OFF_Loop) == 0x0002E8, "Member 'UWBP_PauseMenu_Sub_Option_Btn_03_C::OFF_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_03_C, ON_Loop) == 0x0002F0, "Member 'UWBP_PauseMenu_Sub_Option_Btn_03_C::ON_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_03_C, Base_Btn) == 0x0002F8, "Member 'UWBP_PauseMenu_Sub_Option_Btn_03_C::Base_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_03_C, MouseInteraction) == 0x000300, "Member 'UWBP_PauseMenu_Sub_Option_Btn_03_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_03_C, PAT_OptionPict) == 0x000308, "Member 'UWBP_PauseMenu_Sub_Option_Btn_03_C::PAT_OptionPict' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_03_C, TXT_OptionType) == 0x000310, "Member 'UWBP_PauseMenu_Sub_Option_Btn_03_C::TXT_OptionType' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_03_C, WBP_CMN_ControllerBtn) == 0x000318, "Member 'UWBP_PauseMenu_Sub_Option_Btn_03_C::WBP_CMN_ControllerBtn' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_03_C, Controller_Button_Index) == 0x000320, "Member 'UWBP_PauseMenu_Sub_Option_Btn_03_C::Controller_Button_Index' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_Sub_Option_Btn_03_C, OnClicked) == 0x000328, "Member 'UWBP_PauseMenu_Sub_Option_Btn_03_C::OnClicked' has a wrong offset!");

}

