#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RaceBefore_FinalRound

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_RaceBefore_FinalRound.WBP_RaceBefore_FinalRound_C.ExecuteUbergraph_WBP_RaceBefore_FinalRound
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_1;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_2;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_2;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_3;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_3;                    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound) == 0x000008, "Wrong alignment on WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound");
static_assert(sizeof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound) == 0x0000C8, "Wrong size on WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, EntryPoint) == 0x000000, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000028, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000030, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_DynamicCast_As_____2D) == 0x000038, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_DynamicCast_As_____2D_1) == 0x000048, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_DynamicCast_As_____2D_1' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, CallFunc_LoadAsset_Blocking_ReturnValue_2) == 0x000058, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::CallFunc_LoadAsset_Blocking_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_DynamicCast_As_____2D_2) == 0x000060, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_DynamicCast_As_____2D_2' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_Event_IsDesignTime) == 0x000069, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, CallFunc_PlayAnimation_ReturnValue) == 0x000080, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, CallFunc_PlayAnimation_ReturnValue_1) == 0x000088, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, CallFunc_LoadAsset_Blocking_ReturnValue_3) == 0x000090, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::CallFunc_LoadAsset_Blocking_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_DynamicCast_As_____2D_3) == 0x0000A8, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_DynamicCast_As_____2D_3' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, CallFunc_PauseAnimation_ReturnValue) == 0x0000B4, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x0000B8, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000C0, "Member 'WBP_RaceBefore_FinalRound_C_ExecuteUbergraph_WBP_RaceBefore_FinalRound::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function WBP_RaceBefore_FinalRound.WBP_RaceBefore_FinalRound_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_RaceBefore_FinalRound_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RaceBefore_FinalRound_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_RaceBefore_FinalRound_C_PreConstruct");
static_assert(sizeof(WBP_RaceBefore_FinalRound_C_PreConstruct) == 0x000001, "Wrong size on WBP_RaceBefore_FinalRound_C_PreConstruct");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_RaceBefore_FinalRound_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_RaceBefore_FinalRound.WBP_RaceBefore_FinalRound_C.Set Open Tips Window
// 0x0001 (0x0001 - 0x0000)
struct WBP_RaceBefore_FinalRound_C_Set_Open_Tips_Window final
{
public:
	bool                                          InOpenWindow;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RaceBefore_FinalRound_C_Set_Open_Tips_Window) == 0x000001, "Wrong alignment on WBP_RaceBefore_FinalRound_C_Set_Open_Tips_Window");
static_assert(sizeof(WBP_RaceBefore_FinalRound_C_Set_Open_Tips_Window) == 0x000001, "Wrong size on WBP_RaceBefore_FinalRound_C_Set_Open_Tips_Window");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_Set_Open_Tips_Window, InOpenWindow) == 0x000000, "Member 'WBP_RaceBefore_FinalRound_C_Set_Open_Tips_Window::InOpenWindow' has a wrong offset!");

// Function WBP_RaceBefore_FinalRound.WBP_RaceBefore_FinalRound_C.SetGrandPrixIcon
// 0x0010 (0x0010 - 0x0000)
struct WBP_RaceBefore_FinalRound_C_SetGrandPrixIcon final
{
public:
	EGrandPrixId                                  InGrandprixId;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RaceBefore_FinalRound_C_SetGrandPrixIcon) == 0x000008, "Wrong alignment on WBP_RaceBefore_FinalRound_C_SetGrandPrixIcon");
static_assert(sizeof(WBP_RaceBefore_FinalRound_C_SetGrandPrixIcon) == 0x000010, "Wrong size on WBP_RaceBefore_FinalRound_C_SetGrandPrixIcon");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_SetGrandPrixIcon, InGrandprixId) == 0x000000, "Member 'WBP_RaceBefore_FinalRound_C_SetGrandPrixIcon::InGrandprixId' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_SetGrandPrixIcon, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_RaceBefore_FinalRound_C_SetGrandPrixIcon::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_RaceBefore_FinalRound.WBP_RaceBefore_FinalRound_C.SetMedleyText
// 0x0010 (0x0010 - 0x0000)
struct WBP_RaceBefore_FinalRound_C_SetMedleyText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_RaceBefore_FinalRound_C_SetMedleyText) == 0x000008, "Wrong alignment on WBP_RaceBefore_FinalRound_C_SetMedleyText");
static_assert(sizeof(WBP_RaceBefore_FinalRound_C_SetMedleyText) == 0x000010, "Wrong size on WBP_RaceBefore_FinalRound_C_SetMedleyText");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_SetMedleyText, InText) == 0x000000, "Member 'WBP_RaceBefore_FinalRound_C_SetMedleyText::InText' has a wrong offset!");

// Function WBP_RaceBefore_FinalRound.WBP_RaceBefore_FinalRound_C.SetTextures
// 0x0040 (0x0040 - 0x0000)
struct WBP_RaceBefore_FinalRound_C_SetTextures final
{
public:
	TArray<class UTexture2D*>                     Textures;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RaceBefore_FinalRound_C_SetTextures) == 0x000008, "Wrong alignment on WBP_RaceBefore_FinalRound_C_SetTextures");
static_assert(sizeof(WBP_RaceBefore_FinalRound_C_SetTextures) == 0x000040, "Wrong size on WBP_RaceBefore_FinalRound_C_SetTextures");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_SetTextures, Textures) == 0x000000, "Member 'WBP_RaceBefore_FinalRound_C_SetTextures::Textures' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_SetTextures, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_RaceBefore_FinalRound_C_SetTextures::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_SetTextures, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_RaceBefore_FinalRound_C_SetTextures::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_SetTextures, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_RaceBefore_FinalRound_C_SetTextures::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_SetTextures, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_RaceBefore_FinalRound_C_SetTextures::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_SetTextures, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_RaceBefore_FinalRound_C_SetTextures::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_SetTextures, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_RaceBefore_FinalRound_C_SetTextures::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_SetTextures, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000030, "Member 'WBP_RaceBefore_FinalRound_C_SetTextures::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RaceBefore_FinalRound_C_SetTextures, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'WBP_RaceBefore_FinalRound_C_SetTextures::CallFunc_Array_Get_Item_1' has a wrong offset!");

}

