#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_Sub_Ranking

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_TimeTrial_Sub_Ranking.WBP_TimeTrial_Sub_Ranking_C.DisplayCrossplayOffMessage
// 0x0010 (0x0010 - 0x0000)
struct WBP_TimeTrial_Sub_Ranking_C_DisplayCrossplayOffMessage final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0010)()
};
static_assert(alignof(WBP_TimeTrial_Sub_Ranking_C_DisplayCrossplayOffMessage) == 0x000008, "Wrong alignment on WBP_TimeTrial_Sub_Ranking_C_DisplayCrossplayOffMessage");
static_assert(sizeof(WBP_TimeTrial_Sub_Ranking_C_DisplayCrossplayOffMessage) == 0x000010, "Wrong size on WBP_TimeTrial_Sub_Ranking_C_DisplayCrossplayOffMessage");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_DisplayCrossplayOffMessage, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'WBP_TimeTrial_Sub_Ranking_C_DisplayCrossplayOffMessage::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");

// Function WBP_TimeTrial_Sub_Ranking.WBP_TimeTrial_Sub_Ranking_C.DisplayNetworkErrorMessage
// 0x0010 (0x0010 - 0x0000)
struct WBP_TimeTrial_Sub_Ranking_C_DisplayNetworkErrorMessage final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0010)()
};
static_assert(alignof(WBP_TimeTrial_Sub_Ranking_C_DisplayNetworkErrorMessage) == 0x000008, "Wrong alignment on WBP_TimeTrial_Sub_Ranking_C_DisplayNetworkErrorMessage");
static_assert(sizeof(WBP_TimeTrial_Sub_Ranking_C_DisplayNetworkErrorMessage) == 0x000010, "Wrong size on WBP_TimeTrial_Sub_Ranking_C_DisplayNetworkErrorMessage");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_DisplayNetworkErrorMessage, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'WBP_TimeTrial_Sub_Ranking_C_DisplayNetworkErrorMessage::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");

// Function WBP_TimeTrial_Sub_Ranking.WBP_TimeTrial_Sub_Ranking_C.DisplayNoRankingMessage
// 0x0010 (0x0010 - 0x0000)
struct WBP_TimeTrial_Sub_Ranking_C_DisplayNoRankingMessage final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0010)()
};
static_assert(alignof(WBP_TimeTrial_Sub_Ranking_C_DisplayNoRankingMessage) == 0x000008, "Wrong alignment on WBP_TimeTrial_Sub_Ranking_C_DisplayNoRankingMessage");
static_assert(sizeof(WBP_TimeTrial_Sub_Ranking_C_DisplayNoRankingMessage) == 0x000010, "Wrong size on WBP_TimeTrial_Sub_Ranking_C_DisplayNoRankingMessage");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_DisplayNoRankingMessage, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'WBP_TimeTrial_Sub_Ranking_C_DisplayNoRankingMessage::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");

// Function WBP_TimeTrial_Sub_Ranking.WBP_TimeTrial_Sub_Ranking_C.ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking
// 0x0488 (0x0488 - 0x0000)
struct WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         Temp_byte_Variable_2;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetSelectedMenuSpeedClassId_ReturnValue;  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      K2Node_CustomEvent_InStageID;                      // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0080(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_3;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStageDataAssetTableRow                CallFunc_GetDataTableRowFromName_OutRow;           // 0x00A0(0x00E0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         CallFunc_GetPlatform_ReturnValue;                  // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x01A0(0x0010)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x01B8(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x01C8(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x01D8(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x01E8(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x01F8(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x0208(0x0010)()
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x0218(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x022C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStageDataAssetTableRow                CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0238(0x00E0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_323[0x1];                                      // 0x0323(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0338(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x033C(0x0004)()
	bool                                          CallFunc_AllowCrossPlay_ReturnValue;               // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AllowCrossPlay_ReturnValue_1;             // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         CallFunc_GetPlatform_ReturnValue_1;                // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_8;            // 0x0348(0x0010)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_9;            // 0x0360(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_10;           // 0x0370(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_11;           // 0x0380(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_12;           // 0x0390(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_13;           // 0x03A0(0x0010)()
	EAppSupportedPlatform                         CallFunc_GetPlatform_ReturnValue_2;                // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x03B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x03C8(0x0010)(ConstParm)
	class FText                                   K2Node_Select_Default_1;                           // 0x03D8(0x0010)(ConstParm)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUpKeyPressLoop_ReturnValue;             // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA[0x2];                                      // 0x03EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x03EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDownKeyPressLoop_ReturnValue;           // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         Temp_byte_Variable_5;                              // 0x03FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FE[0x2];                                      // 0x03FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0400(0x0010)(ConstParm)
	class FText                                   K2Node_Select_Default_3;                           // 0x0410(0x0010)(ConstParm)
	EAppSupportedPlatform                         Temp_byte_Variable_6;                              // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         K2Node_Select_Default_4;                           // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0428(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x0464(0x0004)()
	class UButton*                                CallFunc_GetMouseInteractionButton_ReturnValue;    // 0x0468(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_3;                  // 0x0470(0x0004)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0474(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking) == 0x000008, "Wrong alignment on WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking");
static_assert(sizeof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking) == 0x000488, "Wrong size on WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, EntryPoint) == 0x000000, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_Variable) == 0x000018, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_Variable_1) == 0x000019, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_byte_Variable) == 0x00001A, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_byte_Variable_1) == 0x00001B, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_True_if_break_was_hit_Variable) == 0x00001C, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_Not_PreBool_ReturnValue) == 0x000024, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000038, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_int_Array_Index_Variable_1) == 0x00003C, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_Not_PreBool_ReturnValue_1) == 0x000040, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_Variable_2) == 0x000041, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_byte_Variable_2) == 0x000042, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_Has_Been_Initd_Variable) == 0x000043, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000044, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_IsClosed_Variable) == 0x000045, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x000046, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_Has_Been_Initd_Variable_1) == 0x000047, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000058, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetSelectedMenuSpeedClassId_ReturnValue) == 0x000061, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetSelectedMenuSpeedClassId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000068, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x000070, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_UnregisterSingleSubMenu_ReturnValue) == 0x000079, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_UnregisterSingleSubMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_CustomEvent_InStageID) == 0x00007A, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_CustomEvent_InStageID' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000080, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_Variable_3) == 0x000090, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_Array_Get_Item) == 0x000094, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000A0, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000180, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_Less_IntInt_ReturnValue) == 0x000181, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_BooleanAND_ReturnValue) == 0x000182, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000188, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_DynamicCast_As_____2D) == 0x000190, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_DynamicCast_bSuccess_2) == 0x000198, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000199, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_byte_Variable_3) == 0x00019A, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_Not_PreBool_ReturnValue_2) == 0x00019B, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetPlatform_ReturnValue) == 0x00019C, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0001A0, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001B0, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_2) == 0x0001B8, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_3) == 0x0001C8, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_4) == 0x0001D8, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_5) == 0x0001E8, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_6) == 0x0001F8, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_7) == 0x000208, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x000218, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_byte_Variable_4) == 0x000228, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_Array_Get_Item_1) == 0x00022C, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000238, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000318, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_Array_Length_ReturnValue_1) == 0x00031C, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_Less_IntInt_ReturnValue_1) == 0x000320, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_BooleanAND_ReturnValue_1) == 0x000321, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000322, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_Array_Add_ReturnValue) == 0x000324, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_Variable_4) == 0x000328, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000329, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000330, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_SoundPlay_ReturnValue) == 0x000338, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_SoundPlay_ReturnValue_1) == 0x00033C, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_AllowCrossPlay_ReturnValue) == 0x000340, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_AllowCrossPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_AllowCrossPlay_ReturnValue_1) == 0x000341, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_AllowCrossPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_BooleanAND_ReturnValue_2) == 0x000342, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetPlatform_ReturnValue_1) == 0x000343, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetPlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_8) == 0x000348, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000358, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_9) == 0x000360, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_10) == 0x000370, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_11) == 0x000380, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_12) == 0x000390, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_MakeLiteralText_ReturnValue_13) == 0x0003A0, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_MakeLiteralText_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetPlatform_ReturnValue_2) == 0x0003B0, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetPlatform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_CreateDelegate_OutputDelegate) == 0x0003B4, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_Select_Default) == 0x0003C8, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_Select_Default_1) == 0x0003D8, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_bool_IsClosed_Variable_1) == 0x0003E8, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_IsUpKeyPressLoop_ReturnValue) == 0x0003E9, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_IsUpKeyPressLoop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003EC, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_IsDownKeyPressLoop_ReturnValue) == 0x0003FC, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_IsDownKeyPressLoop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_byte_Variable_5) == 0x0003FD, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_Select_Default_2) == 0x000400, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_Select_Default_3) == 0x000410, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, Temp_byte_Variable_6) == 0x000420, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_BooleanAND_ReturnValue_3) == 0x000421, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_Select_Default_4) == 0x000422, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_Select_Default_5) == 0x000423, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_Select_Default_6) == 0x000424, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_Event_MyGeometry) == 0x000428, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_Event_InDeltaTime) == 0x000460, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_SoundPlay_ReturnValue_2) == 0x000464, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_GetMouseInteractionButton_ReturnValue) == 0x000468, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_GetMouseInteractionButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, CallFunc_SoundPlay_ReturnValue_3) == 0x000470, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::CallFunc_SoundPlay_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking, K2Node_CreateDelegate_OutputDelegate_2) == 0x000474, "Member 'WBP_TimeTrial_Sub_Ranking_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Ranking::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_TimeTrial_Sub_Ranking.WBP_TimeTrial_Sub_Ranking_C.GetInputEnable
// 0x0001 (0x0001 - 0x0000)
struct WBP_TimeTrial_Sub_Ranking_C_GetInputEnable final
{
public:
	bool                                          Input;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_Sub_Ranking_C_GetInputEnable) == 0x000001, "Wrong alignment on WBP_TimeTrial_Sub_Ranking_C_GetInputEnable");
static_assert(sizeof(WBP_TimeTrial_Sub_Ranking_C_GetInputEnable) == 0x000001, "Wrong size on WBP_TimeTrial_Sub_Ranking_C_GetInputEnable");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_GetInputEnable, Input) == 0x000000, "Member 'WBP_TimeTrial_Sub_Ranking_C_GetInputEnable::Input' has a wrong offset!");

// Function WBP_TimeTrial_Sub_Ranking.WBP_TimeTrial_Sub_Ranking_C.RequestRanking
// 0x0001 (0x0001 - 0x0000)
struct WBP_TimeTrial_Sub_Ranking_C_RequestRanking final
{
public:
	ESpeedClassId                                 CallFunc_GetSelectedClassId_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_Sub_Ranking_C_RequestRanking) == 0x000001, "Wrong alignment on WBP_TimeTrial_Sub_Ranking_C_RequestRanking");
static_assert(sizeof(WBP_TimeTrial_Sub_Ranking_C_RequestRanking) == 0x000001, "Wrong size on WBP_TimeTrial_Sub_Ranking_C_RequestRanking");
static_assert(offsetof(WBP_TimeTrial_Sub_Ranking_C_RequestRanking, CallFunc_GetSelectedClassId_ReturnValue) == 0x000000, "Member 'WBP_TimeTrial_Sub_Ranking_C_RequestRanking::CallFunc_GetSelectedClassId_ReturnValue' has a wrong offset!");

// Function WBP_TimeTrial_Sub_Ranking.WBP_TimeTrial_Sub_Ranking_C.Set Platform Icon
// 0x0068 (0x0068 - 0x0000)
struct WBP_TimeTrial_Sub_Ranking_C_Set_Platform_Icon final
{
public:
	EAppSupportedPlatform                         Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         Temp_byte_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_8;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_9;                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_10;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_11;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_12;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_13;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_14;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_15;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         CallFunc_GetPlatform_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
