#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_MainMenu_Btn

#include "Basic.hpp"

#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_MainMenu_Btn.WBP_CMN_MainMenu_Btn_C.ExecuteUbergraph_WBP_CMN_MainMenu_Btn
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_CustomEvent_MyGeometry;                     // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	struct FFocusEvent                            K2Node_CustomEvent_InFocusEvent;                   // 0x0040(0x0008)(NoDestructor)
	int32                                         CallFunc_GetUserIndexByFocusEvent_ReturnValue;     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMenuPlayerController*                  K2Node_DynamicCast_AsMenu_Player_Controller;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0064(0x0008)(NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0080(0x0004)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0088(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x008C(0x0004)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_3;                  // 0x009C(0x0004)()
	bool                                          K2Node_CustomEvent_bIsActive;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn) == 0x000008, "Wrong alignment on WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn");
static_assert(sizeof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn) == 0x0000A8, "Wrong size on WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, EntryPoint) == 0x000000, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, Temp_byte_Variable) == 0x000004, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, K2Node_CustomEvent_MyGeometry) == 0x000008, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::K2Node_CustomEvent_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, K2Node_CustomEvent_InFocusEvent) == 0x000040, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::K2Node_CustomEvent_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, CallFunc_GetUserIndexByFocusEvent_ReturnValue) == 0x000048, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::CallFunc_GetUserIndexByFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, K2Node_DynamicCast_AsMenu_Player_Controller) == 0x000058, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::K2Node_DynamicCast_AsMenu_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, K2Node_Event_InFocusEvent) == 0x000064, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, CallFunc_PlayAnimation_ReturnValue_1) == 0x000078, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, CallFunc_SoundPlay_ReturnValue) == 0x000080, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, Temp_byte_Variable_1) == 0x000084, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, Temp_bool_Variable) == 0x000085, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, CallFunc_SoundPlay_ReturnValue_1) == 0x000088, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, CallFunc_SoundPlay_ReturnValue_2) == 0x00008C, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, CallFunc_PlayAnimation_ReturnValue_2) == 0x000090, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, K2Node_SwitchEnum_CmpSuccess) == 0x000098, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, CallFunc_SoundPlay_ReturnValue_3) == 0x00009C, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::CallFunc_SoundPlay_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, K2Node_CustomEvent_bIsActive) == 0x0000A0, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::K2Node_CustomEvent_bIsActive' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, K2Node_Select_Default) == 0x0000A1, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn, CallFunc_BooleanAND_ReturnValue) == 0x0000A2, "Member 'WBP_CMN_MainMenu_Btn_C_ExecuteUbergraph_WBP_CMN_MainMenu_Btn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CMN_MainMenu_Btn.WBP_CMN_MainMenu_Btn_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_MainMenu_Btn_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_CMN_MainMenu_Btn_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_CMN_MainMenu_Btn_C_OnFocusLost");
static_assert(sizeof(WBP_CMN_MainMenu_Btn_C_OnFocusLost) == 0x000008, "Wrong size on WBP_CMN_MainMenu_Btn_C_OnFocusLost");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_CMN_MainMenu_Btn_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_CMN_MainMenu_Btn.WBP_CMN_MainMenu_Btn_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_CMN_MainMenu_Btn_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_CMN_MainMenu_Btn_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_CMN_MainMenu_Btn_C_OnFocusReceived");
static_assert(sizeof(WBP_CMN_MainMenu_Btn_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_CMN_MainMenu_Btn_C_OnFocusReceived");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_CMN_MainMenu_Btn_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_CMN_MainMenu_Btn_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_CMN_MainMenu_Btn_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'WBP_CMN_MainMenu_Btn_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function WBP_CMN_MainMenu_Btn.WBP_CMN_MainMenu_Btn_C.OnFocusReceivedImpl
// 0x0040 (0x0040 - 0x0000)
struct WBP_CMN_MainMenu_Btn_C_OnFocusReceivedImpl final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_CMN_MainMenu_Btn_C_OnFocusReceivedImpl) == 0x000004, "Wrong alignment on WBP_CMN_MainMenu_Btn_C_OnFocusReceivedImpl");
static_assert(sizeof(WBP_CMN_MainMenu_Btn_C_OnFocusReceivedImpl) == 0x000040, "Wrong size on WBP_CMN_MainMenu_Btn_C_OnFocusReceivedImpl");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_OnFocusReceivedImpl, MyGeometry) == 0x000000, "Member 'WBP_CMN_MainMenu_Btn_C_OnFocusReceivedImpl::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_OnFocusReceivedImpl, InFocusEvent) == 0x000038, "Member 'WBP_CMN_MainMenu_Btn_C_OnFocusReceivedImpl::InFocusEvent' has a wrong offset!");

// Function WBP_CMN_MainMenu_Btn.WBP_CMN_MainMenu_Btn_C.SetChangeVisibilityMouseInteraction
// 0x0001 (0x0001 - 0x0000)
struct WBP_CMN_MainMenu_Btn_C_SetChangeVisibilityMouseInteraction final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_MainMenu_Btn_C_SetChangeVisibilityMouseInteraction) == 0x000001, "Wrong alignment on WBP_CMN_MainMenu_Btn_C_SetChangeVisibilityMouseInteraction");
static_assert(sizeof(WBP_CMN_MainMenu_Btn_C_SetChangeVisibilityMouseInteraction) == 0x000001, "Wrong size on WBP_CMN_MainMenu_Btn_C_SetChangeVisibilityMouseInteraction");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetChangeVisibilityMouseInteraction, bIsActive) == 0x000000, "Member 'WBP_CMN_MainMenu_Btn_C_SetChangeVisibilityMouseInteraction::bIsActive' has a wrong offset!");

// Function WBP_CMN_MainMenu_Btn.WBP_CMN_MainMenu_Btn_C.SetEnableButton
// 0x0009 (0x0009 - 0x0000)
struct WBP_CMN_MainMenu_Btn_C_SetEnableButton final
{
public:
	bool                                          bIsEnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_MainMenu_Btn_C_SetEnableButton) == 0x000001, "Wrong alignment on WBP_CMN_MainMenu_Btn_C_SetEnableButton");
static_assert(sizeof(WBP_CMN_MainMenu_Btn_C_SetEnableButton) == 0x000009, "Wrong size on WBP_CMN_MainMenu_Btn_C_SetEnableButton");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetEnableButton, bIsEnable) == 0x000000, "Member 'WBP_CMN_MainMenu_Btn_C_SetEnableButton::bIsEnable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetEnableButton, Temp_byte_Variable) == 0x000001, "Member 'WBP_CMN_MainMenu_Btn_C_SetEnableButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetEnableButton, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_CMN_MainMenu_Btn_C_SetEnableButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetEnableButton, Temp_bool_Variable) == 0x000003, "Member 'WBP_CMN_MainMenu_Btn_C_SetEnableButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetEnableButton, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_CMN_MainMenu_Btn_C_SetEnableButton::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetEnableButton, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_CMN_MainMenu_Btn_C_SetEnableButton::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetEnableButton, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_CMN_MainMenu_Btn_C_SetEnableButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetEnableButton, K2Node_Select_Default) == 0x000007, "Member 'WBP_CMN_MainMenu_Btn_C_SetEnableButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetEnableButton, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_CMN_MainMenu_Btn_C_SetEnableButton::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_CMN_MainMenu_Btn.WBP_CMN_MainMenu_Btn_C.SetIconIndex
// 0x0020 (0x0020 - 0x0000)
struct WBP_CMN_MainMenu_Btn_C_SetIconIndex final
{
public:
	int32                                         InIconIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_MainMenu_Btn_C_SetIconIndex) == 0x000008, "Wrong alignment on WBP_CMN_MainMenu_Btn_C_SetIconIndex");
static_assert(sizeof(WBP_CMN_MainMenu_Btn_C_SetIconIndex) == 0x000020, "Wrong size on WBP_CMN_MainMenu_Btn_C_SetIconIndex");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetIconIndex, InIconIndex) == 0x000000, "Member 'WBP_CMN_MainMenu_Btn_C_SetIconIndex::InIconIndex' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetIconIndex, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_CMN_MainMenu_Btn_C_SetIconIndex::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetIconIndex, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_CMN_MainMenu_Btn_C_SetIconIndex::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetIconIndex, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_CMN_MainMenu_Btn_C_SetIconIndex::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CMN_MainMenu_Btn.WBP_CMN_MainMenu_Btn_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WBP_CMN_MainMenu_Btn_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CMN_MainMenu_Btn_C_SetText) == 0x000008, "Wrong alignment on WBP_CMN_MainMenu_Btn_C_SetText");
static_assert(sizeof(WBP_CMN_MainMenu_Btn_C_SetText) == 0x000010, "Wrong size on WBP_CMN_MainMenu_Btn_C_SetText");
static_assert(offsetof(WBP_CMN_MainMenu_Btn_C_SetText, InText) == 0x000000, "Member 'WBP_CMN_MainMenu_Btn_C_SetText::InText' has a wrong offset!");

}

