#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_Sub_RivalRacerText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result_Sub_RivalRacerText.WBP_Result_Sub_RivalRacerText_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_Result_Sub_RivalRacerText_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TXT_Loop;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_RivalRacer;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Result_Sub_RivalRacerText(int32 EntryPoint);
	void PlayAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Result_Sub_RivalRacerText_C">();
	}
	static class UWBP_Result_Sub_RivalRacerText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_Sub_RivalRacerText_C>();
	}
};
static_assert(alignof(UWBP_Result_Sub_RivalRacerText_C) == 0x000008, "Wrong alignment on UWBP_Result_Sub_RivalRacerText_C");
static_assert(sizeof(UWBP_Result_Sub_RivalRacerText_C) == 0x0002F8, "Wrong size on UWBP_Result_Sub_RivalRacerText_C");
static_assert(offsetof(UWBP_Result_Sub_RivalRacerText_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Result_Sub_RivalRacerText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RivalRacerText_C, TXT_Loop) == 0x0002E8, "Member 'UWBP_Result_Sub_RivalRacerText_C::TXT_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RivalRacerText_C, TXT_RivalRacer) == 0x0002F0, "Member 'UWBP_Result_Sub_RivalRacerText_C::TXT_RivalRacer' has a wrong offset!");

}

