#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyRace_Sub_Option_Preview

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyRace_Sub_Option_Preview.WBP_PartyRace_Sub_Option_Preview_C
// 0x0088 (0x0390 - 0x0308)
class UWBP_PartyRace_Sub_Option_Preview_C final : public UCustomRaceSubOptionPreviewLine
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Detail_Base;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Title_Base;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Mode_Detail;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Mode_Name;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ECustomRaceSettingLine                        SettingLineIndex;                                  // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomRaceSettingLine                 Out_Row;                                           // 0x0338(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_PartyRace_Sub_Option_Preview(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetModeDetailText(const class FText& InText);
	void SetModeNameText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyRace_Sub_Option_Preview_C">();
	}
	static class UWBP_PartyRace_Sub_Option_Preview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyRace_Sub_Option_Preview_C>();
	}
};
static_assert(alignof(UWBP_PartyRace_Sub_Option_Preview_C) == 0x000008, "Wrong alignment on UWBP_PartyRace_Sub_Option_Preview_C");
static_assert(sizeof(UWBP_PartyRace_Sub_Option_Preview_C) == 0x000390, "Wrong size on UWBP_PartyRace_Sub_Option_Preview_C");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Preview_C, UberGraphFrame) == 0x000308, "Member 'UWBP_PartyRace_Sub_Option_Preview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Preview_C, Detail_Base) == 0x000310, "Member 'UWBP_PartyRace_Sub_Option_Preview_C::Detail_Base' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Preview_C, Title_Base) == 0x000318, "Member 'UWBP_PartyRace_Sub_Option_Preview_C::Title_Base' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Preview_C, TXT_Mode_Detail) == 0x000320, "Member 'UWBP_PartyRace_Sub_Option_Preview_C::TXT_Mode_Detail' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Preview_C, TXT_Mode_Name) == 0x000328, "Member 'UWBP_PartyRace_Sub_Option_Preview_C::TXT_Mode_Name' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Preview_C, SettingLineIndex) == 0x000330, "Member 'UWBP_PartyRace_Sub_Option_Preview_C::SettingLineIndex' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_Preview_C, Out_Row) == 0x000338, "Member 'UWBP_PartyRace_Sub_Option_Preview_C::Out_Row' has a wrong offset!");

}

