#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GrandPrixTips_Monitor_StandBy

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GrandPrixTips_Monitor_StandBy.WBP_GrandPrixTips_Monitor_StandBy_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_GrandPrixTips_Monitor_StandBy_C final : public UUserWidget
{
public:
	class UImage*                                 BG_Blue;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dodonpa;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_01;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_02;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Title_01;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Title_02;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Right_2;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GrandPrixTips_Monitor_StandBy_C">();
	}
	static class UWBP_GrandPrixTips_Monitor_StandBy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GrandPrixTips_Monitor_StandBy_C>();
	}
};
static_assert(alignof(UWBP_GrandPrixTips_Monitor_StandBy_C) == 0x000008, "Wrong alignment on UWBP_GrandPrixTips_Monitor_StandBy_C");
static_assert(sizeof(UWBP_GrandPrixTips_Monitor_StandBy_C) == 0x000318, "Wrong size on UWBP_GrandPrixTips_Monitor_StandBy_C");
static_assert(offsetof(UWBP_GrandPrixTips_Monitor_StandBy_C, BG_Blue) == 0x0002E0, "Member 'UWBP_GrandPrixTips_Monitor_StandBy_C::BG_Blue' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrixTips_Monitor_StandBy_C, Dodonpa) == 0x0002E8, "Member 'UWBP_GrandPrixTips_Monitor_StandBy_C::Dodonpa' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrixTips_Monitor_StandBy_C, Line_01) == 0x0002F0, "Member 'UWBP_GrandPrixTips_Monitor_StandBy_C::Line_01' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrixTips_Monitor_StandBy_C, Line_02) == 0x0002F8, "Member 'UWBP_GrandPrixTips_Monitor_StandBy_C::Line_02' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrixTips_Monitor_StandBy_C, TXT_Title_01) == 0x000300, "Member 'UWBP_GrandPrixTips_Monitor_StandBy_C::TXT_Title_01' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrixTips_Monitor_StandBy_C, TXT_Title_02) == 0x000308, "Member 'UWBP_GrandPrixTips_Monitor_StandBy_C::TXT_Title_02' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrixTips_Monitor_StandBy_C, YellowLine_Right_2) == 0x000310, "Member 'UWBP_GrandPrixTips_Monitor_StandBy_C::YellowLine_Right_2' has a wrong offset!");

}

