#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_CustomPaint

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C
// 0x0080 (0x0458 - 0x03D8)
class UWBP_MachineCustom_Sub_CustomPaint_C final : public UUnionUISceneBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VBButton;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_SubMenu_Btn_C*                 WBP_CMN_SubMenu_Btn;                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_Glow_C* WBP_MachineCustom_Sub_CustomPaint_Glow;         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_Liquid_C* WBP_MachineCustom_Sub_CustomPaint_Liquid_Body; // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_Liquid_C* WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit; // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_Liquid_C* WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel; // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FMachineColorAreaUIData& ItemData)> OnColorAreaSelected; // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnCancel;                                          // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnDefault;                                         // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUnionUIGridNavigationBuilder*          NavBuilder;                                        // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   ButtonsPanel0;                                     // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   ButtonsPanel1;                                     // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_4_OnUnionButtonEvent__DelegateSignature(class UUnionUIButtonBase* Button);
	void BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_9_OnUnionButtonEvent__DelegateSignature(class UUnionUIButtonBase* Button);
	void BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_0_OnUnionButtonEvent__DelegateSignature(class UUnionUIButtonBase* Button);
	void BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_3_OnUnionButtonEvent__DelegateSignature(class UUnionUIButtonBase* Button);
	void BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_1_OnFocus__DelegateSignature(class UUnionUIButtonBase* InButton);
	void BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_5_OnDecision__DelegateSignature(class UUnionUIButtonBase* InButton);
	void BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_7_OnDecision__DelegateSignature(class UUnionUIButtonBase* InButton);
	void BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_8_OnFocus__DelegateSignature(class UUnionUIButtonBase* InButton);
	void BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_2_OnFocus__DelegateSignature(class UUnionUIButtonBase* InButton);
	void BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_6_OnDecision__DelegateSignature(class UUnionUIButtonBase* InButton);
	void Cancel(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void Construct();
	void Decision(class UUnionUIButtonBase* Button);
	void ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint(int32 EntryPoint);
	void Focus(class UUnionUIButtonBase* InButton);
	void PlaySECancel();
	void PlaySEDecision();
	void PlaySEFocus();
	void SetInitialFocus(class APlayerController* InPlayerController, EMachineColorAreaUIId InColorAreaId, bool bInDefault);
	void Setup(class APlayerController* InPlayerController, const struct FMachineColorAreaSettingUIData& InUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_CustomPaint_C">();
	}
	static class UWBP_MachineCustom_Sub_CustomPaint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_CustomPaint_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_CustomPaint_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_CustomPaint_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_CustomPaint_C) == 0x000458, "Wrong size on UWBP_MachineCustom_Sub_CustomPaint_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, UberGraphFrame) == 0x0003D8, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, VBButton) == 0x0003E0, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::VBButton' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, WBP_CMN_SubMenu_Btn) == 0x0003E8, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::WBP_CMN_SubMenu_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, WBP_MachineCustom_Sub_CustomPaint_Glow) == 0x0003F0, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::WBP_MachineCustom_Sub_CustomPaint_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, WBP_MachineCustom_Sub_CustomPaint_Liquid_Body) == 0x0003F8, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::WBP_MachineCustom_Sub_CustomPaint_Liquid_Body' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit) == 0x000400, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel) == 0x000408, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, OnColorAreaSelected) == 0x000410, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::OnColorAreaSelected' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, OnCancel) == 0x000420, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::OnCancel' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, OnDefault) == 0x000430, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::OnDefault' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, NavBuilder) == 0x000440, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::NavBuilder' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, ButtonsPanel0) == 0x000448, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::ButtonsPanel0' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_C, ButtonsPanel1) == 0x000450, "Member 'UWBP_MachineCustom_Sub_CustomPaint_C::ButtonsPanel1' has a wrong offset!");

}

