#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_NiceNotice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_NiceNotice.WBP_CMN_NiceNotice_C.ExecuteUbergraph_WBP_CMN_NiceNotice
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CMN_NiceNotice_C* Widget)> K2Node_CreateDelegate_OutputDelegate;       // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWrapBox*                               K2Node_Event_Owner;                                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InChallengeIndex;                     // 0x0058(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InTime;                               // 0x005C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CMN_NiceNotice_C* Widget)> K2Node_CreateDelegate_OutputDelegate_2;     // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CMN_NiceNotice_C*                  K2Node_CustomEvent_Widget;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChallengeId                                  K2Node_CustomEvent_ChallengeId;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice) == 0x000008, "Wrong alignment on WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice");
static_assert(sizeof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice) == 0x0000C8, "Wrong size on WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, EntryPoint) == 0x000000, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, K2Node_Event_Animation) == 0x000028, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000038, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000040, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, K2Node_Event_Owner) == 0x000050, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::K2Node_Event_Owner' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, K2Node_Event_InChallengeIndex) == 0x000058, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::K2Node_Event_InChallengeIndex' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, K2Node_Event_InTime) == 0x00005C, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::K2Node_Event_InTime' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_Conv_IntToByte_ReturnValue) == 0x000060, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_GetValidValue_ReturnValue) == 0x000061, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000078, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, K2Node_CustomEvent_Widget) == 0x000090, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_RemoveChild_ReturnValue) == 0x000098, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, K2Node_CustomEvent_ChallengeId) == 0x000099, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::K2Node_CustomEvent_ChallengeId' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A0, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000AC, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x0000C0, "Member 'WBP_CMN_NiceNotice_C_ExecuteUbergraph_WBP_CMN_NiceNotice::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_CMN_NiceNotice.WBP_CMN_NiceNotice_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_NiceNotice_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_NiceNotice_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_CMN_NiceNotice_C_OnAnimationFinished");
static_assert(sizeof(WBP_CMN_NiceNotice_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_CMN_NiceNotice_C_OnAnimationFinished");
static_assert(offsetof(WBP_CMN_NiceNotice_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_CMN_NiceNotice_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_CMN_NiceNotice.WBP_CMN_NiceNotice_C.OutAnimEndEvent_ChallengeClear
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_NiceNotice_C_OutAnimEndEvent_ChallengeClear final
{
public:
	class UWBP_CMN_NiceNotice_C*                  Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_NiceNotice_C_OutAnimEndEvent_ChallengeClear) == 0x000008, "Wrong alignment on WBP_CMN_NiceNotice_C_OutAnimEndEvent_ChallengeClear");
static_assert(sizeof(WBP_CMN_NiceNotice_C_OutAnimEndEvent_ChallengeClear) == 0x000008, "Wrong size on WBP_CMN_NiceNotice_C_OutAnimEndEvent_ChallengeClear");
static_assert(offsetof(WBP_CMN_NiceNotice_C_OutAnimEndEvent_ChallengeClear, Widget) == 0x000000, "Member 'WBP_CMN_NiceNotice_C_OutAnimEndEvent_ChallengeClear::Widget' has a wrong offset!");

// Function WBP_CMN_NiceNotice.WBP_CMN_NiceNotice_C.SetChallengeId
// 0x0078 (0x0078 - 0x0000)
struct WBP_CMN_NiceNotice_C_SetChallengeId final
{
public:
	EChallengeId                                  InChallengeId;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChallengeCategory                            CallFunc_GetChallengeCategory_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChallengeStruct                       CallFunc_GetChallengeData_ReturnValue;             // 0x0008(0x0048)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_NiceNotice_C_SetChallengeId) == 0x000008, "Wrong alignment on WBP_CMN_NiceNotice_C_SetChallengeId");
static_assert(sizeof(WBP_CMN_NiceNotice_C_SetChallengeId) == 0x000078, "Wrong size on WBP_CMN_NiceNotice_C_SetChallengeId");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetChallengeId, InChallengeId) == 0x000000, "Member 'WBP_CMN_NiceNotice_C_SetChallengeId::InChallengeId' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetChallengeId, CallFunc_GetChallengeCategory_ReturnValue) == 0x000001, "Member 'WBP_CMN_NiceNotice_C_SetChallengeId::CallFunc_GetChallengeCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetChallengeId, CallFunc_GetChallengeData_ReturnValue) == 0x000008, "Member 'WBP_CMN_NiceNotice_C_SetChallengeId::CallFunc_GetChallengeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetChallengeId, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000050, "Member 'WBP_CMN_NiceNotice_C_SetChallengeId::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetChallengeId, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000058, "Member 'WBP_CMN_NiceNotice_C_SetChallengeId::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetChallengeId, CallFunc_FMin_ReturnValue) == 0x000060, "Member 'WBP_CMN_NiceNotice_C_SetChallengeId::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetChallengeId, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000068, "Member 'WBP_CMN_NiceNotice_C_SetChallengeId::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetChallengeId, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000070, "Member 'WBP_CMN_NiceNotice_C_SetChallengeId::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CMN_NiceNotice.WBP_CMN_NiceNotice_C.SetupChallengeClearNotice
// 0x0010 (0x0010 - 0x0000)
struct WBP_CMN_NiceNotice_C_SetupChallengeClearNotice final
{
public:
	class UWrapBox*                               Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         InChallengeIndex;                                  // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InTime;                                            // 0x000C(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_NiceNotice_C_SetupChallengeClearNotice) == 0x000008, "Wrong alignment on WBP_CMN_NiceNotice_C_SetupChallengeClearNotice");
static_assert(sizeof(WBP_CMN_NiceNotice_C_SetupChallengeClearNotice) == 0x000010, "Wrong size on WBP_CMN_NiceNotice_C_SetupChallengeClearNotice");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetupChallengeClearNotice, Owner) == 0x000000, "Member 'WBP_CMN_NiceNotice_C_SetupChallengeClearNotice::Owner' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetupChallengeClearNotice, InChallengeIndex) == 0x000008, "Member 'WBP_CMN_NiceNotice_C_SetupChallengeClearNotice::InChallengeIndex' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetupChallengeClearNotice, InTime) == 0x00000C, "Member 'WBP_CMN_NiceNotice_C_SetupChallengeClearNotice::InTime' has a wrong offset!");

// Function WBP_CMN_NiceNotice.WBP_CMN_NiceNotice_C.SetUpNiceNotice
// 0x0030 (0x0030 - 0x0000)
struct WBP_CMN_NiceNotice_C_SetUpNiceNotice final
{
public:
	class FText                                   InName;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ECrossplayPlatform                            InPlatformType;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_ByteToDouble_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_NiceNotice_C_SetUpNiceNotice) == 0x000008, "Wrong alignment on WBP_CMN_NiceNotice_C_SetUpNiceNotice");
static_assert(sizeof(WBP_CMN_NiceNotice_C_SetUpNiceNotice) == 0x000030, "Wrong size on WBP_CMN_NiceNotice_C_SetUpNiceNotice");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetUpNiceNotice, InName) == 0x000000, "Member 'WBP_CMN_NiceNotice_C_SetUpNiceNotice::InName' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetUpNiceNotice, InPlatformType) == 0x000010, "Member 'WBP_CMN_NiceNotice_C_SetUpNiceNotice::InPlatformType' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetUpNiceNotice, CallFunc_Conv_ByteToDouble_ReturnValue) == 0x000018, "Member 'WBP_CMN_NiceNotice_C_SetUpNiceNotice::CallFunc_Conv_ByteToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetUpNiceNotice, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WBP_CMN_NiceNotice_C_SetUpNiceNotice::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_NiceNotice_C_SetUpNiceNotice, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000028, "Member 'WBP_CMN_NiceNotice_C_SetUpNiceNotice::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CMN_NiceNotice.WBP_CMN_NiceNotice_C.ShowOnly
// 0x0001 (0x0001 - 0x0000)
struct WBP_CMN_NiceNotice_C_ShowOnly final
{
public:
	EChallengeId                                  ChallengeId;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_NiceNotice_C_ShowOnly) == 0x000001, "Wrong alignment on WBP_CMN_NiceNotice_C_ShowOnly");
static_assert(sizeof(WBP_CMN_NiceNotice_C_ShowOnly) == 0x000001, "Wrong size on WBP_CMN_NiceNotice_C_ShowOnly");
static_assert(offsetof(WBP_CMN_NiceNotice_C_ShowOnly, ChallengeId) == 0x000000, "Member 'WBP_CMN_NiceNotice_C_ShowOnly::ChallengeId' has a wrong offset!");

}

