#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu_Btnmode_Sub_Offine_Grandprix

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_TopMenu_Btnmode_Sub_Offine_Grandprix.WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C.ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix
// 0x0058 (0x0058 - 0x0000)
struct WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectTrophyUI*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetProgress_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClassSelectTrophyUI*>           K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UClassSelectTrophyUI*                   CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGrandPrixProgressId                          CallFunc_GetProgressIdGrandPrixMenuSpeedClass_ReturnValue; // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetProgress_ReturnValue_1;                // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix) == 0x000008, "Wrong alignment on WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix");
static_assert(sizeof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix) == 0x000058, "Wrong size on WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, EntryPoint) == 0x000000, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, CallFunc_SetProgress_ReturnValue) == 0x000018, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::CallFunc_SetProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, CallFunc_MakeLiteralByte_ReturnValue) == 0x000019, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, K2Node_MakeArray_Array) == 0x000038, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, CallFunc_GetProgressIdGrandPrixMenuSpeedClass_ReturnValue) == 0x000054, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::CallFunc_GetProgressIdGrandPrixMenuSpeedClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, CallFunc_Less_IntInt_ReturnValue_1) == 0x000055, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix, CallFunc_SetProgress_ReturnValue_1) == 0x000056, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Grandprix::CallFunc_SetProgress_ReturnValue_1' has a wrong offset!");

}

