#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_PlayerDetail_Sub_Info_Number

#include "Basic.hpp"

#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_PlayerDetail_Sub_Info_Number.WBP_CMN_PlayerDetail_Sub_Info_Number_C.ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number
// 0x0138 (0x0138 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_As_____;                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_As______1;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_As______2;                      // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UTexture2D>>      K2Node_CustomEvent_InLoadIcons;                    // 0x0070(0x0010)(ReferenceParm)
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item;                           // 0x0088(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item_2;                         // 0x00D8(0x0028)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number) == 0x000138, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, EntryPoint) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, Temp_object_Variable) == 0x000008, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_DynamicCast_As_____) == 0x000020, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_DynamicCast_As_____' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_CustomEvent_Loaded_1) == 0x000030, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, Temp_object_Variable_1) == 0x000038, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_DynamicCast_As______1) == 0x000040, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_DynamicCast_As______1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_CustomEvent_Loaded) == 0x000050, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, Temp_object_Variable_2) == 0x000058, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_DynamicCast_As______2) == 0x000060, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_DynamicCast_As______2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_CustomEvent_InLoadIcons) == 0x000070, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_CustomEvent_InLoadIcons' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_CustomEvent_Loaded_2) == 0x000080, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, CallFunc_Array_Get_Item_2) == 0x0000D8, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000100, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_CreateDelegate_OutputDelegate_1) == 0x000108, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000118, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, K2Node_CreateDelegate_OutputDelegate_2) == 0x000120, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000130, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Number.WBP_CMN_PlayerDetail_Sub_Info_Number_C.LoadAndSetCharaIcons
// 0x0010 (0x0010 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Number_C_LoadAndSetCharaIcons final
{
public:
	TArray<TSoftObjectPtr<class UTexture2D>>      InLoadIcons;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_LoadAndSetCharaIcons) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Number_C_LoadAndSetCharaIcons");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_LoadAndSetCharaIcons) == 0x000010, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Number_C_LoadAndSetCharaIcons");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_LoadAndSetCharaIcons, InLoadIcons) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_LoadAndSetCharaIcons::InLoadIcons' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Number.WBP_CMN_PlayerDetail_Sub_Info_Number_C.OnLoaded_E1FC87B2465ECB976AB2DBB9011E3990
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E1FC87B2465ECB976AB2DBB9011E3990 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E1FC87B2465ECB976AB2DBB9011E3990) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E1FC87B2465ECB976AB2DBB9011E3990");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E1FC87B2465ECB976AB2DBB9011E3990) == 0x000008, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E1FC87B2465ECB976AB2DBB9011E3990");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E1FC87B2465ECB976AB2DBB9011E3990, Loaded) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E1FC87B2465ECB976AB2DBB9011E3990::Loaded' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Number.WBP_CMN_PlayerDetail_Sub_Info_Number_C.OnLoaded_E710B00048C3BFD801C030B76AAAC944
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E710B00048C3BFD801C030B76AAAC944 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E710B00048C3BFD801C030B76AAAC944) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E710B00048C3BFD801C030B76AAAC944");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E710B00048C3BFD801C030B76AAAC944) == 0x000008, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E710B00048C3BFD801C030B76AAAC944");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E710B00048C3BFD801C030B76AAAC944, Loaded) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_E710B00048C3BFD801C030B76AAAC944::Loaded' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Number.WBP_CMN_PlayerDetail_Sub_Info_Number_C.OnLoaded_FE5531144032839B249608AE27D2DF6C
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_FE5531144032839B249608AE27D2DF6C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_FE5531144032839B249608AE27D2DF6C) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_FE5531144032839B249608AE27D2DF6C");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_FE5531144032839B249608AE27D2DF6C) == 0x000008, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_FE5531144032839B249608AE27D2DF6C");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_FE5531144032839B249608AE27D2DF6C, Loaded) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_OnLoaded_FE5531144032839B249608AE27D2DF6C::Loaded' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Number.WBP_CMN_PlayerDetail_Sub_Info_Number_C.SetUsedCharacterTopThree
// 0x0068 (0x0068 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree final
{
public:
	TArray<struct FUsageCountChara>               InCharaCounts;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<TSoftObjectPtr<class UTexture2D>>      InCharaIcons;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUsageCountChara                       CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0010)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUnionUITextBlock*>              K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUnionUITextBlock*                      CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree) == 0x000068, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree, InCharaCounts) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree::InCharaCounts' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree, InCharaIcons) == 0x000010, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree::InCharaIcons' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree, CallFunc_Array_Get_Item) == 0x00002C, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedCharacterTopThree::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Number.WBP_CMN_PlayerDetail_Sub_Info_Number_C.SetUsedMachineTypeCounts
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedMachineTypeCounts final
{
public:
	TArray<int32>                                 UsedMachineCounts;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Local_MaxCounts;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Local_UsedMachineCounts;                           // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_2;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C*> K2Node_MakeArray_Array;     // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C* CallFunc_Array_Get_Item_3;          // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedMachineTypeCounts) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedMachineTypeCounts");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedMachineTypeCounts) == 0x0000A0, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedMachineTypeCounts");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedMachineTypeCounts, UsedMachineCounts) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedMachineTypeCounts::UsedMachineCounts' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedMachineTypeCounts, Local_MaxCounts) == 0x000010, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_C_SetUsedMachineTypeCounts::Local_MaxCounts' has a wrong offset!");
