#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusInfo_Sub_Point_Reward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatusInfo_Sub_Point_Reward.WBP_StatusInfo_Sub_Point_Reward_C
// 0x0110 (0x03F0 - 0x02E0)
class UWBP_StatusInfo_Sub_Point_Reward_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SmallWindow_Out;                                   // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SmallWindow_Loop;                                  // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SmallWindow_IN;                                    // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_EventReward;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction_Item;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction_Item_1;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction_Item_2;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction_Item_3;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction_Item_4;                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction_Item_5;                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction_Item_6;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction_Item_7;                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction_Item_8;                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pict_Horn;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pict_Sticker;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pict_Title;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PointReward_Base;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Left;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Right;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_HonorTitle;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Klaxon;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Sticker;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_FestaPointTable_C* WBP_Festa_PointReward_FestaPointTable;           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_Object_C*    WBP_Festa_PointReward_Sub_Object;                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HonorTitle_Plate_C*                WBP_HonorTitle_Plate;                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_SmallWindow_C*          WBP_StatusInfo_SmallWindow;                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 ButtonIndex)> OnMouseClicked;                                // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(int32 ButtonIndex, int32 ViewTopDataIndex, int32 SelectDataIndex)> OnMouseHovered; // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnMouseUnhovered;                                  // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BindToOnMouseEvent_RewardButton(class UUnionUIButton* MouseInteraction, const TDelegate<void()>& OnClicked, const TDelegate<void()>& OnHovered, const TDelegate<void()>& OnUnhovered);
	void CallMouseHoveredDispatcher(int32 ButtonIndex);
	void Construct();
	void ExecuteUbergraph_WBP_StatusInfo_Sub_Point_Reward(int32 EntryPoint);
	void OnClicked_RewardButton1();
	void OnClicked_RewardButton2();
	void OnClicked_RewardButton3();
	void OnClicked_RewardButton4();
	void OnClicked_RewardButton5();
	void OnClicked_RewardButton6();
	void OnClicked_RewardButton7();
	void OnClicked_RewardButton8();
	void OnClicked_RewardButton9();
	void OnHovered_RewardButton1();
	void OnHovered_RewardButton2();
	void OnHovered_RewardButton3();
	void OnHovered_RewardButton4();
	void OnHovered_RewardButton5();
	void OnHovered_RewardButton6();
	void OnHovered_RewardButton7();
	void OnHovered_RewardButton8();
	void OnHovered_RewardButton9();
	void OnSmallWindowInAnimEnd();
	void OnSmallWindowOutAnimEnd();
	void OnUnhovered();
	void SetFestaPoint(int32 Point);
	void SetHonorTitle(TArray<struct FFestaPointRewardUIData>& RewardUIDataArray);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatusInfo_Sub_Point_Reward_C">();
	}
	static class UWBP_StatusInfo_Sub_Point_Reward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatusInfo_Sub_Point_Reward_C>();
	}
};
static_assert(alignof(UWBP_StatusInfo_Sub_Point_Reward_C) == 0x000008, "Wrong alignment on UWBP_StatusInfo_Sub_Point_Reward_C");
static_assert(sizeof(UWBP_StatusInfo_Sub_Point_Reward_C) == 0x0003F0, "Wrong size on UWBP_StatusInfo_Sub_Point_Reward_C");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, SmallWindow_Out) == 0x0002E8, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::SmallWindow_Out' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, SmallWindow_Loop) == 0x0002F0, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::SmallWindow_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, SmallWindow_IN) == 0x0002F8, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::SmallWindow_IN' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, base) == 0x000300, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, DMY_EventReward) == 0x000308, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::DMY_EventReward' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, MouseInteraction_Item) == 0x000310, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::MouseInteraction_Item' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, MouseInteraction_Item_1) == 0x000318, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::MouseInteraction_Item_1' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, MouseInteraction_Item_2) == 0x000320, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::MouseInteraction_Item_2' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, MouseInteraction_Item_3) == 0x000328, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::MouseInteraction_Item_3' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, MouseInteraction_Item_4) == 0x000330, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::MouseInteraction_Item_4' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, MouseInteraction_Item_5) == 0x000338, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::MouseInteraction_Item_5' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, MouseInteraction_Item_6) == 0x000340, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::MouseInteraction_Item_6' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, MouseInteraction_Item_7) == 0x000348, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::MouseInteraction_Item_7' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, MouseInteraction_Item_8) == 0x000350, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::MouseInteraction_Item_8' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, Pict_Horn) == 0x000358, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::Pict_Horn' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, Pict_Sticker) == 0x000360, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::Pict_Sticker' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, Pict_Title) == 0x000368, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::Pict_Title' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, PointReward_Base) == 0x000370, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::PointReward_Base' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, RaceFlag_Left) == 0x000378, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::RaceFlag_Left' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, RaceFlag_Right) == 0x000380, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::RaceFlag_Right' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, TXT_HonorTitle) == 0x000388, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::TXT_HonorTitle' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, TXT_Klaxon) == 0x000390, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::TXT_Klaxon' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, TXT_Sticker) == 0x000398, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::TXT_Sticker' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, WBP_Festa_PointReward_FestaPointTable) == 0x0003A0, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::WBP_Festa_PointReward_FestaPointTable' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, WBP_Festa_PointReward_Sub_Object) == 0x0003A8, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::WBP_Festa_PointReward_Sub_Object' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, WBP_HonorTitle_Plate) == 0x0003B0, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::WBP_HonorTitle_Plate' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, WBP_StatusInfo_SmallWindow) == 0x0003B8, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::WBP_StatusInfo_SmallWindow' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, OnMouseClicked) == 0x0003C0, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::OnMouseClicked' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, OnMouseHovered) == 0x0003D0, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::OnMouseHovered' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Point_Reward_C, OnMouseUnhovered) == 0x0003E0, "Member 'UWBP_StatusInfo_Sub_Point_Reward_C::OnMouseUnhovered' has a wrong offset!");

}

