#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FestaResult_RewardComplete

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FestaResult_RewardComplete.WBP_FestaResult_RewardComplete_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_FestaResult_RewardComplete_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InLoop;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_CharaCut;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Close();
	void ExecuteUbergraph_WBP_FestaResult_RewardComplete(int32 EntryPoint);
	void Open(EDriverId DriverId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FestaResult_RewardComplete_C">();
	}
	static class UWBP_FestaResult_RewardComplete_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FestaResult_RewardComplete_C>();
	}
};
static_assert(alignof(UWBP_FestaResult_RewardComplete_C) == 0x000008, "Wrong alignment on UWBP_FestaResult_RewardComplete_C");
static_assert(sizeof(UWBP_FestaResult_RewardComplete_C) == 0x000308, "Wrong size on UWBP_FestaResult_RewardComplete_C");
static_assert(offsetof(UWBP_FestaResult_RewardComplete_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_FestaResult_RewardComplete_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_RewardComplete_C, Out) == 0x0002E8, "Member 'UWBP_FestaResult_RewardComplete_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_RewardComplete_C, InLoop) == 0x0002F0, "Member 'UWBP_FestaResult_RewardComplete_C::InLoop' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_RewardComplete_C, base) == 0x0002F8, "Member 'UWBP_FestaResult_RewardComplete_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_RewardComplete_C, DMY_CharaCut) == 0x000300, "Member 'UWBP_FestaResult_RewardComplete_C::DMY_CharaCut' has a wrong offset!");

}

