#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemSwitch

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemSwitch.WBP_ItemSwitch_C
// 0x0090 (0x03B0 - 0x0320)
class UWBP_ItemSwitch_C final : public UPartyRaceItemSwitch
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ItemSwitch_Out;                                    // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemSwitch_Loop;                                   // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemSwitch_In;                                     // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_Black;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton_80;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_93;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_BG_01_C*                       WBP_CMN_BG_01;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_Detail_C*           WBP_ItemSwitch_Sub_Detail;                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_Window_C*           WBP_ItemSwitch_Sub_Window;                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_Option_Btn_OK_C*     WBP_PartyRace_Sub_Option_Btn_OK;                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClosed;                                          // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUnionUIPopupWindowBase*                QuitConfirmWidget;                                 // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnd;                                             // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnCancel;                                          // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CheckIsGuest(bool IsGuest);
	void Construct();
	void CreatePopupWindow();
	void DestroyQuitConfirmWidget();
	class UWidget* DoCustomNavigation(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_ItemSwitch(int32 EntryPoint);
	void Finished_35A37F1144F5DB39FE23A48C65DAA875();
	void FireInOutAnim(bool bOut, bool Decide);
	void FocusToOK();
	void GetGroupSettingFromGameMode(ERaceSettingGrouping* GroupSetting);
	void OnCancelEvent_Event(class UUnionUIButtonBase* Button);
	void OnDecisionEvent_Event(class UUnionUIButtonBase* Button);
	void OnInAnimEnd();
	void OnOutAnimEnd();
	void OnUISceneCancelEvent_Event(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnUISceneFocusEvent_Event(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void PopupDecisionEvent(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void PreConstruct(bool IsDesignTime);
	void UpdateSetting();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemSwitch_C">();
	}
	static class UWBP_ItemSwitch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemSwitch_C>();
	}
};
static_assert(alignof(UWBP_ItemSwitch_C) == 0x000008, "Wrong alignment on UWBP_ItemSwitch_C");
static_assert(sizeof(UWBP_ItemSwitch_C) == 0x0003B0, "Wrong size on UWBP_ItemSwitch_C");
static_assert(offsetof(UWBP_ItemSwitch_C, UberGraphFrame) == 0x000320, "Member 'UWBP_ItemSwitch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, ItemSwitch_Out) == 0x000328, "Member 'UWBP_ItemSwitch_C::ItemSwitch_Out' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, ItemSwitch_Loop) == 0x000330, "Member 'UWBP_ItemSwitch_C::ItemSwitch_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, ItemSwitch_In) == 0x000338, "Member 'UWBP_ItemSwitch_C::ItemSwitch_In' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, BG_Black) == 0x000340, "Member 'UWBP_ItemSwitch_C::BG_Black' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, OutOfContentButton_80) == 0x000348, "Member 'UWBP_ItemSwitch_C::OutOfContentButton_80' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, Panel) == 0x000350, "Member 'UWBP_ItemSwitch_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, SafeZone_93) == 0x000358, "Member 'UWBP_ItemSwitch_C::SafeZone_93' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, WBP_CMN_BG_01) == 0x000360, "Member 'UWBP_ItemSwitch_C::WBP_CMN_BG_01' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, WBP_ItemSwitch_Sub_Detail) == 0x000368, "Member 'UWBP_ItemSwitch_C::WBP_ItemSwitch_Sub_Detail' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, WBP_ItemSwitch_Sub_Window) == 0x000370, "Member 'UWBP_ItemSwitch_C::WBP_ItemSwitch_Sub_Window' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, WBP_PartyRace_Sub_Option_Btn_OK) == 0x000378, "Member 'UWBP_ItemSwitch_C::WBP_PartyRace_Sub_Option_Btn_OK' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, OnClosed) == 0x000380, "Member 'UWBP_ItemSwitch_C::OnClosed' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, QuitConfirmWidget) == 0x000390, "Member 'UWBP_ItemSwitch_C::QuitConfirmWidget' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, IsEnd) == 0x000398, "Member 'UWBP_ItemSwitch_C::IsEnd' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_C, OnCancel) == 0x0003A0, "Member 'UWBP_ItemSwitch_C::OnCancel' has a wrong offset!");

}

