#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyRace_Sub_RivalTeamNext

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyRace_Sub_RivalTeamNext.WBP_PartyRace_Sub_RivalTeamNext_C
// 0x0080 (0x0708 - 0x0688)
class UWBP_PartyRace_Sub_RivalTeamNext_C final : public UPartyRaceRivalTeamButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RivalNext_OFF_In;                                  // 0x0690(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RivalNext_OFF;                                     // 0x0698(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DMY_CharaCut;                                      // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire01_01;                                         // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire02_01;                                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire03_01;                                         // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow;                                              // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate;                                             // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate_Text;                                        // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sparks_01;                                         // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_No_Rivals_Set;                                 // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Rival;                                         // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn;                             // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_RivalLevel_C*                  WBP_CMN_RivalLevel;                                // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_in_or_Out;                                      // 0x0700(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PartyRace_Sub_RivalTeamNext(int32 EntryPoint);
	void In_ReflectionONOFF();
	void In_ReflectionONOFF_ForPrivateMatch(bool bIsRivalChallenge);
	void Out_ReflectionONOFF();
	void Play_Animation_ONOFF(bool bIsOn);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyRace_Sub_RivalTeamNext_C">();
	}
	static class UWBP_PartyRace_Sub_RivalTeamNext_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyRace_Sub_RivalTeamNext_C>();
	}
};
static_assert(alignof(UWBP_PartyRace_Sub_RivalTeamNext_C) == 0x000008, "Wrong alignment on UWBP_PartyRace_Sub_RivalTeamNext_C");
static_assert(sizeof(UWBP_PartyRace_Sub_RivalTeamNext_C) == 0x000708, "Wrong size on UWBP_PartyRace_Sub_RivalTeamNext_C");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, UberGraphFrame) == 0x000688, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, RivalNext_OFF_In) == 0x000690, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::RivalNext_OFF_In' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, RivalNext_OFF) == 0x000698, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::RivalNext_OFF' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, DMY_CharaCut) == 0x0006A0, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::DMY_CharaCut' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, Fire01_01) == 0x0006A8, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::Fire01_01' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, Fire02_01) == 0x0006B0, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::Fire02_01' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, Fire03_01) == 0x0006B8, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::Fire03_01' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, Grow) == 0x0006C0, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::Grow' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, Plate) == 0x0006C8, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::Plate' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, Plate_Text) == 0x0006D0, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::Plate_Text' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, Sparks_01) == 0x0006D8, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::Sparks_01' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, TXT_No_Rivals_Set) == 0x0006E0, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::TXT_No_Rivals_Set' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, TXT_Rival) == 0x0006E8, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::TXT_Rival' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, WBP_CMN_ControllerBtn) == 0x0006F0, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::WBP_CMN_ControllerBtn' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, WBP_CMN_RivalLevel) == 0x0006F8, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::WBP_CMN_RivalLevel' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_RivalTeamNext_C, Is_in_or_Out) == 0x000700, "Member 'UWBP_PartyRace_Sub_RivalTeamNext_C::Is_in_or_Out' has a wrong offset!");

}

