#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_StartDash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_StartDash.WBP_Race_StartDash_C
// 0x0050 (0x0340 - 0x02F0)
class UWBP_Race_StartDash_C final : public UUnionRaceStartUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StartDash_Out;                                     // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StartDash_Loop;                                    // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StartDash_In;                                      // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_StartDash_Sub_CountDown_C*    WBP_Race_StartDash_Sub_CountDown_Even;             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_StartDash_Sub_CountDown_C*    WBP_Race_StartDash_Sub_CountDown_Odd;              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_StartText_C*                  WBP_Race_StartText;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWidget* WidgetRef)> OnFinish;                               // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_StartDash(int32 EntryPoint);
	void FireInAnim();
	void OnAnimFinish();
	void SetCount(int32 InCount);
	void SetGaugePivotAndRange(class UImage* ImageRef, float PivotRate, float GaugeRateRange);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_StartDash_C">();
	}
	static class UWBP_Race_StartDash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_StartDash_C>();
	}
};
static_assert(alignof(UWBP_Race_StartDash_C) == 0x000008, "Wrong alignment on UWBP_Race_StartDash_C");
static_assert(sizeof(UWBP_Race_StartDash_C) == 0x000340, "Wrong size on UWBP_Race_StartDash_C");
static_assert(offsetof(UWBP_Race_StartDash_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Race_StartDash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_StartDash_C, StartDash_Out) == 0x0002F8, "Member 'UWBP_Race_StartDash_C::StartDash_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Race_StartDash_C, StartDash_Loop) == 0x000300, "Member 'UWBP_Race_StartDash_C::StartDash_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Race_StartDash_C, StartDash_In) == 0x000308, "Member 'UWBP_Race_StartDash_C::StartDash_In' has a wrong offset!");
static_assert(offsetof(UWBP_Race_StartDash_C, CanvasPanel_0) == 0x000310, "Member 'UWBP_Race_StartDash_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_Race_StartDash_C, WBP_Race_StartDash_Sub_CountDown_Even) == 0x000318, "Member 'UWBP_Race_StartDash_C::WBP_Race_StartDash_Sub_CountDown_Even' has a wrong offset!");
static_assert(offsetof(UWBP_Race_StartDash_C, WBP_Race_StartDash_Sub_CountDown_Odd) == 0x000320, "Member 'UWBP_Race_StartDash_C::WBP_Race_StartDash_Sub_CountDown_Odd' has a wrong offset!");
static_assert(offsetof(UWBP_Race_StartDash_C, WBP_Race_StartText) == 0x000328, "Member 'UWBP_Race_StartDash_C::WBP_Race_StartText' has a wrong offset!");
static_assert(offsetof(UWBP_Race_StartDash_C, OnFinish) == 0x000330, "Member 'UWBP_Race_StartDash_C::OnFinish' has a wrong offset!");

}

