#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_DonpaTicket_Use

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Popup_DonpaTicket_Use.WBP_Popup_DonpaTicket_Use_C
// 0x0098 (0x0490 - 0x03F8)
class UWBP_Popup_DonpaTicket_Use_C final : public UCommonMenuPopupDonpaTicketUse
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Popup_Loop;                                        // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_Out;                                         // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_In;                                          // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Base;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton_80;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Info;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DonpaTicketApp_Sub_TicketNumber_C* WBP_DonpaTicketApp_Sub_TicketNumber_;              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          WBP_Popup_Sub_Btn_Standard_01;                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          WBP_Popup_Sub_Btn_Standard_02;                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBase;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         InitialFocusButtonIndex;                           // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonControlState;                                // 0x045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUnionUIButtonBase*>             Array;                                             // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         DecideButtonIndex;                                 // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ButtonControlTimer;                                // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ButtonControlDelayTime;                            // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OwnerControllerIndex;                              // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClearButtonNavigation();
	void Construct();
	void CustomEvent();
	void CustomEvent_1(EButtonFocusType InButtonFocusType);
	void ExecuteUbergraph_WBP_Popup_DonpaTicket_Use(int32 EntryPoint);
	class UWidgetAnimation* GetAnimationIn();
	class UWidgetAnimation* GetAnimationLoop();
	class UWidgetAnimation* GetAnimationOut();
	void GetNoButton(class UWBP_Popup_Sub_Btn_Standard_C** Button);
	EPopupWindowButtonType GetPopupWindowButtonType();
	EPopupWindowType GetPopupWindowType();
	void GetYesButton(class UWBP_Popup_Sub_Btn_Standard_C** Button);
	void InitButtonControlDelay();
	void InitParam(EPopupWindowButtonType ButtonType);
	void OnAnimationInFinished();
	void OnButtonDecision(class UUnionUIButtonBase* Button);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnOutAnimFinished_Impl();
	void OnPanelDecision_Impl(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void PlayAnimationIn();
	void SetButtonControlDelayTime(float InTime);
	void SetButtonFocusType(EButtonFocusType InButtonFocusType);
	void SetButtonNavigation();
	void SetButtonText(const TArray<class FText>& BtnTextArray);
	void SetDisplayFooterButton(const bool InDisplay);
	void SetDonpaTicketCount(int32 CurrentCount, int32 AfterCount);
	void SetEnableInput(bool InEnable);
	void SetFooterMenuBtn(int32 BtnIconIndex, int32 BtnIconType, const class FText& BtnText);
	void SetImageButtonSelectText(const class FText& InText);
	void SetImageTexture(const class UTexture2D* Texture2D);
	void SetInitialFocusButtonIndex(const int32 InButtonIndex);
	void SetPopupInfoDisplayIndex(int32 Index_0);
	void SetPopupInfoMainMenuButtonIconIndex(int32 Btn01IconIndex, int32 Btn02IconIndex);
	void SetTextMessege(const class FText& Text);
	void SetTextTitle(const class FText& Text, bool Attension);
	void SetYesNoTexts(const class FText& No, const class FText& Yes);
	void StartButtonContolDelay();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateButtonControlDelay(double InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Popup_DonpaTicket_Use_C">();
	}
	static class UWBP_Popup_DonpaTicket_Use_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Popup_DonpaTicket_Use_C>();
	}
};
static_assert(alignof(UWBP_Popup_DonpaTicket_Use_C) == 0x000008, "Wrong alignment on UWBP_Popup_DonpaTicket_Use_C");
static_assert(sizeof(UWBP_Popup_DonpaTicket_Use_C) == 0x000490, "Wrong size on UWBP_Popup_DonpaTicket_Use_C");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, UberGraphFrame) == 0x0003F8, "Member 'UWBP_Popup_DonpaTicket_Use_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, Popup_Loop) == 0x000400, "Member 'UWBP_Popup_DonpaTicket_Use_C::Popup_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, Popup_Out) == 0x000408, "Member 'UWBP_Popup_DonpaTicket_Use_C::Popup_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, Popup_In) == 0x000410, "Member 'UWBP_Popup_DonpaTicket_Use_C::Popup_In' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, Image_Base) == 0x000418, "Member 'UWBP_Popup_DonpaTicket_Use_C::Image_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, OutOfContentButton_80) == 0x000420, "Member 'UWBP_Popup_DonpaTicket_Use_C::OutOfContentButton_80' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, SafeZone_0) == 0x000428, "Member 'UWBP_Popup_DonpaTicket_Use_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, TXT_Info) == 0x000430, "Member 'UWBP_Popup_DonpaTicket_Use_C::TXT_Info' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, WBP_DonpaTicketApp_Sub_TicketNumber_) == 0x000438, "Member 'UWBP_Popup_DonpaTicket_Use_C::WBP_DonpaTicketApp_Sub_TicketNumber_' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, WBP_Popup_Sub_Btn_Standard_01) == 0x000440, "Member 'UWBP_Popup_DonpaTicket_Use_C::WBP_Popup_Sub_Btn_Standard_01' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, WBP_Popup_Sub_Btn_Standard_02) == 0x000448, "Member 'UWBP_Popup_DonpaTicket_Use_C::WBP_Popup_Sub_Btn_Standard_02' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, WindowBase) == 0x000450, "Member 'UWBP_Popup_DonpaTicket_Use_C::WindowBase' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, InitialFocusButtonIndex) == 0x000458, "Member 'UWBP_Popup_DonpaTicket_Use_C::InitialFocusButtonIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, ButtonControlState) == 0x00045C, "Member 'UWBP_Popup_DonpaTicket_Use_C::ButtonControlState' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, Array) == 0x000460, "Member 'UWBP_Popup_DonpaTicket_Use_C::Array' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, DecideButtonIndex) == 0x000470, "Member 'UWBP_Popup_DonpaTicket_Use_C::DecideButtonIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, ButtonControlTimer) == 0x000478, "Member 'UWBP_Popup_DonpaTicket_Use_C::ButtonControlTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, ButtonControlDelayTime) == 0x000480, "Member 'UWBP_Popup_DonpaTicket_Use_C::ButtonControlDelayTime' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_DonpaTicket_Use_C, OwnerControllerIndex) == 0x000488, "Member 'UWBP_Popup_DonpaTicket_Use_C::OwnerControllerIndex' has a wrong offset!");

}

