#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu_Btnmode_Sub_Offine_Party

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_TopMenu_Btnmode_Sub_Offine_Party.WBP_TopMenu_Btnmode_Sub_Offine_Party_C.ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party
// 0x0040 (0x0040 - 0x0000)
struct WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERivalTeamId                                  CallFunc_GetSelectedRivalTeamId_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRivalTeamEliminatedCount_ReturnValue;  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRivalTeamAllEliminatedCount_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue;              // 0x0018(0x0010)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRivalTeamAllEliminatedCount_ReturnValue_1; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NumEliminatedRivalTeams;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NumRivalTeams;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party) == 0x000008, "Wrong alignment on WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party");
static_assert(sizeof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party) == 0x000040, "Wrong size on WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, EntryPoint) == 0x000000, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, CallFunc_GetSelectedRivalTeamId_ReturnValue) == 0x000004, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::CallFunc_GetSelectedRivalTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, CallFunc_GetRivalTeamEliminatedCount_ReturnValue) == 0x00000C, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::CallFunc_GetRivalTeamEliminatedCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, CallFunc_Conv_IntToByte_ReturnValue) == 0x000010, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, CallFunc_GetRivalTeamAllEliminatedCount_ReturnValue) == 0x000014, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::CallFunc_GetRivalTeamAllEliminatedCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, CallFunc_Conv_ByteToText_ReturnValue) == 0x000018, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::CallFunc_Conv_ByteToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, CallFunc_GetRivalTeamAllEliminatedCount_ReturnValue_1) == 0x00002C, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::CallFunc_GetRivalTeamAllEliminatedCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, K2Node_SwitchInteger_CmpSuccess) == 0x000030, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, K2Node_CustomEvent_NumEliminatedRivalTeams) == 0x000034, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::K2Node_CustomEvent_NumEliminatedRivalTeams' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party, K2Node_CustomEvent_NumRivalTeams) == 0x000038, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_Party::K2Node_CustomEvent_NumRivalTeams' has a wrong offset!");

// Function WBP_TopMenu_Btnmode_Sub_Offine_Party.WBP_TopMenu_Btnmode_Sub_Offine_Party_C.UpdateProgress
// 0x0008 (0x0008 - 0x0000)
struct WBP_TopMenu_Btnmode_Sub_Offine_Party_C_UpdateProgress final
{
public:
	int32                                         NumEliminatedRivalTeams;                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumRivalTeams;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_UpdateProgress) == 0x000004, "Wrong alignment on WBP_TopMenu_Btnmode_Sub_Offine_Party_C_UpdateProgress");
static_assert(sizeof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_UpdateProgress) == 0x000008, "Wrong size on WBP_TopMenu_Btnmode_Sub_Offine_Party_C_UpdateProgress");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_UpdateProgress, NumEliminatedRivalTeams) == 0x000000, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_UpdateProgress::NumEliminatedRivalTeams' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_Party_C_UpdateProgress, NumRivalTeams) == 0x000004, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_Party_C_UpdateProgress::NumRivalTeams' has a wrong offset!");

}

