#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetCustom_Window

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_GadgetCustom_Window.WBP_GadgetCustom_Window_C.ApplyGadgetCustomCategoryHeader
// 0x0170 (0x0170 - 0x0000)
struct WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader final
{
public:
	TArray<EGadgetId>                             TempVisiblegadgetIdsToGadgetCustomWindow;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<EGadgetCategory>                       TempNewIconCategorys;                              // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetId                                     CallFunc_Array_Get_Item;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGadgetData                            CallFunc_GetGadgetData_OutGadgetData;              // 0x0038(0x00C0)()
	bool                                          CallFunc_GetGadgetData_ReturnValue;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUserItemProperty                      CallFunc_GetGadgetSaveData_OutGadgetSaveData;      // 0x00F9(0x0002)(NoDestructor)
	bool                                          CallFunc_GetGadgetSaveData_ReturnValue;            // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0010)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EGadgetId>                             CallFunc_GetVisibleGadgetIdsToGadgetCustomWindow_OutGadgetIds; // 0x0128(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetCategory                               CallFunc_Array_Get_Item_1;                         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item_2;                         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GadgetCustom_Sub_Header_GadgetType_C* K2Node_DynamicCast_AsWBP_Gadget_Custom_Sub_Header_Gadget_Type; // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader");
static_assert(sizeof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader) == 0x000170, "Wrong size on WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, TempVisiblegadgetIdsToGadgetCustomWindow) == 0x000000, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::TempVisiblegadgetIdsToGadgetCustomWindow' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, TempNewIconCategorys) == 0x000010, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::TempNewIconCategorys' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_GetGadgetData_OutGadgetData) == 0x000038, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_GetGadgetData_OutGadgetData' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_GetGadgetData_ReturnValue) == 0x0000F8, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_GetGadgetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_GetGadgetSaveData_OutGadgetSaveData) == 0x0000F9, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_GetGadgetSaveData_OutGadgetSaveData' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_GetGadgetSaveData_ReturnValue) == 0x0000FB, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_GetGadgetSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000FC, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, K2Node_MakeArray_Array) == 0x000100, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Format_ReturnValue) == 0x000110, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Array_Add_ReturnValue) == 0x000120, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, Temp_int_Loop_Counter_Variable_1) == 0x000124, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_GetVisibleGadgetIdsToGadgetCustomWindow_OutGadgetIds) == 0x000128, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_GetVisibleGadgetIdsToGadgetCustomWindow_OutGadgetIds' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Less_IntInt_ReturnValue) == 0x000138, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Add_IntInt_ReturnValue_1) == 0x00013C, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Array_Get_Item_1) == 0x000140, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Array_Get_Item_2) == 0x000148, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Array_Contains_ReturnValue) == 0x000150, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, K2Node_DynamicCast_AsWBP_Gadget_Custom_Sub_Header_Gadget_Type) == 0x000158, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::K2Node_DynamicCast_AsWBP_Gadget_Custom_Sub_Header_Gadget_Type' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Array_Length_ReturnValue_1) == 0x000164, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Less_IntInt_ReturnValue_1) == 0x000168, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_IsValid_ReturnValue) == 0x000169, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00016A, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader, CallFunc_BooleanAND_ReturnValue) == 0x00016B, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomCategoryHeader::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_GadgetCustom_Window.WBP_GadgetCustom_Window_C.ApplyGadgetCustomScrollPrintBox
// 0x0130 (0x0130 - 0x0000)
struct WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox final
{
public:
	bool                                          bInReSize;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUserItemProperty                      TempGadgetSaveData;                                // 0x0001(0x0002)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGadgetId>                             TempLastSelectedGadgetCategorys;                   // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<struct FUserGadgetData>                TempSelectedGadgetPlateUIData;                     // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<EGadgetId>                             EquippedVisibleGadgets;                            // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<EGadgetId>                             NewIconVisibleGadgets;                             // 0x0038(0x0010)(Edit, BlueprintVisible)
	int32                                         SelectableCategoryLength;                          // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoInitResize_ReturnValue;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetId                                     CallFunc_Array_Get_Item;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUserItemProperty                      CallFunc_GetGadgetSaveData_OutGadgetSaveData;      // 0x0071(0x0002)(NoDestructor)
	bool                                          CallFunc_GetGadgetSaveData_ReturnValue;            // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetId                                     CallFunc_Array_Get_Item_1;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserGadgetData                        CallFunc_Array_Get_Item_2;                         // 0x008C(0x0008)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_2;                              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGadgetPlateUIData                     CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData; // 0x00A8(0x0028)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0010)()
	float                                         K2Node_Select_Default;                             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGadgetCustomWindowCategoryData        CallFunc_Map_Find_Value;                           // 0x0110(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox");
static_assert(sizeof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox) == 0x000130, "Wrong size on WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, bInReSize) == 0x000000, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::bInReSize' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, TempGadgetSaveData) == 0x000001, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::TempGadgetSaveData' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, TempLastSelectedGadgetCategorys) == 0x000008, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::TempLastSelectedGadgetCategorys' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, TempSelectedGadgetPlateUIData) == 0x000018, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::TempSelectedGadgetPlateUIData' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, EquippedVisibleGadgets) == 0x000028, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::EquippedVisibleGadgets' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, NewIconVisibleGadgets) == 0x000038, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::NewIconVisibleGadgets' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, SelectableCategoryLength) == 0x000048, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::SelectableCategoryLength' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_DoInitResize_ReturnValue) == 0x000055, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_DoInitResize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, Temp_int_Loop_Counter_Variable_1) == 0x00005C, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, Temp_int_Array_Index_Variable_1) == 0x000064, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, Temp_real_Variable) == 0x000068, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, Temp_int_Array_Index_Variable_2) == 0x00006C, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_GetGadgetSaveData_OutGadgetSaveData) == 0x000071, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_GetGadgetSaveData_OutGadgetSaveData' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_GetGadgetSaveData_ReturnValue) == 0x000073, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_GetGadgetSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, Temp_real_Variable_1) == 0x000078, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Array_Length_ReturnValue_1) == 0x00007C, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Array_Length_ReturnValue_2) == 0x000084, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Array_Get_Item_2) == 0x00008C, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Array_Length_ReturnValue_3) == 0x000094, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Less_IntInt_ReturnValue_1) == 0x000098, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Array_Find_ReturnValue) == 0x00009C, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, Temp_real_Variable_2) == 0x0000A4, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData) == 0x0000A8, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_GetSelectedGadgetPlateUIData_OutGadgetPlateUIData' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Array_Add_ReturnValue) == 0x0000D0, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, Temp_real_Variable_3) == 0x0000D4, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, Temp_int_Variable) == 0x0000D8, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Array_Find_ReturnValue_1) == 0x0000DC, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000E0, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Array_Add_ReturnValue_1) == 0x0000E4, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, K2Node_MakeArray_Array) == 0x0000E8, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, K2Node_Select_Default) == 0x000108, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00010C, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Map_Find_Value) == 0x000110, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Map_Find_ReturnValue) == 0x000120, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, Temp_int_Loop_Counter_Variable_2) == 0x000124, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Less_IntInt_ReturnValue_2) == 0x000128, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox, CallFunc_Add_IntInt_ReturnValue_2) == 0x00012C, "Member 'WBP_GadgetCustom_Window_C_ApplyGadgetCustomScrollPrintBox::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function WBP_GadgetCustom_Window.WBP_GadgetCustom_Window_C.CalcGadgetCategoryDistance
// 0x0048 (0x0048 - 0x0000)
struct WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance final
{
public:
	bool                                          bRightDown;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetCategory                               GadgetCategory;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Distance;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetCategory                               OutGadgetCategory;                                 // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalEnumMax;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalIndex;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_2;              // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_3;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_3;              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance) == 0x000004, "Wrong alignment on WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance");
static_assert(sizeof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance) == 0x000048, "Wrong size on WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, bRightDown) == 0x000000, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::bRightDown' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, GadgetCategory) == 0x000001, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::GadgetCategory' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, Distance) == 0x000004, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::Distance' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, OutGadgetCategory) == 0x000008, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::OutGadgetCategory' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, LocalEnumMax) == 0x00000C, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::LocalEnumMax' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, LocalIndex) == 0x000010, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::LocalIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000018, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_MakeLiteralByte_ReturnValue) == 0x00001C, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000020, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Add_IntInt_ReturnValue_2) == 0x000030, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Add_IntInt_ReturnValue_3) == 0x000034, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Conv_IntToByte_ReturnValue) == 0x000038, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000039, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_GetValidValue_ReturnValue) == 0x00003A, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_GetValidValue_ReturnValue_1) == 0x00003B, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Conv_IntToByte_ReturnValue_2) == 0x00003D, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Conv_IntToByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_GetValidValue_ReturnValue_2) == 0x00003E, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_GetValidValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Percent_IntInt_ReturnValue) == 0x000040, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_Conv_IntToByte_ReturnValue_3) == 0x000044, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_Conv_IntToByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_GetValidValue_ReturnValue_3) == 0x000045, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_GetValidValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000046, "Member 'WBP_GadgetCustom_Window_C_CalcGadgetCategoryDistance::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GadgetCustom_Window.WBP_GadgetCustom_Window_C.CanPlayScrollAnim
// 0x0028 (0x0028 - 0x0000)
struct WBP_GadgetCustom_Window_C_CanPlayScrollAnim final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayPurchaseAnim_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayScrollAnimUpDown_ReturnValue;       // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GadgetCustom_Sub_TypeBox_C*        K2Node_DynamicCast_AsWBP_Gadget_Custom_Sub_Type_Box; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayScrollAnim_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Window_C_CanPlayScrollAnim");
static_assert(sizeof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim) == 0x000028, "Wrong size on WBP_GadgetCustom_Window_C_CanPlayScrollAnim");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, Result) == 0x000000, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::Result' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, CallFunc_IsPlayPurchaseAnim_ReturnValue) == 0x000001, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::CallFunc_IsPlayPurchaseAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, CallFunc_IsPlayScrollAnimUpDown_ReturnValue) == 0x000003, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::CallFunc_IsPlayScrollAnimUpDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, CallFunc_Not_PreBool_ReturnValue_1) == 0x000010, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, K2Node_DynamicCast_AsWBP_Gadget_Custom_Sub_Type_Box) == 0x000018, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::K2Node_DynamicCast_AsWBP_Gadget_Custom_Sub_Type_Box' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, CallFunc_IsPlayScrollAnim_ReturnValue) == 0x000021, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::CallFunc_IsPlayScrollAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, CallFunc_Not_PreBool_ReturnValue_2) == 0x000022, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, CallFunc_Not_PreBool_ReturnValue_3) == 0x000024, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Window_C_CanPlayScrollAnim, CallFunc_BooleanAND_ReturnValue_1) == 0x000026, "Member 'WBP_GadgetCustom_Window_C_CanPlayScrollAnim::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_GadgetCustom_Window.WBP_GadgetCustom_Window_C.ExecuteUbergraph_WBP_GadgetCustom_Window
// 0x04A0 (0x04A0 - 0x0000)
struct WBP_GadgetCustom_Window_C_ExecuteUbergraph_WBP_GadgetCustom_Window final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0028(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0038(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0060(0x0010)()
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_2;        // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, EUnionUIControlDir Dir)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_1;     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
