#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_TabBtn

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_TabBtn.WBP_MachineCustom_Sub_TabBtn_C
// 0x0040 (0x0350 - 0x0310)
class UWBP_MachineCustom_Sub_TabBtn_C final : public UMachineCustomTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Tab_Select_Loop;                                   // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tab_Active_Loop;                                   // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 PAT_TabPict_Mark;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_TabPict_Platform;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         UnionUIButton;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_All;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_FriendList;                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MachineCustom_Sub_TabBtn_UnionUIButton_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_MachineCustom_Sub_TabBtn(int32 EntryPoint);
	void PlayAnim(bool bInIsActive);
	void SetEnabled(bool bInIsEnabled);
	void SetEnableMouseInput(bool bInIsEnabled);
	void SetFriendListIconIndex(int32 InIconIndex);
	void SetPlatformIconType(ECrossplayPlatform InPlatformType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_TabBtn_C">();
	}
	static class UWBP_MachineCustom_Sub_TabBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_TabBtn_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_TabBtn_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_TabBtn_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_TabBtn_C) == 0x000350, "Wrong size on UWBP_MachineCustom_Sub_TabBtn_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_TabBtn_C, UberGraphFrame) == 0x000310, "Member 'UWBP_MachineCustom_Sub_TabBtn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_TabBtn_C, Tab_Select_Loop) == 0x000318, "Member 'UWBP_MachineCustom_Sub_TabBtn_C::Tab_Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_TabBtn_C, Tab_Active_Loop) == 0x000320, "Member 'UWBP_MachineCustom_Sub_TabBtn_C::Tab_Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_TabBtn_C, PAT_TabPict_Mark) == 0x000328, "Member 'UWBP_MachineCustom_Sub_TabBtn_C::PAT_TabPict_Mark' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_TabBtn_C, PAT_TabPict_Platform) == 0x000330, "Member 'UWBP_MachineCustom_Sub_TabBtn_C::PAT_TabPict_Platform' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_TabBtn_C, UnionUIButton) == 0x000338, "Member 'UWBP_MachineCustom_Sub_TabBtn_C::UnionUIButton' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_TabBtn_C, WidgetSwitcher_All) == 0x000340, "Member 'UWBP_MachineCustom_Sub_TabBtn_C::WidgetSwitcher_All' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_TabBtn_C, WidgetSwitcher_FriendList) == 0x000348, "Member 'UWBP_MachineCustom_Sub_TabBtn_C::WidgetSwitcher_FriendList' has a wrong offset!");

}

