#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_Sub_BonusIcon

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_Result_Sub_BonusIcon.WBP_Result_Sub_BonusIcon_C.ExecuteUbergraph_WBP_Result_Sub_BonusIcon
// 0x0268 (0x0268 - 0x0000)
struct WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGroupBonusType                               Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0030(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_2;                        // 0x0058(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_3;                        // 0x0080(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_4;                        // 0x00A8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_5;                        // 0x00D0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_6;                        // 0x00F8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_7;                        // 0x0120(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_8;                        // 0x0148(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_9;                        // 0x0170(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_10;                       // 0x0198(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_11;                       // 0x01C0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_12;                       // 0x01E8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_13;                       // 0x0210(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	EGroupBonusType                               CallFunc_GetFestaBonusType_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0240(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon) == 0x000008, "Wrong alignment on WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon");
static_assert(sizeof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon) == 0x000268, "Wrong size on WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, EntryPoint) == 0x000000, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_byte_Variable) == 0x000004, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable) == 0x000008, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_1) == 0x000030, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_2) == 0x000058, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_3) == 0x000080, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_4) == 0x0000A8, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_5) == 0x0000D0, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_6) == 0x0000F8, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_7) == 0x000120, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_8) == 0x000148, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_9) == 0x000170, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_10) == 0x000198, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_11) == 0x0001C0, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_12) == 0x0001E8, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, Temp_softobject_Variable_13) == 0x000210, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::Temp_softobject_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, CallFunc_GetFestaBonusType_ReturnValue) == 0x000238, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::CallFunc_GetFestaBonusType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon, K2Node_Select_Default) == 0x000240, "Member 'WBP_Result_Sub_BonusIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusIcon::K2Node_Select_Default' has a wrong offset!");

}

