#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_Window

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Popup_Window.WBP_Popup_Window_C
// 0x0088 (0x0478 - 0x03F0)
class UWBP_Popup_Window_C final : public UUnionUIPopupWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Popup_Out;                                         // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_Loop;                                        // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_In;                                          // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        DSP_WS_HeaderText;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         OutOfContentButton;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_MainTitle;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_MainTitle_Attention;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_CommonBtn_C*        WBP_FooterMenu_Sub_CommonBtn;                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Info_C*                      WBP_Popup_Info;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPopupWindowType                              WindowType;                                        // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupWindowButtonType                        ButtonType;                                        // 0x0451(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452[0x2];                                      // 0x0452(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DecideButtonIndex;                                 // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InitialFocusButtonIndex;                           // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonControlState;                                // 0x045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ButtonControlTimer;                                // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ButtonControlDelayTime;                            // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableInput;                                       // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddFocusButton(const TArray<class UUnionUIButtonBase*>& ButtonArray);
	void AddFocusButtonByButtonType(EPopupWindowButtonType ButtonType_0);
	void BndEvt__WBP_Popup_Window_MouseInteraction_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void ClearButtonNavigation();
	void Construct();
	void Destruct();
	void DisableSubMenu();
	void EnableSubMenu();
	void ExecuteUbergraph_WBP_Popup_Window(int32 EntryPoint);
	class UWidgetAnimation* GetAnimationIn();
	class UWidgetAnimation* GetAnimationLoop();
	class UWidgetAnimation* GetAnimationOut();
	void GetNoButton(class UUnionUIButtonBase** Button);
	EPopupWindowButtonType GetPopupWindowButtonType();
	EPopupWindowType GetPopupWindowType();
	void GetYesButton(class UUnionUIButtonBase** Button);
	void InitButtonControlDelay();
	void InitParam(EPopupWindowButtonType ButtonType_0);
	void OnAcceptKeyPressed();
	void OnAcceptKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnAcceptKeyReleased();
	void OnAcceptKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnAnimationInFinished();
	void OnBackKeyPressed();
	void OnBackKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnBackKeyReleased();
	void OnBackKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnButtonDecision(class UUnionUIButtonBase* Button);
	void OnDownKeyPressed();
	void OnDownKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnDownKeyReleased();
	void OnDownKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnFaceButtonLeftPressed();
	void OnFaceButtonLeftPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnFaceButtonLeftReleased();
	void OnFaceButtonLeftReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnFaceButtonTopPressed();
	void OnFaceButtonTopPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnFaceButtonTopReleased();
	void OnFaceButtonTopReleasedWithPlayerId(const int32& PlayerControllerIndex);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnLeftKeyPressed();
	void OnLeftKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftKeyReleased();
	void OnLeftKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftShoulderPressed();
	void OnLeftShoulderPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftShoulderReleased();
	void OnLeftShoulderReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftStickAxis(const struct FVector2D& Value);
	void OnLeftStickAxisWithPlayerId(const struct FVector2D& Value, const int32& PlayerControllerIndex);
	void OnLeftStickButtonPressed();
	void OnLeftStickButtonPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftStickButtonReleased();
	void OnLeftStickButtonReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnOutAnimFinished_Impl();
	void OnPanelDecision_Impl(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void OnRightKeyPressed();
	void OnRightKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightKeyReleased();
	void OnRightKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightShoulderPressed();
	void OnRightShoulderPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightShoulderReleased();
	void OnRightShoulderReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightStickAxis(const struct FVector2D& Value);
	void OnRightStickAxisWithPlayerId(const struct FVector2D& Value, const int32& PlayerControllerIndex);
	void OnRightStickButtonPressed();
	void OnRightStickButtonPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightStickButtonReleased();
	void OnRightStickButtonReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnSpecialPressed();
	void OnSpecialPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnSpecialReleased();
	void OnSpecialReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnUpKeyPressed();
	void OnUpKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnUpKeyReleased();
	void OnUpKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void PlayAnimationIn();
	void PreConstruct(bool IsDesignTime);
	void RegisterMainMenu();
	void SetButtonControlDelayTime(float InTime);
	void SetButtonFocusType(EButtonFocusType InButtonFocusType);
	void SetButtonNavigation();
	void SetButtonText(const TArray<class FText>& BtnTextArray);
	void SetDisplayFooterButton(const bool InDisplay);
	void SetDonpaTicketCount(int32 CurrentCount, int32 AfterCount);
	void SetEnableInput(bool InEnable);
	void SetFooterMenuBtn(int32 BtnIconIndex, int32 BtnIconType, const class FText& BtnText);
	void SetImageButtonSelectText(const class FText& InText);
	void SetImageTexture(const class UTexture2D* Texture2D);
	void SetInfoDisplay(bool SetImage);
	void SetInitialFocusButtonIndex(const int32 InButtonIndex);
	void SetPopupInfoDisplayIndex(int32 Index_0);
	void SetPopupInfoMainMenuButtonIconIndex(int32 Btn01IconIndex, int32 Btn02IconIndex);
	void SetTextMessege(const class FText& Text);
	void SetTextTitle(const class FText& Text, bool Attension);
	void SilentFocusReady(bool bOnce);
	void StartButtonContolDelay();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UnregisterMainMenu();
	void UpdateButtonControlDelay(double InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Popup_Window_C">();
	}
	static class UWBP_Popup_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Popup_Window_C>();
	}
};
static_assert(alignof(UWBP_Popup_Window_C) == 0x000008, "Wrong alignment on UWBP_Popup_Window_C");
static_assert(sizeof(UWBP_Popup_Window_C) == 0x000478, "Wrong size on UWBP_Popup_Window_C");
static_assert(offsetof(UWBP_Popup_Window_C, UberGraphFrame) == 0x0003F0, "Member 'UWBP_Popup_Window_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, Popup_Out) == 0x0003F8, "Member 'UWBP_Popup_Window_C::Popup_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, Popup_Loop) == 0x000400, "Member 'UWBP_Popup_Window_C::Popup_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, Popup_In) == 0x000408, "Member 'UWBP_Popup_Window_C::Popup_In' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, DSP_WS_HeaderText) == 0x000410, "Member 'UWBP_Popup_Window_C::DSP_WS_HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, MouseInteraction) == 0x000418, "Member 'UWBP_Popup_Window_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, OutOfContentButton) == 0x000420, "Member 'UWBP_Popup_Window_C::OutOfContentButton' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, Panel) == 0x000428, "Member 'UWBP_Popup_Window_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, TXT_MainTitle) == 0x000430, "Member 'UWBP_Popup_Window_C::TXT_MainTitle' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, TXT_MainTitle_Attention) == 0x000438, "Member 'UWBP_Popup_Window_C::TXT_MainTitle_Attention' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, WBP_FooterMenu_Sub_CommonBtn) == 0x000440, "Member 'UWBP_Popup_Window_C::WBP_FooterMenu_Sub_CommonBtn' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, WBP_Popup_Info) == 0x000448, "Member 'UWBP_Popup_Window_C::WBP_Popup_Info' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, WindowType) == 0x000450, "Member 'UWBP_Popup_Window_C::WindowType' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, ButtonType) == 0x000451, "Member 'UWBP_Popup_Window_C::ButtonType' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, DecideButtonIndex) == 0x000454, "Member 'UWBP_Popup_Window_C::DecideButtonIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, InitialFocusButtonIndex) == 0x000458, "Member 'UWBP_Popup_Window_C::InitialFocusButtonIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, ButtonControlState) == 0x00045C, "Member 'UWBP_Popup_Window_C::ButtonControlState' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, ButtonControlTimer) == 0x000460, "Member 'UWBP_Popup_Window_C::ButtonControlTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, ButtonControlDelayTime) == 0x000468, "Member 'UWBP_Popup_Window_C::ButtonControlDelayTime' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_C, EnableInput) == 0x000470, "Member 'UWBP_Popup_Window_C::EnableInput' has a wrong offset!");

}

