#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetCustom_Top

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GadgetCustom_Top.WBP_GadgetCustom_Top_C
// 0x0060 (0x0348 - 0x02E8)
class UWBP_GadgetCustom_Top_C final : public UGadgetCustomizeWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GadgetCustom_Out;                                  // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GadgetCustom_Loop;                                 // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GadgetCustom_In;                                   // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    DummyCharaNameBox;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_GadgetCustomTop;                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_GadgetCountFullWindow_C*       WBP_CMN_GadgetCountFullWindow;                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_GadgetPlate_C*    WBP_GadgetCustom_Sub_GadgetPlate;                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_SkillPlate_C*     WBP_GadgetCustom_Sub_SkillPlate;                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Window_C*             WBP_GadgetCustom_Window;                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_MachineParameter_C*         WBP_Window_MachineParameter;                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GadgetCustom_Top(int32 EntryPoint);
	void SetPlateWindowZorderHigherThanSelectWindow(int32 InPlayerControllerIndex, bool bPlateWindowHigher);
	void Setup(const struct FGadgetCustomizeWindowData& InWindowData, const bool bInFestaSpecialRule);

	void GetCharaNameBoxes(TArray<class UUnionRichTextBlock*>* OutCharaNameBoxes) const;
	void GetDetailWindows(TArray<class UGadgetDetailWindow*>* OutDetailWindows) const;
	void GetGadgetCustomWindows(TArray<class UGadgetCustomWindow*>* OutGadgetCustomWindows) const;
	void GetmachineParameterWindows(TArray<class UCharaMachineParamWindow*>* OutMachineParameterWindows) const;
	void GetPlateWindows(TArray<class UGadgetPlateWindow*>* OutPlateWindows) const;
	class UCommonCountNumberWidget* GetTicketBox() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GadgetCustom_Top_C">();
	}
	static class UWBP_GadgetCustom_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GadgetCustom_Top_C>();
	}
};
static_assert(alignof(UWBP_GadgetCustom_Top_C) == 0x000008, "Wrong alignment on UWBP_GadgetCustom_Top_C");
static_assert(sizeof(UWBP_GadgetCustom_Top_C) == 0x000348, "Wrong size on UWBP_GadgetCustom_Top_C");
static_assert(offsetof(UWBP_GadgetCustom_Top_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_GadgetCustom_Top_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Top_C, GadgetCustom_Out) == 0x0002F0, "Member 'UWBP_GadgetCustom_Top_C::GadgetCustom_Out' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Top_C, GadgetCustom_Loop) == 0x0002F8, "Member 'UWBP_GadgetCustom_Top_C::GadgetCustom_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Top_C, GadgetCustom_In) == 0x000300, "Member 'UWBP_GadgetCustom_Top_C::GadgetCustom_In' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Top_C, BG) == 0x000308, "Member 'UWBP_GadgetCustom_Top_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Top_C, DummyCharaNameBox) == 0x000310, "Member 'UWBP_GadgetCustom_Top_C::DummyCharaNameBox' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Top_C, SafeZone_GadgetCustomTop) == 0x000318, "Member 'UWBP_GadgetCustom_Top_C::SafeZone_GadgetCustomTop' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Top_C, WBP_CMN_GadgetCountFullWindow) == 0x000320, "Member 'UWBP_GadgetCustom_Top_C::WBP_CMN_GadgetCountFullWindow' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Top_C, WBP_GadgetCustom_Sub_GadgetPlate) == 0x000328, "Member 'UWBP_GadgetCustom_Top_C::WBP_GadgetCustom_Sub_GadgetPlate' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Top_C, WBP_GadgetCustom_Sub_SkillPlate) == 0x000330, "Member 'UWBP_GadgetCustom_Top_C::WBP_GadgetCustom_Sub_SkillPlate' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Top_C, WBP_GadgetCustom_Window) == 0x000338, "Member 'UWBP_GadgetCustom_Top_C::WBP_GadgetCustom_Window' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Top_C, WBP_Window_MachineParameter) == 0x000340, "Member 'UWBP_GadgetCustom_Top_C::WBP_Window_MachineParameter' has a wrong offset!");

}

