#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_Sub_Header_StageName

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_TimeTrial_Sub_Header_StageName.WBP_TimeTrial_Sub_Header_StageName_C.ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName
// 0x0140 (0x0140 - 0x0000)
struct WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStageDataAssetTableRow                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x00E0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      K2Node_CustomEvent_InStageID;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName) == 0x000008, "Wrong alignment on WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName");
static_assert(sizeof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName) == 0x000140, "Wrong size on WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, EntryPoint) == 0x000000, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000008, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, Temp_bool_True_if_break_was_hit_Variable) == 0x00001C, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, CallFunc_Array_Get_Item) == 0x000024, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000110, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, CallFunc_Not_PreBool_ReturnValue) == 0x000111, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000118, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, Temp_int_Loop_Counter_Variable) == 0x000120, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, K2Node_DynamicCast_As_____2D) == 0x000128, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, CallFunc_Less_IntInt_ReturnValue) == 0x000131, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, CallFunc_Add_IntInt_ReturnValue) == 0x000134, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, CallFunc_BooleanAND_ReturnValue) == 0x000138, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, K2Node_CustomEvent_InStageID) == 0x000139, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::K2Node_CustomEvent_InStageID' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00013A, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Header_StageName::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_TimeTrial_Sub_Header_StageName.WBP_TimeTrial_Sub_Header_StageName_C.SetStageParam
// 0x0001 (0x0001 - 0x0000)
struct WBP_TimeTrial_Sub_Header_StageName_C_SetStageParam final
{
public:
	EStageId                                      InStageId;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_Sub_Header_StageName_C_SetStageParam) == 0x000001, "Wrong alignment on WBP_TimeTrial_Sub_Header_StageName_C_SetStageParam");
static_assert(sizeof(WBP_TimeTrial_Sub_Header_StageName_C_SetStageParam) == 0x000001, "Wrong size on WBP_TimeTrial_Sub_Header_StageName_C_SetStageParam");
static_assert(offsetof(WBP_TimeTrial_Sub_Header_StageName_C_SetStageParam, InStageId) == 0x000000, "Member 'WBP_TimeTrial_Sub_Header_StageName_C_SetStageParam::InStageId' has a wrong offset!");

}

