#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CustomRandom_Sub_MenuBtn

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CustomRandom_Sub_MenuBtn.WBP_CustomRandom_Sub_MenuBtn_C
// 0x0058 (0x0338 - 0x02E0)
class UWBP_CustomRandom_Sub_MenuBtn_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Btn_Select_Loop;                                   // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_Loop;                                   // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Btn_Active;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_Cursor;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_Select;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Cursor_Texture;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Set_Icon_01;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Set_Icon_02;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlagWave;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_MiniBtn;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_BtnBase;                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CustomRandom_Sub_MenuBtn_C">();
	}
	static class UWBP_CustomRandom_Sub_MenuBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CustomRandom_Sub_MenuBtn_C>();
	}
};
static_assert(alignof(UWBP_CustomRandom_Sub_MenuBtn_C) == 0x000008, "Wrong alignment on UWBP_CustomRandom_Sub_MenuBtn_C");
static_assert(sizeof(UWBP_CustomRandom_Sub_MenuBtn_C) == 0x000338, "Wrong size on UWBP_CustomRandom_Sub_MenuBtn_C");
static_assert(offsetof(UWBP_CustomRandom_Sub_MenuBtn_C, Btn_Select_Loop) == 0x0002E0, "Member 'UWBP_CustomRandom_Sub_MenuBtn_C::Btn_Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CustomRandom_Sub_MenuBtn_C, Btn_Active_Loop) == 0x0002E8, "Member 'UWBP_CustomRandom_Sub_MenuBtn_C::Btn_Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CustomRandom_Sub_MenuBtn_C, Btn_Active) == 0x0002F0, "Member 'UWBP_CustomRandom_Sub_MenuBtn_C::Btn_Active' has a wrong offset!");
static_assert(offsetof(UWBP_CustomRandom_Sub_MenuBtn_C, Btn_Cursor) == 0x0002F8, "Member 'UWBP_CustomRandom_Sub_MenuBtn_C::Btn_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_CustomRandom_Sub_MenuBtn_C, Btn_Select) == 0x000300, "Member 'UWBP_CustomRandom_Sub_MenuBtn_C::Btn_Select' has a wrong offset!");
static_assert(offsetof(UWBP_CustomRandom_Sub_MenuBtn_C, DSP_Cursor_Texture) == 0x000308, "Member 'UWBP_CustomRandom_Sub_MenuBtn_C::DSP_Cursor_Texture' has a wrong offset!");
static_assert(offsetof(UWBP_CustomRandom_Sub_MenuBtn_C, DSP_Set_Icon_01) == 0x000310, "Member 'UWBP_CustomRandom_Sub_MenuBtn_C::DSP_Set_Icon_01' has a wrong offset!");
static_assert(offsetof(UWBP_CustomRandom_Sub_MenuBtn_C, DSP_Set_Icon_02) == 0x000318, "Member 'UWBP_CustomRandom_Sub_MenuBtn_C::DSP_Set_Icon_02' has a wrong offset!");
static_assert(offsetof(UWBP_CustomRandom_Sub_MenuBtn_C, RaceFlagWave) == 0x000320, "Member 'UWBP_CustomRandom_Sub_MenuBtn_C::RaceFlagWave' has a wrong offset!");
static_assert(offsetof(UWBP_CustomRandom_Sub_MenuBtn_C, TXT_MiniBtn) == 0x000328, "Member 'UWBP_CustomRandom_Sub_MenuBtn_C::TXT_MiniBtn' has a wrong offset!");
static_assert(offsetof(UWBP_CustomRandom_Sub_MenuBtn_C, WidgetSwitcher_BtnBase) == 0x000330, "Member 'UWBP_CustomRandom_Sub_MenuBtn_C::WidgetSwitcher_BtnBase' has a wrong offset!");

}

