#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClassSelect_Sub_Btn_Class

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_ClassSelect_Sub_Btn_Class.WBP_ClassSelect_Sub_Btn_Class_C.ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIButtonSoundSetting                    Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIButtonSoundSetting                    Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable_4;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable_5;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             Temp_byte_Variable_8;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              K2Node_Select_Default_1;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBaseCore* Button)> K2Node_CreateDelegate_OutputDelegate;      // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBaseCore* Button)> K2Node_CreateDelegate_OutputDelegate_1;    // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBaseCore* Button)> K2Node_CreateDelegate_OutputDelegate_2;    // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIButtonSoundSetting                    K2Node_Select_Default_2;                           // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bLock;                          // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InComplete;                           // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Current;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Max;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             K2Node_Event_InMenuSpeedClass;                     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBaseCore*                 K2Node_CustomEvent_Button_2;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBaseCore*                 K2Node_CustomEvent_Button_1;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0068(0x0010)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0080(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0090(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x00A0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x00B0(0x0010)()
	class UUnionUIButtonBaseCore*                 K2Node_CustomEvent_Button;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_4;                           // 0x00C8(0x0010)(ConstParm)
	int32                                         K2Node_CustomEvent_NormalMedalCount;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NormalMedalMax;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class) == 0x000008, "Wrong alignment on WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class");
static_assert(sizeof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class) == 0x0000E0, "Wrong size on WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, EntryPoint) == 0x000000, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_byte_Variable) == 0x000004, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_bool_Variable) == 0x000006, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_byte_Variable_2) == 0x000007, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_byte_Variable_3) == 0x000008, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_bool_Variable_1) == 0x000009, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_byte_Variable_4) == 0x00000A, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_byte_Variable_5) == 0x00000B, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_bool_Variable_2) == 0x00000C, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_byte_Variable_6) == 0x00000D, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_byte_Variable_7) == 0x00000E, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_byte_Variable_8) == 0x00000F, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_Select_Default) == 0x000010, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_Select_Default_1) == 0x000011, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, Temp_bool_Variable_3) == 0x000044, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_Select_Default_2) == 0x000045, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_CustomEvent_bLock) == 0x000046, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_CustomEvent_bLock' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_Event_InComplete) == 0x000047, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_Event_InComplete' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_CustomEvent_Current) == 0x000048, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_CustomEvent_Current' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_CustomEvent_Max) == 0x00004C, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_CustomEvent_Max' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_Select_Default_3) == 0x000050, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_Event_InMenuSpeedClass) == 0x000051, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_Event_InMenuSpeedClass' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000054, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_CustomEvent_Button_2) == 0x000058, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_CustomEvent_Button_1) == 0x000060, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, CallFunc_MakeLiteralText_ReturnValue) == 0x000068, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_Event_IsDesignTime) == 0x000078, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000080, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000090, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, CallFunc_MakeLiteralText_ReturnValue_3) == 0x0000A0, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, CallFunc_MakeLiteralText_ReturnValue_4) == 0x0000B0, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_CustomEvent_Button) == 0x0000C0, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_Select_Default_4) == 0x0000C8, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_CustomEvent_NormalMedalCount) == 0x0000D8, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_CustomEvent_NormalMedalCount' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class, K2Node_CustomEvent_NormalMedalMax) == 0x0000DC, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_ExecuteUbergraph_WBP_ClassSelect_Sub_Btn_Class::K2Node_CustomEvent_NormalMedalMax' has a wrong offset!");

// Function WBP_ClassSelect_Sub_Btn_Class.WBP_ClassSelect_Sub_Btn_Class_C.OnDecidedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClassSelect_Sub_Btn_Class_C_OnDecidedEvent_Event final
{
public:
	class UUnionUIButtonBaseCore*                 Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_Btn_Class_C_OnDecidedEvent_Event) == 0x000008, "Wrong alignment on WBP_ClassSelect_Sub_Btn_Class_C_OnDecidedEvent_Event");
static_assert(sizeof(WBP_ClassSelect_Sub_Btn_Class_C_OnDecidedEvent_Event) == 0x000008, "Wrong size on WBP_ClassSelect_Sub_Btn_Class_C_OnDecidedEvent_Event");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_OnDecidedEvent_Event, Button) == 0x000000, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_OnDecidedEvent_Event::Button' has a wrong offset!");

// Function WBP_ClassSelect_Sub_Btn_Class.WBP_ClassSelect_Sub_Btn_Class_C.OnDeselectedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClassSelect_Sub_Btn_Class_C_OnDeselectedEvent_Event final
{
public:
	class UUnionUIButtonBaseCore*                 Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_Btn_Class_C_OnDeselectedEvent_Event) == 0x000008, "Wrong alignment on WBP_ClassSelect_Sub_Btn_Class_C_OnDeselectedEvent_Event");
static_assert(sizeof(WBP_ClassSelect_Sub_Btn_Class_C_OnDeselectedEvent_Event) == 0x000008, "Wrong size on WBP_ClassSelect_Sub_Btn_Class_C_OnDeselectedEvent_Event");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_OnDeselectedEvent_Event, Button) == 0x000000, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_OnDeselectedEvent_Event::Button' has a wrong offset!");

// Function WBP_ClassSelect_Sub_Btn_Class.WBP_ClassSelect_Sub_Btn_Class_C.OnSelectedEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClassSelect_Sub_Btn_Class_C_OnSelectedEvent_Event final
{
public:
	class UUnionUIButtonBaseCore*                 Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_Btn_Class_C_OnSelectedEvent_Event) == 0x000008, "Wrong alignment on WBP_ClassSelect_Sub_Btn_Class_C_OnSelectedEvent_Event");
static_assert(sizeof(WBP_ClassSelect_Sub_Btn_Class_C_OnSelectedEvent_Event) == 0x000008, "Wrong size on WBP_ClassSelect_Sub_Btn_Class_C_OnSelectedEvent_Event");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_OnSelectedEvent_Event, Button) == 0x000000, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_OnSelectedEvent_Event::Button' has a wrong offset!");

// Function WBP_ClassSelect_Sub_Btn_Class.WBP_ClassSelect_Sub_Btn_Class_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ClassSelect_Sub_Btn_Class_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_Btn_Class_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ClassSelect_Sub_Btn_Class_C_PreConstruct");
static_assert(sizeof(WBP_ClassSelect_Sub_Btn_Class_C_PreConstruct) == 0x000001, "Wrong size on WBP_ClassSelect_Sub_Btn_Class_C_PreConstruct");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ClassSelect_Sub_Btn_Class.WBP_ClassSelect_Sub_Btn_Class_C.SetComplete
// 0x0001 (0x0001 - 0x0000)
struct WBP_ClassSelect_Sub_Btn_Class_C_SetComplete final
{
public:
	bool                                          InComplete;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_Btn_Class_C_SetComplete) == 0x000001, "Wrong alignment on WBP_ClassSelect_Sub_Btn_Class_C_SetComplete");
static_assert(sizeof(WBP_ClassSelect_Sub_Btn_Class_C_SetComplete) == 0x000001, "Wrong size on WBP_ClassSelect_Sub_Btn_Class_C_SetComplete");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_SetComplete, InComplete) == 0x000000, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_SetComplete::InComplete' has a wrong offset!");

// Function WBP_ClassSelect_Sub_Btn_Class.WBP_ClassSelect_Sub_Btn_Class_C.SetCompleteCount
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClassSelect_Sub_Btn_Class_C_SetCompleteCount final
{
public:
	int32                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_Btn_Class_C_SetCompleteCount) == 0x000004, "Wrong alignment on WBP_ClassSelect_Sub_Btn_Class_C_SetCompleteCount");
static_assert(sizeof(WBP_ClassSelect_Sub_Btn_Class_C_SetCompleteCount) == 0x000008, "Wrong size on WBP_ClassSelect_Sub_Btn_Class_C_SetCompleteCount");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_SetCompleteCount, Current) == 0x000000, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_SetCompleteCount::Current' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_SetCompleteCount, Max) == 0x000004, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_SetCompleteCount::Max' has a wrong offset!");

// Function WBP_ClassSelect_Sub_Btn_Class.WBP_ClassSelect_Sub_Btn_Class_C.SetLock
// 0x0001 (0x0001 - 0x0000)
struct WBP_ClassSelect_Sub_Btn_Class_C_SetLock final
{
public:
	bool                                          bLock;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_Btn_Class_C_SetLock) == 0x000001, "Wrong alignment on WBP_ClassSelect_Sub_Btn_Class_C_SetLock");
static_assert(sizeof(WBP_ClassSelect_Sub_Btn_Class_C_SetLock) == 0x000001, "Wrong size on WBP_ClassSelect_Sub_Btn_Class_C_SetLock");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_SetLock, bLock) == 0x000000, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_SetLock::bLock' has a wrong offset!");

// Function WBP_ClassSelect_Sub_Btn_Class.WBP_ClassSelect_Sub_Btn_Class_C.SetMenuSpeedClass
// 0x0001 (0x0001 - 0x0000)
struct WBP_ClassSelect_Sub_Btn_Class_C_SetMenuSpeedClass final
{
public:
	EMenuSpeedClassId                             InMenuSpeedClass;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_Btn_Class_C_SetMenuSpeedClass) == 0x000001, "Wrong alignment on WBP_ClassSelect_Sub_Btn_Class_C_SetMenuSpeedClass");
static_assert(sizeof(WBP_ClassSelect_Sub_Btn_Class_C_SetMenuSpeedClass) == 0x000001, "Wrong size on WBP_ClassSelect_Sub_Btn_Class_C_SetMenuSpeedClass");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_SetMenuSpeedClass, InMenuSpeedClass) == 0x000000, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_SetMenuSpeedClass::InMenuSpeedClass' has a wrong offset!");

// Function WBP_ClassSelect_Sub_Btn_Class.WBP_ClassSelect_Sub_Btn_Class_C.SetTimeTrialMedalCount
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClassSelect_Sub_Btn_Class_C_SetTimeTrialMedalCount final
{
public:
	int32                                         NormalMedalCount;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NormalMedalMax;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_Btn_Class_C_SetTimeTrialMedalCount) == 0x000004, "Wrong alignment on WBP_ClassSelect_Sub_Btn_Class_C_SetTimeTrialMedalCount");
static_assert(sizeof(WBP_ClassSelect_Sub_Btn_Class_C_SetTimeTrialMedalCount) == 0x000008, "Wrong size on WBP_ClassSelect_Sub_Btn_Class_C_SetTimeTrialMedalCount");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_SetTimeTrialMedalCount, NormalMedalCount) == 0x000000, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_SetTimeTrialMedalCount::NormalMedalCount' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Btn_Class_C_SetTimeTrialMedalCount, NormalMedalMax) == 0x000004, "Member 'WBP_ClassSelect_Sub_Btn_Class_C_SetTimeTrialMedalCount::NormalMedalMax' has a wrong offset!");

}

