#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_Sub_RankingTable

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TimeTrial_Sub_RankingTable.WBP_TimeTrial_Sub_RankingTable_C.ExecuteUbergraph_WBP_TimeTrial_Sub_RankingTable
// 0x0004 (0x0004 - 0x0000)
struct WBP_TimeTrial_Sub_RankingTable_C_ExecuteUbergraph_WBP_TimeTrial_Sub_RankingTable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_Sub_RankingTable_C_ExecuteUbergraph_WBP_TimeTrial_Sub_RankingTable) == 0x000004, "Wrong alignment on WBP_TimeTrial_Sub_RankingTable_C_ExecuteUbergraph_WBP_TimeTrial_Sub_RankingTable");
static_assert(sizeof(WBP_TimeTrial_Sub_RankingTable_C_ExecuteUbergraph_WBP_TimeTrial_Sub_RankingTable) == 0x000004, "Wrong size on WBP_TimeTrial_Sub_RankingTable_C_ExecuteUbergraph_WBP_TimeTrial_Sub_RankingTable");
static_assert(offsetof(WBP_TimeTrial_Sub_RankingTable_C_ExecuteUbergraph_WBP_TimeTrial_Sub_RankingTable, EntryPoint) == 0x000000, "Member 'WBP_TimeTrial_Sub_RankingTable_C_ExecuteUbergraph_WBP_TimeTrial_Sub_RankingTable::EntryPoint' has a wrong offset!");

// Function WBP_TimeTrial_Sub_RankingTable.WBP_TimeTrial_Sub_RankingTable_C.GetMouseButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_TimeTrial_Sub_RankingTable_C_GetMouseButton final
{
public:
	class UButton*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UButton*                                CallFunc_GetMouseInteractionButton_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_Sub_RankingTable_C_GetMouseButton) == 0x000008, "Wrong alignment on WBP_TimeTrial_Sub_RankingTable_C_GetMouseButton");
static_assert(sizeof(WBP_TimeTrial_Sub_RankingTable_C_GetMouseButton) == 0x000010, "Wrong size on WBP_TimeTrial_Sub_RankingTable_C_GetMouseButton");
static_assert(offsetof(WBP_TimeTrial_Sub_RankingTable_C_GetMouseButton, ReturnValue) == 0x000000, "Member 'WBP_TimeTrial_Sub_RankingTable_C_GetMouseButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_RankingTable_C_GetMouseButton, CallFunc_GetMouseInteractionButton_ReturnValue) == 0x000008, "Member 'WBP_TimeTrial_Sub_RankingTable_C_GetMouseButton::CallFunc_GetMouseInteractionButton_ReturnValue' has a wrong offset!");

}

