#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ready_M4

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Ready_M4.WBP_Ready_M4_C
// 0x0138 (0x0430 - 0x02F8)
class UWBP_Ready_M4_C final : public UReadyWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ready_M4_Decide;                                   // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ready_M4_Cancel;                                   // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ready_M4_Loop;                                     // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ready_M4_In;                                       // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_BG_P1;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_BG_P2;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_BG_P3;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_BG_P4;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_BG_Shadow_P1;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_BG_Shadow_P2;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_BG_Shadow_P3;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_BG_Shadow_P4;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Black;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Light;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_P4;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_Core_Add_01;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_Core_Add_02;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Left_P1;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Left_P1_1;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Right_P2;                                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Right_P4;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Ready_M2;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_2;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_Sub_BoxBtn_C*                  WBP_CMN_Sub_BoxBtn;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ready_Sub_CharaWindow_P1P3_C*      WBP_Ready_Sub_CharaWindow_P1;                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ready_Sub_CharaWindow_P2P4_C*      WBP_Ready_Sub_CharaWindow_P2;                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ready_Sub_CharaWindow_P1P3_C*      WBP_Ready_Sub_CharaWindow_P3;                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ready_Sub_CharaWindow_P2P4_C*      WBP_Ready_Sub_CharaWindow_P4;                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ready_Sub_Decide_C*                WBP_Ready_Sub_Decide;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ready_Sub_Gadget_C*                WBP_Ready_Sub_Gadget_P1;                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ready_Sub_Gadget_C*                WBP_Ready_Sub_Gadget_P2;                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ready_Sub_Gadget_C*                WBP_Ready_Sub_Gadget_P3;                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ready_Sub_Gadget_C*                WBP_Ready_Sub_Gadget_P4;                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ready_Sub_StandByText_C*           WBP_Ready_Sub_StandByText;                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_MachineParameter_C*         WBP_Window_MachineParameter_P1;                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_MachineParameter_C*         WBP_Window_MachineParameter_P2;                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_MachineParameter_C*         WBP_Window_MachineParameter_P3;                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_MachineParameter_C*         WBP_Window_MachineParameter_P4;                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Ready_M4(int32 EntryPoint);
	void GadgetIconMouseEnable(ESlateVisibility InVisibility);
	void OnDecideGoAnimDinished();
	void PlayGoAnimation();
	void PlayInAnimation();
	void PlayOutAnimation();
	void PreConstruct(bool IsDesignTime);
	void SetCollapse();
	void SetReadyColor(bool bIsCheck);
	void SetThreePersonMode();
	void UpdateGadgetDetailWindowToSlotZero(const int32 InPlayerIndex);

	void GetCharaMachineParamWindow(TArray<class UCharaMachineParamWindow*>* OutCharaMachineParamWindows) const;
	void GetGadgetPlateWindows(TArray<class UGadgetPlateWindow*>* OutGadgetPlateWindows) const;
	void GetReadyOptions(TArray<class UReadyOption*>* OutReadyOptions) const;
	void GetReadyWindowCharacterIcons(TArray<class UReadyWindowCharacterIcon*>* OutReadyWindowCharacterIcons) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Ready_M4_C">();
	}
	static class UWBP_Ready_M4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Ready_M4_C>();
	}
};
static_assert(alignof(UWBP_Ready_M4_C) == 0x000008, "Wrong alignment on UWBP_Ready_M4_C");
static_assert(sizeof(UWBP_Ready_M4_C) == 0x000430, "Wrong size on UWBP_Ready_M4_C");
static_assert(offsetof(UWBP_Ready_M4_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_Ready_M4_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Ready_M4_Decide) == 0x000300, "Member 'UWBP_Ready_M4_C::Ready_M4_Decide' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Ready_M4_Cancel) == 0x000308, "Member 'UWBP_Ready_M4_C::Ready_M4_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Ready_M4_Loop) == 0x000310, "Member 'UWBP_Ready_M4_C::Ready_M4_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Ready_M4_In) == 0x000318, "Member 'UWBP_Ready_M4_C::Ready_M4_In' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Base_BG_P1) == 0x000320, "Member 'UWBP_Ready_M4_C::Base_BG_P1' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Base_BG_P2) == 0x000328, "Member 'UWBP_Ready_M4_C::Base_BG_P2' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Base_BG_P3) == 0x000330, "Member 'UWBP_Ready_M4_C::Base_BG_P3' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Base_BG_P4) == 0x000338, "Member 'UWBP_Ready_M4_C::Base_BG_P4' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Base_BG_Shadow_P1) == 0x000340, "Member 'UWBP_Ready_M4_C::Base_BG_Shadow_P1' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Base_BG_Shadow_P2) == 0x000348, "Member 'UWBP_Ready_M4_C::Base_BG_Shadow_P2' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Base_BG_Shadow_P3) == 0x000350, "Member 'UWBP_Ready_M4_C::Base_BG_Shadow_P3' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Base_BG_Shadow_P4) == 0x000358, "Member 'UWBP_Ready_M4_C::Base_BG_Shadow_P4' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, BG_Black) == 0x000360, "Member 'UWBP_Ready_M4_C::BG_Black' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, BG_Light) == 0x000368, "Member 'UWBP_Ready_M4_C::BG_Light' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, CanvasPanel_P4) == 0x000370, "Member 'UWBP_Ready_M4_C::CanvasPanel_P4' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Eff_Core_Add_01) == 0x000378, "Member 'UWBP_Ready_M4_C::Eff_Core_Add_01' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, Eff_Core_Add_02) == 0x000380, "Member 'UWBP_Ready_M4_C::Eff_Core_Add_02' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, RaceFlag_Left_P1) == 0x000388, "Member 'UWBP_Ready_M4_C::RaceFlag_Left_P1' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, RaceFlag_Left_P1_1) == 0x000390, "Member 'UWBP_Ready_M4_C::RaceFlag_Left_P1_1' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, RaceFlag_Right_P2) == 0x000398, "Member 'UWBP_Ready_M4_C::RaceFlag_Right_P2' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, RaceFlag_Right_P4) == 0x0003A0, "Member 'UWBP_Ready_M4_C::RaceFlag_Right_P4' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, SafeZone_Ready_M2) == 0x0003A8, "Member 'UWBP_Ready_M4_C::SafeZone_Ready_M2' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, SizeBox_2) == 0x0003B0, "Member 'UWBP_Ready_M4_C::SizeBox_2' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_CMN_Sub_BoxBtn) == 0x0003B8, "Member 'UWBP_Ready_M4_C::WBP_CMN_Sub_BoxBtn' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Ready_Sub_CharaWindow_P1) == 0x0003C0, "Member 'UWBP_Ready_M4_C::WBP_Ready_Sub_CharaWindow_P1' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Ready_Sub_CharaWindow_P2) == 0x0003C8, "Member 'UWBP_Ready_M4_C::WBP_Ready_Sub_CharaWindow_P2' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Ready_Sub_CharaWindow_P3) == 0x0003D0, "Member 'UWBP_Ready_M4_C::WBP_Ready_Sub_CharaWindow_P3' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Ready_Sub_CharaWindow_P4) == 0x0003D8, "Member 'UWBP_Ready_M4_C::WBP_Ready_Sub_CharaWindow_P4' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Ready_Sub_Decide) == 0x0003E0, "Member 'UWBP_Ready_M4_C::WBP_Ready_Sub_Decide' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Ready_Sub_Gadget_P1) == 0x0003E8, "Member 'UWBP_Ready_M4_C::WBP_Ready_Sub_Gadget_P1' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Ready_Sub_Gadget_P2) == 0x0003F0, "Member 'UWBP_Ready_M4_C::WBP_Ready_Sub_Gadget_P2' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Ready_Sub_Gadget_P3) == 0x0003F8, "Member 'UWBP_Ready_M4_C::WBP_Ready_Sub_Gadget_P3' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Ready_Sub_Gadget_P4) == 0x000400, "Member 'UWBP_Ready_M4_C::WBP_Ready_Sub_Gadget_P4' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Ready_Sub_StandByText) == 0x000408, "Member 'UWBP_Ready_M4_C::WBP_Ready_Sub_StandByText' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Window_MachineParameter_P1) == 0x000410, "Member 'UWBP_Ready_M4_C::WBP_Window_MachineParameter_P1' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Window_MachineParameter_P2) == 0x000418, "Member 'UWBP_Ready_M4_C::WBP_Window_MachineParameter_P2' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Window_MachineParameter_P3) == 0x000420, "Member 'UWBP_Ready_M4_C::WBP_Window_MachineParameter_P3' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_M4_C, WBP_Window_MachineParameter_P4) == 0x000428, "Member 'UWBP_Ready_M4_C::WBP_Window_MachineParameter_P4' has a wrong offset!");

}

