#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineSelect_Sub_TypeWindow

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "EMachineSelectMode_structs.hpp"
#include "UnionRun_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineSelect_Sub_TypeWindow.WBP_MachineSelect_Sub_TypeWindow_C
// 0x0138 (0x0898 - 0x0760)
class UWBP_MachineSelect_Sub_TypeWindow_C final : public UMachineTypeScrollControl
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0760(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MachineType_Down_Program;                          // 0x0768(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MachineType_Up_Program;                            // 0x0770(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MachineType_Idle_Program;                          // 0x0778(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Window_M2_Out;                                     // 0x0780(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Window_M2_Loop;                                    // 0x0788(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Window_M2_In;                                      // 0x0790(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Window_M1M4_Out;                                   // 0x0798(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Window_M1M4_Loop;                                  // 0x07A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Window_M1M4_In;                                    // 0x07A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_CrossButton_C*   MLC_Down_Button;                                   // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_CrossButton_C*   MLC_Left_Button;                                   // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_CrossButton_C*   MLC_Right_Button;                                  // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_CrossButton_C*   MLC_Up_Button;                                     // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         UnionUIButton_Bottom;                              // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         UnionUIButton_Center;                              // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         UnionUIButton_Left;                                // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         UnionUIButton_Right;                               // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         UnionUIButton_Top;                                 // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ScrollSnapPoint_C*             WBP_CMN_ScrollSnapPoint;                           // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_Header_MachineType_C* WBP_MachineSelect_Sub_Header_MachineType_01;  // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_Header_MachineType_C* WBP_MachineSelect_Sub_Header_MachineType_02;  // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_Header_MachineType_C* WBP_MachineSelect_Sub_Header_MachineType_03;  // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_Header_MachineType_C* WBP_MachineSelect_Sub_Header_MachineType_04;  // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_Header_MachineType_C* WBP_MachineSelect_Sub_Header_MachineType_05;  // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_Header_MachineType_C* WBP_MachineSelect_Sub_Header_MachineType_06;  // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_Header_MachineType_C* WBP_MachineSelect_Sub_Header_MachineType_07;  // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_TypeBox_C*       WBP_MachineSelect_Sub_TypeBox_00;                  // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_TypeBox_C*       WBP_MachineSelect_Sub_TypeBox_01;                  // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_TypeBox_C*       WBP_MachineSelect_Sub_TypeBox_02;                  // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_TypeBox_C*       WBP_MachineSelect_Sub_TypeBox_03;                  // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_TypeBox_C*       WBP_MachineSelect_Sub_TypeBox_04;                  // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_TypeBox_C*       WBP_MachineSelect_Sub_TypeBox_05;                  // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_TypeBox_C*       WBP_MachineSelect_Sub_TypeBox_06;                  // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_TypeBox_C*       WBP_MachineSelect_Sub_TypeBox_07;                  // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_TypeBox_C*       WBP_MachineSelect_Sub_TypeBox_08;                  // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_TypeBox_C*       WBP_MachineSelect_Sub_TypeBox_09;                  // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EMachineSelectMode::EMachineSelectMode        Mode;                                              // 0x0888(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_889[0x7];                                      // 0x0889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUICrossButtons*                   CrossButtons;                                      // 0x0890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MachineSelect_Sub_TypeWindow_MLC_Up_Button_K2Node_ComponentBoundEvent_0_OnUnionButtonDirectionEvent__DelegateSignature(class UUnionUIButtonBase* Button, EUnionUIControlDir Dir);
	void BndEvt__WBP_MachineSelect_Sub_TypeWindow_MLC_Up_Button_K2Node_ComponentBoundEvent_1_OnUnionButtonEvent__DelegateSignature(class UUnionUIButtonBase* Button);
	void BndEvt__WBP_MachineSelect_Sub_TypeWindow_MLC_Up_Button_K2Node_ComponentBoundEvent_2_OnUnionButtonEvent__DelegateSignature(class UUnionUIButtonBase* Button);
	void BndEvt__WBP_MachineSelect_Sub_TypeWindow_MLC_Up_Button_K2Node_ComponentBoundEvent_7_OnTakePicture__DelegateSignature();
	void BndEvt__WBP_MachineSelect_Sub_TypeWindow_UnionUIButton_Decide_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_MachineSelect_Sub_TypeWindow_UnionUIButton_ScrollBottom_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_MachineSelect_Sub_TypeWindow_UnionUIButton_ScrollLeft_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_MachineSelect_Sub_TypeWindow_UnionUIButton_ScrollRight_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_MachineSelect_Sub_TypeWindow_UnionUIButton_ScrollTop_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_MachineSelect_Sub_TypeWindow_WBP_MachineSelect_Sub_Ready_K2Node_ComponentBoundEvent_0_Event_AnimFinishedOut__DelegateSignature();
	void Construct();
	void CreateCrossButton();
	void ExecuteUbergraph_WBP_MachineSelect_Sub_TypeWindow(int32 EntryPoint);
	void GetBoxInfo(int32 InIndex, int32* IndexOnBox, ECarStatusType* machineType, int32* CenterElementTypeIndex, EMachineId* MachineId);
	void OnCancelBack();
	void OnDirectionLeftRight(bool IsRight);
	void OnFinishedScrollAnimationBP();
	void OnFocusLastSelected(ECarStatusType InMachineType, EMachineId InMachineID);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnTypeHorizontalScrollAnimationFinished(class UUnionUIAnimScrollControl* FinishedWidget);
	void PlaySECancel();
	void PlaySEError();
	void PlaySESelect();
	void PlayUISceneAnimation(EUnionUISceneAnimation InAnimation);
	void PreConstruct(bool IsDesignTime);
	void SetCenterCursorVisible(bool NewVisible);
	void SetCrossButtonPlayerIndex();
	void SetElement();
	void SetElementPlayerIndex();
	void SetEnableInputButton(bool IsEnable);
	void SetupElement();
	void SetupHeader(ECarStatusType InMachineType);
	void SetupPresentElement();
	void SetVisibleCrossButton(bool IsVisible_0);
	void UpdateIconTextures();
	void UpdateMachineTypeColorWidth();
	void UpdateScrollPointBox();
	void WidgetAnimationEvt_Window_M1M4_In_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_Window_M2_In_K2Node_WidgetAnimationEvent_1();

	void GetCenterTypeBox(class UWBP_MachineSelect_Sub_TypeBox_C** TypeBox) const;
	void GetOtherCenterTypeBox(class UWBP_MachineSelect_Sub_TypeBox_C** OutElement) const;
	void GetSelectableMachineIndex(ECarStatusType InMachineType, EMachineId InMachineID, int32* OutMachineIndex) const;
	EMachineId GetSelectMachineID() const;
	ECarStatusType GetSelectMachineType() const;
	bool IsCharaMachineSelectMode() const;
	bool IsGarageMode() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineSelect_Sub_TypeWindow_C">();
	}
	static class UWBP_MachineSelect_Sub_TypeWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineSelect_Sub_TypeWindow_C>();
	}
};
static_assert(alignof(UWBP_MachineSelect_Sub_TypeWindow_C) == 0x000008, "Wrong alignment on UWBP_MachineSelect_Sub_TypeWindow_C");
static_assert(sizeof(UWBP_MachineSelect_Sub_TypeWindow_C) == 0x000898, "Wrong size on UWBP_MachineSelect_Sub_TypeWindow_C");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, UberGraphFrame) == 0x000760, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, MachineType_Down_Program) == 0x000768, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::MachineType_Down_Program' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, MachineType_Up_Program) == 0x000770, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::MachineType_Up_Program' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, MachineType_Idle_Program) == 0x000778, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::MachineType_Idle_Program' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, Window_M2_Out) == 0x000780, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::Window_M2_Out' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, Window_M2_Loop) == 0x000788, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::Window_M2_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, Window_M2_In) == 0x000790, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::Window_M2_In' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, Window_M1M4_Out) == 0x000798, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::Window_M1M4_Out' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, Window_M1M4_Loop) == 0x0007A0, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::Window_M1M4_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, Window_M1M4_In) == 0x0007A8, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::Window_M1M4_In' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, MLC_Down_Button) == 0x0007B0, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::MLC_Down_Button' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, MLC_Left_Button) == 0x0007B8, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::MLC_Left_Button' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, MLC_Right_Button) == 0x0007C0, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::MLC_Right_Button' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, MLC_Up_Button) == 0x0007C8, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::MLC_Up_Button' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, UnionUIButton_Bottom) == 0x0007D0, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::UnionUIButton_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, UnionUIButton_Center) == 0x0007D8, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::UnionUIButton_Center' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, UnionUIButton_Left) == 0x0007E0, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::UnionUIButton_Left' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, UnionUIButton_Right) == 0x0007E8, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::UnionUIButton_Right' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, UnionUIButton_Top) == 0x0007F0, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::UnionUIButton_Top' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_CMN_ScrollSnapPoint) == 0x0007F8, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_CMN_ScrollSnapPoint' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_Header_MachineType_01) == 0x000800, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_Header_MachineType_01' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_Header_MachineType_02) == 0x000808, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_Header_MachineType_02' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_Header_MachineType_03) == 0x000810, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_Header_MachineType_03' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_Header_MachineType_04) == 0x000818, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_Header_MachineType_04' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_Header_MachineType_05) == 0x000820, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_Header_MachineType_05' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_Header_MachineType_06) == 0x000828, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_Header_MachineType_06' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_Header_MachineType_07) == 0x000830, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_Header_MachineType_07' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_TypeBox_00) == 0x000838, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_TypeBox_00' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_TypeBox_01) == 0x000840, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_TypeBox_01' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_TypeBox_02) == 0x000848, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_TypeBox_02' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_TypeBox_03) == 0x000850, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_TypeBox_03' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_TypeBox_04) == 0x000858, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_TypeBox_04' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_TypeBox_05) == 0x000860, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_TypeBox_05' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_TypeBox_06) == 0x000868, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_TypeBox_06' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_TypeBox_07) == 0x000870, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_TypeBox_07' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_TypeBox_08) == 0x000878, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_TypeBox_08' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, WBP_MachineSelect_Sub_TypeBox_09) == 0x000880, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::WBP_MachineSelect_Sub_TypeBox_09' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, Mode) == 0x000888, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::Mode' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeWindow_C, CrossButtons) == 0x000890, "Member 'UWBP_MachineSelect_Sub_TypeWindow_C::CrossButtons' has a wrong offset!");

}

