#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_GadgetIcon_Simple

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_GadgetIcon_Simple.WBP_Race_HUD_Sub_GadgetIcon_Simple_C
// 0x0208 (0x04E8 - 0x02E0)
class UWBP_Race_HUD_Sub_GadgetIcon_Simple_C final : public URaceUISubGadget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Base_Btm;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Btm_EX;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Top;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_01_Btm_Center;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_01_Btm_Left;                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_01_Btm_Right;                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_01_EX_Center;                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_01_EX_Left;                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_01_EX_Right;                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_01_Top_Center;                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_01_Top_Left;                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_01_Top_Right;                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_02_Btm_Left;                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_02_Btm_Right;                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_02_EX_Lef;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_02_EX_Right;                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_02_Top_Left;                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_02_Top_Right;                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_03_Btm;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_03_EX;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_GadgetIcon_03_Top;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NG_01_Btm_Center;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NG_01_Btm_Left;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NG_01_Btm_Right;                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NG_01_Top_Center;                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NG_01_Top_Left;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NG_01_Top_Right;                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NG_02_Btm_Left;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NG_02_Btm_Right;                               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NG_02_Top_Left;                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NG_02_Top_Right;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NG_03_Btm;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NG_03_Top;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_01_Btm_Center;                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_01_Btm_Left;                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_01_Btm_Right;                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_01_Btm_Right_1;                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_01_EX_Center;                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_01_EX_Left;                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_01_Top_Center;                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_01_Top_Left;                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_01_Top_Right;                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_02_Btm_Left;                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_02_Btm_Right;                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_02_EX_Left;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_02_EX_Right;                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_02_Top_Left;                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_02_Top_Right;                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_03_Btm;                               // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_03_EX;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_PAT_Cost_03_Top;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EGadgetPlateId                                PlateRankID;                                       // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBorder*>                        Cost01Arr;                                         // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<EGadgetId, class UBorder*>               DisplayMap;                                        // 0x0498(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void DisplaySlot(int32 SlotIndex, int32 SlotNum, EGadgetId gadgetId, bool IsNotEnable, bool IsKit);
	void ExecuteUbergraph_WBP_Race_HUD_Sub_GadgetIcon_Simple(int32 EntryPoint);
	void GetSlot(int32 SlotIndex, int32 SlotNum, class UImage** IconSlot);
	void Initialize();
	void Set_RivalTeamGadget(const struct FGadgetData& GadgetData, int32 SlotIndex);
	void SetEffectiveIcon(EGadgetId gadgetId, bool IsEffective);
	void SetGhostPlateData(const struct FUserGadgetPresetData& UserGadgetPresetData);
	void SetLockPlate();
	void SetPlateData(int32 PlayerIndex, bool IsGhostReplay, const struct FUserGadgetPresetData& GhostGadgetData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_GadgetIcon_Simple_C">();
	}
	static class UWBP_Race_HUD_Sub_GadgetIcon_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_GadgetIcon_Simple_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_GadgetIcon_Simple_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C) == 0x0004E8, "Wrong size on UWBP_Race_HUD_Sub_GadgetIcon_Simple_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, Base_Btm) == 0x0002E8, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::Base_Btm' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, Base_Btm_EX) == 0x0002F0, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::Base_Btm_EX' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, Base_Top) == 0x0002F8, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::Base_Top' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_01_Btm_Center) == 0x000300, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_01_Btm_Center' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_01_Btm_Left) == 0x000308, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_01_Btm_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_01_Btm_Right) == 0x000310, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_01_Btm_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_01_EX_Center) == 0x000318, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_01_EX_Center' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_01_EX_Left) == 0x000320, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_01_EX_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_01_EX_Right) == 0x000328, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_01_EX_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_01_Top_Center) == 0x000330, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_01_Top_Center' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_01_Top_Left) == 0x000338, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_01_Top_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_01_Top_Right) == 0x000340, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_01_Top_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_02_Btm_Left) == 0x000348, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_02_Btm_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_02_Btm_Right) == 0x000350, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_02_Btm_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_02_EX_Lef) == 0x000358, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_02_EX_Lef' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_02_EX_Right) == 0x000360, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_02_EX_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_02_Top_Left) == 0x000368, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_02_Top_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_02_Top_Right) == 0x000370, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_02_Top_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_03_Btm) == 0x000378, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_03_Btm' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_03_EX) == 0x000380, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_03_EX' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DMY_GadgetIcon_03_Top) == 0x000388, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DMY_GadgetIcon_03_Top' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_NG_01_Btm_Center) == 0x000390, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_NG_01_Btm_Center' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_NG_01_Btm_Left) == 0x000398, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_NG_01_Btm_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_NG_01_Btm_Right) == 0x0003A0, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_NG_01_Btm_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_NG_01_Top_Center) == 0x0003A8, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_NG_01_Top_Center' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_NG_01_Top_Left) == 0x0003B0, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_NG_01_Top_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_NG_01_Top_Right) == 0x0003B8, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_NG_01_Top_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_NG_02_Btm_Left) == 0x0003C0, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_NG_02_Btm_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_NG_02_Btm_Right) == 0x0003C8, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_NG_02_Btm_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_NG_02_Top_Left) == 0x0003D0, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_NG_02_Top_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_NG_02_Top_Right) == 0x0003D8, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_NG_02_Top_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_NG_03_Btm) == 0x0003E0, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_NG_03_Btm' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_NG_03_Top) == 0x0003E8, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_NG_03_Top' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_01_Btm_Center) == 0x0003F0, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_01_Btm_Center' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_01_Btm_Left) == 0x0003F8, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_01_Btm_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_01_Btm_Right) == 0x000400, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_01_Btm_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_01_Btm_Right_1) == 0x000408, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_01_Btm_Right_1' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_01_EX_Center) == 0x000410, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_01_EX_Center' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_01_EX_Left) == 0x000418, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_01_EX_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_01_Top_Center) == 0x000420, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_01_Top_Center' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_01_Top_Left) == 0x000428, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_01_Top_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_01_Top_Right) == 0x000430, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_01_Top_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_02_Btm_Left) == 0x000438, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_02_Btm_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_02_Btm_Right) == 0x000440, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_02_Btm_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_02_EX_Left) == 0x000448, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_02_EX_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_02_EX_Right) == 0x000450, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_02_EX_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_02_Top_Left) == 0x000458, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_02_Top_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_02_Top_Right) == 0x000460, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_02_Top_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_03_Btm) == 0x000468, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_03_Btm' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_03_EX) == 0x000470, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_03_EX' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DSP_PAT_Cost_03_Top) == 0x000478, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DSP_PAT_Cost_03_Top' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, PlateRankID) == 0x000480, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::PlateRankID' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, Cost01Arr) == 0x000488, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::Cost01Arr' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_GadgetIcon_Simple_C, DisplayMap) == 0x000498, "Member 'UWBP_Race_HUD_Sub_GadgetIcon_Simple_C::DisplayMap' has a wrong offset!");

}

