#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PrivateMatch_Popup_Sub_Info

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_PrivateMatch_Popup_Sub_Info.WBP_PrivateMatch_Popup_Sub_Info_C.ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info
// 0x0308 (0x0308 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0050(0x0010)()
	double                                        K2Node_CustomEvent_InRate;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_Int64ToString_ReturnValue;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0080(0x0010)(ConstParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0010)()
	int32                                         K2Node_CustomEvent_SwitcherIndex_1;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SwitcherIndex;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_1;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_GetButton_Button;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrivateMatchButton*                    K2Node_DynamicCast_AsPrivate_Match_Button;         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_CustomEvent_InTextArray;                    // 0x00F0(0x0010)(ConstParm, ReferenceParm)
	TArray<class UPrivateMatchButton*>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_IconIndex;                      // 0x0118(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrivateMatchButton*>            K2Node_MakeArray_Array_1;                          // 0x0128(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUnionUIButtonBase*                     CallFunc_GetActiveWidgetButton_Button;             // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_MaxCount;                       // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_UploadCount;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MaxCount_1;                     // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01C0(0x0010)()
	bool                                          K2Node_CustomEvent_bJoin_1;                        // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_1;       // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0200(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0210(0x0010)()
	bool                                          K2Node_CustomEvent_bJoin;                          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_2;       // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0230(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0240(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0250(0x0010)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0280(0x0010)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrivateMatchPopup*                     K2Node_CustomEvent_PrivateMatchPopup;              // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x02C8(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x02D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x02F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info) == 0x000008, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info) == 0x000308, "Wrong size on WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, EntryPoint) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000038, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_MakeLiteralText_ReturnValue) == 0x000050, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_InRate) == 0x000060, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_InRate' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Conv_DoubleToInt64_ReturnValue) == 0x000068, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Conv_DoubleToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Conv_Int64ToString_ReturnValue) == 0x000070, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Conv_Int64ToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_InText) == 0x000080, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_SwitcherIndex_1) == 0x0000B0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_SwitcherIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_SwitcherIndex) == 0x0000B4, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_SwitcherIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_ButtonIndex_1) == 0x0000B8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_ButtonIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_GetButton_Button) == 0x0000C0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_GetButton_Button' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_DynamicCast_AsPrivate_Match_Button) == 0x0000C8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_DynamicCast_AsPrivate_Match_Button' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000D8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000E0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000E8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_InTextArray) == 0x0000F0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_InTextArray' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_MakeArray_Array) == 0x000100, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000110, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_SwitchInteger_CmpSuccess) == 0x000114, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_IconIndex) == 0x000118, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_IconIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_ButtonIndex) == 0x00011C, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_SwitchInteger_CmpSuccess_1) == 0x000120, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_MakeArray_Array_1) == 0x000128, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_GetActiveWidgetButton_Button) == 0x000138, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_GetActiveWidgetButton_Button' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_GetOwningPlayer_ReturnValue) == 0x000140, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000148, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_IsValid_ReturnValue) == 0x000151, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_MaxCount) == 0x000154, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_MaxCount' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Conv_IntToString_ReturnValue) == 0x000158, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_UploadCount) == 0x000168, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_UploadCount' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_MaxCount_1) == 0x00016C, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_MaxCount_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000170, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000180, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_PlayAnimation_ReturnValue_4) == 0x000190, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000198, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_Event_IsDesignTime) == 0x0001A8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001B0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001C0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_bJoin_1) == 0x0001D0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_bJoin_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_GetActiveWidgetIndex_ReturnValue_1) == 0x0001D4, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_GetActiveWidgetIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_MakeLiteralInt_ReturnValue) == 0x0001D8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001DC, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001EC, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001F0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000200, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000210, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_bJoin) == 0x000220, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_bJoin' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000224, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_GetActiveWidgetIndex_ReturnValue_2) == 0x000228, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_GetActiveWidgetIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, Temp_bool_Variable) == 0x00022C, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00022D, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000230, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_MakeLiteralText_ReturnValue_4) == 0x000240, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_Select_Default) == 0x000250, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_PlayAnimation_ReturnValue_5) == 0x000260, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, Temp_bool_Variable_1) == 0x000268, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000270, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000278, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_Select_Default_1) == 0x000280, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_IsValid_ReturnValue_1) == 0x000290, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CustomEvent_PrivateMatchPopup) == 0x000298, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CustomEvent_PrivateMatchPopup' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_PlayAnimation_ReturnValue_6) == 0x0002A0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0002A8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0002B8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0002C8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002D8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_PlayAnimation_ReturnValue_7) == 0x0002E8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, K2Node_CreateDelegate_OutputDelegate_6) == 0x0002F0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000300, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_ExecuteUbergraph_WBP_PrivateMatch_Popup_Sub_Info::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_PrivateMatch_Popup_Sub_Info.WBP_PrivateMatch_Popup_Sub_Info_C.GetActiveWidgetButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton final
{
public:
	int32                                         ButtonIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     Button;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         BtnIndex;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetButton_Button;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton) == 0x000008, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton) == 0x000020, "Wrong size on WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton, ButtonIndex) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton::ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton, Button) == 0x000008, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton::Button' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton, BtnIndex) == 0x000010, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton::BtnIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000014, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton, CallFunc_GetButton_Button) == 0x000018, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButton::CallFunc_GetButton_Button' has a wrong offset!");

// Function WBP_PrivateMatch_Popup_Sub_Info.WBP_PrivateMatch_Popup_Sub_Info_C.GetActiveWidgetButtons
// 0x0050 (0x0050 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons final
{
public:
	TArray<class UUnionUIButtonBase*>             Buttons;                                           // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUnionUIButtonBase*>             K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUnionUIButtonBase*>             K2Node_MakeArray_Array_1;                          // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUnionUIButtonBase*>             K2Node_Select_Default;                             // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons) == 0x000008, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons) == 0x000050, "Wrong size on WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons, Buttons) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons::Buttons' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons, Temp_int_Variable) == 0x000010, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons, K2Node_MakeArray_Array_1) == 0x000028, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000038, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons, K2Node_Select_Default) == 0x000040, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetActiveWidgetButtons::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PrivateMatch_Popup_Sub_Info.WBP_PrivateMatch_Popup_Sub_Info_C.GetButton
// 0x0028 (0x0028 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_Info_C_GetButton final
{
public:
	int32                                         SwitcherIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     Button;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         BtnIndex;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PrivateMatch_Popup_Sub_LobbyBtn_C* K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_Info_C_GetButton) == 0x000008, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_Info_C_GetButton");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_Info_C_GetButton) == 0x000028, "Wrong size on WBP_PrivateMatch_Popup_Sub_Info_C_GetButton");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetButton, SwitcherIndex) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetButton::SwitcherIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetButton, ButtonIndex) == 0x000004, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetButton::ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetButton, Button) == 0x000008, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetButton::Button' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetButton, BtnIndex) == 0x000010, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetButton::BtnIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetButton, Temp_int_Variable) == 0x000014, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetButton::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetButton, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetButton::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetButton, K2Node_SwitchInteger_CmpSuccess_1) == 0x000019, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetButton::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_GetButton, K2Node_Select_Default) == 0x000020, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_GetButton::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PrivateMatch_Popup_Sub_Info.WBP_PrivateMatch_Popup_Sub_Info_C.InitialActiveWidget
// 0x0100 (0x0100 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget final
{
public:
	int32                                         Selection;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0038(0x0010)()
	class FText                                   Temp_text_Variable_4;                              // 0x0048(0x0010)()
	class FText                                   Temp_text_Variable_5;                              // 0x0058(0x0010)()
	class FText                                   Temp_text_Variable_6;                              // 0x0068(0x0010)()
	class FText                                   Temp_text_Variable_7;                              // 0x0078(0x0010)()
	class FText                                   Temp_text_Variable_8;                              // 0x0088(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0098(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00A8(0x0010)()
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00C0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x00D0(0x0010)()
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x00F0(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget) == 0x000008, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget) == 0x000100, "Wrong size on WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, Selection) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::Selection' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, Temp_byte_Variable) == 0x000004, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, Temp_text_Variable) == 0x000008, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, Temp_text_Variable_1) == 0x000018, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, Temp_text_Variable_2) == 0x000028, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, Temp_text_Variable_3) == 0x000038, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, Temp_text_Variable_4) == 0x000048, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, Temp_text_Variable_5) == 0x000058, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, Temp_text_Variable_6) == 0x000068, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, Temp_text_Variable_7) == 0x000078, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, Temp_text_Variable_8) == 0x000088, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, CallFunc_MakeLiteralText_ReturnValue) == 0x000098, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000A8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x0000B8, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, K2Node_Select_Default) == 0x0000C0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, CallFunc_MakeLiteralText_ReturnValue_2) == 0x0000D0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget, K2Node_MakeArray_Array_1) == 0x0000F0, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_InitialActiveWidget::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function WBP_PrivateMatch_Popup_Sub_Info.WBP_PrivateMatch_Popup_Sub_Info_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_Info_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PrivateMatch_Popup_Sub_Info_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PrivateMatch_Popup_Sub_Info_C_PreConstruct");
static_assert(sizeof(WBP_PrivateMatch_Popup_Sub_Info_C_PreConstruct) == 0x000001, "Wrong size on WBP_PrivateMatch_Popup_Sub_Info_C_PreConstruct");
static_assert(offsetof(WBP_PrivateMatch_Popup_Sub_Info_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PrivateMatch_Popup_Sub_Info_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PrivateMatch_Popup_Sub_Info.WBP_PrivateMatch_Popup_Sub_Info_C.SetActiveWidgetButtonText
// 0x0060 (0x0060 - 0x0000)
struct WBP_PrivateMatch_Popup_Sub_Info_C_SetActiveWidgetButtonText final
{
public:
	TArray<class FText>                           Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UPrivateMatchButton*>            Buttons;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UPrivateMatchButton*>            BtnArray;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
