#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Festa_TeamGroup

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Sub_Festa_TeamGroup.WBP_Race_HUD_Sub_Festa_TeamGroup_C.ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup
// 0x0050 (0x0050 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     K2Node_CustomEvent_DriverID;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsDispYou;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Rank;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_IconTexture;                    // 0x0010(0x0028)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0038(0x0010)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup) == 0x000050, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup, EntryPoint) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup, K2Node_CustomEvent_DriverID) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup::K2Node_CustomEvent_DriverID' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup, K2Node_CustomEvent_IsDispYou) == 0x000005, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup::K2Node_CustomEvent_IsDispYou' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup, K2Node_CustomEvent_Rank) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup::K2Node_CustomEvent_Rank' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup, K2Node_CustomEvent_IconTexture) == 0x000010, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup::K2Node_CustomEvent_IconTexture' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup, CallFunc_MakeLiteralText_ReturnValue) == 0x000038, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamGroup.WBP_Race_HUD_Sub_Festa_TeamGroup_C.PlayChangeRank
// 0x0030 (0x0030 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank final
{
public:
	EDriverId                                     DriverId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDispYou;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Rank;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              IconTexture;                                       // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank) == 0x000030, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank, DriverId) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank::DriverId' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank, IsDispYou) == 0x000001, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank::IsDispYou' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank, Rank) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank::Rank' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank, IconTexture) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChangeRank::IconTexture' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamGroup.WBP_Race_HUD_Sub_Festa_TeamGroup_C.PlayChargeEffect
// 0x0014 (0x0014 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect final
{
public:
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0000(0x0004)()
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue;                  // 0x0004(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0008(0x0004)()
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue_1;                // 0x000C(0x0004)()
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue_2;                // 0x0010(0x0004)()
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect) == 0x000004, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect) == 0x000014, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect, CallFunc_SoundPlay_ReturnValue) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect, CallFunc_SetPanSplit_ReturnValue) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect::CallFunc_SetPanSplit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect, CallFunc_SoundPlay_ReturnValue_1) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect, CallFunc_SetPanSplit_ReturnValue_1) == 0x00000C, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect::CallFunc_SetPanSplit_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect, CallFunc_SetPanSplit_ReturnValue_2) == 0x000010, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_PlayChargeEffect::CallFunc_SetPanSplit_ReturnValue_2' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamGroup.WBP_Race_HUD_Sub_Festa_TeamGroup_C.Set BaseColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_BaseColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_BaseColor) == 0x000004, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_BaseColor");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_BaseColor) == 0x000010, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_BaseColor");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_BaseColor, Color) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_BaseColor::Color' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamGroup.WBP_Race_HUD_Sub_Festa_TeamGroup_C.Set Driver Icon
// 0x03D0 (0x03D0 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon final
{
public:
	EDriverId                                     DirverId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsCharacterReleased_ReturnValue;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDriverData                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0390)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon) == 0x0003D0, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon, DirverId) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon::DirverId' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon, Temp_byte_Variable) == 0x000001, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon, CallFunc_GetIsCharacterReleased_ReturnValue) == 0x000002, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon::CallFunc_GetIsCharacterReleased_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon, Temp_bool_Variable) == 0x000003, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon, K2Node_Select_Default) == 0x000010, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon, CallFunc_GetEnumeratorName_ReturnValue) == 0x000014, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003B0, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0003B8, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon, K2Node_DynamicCast_As_____2D) == 0x0003C0, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon, K2Node_DynamicCast_bSuccess) == 0x0003C8, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_Icon::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamGroup.WBP_Race_HUD_Sub_Festa_TeamGroup_C.Set Driver IconForTex
// 0x0048 (0x0048 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex final
{
public:
	TSoftObjectPtr<class UTexture2D>              DirverId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex) == 0x000048, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex, DirverId) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex::DirverId' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000028, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex, K2Node_DynamicCast_As_____2D) == 0x000038, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_Set_Driver_IconForTex::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamGroup.WBP_Race_HUD_Sub_Festa_TeamGroup_C.SetDispPlayer
// 0x0001 (0x0001 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetDispPlayer final
{
public:
	bool                                          IsDsip;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetDispPlayer) == 0x000001, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetDispPlayer");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetDispPlayer) == 0x000001, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetDispPlayer");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetDispPlayer, IsDsip) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetDispPlayer::IsDsip' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamGroup.WBP_Race_HUD_Sub_Festa_TeamGroup_C.SetInfoDelay
// 0x0030 (0x0030 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay final
{
public:
	EDriverId                                     DriverId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDispYou;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Rank;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              IconTexture;                                       // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay) == 0x000030, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay, DriverId) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay::DriverId' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay, IsDispYou) == 0x000001, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay::IsDispYou' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay, Rank) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay::Rank' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay, IconTexture) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetInfoDelay::IconTexture' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamGroup.WBP_Race_HUD_Sub_Festa_TeamGroup_C.SetRank
// 0x0020 (0x0020 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank final
{
public:
	int32                                         Rank;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank) == 0x000020, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank, Rank) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank::Rank' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_SetRank::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamGroup.WBP_Race_HUD_Sub_Festa_TeamGroup_C.UpdateLocalizeTexture
// 0x0078 (0x0078 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture final
{
public:
	ELanguage                                     CallFunc_GetTextLangFromSave_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_As_______;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLocalizeRuntimeImage                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0030)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture) == 0x000078, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture, CallFunc_GetTextLangFromSave_ReturnValue) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture::CallFunc_GetTextLangFromSave_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture, CallFunc_GetEnumeratorName_ReturnValue) == 0x000010, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture, K2Node_DynamicCast_As_______) == 0x000018, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture::K2Node_DynamicCast_As_______' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000058, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000060, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture, K2Node_DynamicCast_As_____2D) == 0x000068, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WBP_Race_HUD_Sub_Festa_TeamGroup_C_UpdateLocalizeTexture::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

