#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_Sub_Btn_Standard

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Popup_Sub_Btn_Standard.WBP_Popup_Sub_Btn_Standard_C
// 0x0088 (0x0510 - 0x0488)
class UWBP_Popup_Sub_Btn_Standard_C final : public UCommonMenuPopupSubBtnStandard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Select_Out;                                    // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_Out;                                    // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_to_Active;                              // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_to_Select;                              // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_Loop;                                   // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_Loop;                                   // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Btn_Cursor;                                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_Cursor_4Corner;                                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Cursor_Texture;                                // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseInteraction;                                  // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_BtnColor;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          MouseDown;                                         // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          DecisionSound;                                     // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bActionExecuteOnReleaseMode;                       // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bActionExecuteReady;                               // 0x0509(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AcceptKeyResponse();
	void Check_Release_Response_InputType(bool* bOutReleaseResponseInput);
	void Construct();
	void ExecuteUbergraph_WBP_Popup_Sub_Btn_Standard(int32 EntryPoint);
	void OnAcceptKeyPressed();
	void OnAcceptKeyReleased();
	void OnActiveToSelectAnimFinished();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnBackKeyPressed();
	void OnFocus_Imp(class UUnionUIButtonBase* Button);
	void OnFocusAnimStart();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnSelectOutAnimDinished();
	void OnSlectToActiveAnimFinished();
	void OnUnFocusAnimStart();
	void SetButtonColorIndex(int32 ColorIndex);
	void SetDecisionSound(class USoundAtomCue* InDecisionSound);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Popup_Sub_Btn_Standard_C">();
	}
	static class UWBP_Popup_Sub_Btn_Standard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Popup_Sub_Btn_Standard_C>();
	}
};
static_assert(alignof(UWBP_Popup_Sub_Btn_Standard_C) == 0x000008, "Wrong alignment on UWBP_Popup_Sub_Btn_Standard_C");
static_assert(sizeof(UWBP_Popup_Sub_Btn_Standard_C) == 0x000510, "Wrong size on UWBP_Popup_Sub_Btn_Standard_C");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, UberGraphFrame) == 0x000488, "Member 'UWBP_Popup_Sub_Btn_Standard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, Btn_Select_Out) == 0x000490, "Member 'UWBP_Popup_Sub_Btn_Standard_C::Btn_Select_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, Btn_Active_Out) == 0x000498, "Member 'UWBP_Popup_Sub_Btn_Standard_C::Btn_Active_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, Btn_Select_to_Active) == 0x0004A0, "Member 'UWBP_Popup_Sub_Btn_Standard_C::Btn_Select_to_Active' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, Btn_Active_to_Select) == 0x0004A8, "Member 'UWBP_Popup_Sub_Btn_Standard_C::Btn_Active_to_Select' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, Btn_Select_Loop) == 0x0004B0, "Member 'UWBP_Popup_Sub_Btn_Standard_C::Btn_Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, Btn_Active_Loop) == 0x0004B8, "Member 'UWBP_Popup_Sub_Btn_Standard_C::Btn_Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, Btn_Cursor) == 0x0004C0, "Member 'UWBP_Popup_Sub_Btn_Standard_C::Btn_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, Btn_Cursor_4Corner) == 0x0004C8, "Member 'UWBP_Popup_Sub_Btn_Standard_C::Btn_Cursor_4Corner' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, DSP_Cursor_Texture) == 0x0004D0, "Member 'UWBP_Popup_Sub_Btn_Standard_C::DSP_Cursor_Texture' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, MouseInteraction) == 0x0004D8, "Member 'UWBP_Popup_Sub_Btn_Standard_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, PAT_BtnColor) == 0x0004E0, "Member 'UWBP_Popup_Sub_Btn_Standard_C::PAT_BtnColor' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, RaceFlag) == 0x0004E8, "Member 'UWBP_Popup_Sub_Btn_Standard_C::RaceFlag' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, Shadow) == 0x0004F0, "Member 'UWBP_Popup_Sub_Btn_Standard_C::Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, MouseDown) == 0x0004F8, "Member 'UWBP_Popup_Sub_Btn_Standard_C::MouseDown' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, DecisionSound) == 0x000500, "Member 'UWBP_Popup_Sub_Btn_Standard_C::DecisionSound' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, bActionExecuteOnReleaseMode) == 0x000508, "Member 'UWBP_Popup_Sub_Btn_Standard_C::bActionExecuteOnReleaseMode' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Btn_Standard_C, bActionExecuteReady) == 0x000509, "Member 'UWBP_Popup_Sub_Btn_Standard_C::bActionExecuteReady' has a wrong offset!");

}

