#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PauseMenu

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_classes.hpp"
#include "UnionRun_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PauseMenu.WBP_PauseMenu_C
// 0x01C8 (0x05A0 - 0x03D8)
class UWBP_PauseMenu_C final : public UUnionUISceneBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PauseMenu_Out;                                     // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PauseMenu_Loop;                                    // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PauseMenu_In;                                      // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_RSR;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Option_Btn_03_P1;                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Option_Btn_03_P2;                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Option_Btn_03_P3;                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Option_Btn_03_P4;                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_ClassName;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBButton;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_Big_C*            WBP_CMN_PlayerNumber_Big;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_Big_C*            WBP_CMN_PlayerNumber_Big_1P;                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_Big_C*            WBP_CMN_PlayerNumber_Big_P2;                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_Big_C*            WBP_CMN_PlayerNumber_Big_P3;                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_Big_C*            WBP_CMN_PlayerNumber_Big_P4;                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_C*                      WBP_FooterMenu;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_GadgetPlate_C*    WBP_GadgetCustom_Sub_GadgetPlate_P1;               // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_GadgetPlate_C*    WBP_GadgetCustom_Sub_GadgetPlate_P2;               // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_GadgetPlate_C*    WBP_GadgetCustom_Sub_GadgetPlate_P3;               // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_GadgetPlate_C*    WBP_GadgetCustom_Sub_GadgetPlate_P4;               // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_SkillPlate_C*     WBP_GadgetCustom_Sub_SkillPlate_P1;                // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_SkillPlate_C*     WBP_GadgetCustom_Sub_SkillPlate_P2;                // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_SkillPlate_C*     WBP_GadgetCustom_Sub_SkillPlate_P3;                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_SkillPlate_C*     WBP_GadgetCustom_Sub_SkillPlate_P4;                // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     WBP_PauseMenu_Sub_Option_Btn_03_P1;                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     WBP_PauseMenu_Sub_Option_Btn_03_P2;                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     WBP_PauseMenu_Sub_Option_Btn_03_P3;                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PauseMenu_Sub_Option_Btn_03_C*     WBP_PauseMenu_Sub_Option_Btn_03_P4;                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RSR_C*                  WBP_Result_Sub_RSR_01;                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RSR_C*                  WBP_Result_Sub_RSR_02;                             // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RSR_C*                  WBP_Result_Sub_RSR_03;                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RSR_C*                  WBP_Result_Sub_RSR_04;                             // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RSR_C*                  WBP_Result_Sub_RSR_05;                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_P1;                                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_P2;                                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_P3;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_P4;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_Icon_Active;                                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Owner_Player_Index;                                // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   MenuButtonsPanel;                                  // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ForceCancelPauseEvent;                             // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Player_Count;                                      // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_GadgetCustom_Sub_GadgetPlate_C*> GadgetPlateArr;                               // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWidgetSwitcher*>                SkillPlateArr;                                     // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_CMN_RaceMenu_Sub_Btn_C*            PrevBtnWidget;                                     // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_PauseMenu_Sub_Option_Btn_03_C*> OptionHandleAssistArr;                         // 0x0570(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsDisableFocus;                                    // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInputBlocked;                                   // 0x0581(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_582[0x6];                                      // 0x0582(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RacePauseMenuSequence_C*            PauseMenuSequence;                                 // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_PauseMenu_Sub_Option_Btn_03_C* InButton, int32 InIndex)> OnClickedOption; // 0x0590(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnSpecialButtonPressedOptionPanel();
	void ChangeOwnerPlayerConntroller();
	void OnFocusMenuPanel(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void OnCancelMenuPanel(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void OnDecisionDownMenuPanel(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void OnDecideMenuPanel(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void ReturnFromPopuup();
	void ExecTimeTrialSetting();
	void SetInitialFocus();
	void ShowFooterMenu();
	void InitializeRedStartRing(int32 PlayerIndex);
	void IsGadgetInfoModeinIndex(int32 PlayerControllerIndex, bool* IsMode);
	void IsGadgetInfoMode(bool* IsMode);
	void SetGadgetInfoMode(int32 PlayerControllerIndex);
	void SetGadgetInfo();
	void Finalize();
	void InitializeGadgetInfo();
	void InitializeSpeedClass();
	void InitializeRSR();
	void SetVisibilityOptionButtons(TArray<class UUnionUIButtonBase*>& Buttons, ESlateVisibility Visibility_0);
	bool IsSinglePlay();
	void InitializePlayerIcon();
	void UnregisterMenuButton();
	void Flip_Assist_Enabled(ERacePauseMenuItem Type, int32 PlayerIndex);
	void GetAssistEnabled(ERacePauseMenuItem Type, int32 PlayerIndex, bool* ValidIndex, bool* Value);
	void GetOptionType(int32 ButtonIndex, ERacePauseMenuItem* Type);
	void ClickOption(class UWBP_PauseMenu_Sub_Option_Btn_03_C* InButton);
	void SetOption(ERacePauseMenuItem PauseID, int32 PlayerIndex);
	void InitilaizeOptionButtonsState(TArray<class UUnionUIButtonBase*>& Buttons, int32 PlayerIndex);
	void InitializeOptionButton();
	void InitializeMenuButton(class UCommonRaceMenuContentsInfo* Contents);
	void Initialize(int32 OwnerPlayerIndex, class UCommonRaceMenuContentsInfo* Contents, int32 PlayerCount);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void HideAll();
	void PlayAnimationIn();
	void OnItemFocused_イベント(int32 PlayerIndex, int32 SlotState, int32 SlotIndex);
	void OnItemFocused_イベント_0(int32 PlayerIndex, int32 SlotState, int32 SlotIndex);
	void OnItemFocused_イベント_1(int32 PlayerIndex, int32 SlotState, int32 SlotIndex);
	void OnItemFocused_イベント_2(int32 PlayerIndex, int32 SlotState, int32 SlotIndex);
	void ReturnFromPopupForDelay();
	void BindGadgetInfo();
	void ExecuteUbergraph_WBP_PauseMenu(int32 EntryPoint);

	void GetMenuButton(int32 Index_0, class UWBP_CMN_RaceMenu_Sub_Btn_C** Button) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PauseMenu_C">();
	}
	static class UWBP_PauseMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PauseMenu_C>();
	}
};
static_assert(alignof(UWBP_PauseMenu_C) == 0x000008, "Wrong alignment on UWBP_PauseMenu_C");
static_assert(sizeof(UWBP_PauseMenu_C) == 0x0005A0, "Wrong size on UWBP_PauseMenu_C");
static_assert(offsetof(UWBP_PauseMenu_C, UberGraphFrame) == 0x0003D8, "Member 'UWBP_PauseMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, PauseMenu_Out) == 0x0003E0, "Member 'UWBP_PauseMenu_C::PauseMenu_Out' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, PauseMenu_Loop) == 0x0003E8, "Member 'UWBP_PauseMenu_C::PauseMenu_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, PauseMenu_In) == 0x0003F0, "Member 'UWBP_PauseMenu_C::PauseMenu_In' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, HorizontalBox_RSR) == 0x0003F8, "Member 'UWBP_PauseMenu_C::HorizontalBox_RSR' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Line) == 0x000400, "Member 'UWBP_PauseMenu_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, OutOfContentButton) == 0x000408, "Member 'UWBP_PauseMenu_C::OutOfContentButton' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Overlay_Option_Btn_03_P1) == 0x000410, "Member 'UWBP_PauseMenu_C::Overlay_Option_Btn_03_P1' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Overlay_Option_Btn_03_P2) == 0x000418, "Member 'UWBP_PauseMenu_C::Overlay_Option_Btn_03_P2' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Overlay_Option_Btn_03_P3) == 0x000420, "Member 'UWBP_PauseMenu_C::Overlay_Option_Btn_03_P3' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Overlay_Option_Btn_03_P4) == 0x000428, "Member 'UWBP_PauseMenu_C::Overlay_Option_Btn_03_P4' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, TXT_ClassName) == 0x000430, "Member 'UWBP_PauseMenu_C::TXT_ClassName' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, VBButton) == 0x000438, "Member 'UWBP_PauseMenu_C::VBButton' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_CMN_PlayerNumber_Big) == 0x000440, "Member 'UWBP_PauseMenu_C::WBP_CMN_PlayerNumber_Big' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_CMN_PlayerNumber_Big_1P) == 0x000448, "Member 'UWBP_PauseMenu_C::WBP_CMN_PlayerNumber_Big_1P' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_CMN_PlayerNumber_Big_P2) == 0x000450, "Member 'UWBP_PauseMenu_C::WBP_CMN_PlayerNumber_Big_P2' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_CMN_PlayerNumber_Big_P3) == 0x000458, "Member 'UWBP_PauseMenu_C::WBP_CMN_PlayerNumber_Big_P3' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_CMN_PlayerNumber_Big_P4) == 0x000460, "Member 'UWBP_PauseMenu_C::WBP_CMN_PlayerNumber_Big_P4' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_FooterMenu) == 0x000468, "Member 'UWBP_PauseMenu_C::WBP_FooterMenu' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_GadgetCustom_Sub_GadgetPlate_P1) == 0x000470, "Member 'UWBP_PauseMenu_C::WBP_GadgetCustom_Sub_GadgetPlate_P1' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_GadgetCustom_Sub_GadgetPlate_P2) == 0x000478, "Member 'UWBP_PauseMenu_C::WBP_GadgetCustom_Sub_GadgetPlate_P2' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_GadgetCustom_Sub_GadgetPlate_P3) == 0x000480, "Member 'UWBP_PauseMenu_C::WBP_GadgetCustom_Sub_GadgetPlate_P3' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_GadgetCustom_Sub_GadgetPlate_P4) == 0x000488, "Member 'UWBP_PauseMenu_C::WBP_GadgetCustom_Sub_GadgetPlate_P4' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_GadgetCustom_Sub_SkillPlate_P1) == 0x000490, "Member 'UWBP_PauseMenu_C::WBP_GadgetCustom_Sub_SkillPlate_P1' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_GadgetCustom_Sub_SkillPlate_P2) == 0x000498, "Member 'UWBP_PauseMenu_C::WBP_GadgetCustom_Sub_SkillPlate_P2' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_GadgetCustom_Sub_SkillPlate_P3) == 0x0004A0, "Member 'UWBP_PauseMenu_C::WBP_GadgetCustom_Sub_SkillPlate_P3' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_GadgetCustom_Sub_SkillPlate_P4) == 0x0004A8, "Member 'UWBP_PauseMenu_C::WBP_GadgetCustom_Sub_SkillPlate_P4' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_PauseMenu_Sub_Option_Btn_03_P1) == 0x0004B0, "Member 'UWBP_PauseMenu_C::WBP_PauseMenu_Sub_Option_Btn_03_P1' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_PauseMenu_Sub_Option_Btn_03_P2) == 0x0004B8, "Member 'UWBP_PauseMenu_C::WBP_PauseMenu_Sub_Option_Btn_03_P2' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_PauseMenu_Sub_Option_Btn_03_P3) == 0x0004C0, "Member 'UWBP_PauseMenu_C::WBP_PauseMenu_Sub_Option_Btn_03_P3' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_PauseMenu_Sub_Option_Btn_03_P4) == 0x0004C8, "Member 'UWBP_PauseMenu_C::WBP_PauseMenu_Sub_Option_Btn_03_P4' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_Result_Sub_RSR_01) == 0x0004D0, "Member 'UWBP_PauseMenu_C::WBP_Result_Sub_RSR_01' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_Result_Sub_RSR_02) == 0x0004D8, "Member 'UWBP_PauseMenu_C::WBP_Result_Sub_RSR_02' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_Result_Sub_RSR_03) == 0x0004E0, "Member 'UWBP_PauseMenu_C::WBP_Result_Sub_RSR_03' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_Result_Sub_RSR_04) == 0x0004E8, "Member 'UWBP_PauseMenu_C::WBP_Result_Sub_RSR_04' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_Result_Sub_RSR_05) == 0x0004F0, "Member 'UWBP_PauseMenu_C::WBP_Result_Sub_RSR_05' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WidgetSwitcher_P1) == 0x0004F8, "Member 'UWBP_PauseMenu_C::WidgetSwitcher_P1' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WidgetSwitcher_P2) == 0x000500, "Member 'UWBP_PauseMenu_C::WidgetSwitcher_P2' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WidgetSwitcher_P3) == 0x000508, "Member 'UWBP_PauseMenu_C::WidgetSwitcher_P3' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WidgetSwitcher_P4) == 0x000510, "Member 'UWBP_PauseMenu_C::WidgetSwitcher_P4' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WS_Icon_Active) == 0x000518, "Member 'UWBP_PauseMenu_C::WS_Icon_Active' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Owner_Player_Index) == 0x000520, "Member 'UWBP_PauseMenu_C::Owner_Player_Index' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, MenuButtonsPanel) == 0x000528, "Member 'UWBP_PauseMenu_C::MenuButtonsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, ForceCancelPauseEvent) == 0x000530, "Member 'UWBP_PauseMenu_C::ForceCancelPauseEvent' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Player_Count) == 0x000540, "Member 'UWBP_PauseMenu_C::Player_Count' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, GadgetPlateArr) == 0x000548, "Member 'UWBP_PauseMenu_C::GadgetPlateArr' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, SkillPlateArr) == 0x000558, "Member 'UWBP_PauseMenu_C::SkillPlateArr' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, PrevBtnWidget) == 0x000568, "Member 'UWBP_PauseMenu_C::PrevBtnWidget' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, OptionHandleAssistArr) == 0x000570, "Member 'UWBP_PauseMenu_C::OptionHandleAssistArr' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, IsDisableFocus) == 0x000580, "Member 'UWBP_PauseMenu_C::IsDisableFocus' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, bIsInputBlocked) == 0x000581, "Member 'UWBP_PauseMenu_C::bIsInputBlocked' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, PauseMenuSequence) == 0x000588, "Member 'UWBP_PauseMenu_C::PauseMenuSequence' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, OnClickedOption) == 0x000590, "Member 'UWBP_PauseMenu_C::OnClickedOption' has a wrong offset!");

}

