#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EndMenu_Sub_GadgetLv_Gauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EndMenu_Sub_GadgetLv_Gauge.WBP_EndMenu_Sub_GadgetLv_Gauge_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_EndMenu_Sub_GadgetLv_Gauge_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Gauge_Active;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gauge_Base;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_NumPoint;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_NumPoint_Get;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_EndMenu_Sub_GadgetLv_Gauge(int32 EntryPoint);
	void SetGauge(double Now, double Next, double Low);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EndMenu_Sub_GadgetLv_Gauge_C">();
	}
	static class UWBP_EndMenu_Sub_GadgetLv_Gauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EndMenu_Sub_GadgetLv_Gauge_C>();
	}
};
static_assert(alignof(UWBP_EndMenu_Sub_GadgetLv_Gauge_C) == 0x000008, "Wrong alignment on UWBP_EndMenu_Sub_GadgetLv_Gauge_C");
static_assert(sizeof(UWBP_EndMenu_Sub_GadgetLv_Gauge_C) == 0x000310, "Wrong size on UWBP_EndMenu_Sub_GadgetLv_Gauge_C");
static_assert(offsetof(UWBP_EndMenu_Sub_GadgetLv_Gauge_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_EndMenu_Sub_GadgetLv_Gauge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EndMenu_Sub_GadgetLv_Gauge_C, Gauge_Active) == 0x0002E8, "Member 'UWBP_EndMenu_Sub_GadgetLv_Gauge_C::Gauge_Active' has a wrong offset!");
static_assert(offsetof(UWBP_EndMenu_Sub_GadgetLv_Gauge_C, Gauge_Base) == 0x0002F0, "Member 'UWBP_EndMenu_Sub_GadgetLv_Gauge_C::Gauge_Base' has a wrong offset!");
static_assert(offsetof(UWBP_EndMenu_Sub_GadgetLv_Gauge_C, RetainerBox_0) == 0x0002F8, "Member 'UWBP_EndMenu_Sub_GadgetLv_Gauge_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_EndMenu_Sub_GadgetLv_Gauge_C, TXT_NumPoint) == 0x000300, "Member 'UWBP_EndMenu_Sub_GadgetLv_Gauge_C::TXT_NumPoint' has a wrong offset!");
static_assert(offsetof(UWBP_EndMenu_Sub_GadgetLv_Gauge_C, TXT_NumPoint_Get) == 0x000308, "Member 'UWBP_EndMenu_Sub_GadgetLv_Gauge_C::TXT_NumPoint_Get' has a wrong offset!");

}

