#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusInfo_Sub_Tab

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatusInfo_Sub_Tab.WBP_StatusInfo_Sub_Tab_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_StatusInfo_Sub_Tab_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_StatusInfo_Sub_MainTabBtn_C*       WBP_Info_Sub_MainTabBtn_01;                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_MainTabBtn_C*       WBP_Info_Sub_MainTabBtn_02;                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_MainTabBtn_C*       WBP_Info_Sub_MainTabBtn_03;                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_MainTabBtn_C*       WBP_Info_Sub_MainTabBtn_04;                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_MainTabBtn_C*       WBP_Info_Sub_MainTabBtn_05;                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_MainTabBtn_C*       WBP_Info_Sub_MainTabBtn_06;                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 TabIndex)> OnPressed_Tab;                                    // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_StatusInfo_Sub_Tab_WBP_Info_Sub_MainTabBtn_01_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();
	void BndEvt__WBP_StatusInfo_Sub_Tab_WBP_Info_Sub_MainTabBtn_02_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();
	void BndEvt__WBP_StatusInfo_Sub_Tab_WBP_Info_Sub_MainTabBtn_03_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature();
	void BndEvt__WBP_StatusInfo_Sub_Tab_WBP_Info_Sub_MainTabBtn_04_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature();
	void BndEvt__WBP_StatusInfo_Sub_Tab_WBP_Info_Sub_MainTabBtn_05_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature();
	void BndEvt__WBP_StatusInfo_Sub_Tab_WBP_Info_Sub_MainTabBtn_06_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_StatusInfo_Sub_Tab(int32 EntryPoint);
	void SetSelected(int32 Index_0);
	void SetupTab(int32 TabIndex, EEventInfoWidgetPageCategory Category, const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatusInfo_Sub_Tab_C">();
	}
	static class UWBP_StatusInfo_Sub_Tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatusInfo_Sub_Tab_C>();
	}
};
static_assert(alignof(UWBP_StatusInfo_Sub_Tab_C) == 0x000008, "Wrong alignment on UWBP_StatusInfo_Sub_Tab_C");
static_assert(sizeof(UWBP_StatusInfo_Sub_Tab_C) == 0x000328, "Wrong size on UWBP_StatusInfo_Sub_Tab_C");
static_assert(offsetof(UWBP_StatusInfo_Sub_Tab_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_StatusInfo_Sub_Tab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Tab_C, WBP_Info_Sub_MainTabBtn_01) == 0x0002E8, "Member 'UWBP_StatusInfo_Sub_Tab_C::WBP_Info_Sub_MainTabBtn_01' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Tab_C, WBP_Info_Sub_MainTabBtn_02) == 0x0002F0, "Member 'UWBP_StatusInfo_Sub_Tab_C::WBP_Info_Sub_MainTabBtn_02' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Tab_C, WBP_Info_Sub_MainTabBtn_03) == 0x0002F8, "Member 'UWBP_StatusInfo_Sub_Tab_C::WBP_Info_Sub_MainTabBtn_03' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Tab_C, WBP_Info_Sub_MainTabBtn_04) == 0x000300, "Member 'UWBP_StatusInfo_Sub_Tab_C::WBP_Info_Sub_MainTabBtn_04' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Tab_C, WBP_Info_Sub_MainTabBtn_05) == 0x000308, "Member 'UWBP_StatusInfo_Sub_Tab_C::WBP_Info_Sub_MainTabBtn_05' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Tab_C, WBP_Info_Sub_MainTabBtn_06) == 0x000310, "Member 'UWBP_StatusInfo_Sub_Tab_C::WBP_Info_Sub_MainTabBtn_06' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Tab_C, OnPressed_Tab) == 0x000318, "Member 'UWBP_StatusInfo_Sub_Tab_C::OnPressed_Tab' has a wrong offset!");

}

