#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Rank

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Sub_Rank.WBP_Race_HUD_Sub_Rank_C.ExecuteUbergraph_WBP_Race_HUD_Sub_Rank
// 0x0020 (0x0020 - 0x0000)
struct WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank");
static_assert(sizeof(WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank) == 0x000020, "Wrong size on WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank, EntryPoint) == 0x000000, "Member 'WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000010, "Member 'WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000018, "Member 'WBP_Race_HUD_Sub_Rank_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Rank::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Rank.WBP_Race_HUD_Sub_Rank_C.FireRankChangeAnim
// 0x0010 (0x0010 - 0x0000)
struct WBP_Race_HUD_Sub_Rank_C_FireRankChangeAnim final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Rank_C_FireRankChangeAnim) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Rank_C_FireRankChangeAnim");
static_assert(sizeof(WBP_Race_HUD_Sub_Rank_C_FireRankChangeAnim) == 0x000010, "Wrong size on WBP_Race_HUD_Sub_Rank_C_FireRankChangeAnim");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_FireRankChangeAnim, Amount) == 0x000000, "Member 'WBP_Race_HUD_Sub_Rank_C_FireRankChangeAnim::Amount' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_FireRankChangeAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Rank_C_FireRankChangeAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Rank.WBP_Race_HUD_Sub_Rank_C.GetRankIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Sub_Rank_C_GetRankIndex final
{
public:
	int32                                         RankIndex_0;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Rank_C_GetRankIndex) == 0x000004, "Wrong alignment on WBP_Race_HUD_Sub_Rank_C_GetRankIndex");
static_assert(sizeof(WBP_Race_HUD_Sub_Rank_C_GetRankIndex) == 0x000004, "Wrong size on WBP_Race_HUD_Sub_Rank_C_GetRankIndex");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_GetRankIndex, RankIndex_0) == 0x000000, "Member 'WBP_Race_HUD_Sub_Rank_C_GetRankIndex::RankIndex_0' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Rank.WBP_Race_HUD_Sub_Rank_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Race_HUD_Sub_Rank_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Rank_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Race_HUD_Sub_Rank_C_PreConstruct");
static_assert(sizeof(WBP_Race_HUD_Sub_Rank_C_PreConstruct) == 0x000001, "Wrong size on WBP_Race_HUD_Sub_Rank_C_PreConstruct");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Race_HUD_Sub_Rank_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Rank.WBP_Race_HUD_Sub_Rank_C.SetRankByIndex
// 0x0018 (0x0018 - 0x0000)
struct WBP_Race_HUD_Sub_Rank_C_SetRankByIndex final
{
public:
	int32                                         InRank;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndex) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Rank_C_SetRankByIndex");
static_assert(sizeof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndex) == 0x000018, "Wrong size on WBP_Race_HUD_Sub_Rank_C_SetRankByIndex");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndex, InRank) == 0x000000, "Member 'WBP_Race_HUD_Sub_Rank_C_SetRankByIndex::InRank' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndex, Temp_int_Variable) == 0x000004, "Member 'WBP_Race_HUD_Sub_Rank_C_SetRankByIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Rank_C_SetRankByIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndex, K2Node_Select_Default) == 0x000010, "Member 'WBP_Race_HUD_Sub_Rank_C_SetRankByIndex::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Rank.WBP_Race_HUD_Sub_Rank_C.SetRankByIndexTo4-12Material
// 0x0020 (0x0020 - 0x0000)
struct WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material");
static_assert(sizeof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material) == 0x000020, "Wrong size on WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material, Index_0) == 0x000000, "Member 'WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material, CallFunc_Clamp_ReturnValue) == 0x00000C, "Member 'WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_Race_HUD_Sub_Rank_C_SetRankByIndexTo4_12Material::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Rank.WBP_Race_HUD_Sub_Rank_C.UpdateLocalizeTexture
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_Race_HUD_Sub_Rank_C_UpdateLocalizeTexture final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_As_______;                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELanguage                                     CallFunc_GetTextLangFromSave_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLocalizeRuntimeImageArray             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0018)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELanguage                                     CallFunc_GetTextLangFromSave_ReturnValue_1;        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item;                           // 0x0060(0x0028)(HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_2;         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ELanguage                                     CallFunc_GetTextLangFromSave_ReturnValue_2;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_DynamicCast_As________1;                    // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_2;          // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLocalizeRuntimeImageArray             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00D8(0x0018)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_3;         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_4;         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_As________2;                    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_1;                    // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLocalizeRuntimeImage                  CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0150(0x0030)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_5;         // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_2;                    // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Rank_C_UpdateLocalizeTexture) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Rank_C_UpdateLocalizeTexture");
static_assert(sizeof(WBP_Race_HUD_Sub_Rank_C_UpdateLocalizeTexture) == 0x0001A8, "Wrong size on WBP_Race_HUD_Sub_Rank_C_UpdateLocalizeTexture");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_UpdateLocalizeTexture, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_Race_HUD_Sub_Rank_C_UpdateLocalizeTexture::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Rank_C_UpdateLocalizeTexture, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Race_HUD_Sub_Rank_C_UpdateLocalizeTexture::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
