#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_CustomPaint_Glow

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_CustomPaint_Glow.WBP_MachineCustom_Sub_CustomPaint_Glow_C
// 0x0080 (0x0500 - 0x0480)
class UWBP_MachineCustom_Sub_CustomPaint_Glow_C final : public UUnionUIButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Displayable_Detail;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Cursor_Texture;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MLC_GlowIcon;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Undisplayable_Detail;                              // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_Line_Btn_C*                    WBP_CMN_Line_Btn;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Category;                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APlayerController*                      PlayerController;                                  // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMachineColorAreaUIData                ItemData;                                          // 0x04C0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint_Glow(int32 EntryPoint);
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnDownKeyPressed();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnLeftKeyPressed();
	void OnRightKeyPressed();
	void OnUpKeyPressed();
	void SetCursorVisible(bool bInIsVisible);
	void Setup(class APlayerController* InPlayerController, const struct FMachineColorAreaUIData& InItemData);

	void GetItemData(struct FMachineColorAreaUIData* OutUIData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_CustomPaint_Glow_C">();
	}
	static class UWBP_MachineCustom_Sub_CustomPaint_Glow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_CustomPaint_Glow_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_CustomPaint_Glow_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_CustomPaint_Glow_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_CustomPaint_Glow_C) == 0x000500, "Wrong size on UWBP_MachineCustom_Sub_CustomPaint_Glow_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Glow_C, UberGraphFrame) == 0x000480, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Glow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Glow_C, Displayable_Detail) == 0x000488, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Glow_C::Displayable_Detail' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Glow_C, DSP_Cursor_Texture) == 0x000490, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Glow_C::DSP_Cursor_Texture' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Glow_C, MLC_GlowIcon) == 0x000498, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Glow_C::MLC_GlowIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Glow_C, Undisplayable_Detail) == 0x0004A0, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Glow_C::Undisplayable_Detail' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Glow_C, WBP_CMN_Line_Btn) == 0x0004A8, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Glow_C::WBP_CMN_Line_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Glow_C, WidgetSwitcher_Category) == 0x0004B0, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Glow_C::WidgetSwitcher_Category' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Glow_C, PlayerController) == 0x0004B8, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Glow_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Glow_C, ItemData) == 0x0004C0, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Glow_C::ItemData' has a wrong offset!");

}

