#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_System_Sub_Loading_Stageicon

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_System_Sub_Loading_Stageicon.WBP_System_Sub_Loading_StageIcon_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_System_Sub_Loading_StageIcon_C final : public UUserWidget
{
public:
	class UImage*                                 Base_01;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_02;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_StageIcon;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_CourseIcon_C*     WBP_CourseSelect_Sub_CourseIcon;                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetTexture(class UTexture2D* InTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_System_Sub_Loading_StageIcon_C">();
	}
	static class UWBP_System_Sub_Loading_StageIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_System_Sub_Loading_StageIcon_C>();
	}
};
static_assert(alignof(UWBP_System_Sub_Loading_StageIcon_C) == 0x000008, "Wrong alignment on UWBP_System_Sub_Loading_StageIcon_C");
static_assert(sizeof(UWBP_System_Sub_Loading_StageIcon_C) == 0x000308, "Wrong size on UWBP_System_Sub_Loading_StageIcon_C");
static_assert(offsetof(UWBP_System_Sub_Loading_StageIcon_C, Base_01) == 0x0002E0, "Member 'UWBP_System_Sub_Loading_StageIcon_C::Base_01' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_Loading_StageIcon_C, Base_02) == 0x0002E8, "Member 'UWBP_System_Sub_Loading_StageIcon_C::Base_02' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_Loading_StageIcon_C, DMY_StageIcon) == 0x0002F0, "Member 'UWBP_System_Sub_Loading_StageIcon_C::DMY_StageIcon' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_Loading_StageIcon_C, WBP_CourseSelect_Sub_CourseIcon) == 0x0002F8, "Member 'UWBP_System_Sub_Loading_StageIcon_C::WBP_CourseSelect_Sub_CourseIcon' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_Loading_StageIcon_C, WidgetSwitcher_0) == 0x000300, "Member 'UWBP_System_Sub_Loading_StageIcon_C::WidgetSwitcher_0' has a wrong offset!");

}

