#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_StickerSelect

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"
#include "ST_StickerPresetPageData_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "ST_StickerPresetPageItemData_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C
// 0x00E8 (0x04E0 - 0x03F8)
class UWBP_MachineCustom_Sub_StickerSelect_C final : public UMachineStickerSelectWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PresetWindow_Loop;                                 // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PresetWindow_Left_In;                              // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PresetWindow_Right_In;                             // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CPStickerPreset;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_LR_Arrow_C*                    WBP_CMN_LR_Arrow_L;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_LR_Arrow_C*                    WBP_CMN_LR_Arrow_R;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ScrollSnapPoint_C*             WBP_CMN_ScrollSnapPoint;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* WBP_MachineCustom_Sub_Sticker_PresetWindow_01; // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* WBP_MachineCustom_Sub_Sticker_PresetWindow_02; // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* WBP_MachineCustom_Sub_Sticker_PresetWindow_03; // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C*> Pages;                              // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FST_StickerPresetPageData>      PageDataList;                                      // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ItemNumPerPage;                                    // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemNumInRow;                                      // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PageDataIndex;                                     // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastItemIndex;                                     // 0x0484(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PrevPageDataIndex;                                 // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 InPlayerIndex)> OnCancel;                                    // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FST_StickerPresetPageItemData& ItemData, int32 InPlayerIndex)> OnItemSelected; // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FST_StickerPresetPageItemData& ItemData, int32 InPlayerIndex, int32 ButtonIndex)> OnItemFocused; // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         PrevRowIndex;                                      // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextRowIndex;                                      // 0x04C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanNextPage;                                      // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanPrevPage;                                      // 0x04C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CA[0x6];                                      // 0x04CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPurchaseAnimFinished;                            // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AddPage(const struct FST_StickerPresetPageData& InPageData);
	void BndEvt__WBP_MachineCustom_Sub_StickerSelect_WBP_CMN_LR_Arrow_L_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__WBP_MachineCustom_Sub_StickerSelect_WBP_CMN_LR_Arrow_R_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void Clear();
	void Construct();
	void ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect(int32 EntryPoint);
	void Item_OnCancel(class UUnionUIButtonBase* InButton);
	void Item_OnDecision(class UUnionUIButtonBase* InButton);
	void Item_OnFocus(class UUnionUIButtonBase* InButton);
	void LeftShoulder(class UUnionUIButtonBase* InButton);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnFocusReceivedInternal(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void Page_OnPurchaseAnimFinished();
	void Page_OnSideNavigationCustom(EUnionUIControlDir Direction, class UUnionUIButtonBase* Button, int32 RowIndex, int32 ColumnIndex);
	void PlayAnimationLeftIn();
	void PlayAnimationRightIn();
	void PlayPurchaseAnim();
	void PlaySETab();
	void RightShoulder(class UUnionUIButtonBase* Button);
	void SetFocusToItem(int32 InItemIndex);
	void SetFocusToItemInNextPage(int32 InRowIndex);
	void SetFocusToItemInPrevPage(int32 InRowIndex);
	void SetIndices();
	void SetInitialFocus(class APlayerController* InPlayerController);
	void SetPageItems(int32 InPageDataIndex, int32 InPageIndex);
	void Setup();
	void SetupPage();
	void SwitchPageToNext(int32 RowIndex);
	void SwitchPageToPrev(int32 RowIndex);
	void UpdateArrows();
	void UpdatePageNumColor();
	void UpdateScrollPointBox();
	void WidgetAnimationEvt_PresetWindow_Left_In_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_PresetWindow_Right_In_K2Node_WidgetAnimationEvent_1();

	void IsCanNextPage(bool* bCanNextPage_0) const;
	void IsCanPrevPage(bool* bCanPrevPage_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_StickerSelect_C">();
	}
	static class UWBP_MachineCustom_Sub_StickerSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_StickerSelect_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_StickerSelect_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_StickerSelect_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_StickerSelect_C) == 0x0004E0, "Wrong size on UWBP_MachineCustom_Sub_StickerSelect_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, UberGraphFrame) == 0x0003F8, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, PresetWindow_Loop) == 0x000400, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::PresetWindow_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, PresetWindow_Left_In) == 0x000408, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::PresetWindow_Left_In' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, PresetWindow_Right_In) == 0x000410, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::PresetWindow_Right_In' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, CPStickerPreset) == 0x000418, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::CPStickerPreset' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, RetainerBox_0) == 0x000420, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, WBP_CMN_LR_Arrow_L) == 0x000428, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::WBP_CMN_LR_Arrow_L' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, WBP_CMN_LR_Arrow_R) == 0x000430, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::WBP_CMN_LR_Arrow_R' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, WBP_CMN_ScrollSnapPoint) == 0x000438, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::WBP_CMN_ScrollSnapPoint' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, WBP_MachineCustom_Sub_Sticker_PresetWindow_01) == 0x000440, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::WBP_MachineCustom_Sub_Sticker_PresetWindow_01' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, WBP_MachineCustom_Sub_Sticker_PresetWindow_02) == 0x000448, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::WBP_MachineCustom_Sub_Sticker_PresetWindow_02' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, WBP_MachineCustom_Sub_Sticker_PresetWindow_03) == 0x000450, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::WBP_MachineCustom_Sub_Sticker_PresetWindow_03' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, Pages) == 0x000458, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::Pages' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, PageDataList) == 0x000468, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::PageDataList' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, ItemNumPerPage) == 0x000478, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::ItemNumPerPage' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, ItemNumInRow) == 0x00047C, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::ItemNumInRow' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, PageDataIndex) == 0x000480, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::PageDataIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, LastItemIndex) == 0x000484, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::LastItemIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, PrevPageDataIndex) == 0x000488, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::PrevPageDataIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, OnCancel) == 0x000490, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::OnCancel' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, OnItemSelected) == 0x0004A0, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::OnItemSelected' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, OnItemFocused) == 0x0004B0, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::OnItemFocused' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, PrevRowIndex) == 0x0004C0, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::PrevRowIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, NextRowIndex) == 0x0004C4, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::NextRowIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, bCanNextPage) == 0x0004C8, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::bCanNextPage' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, bCanPrevPage) == 0x0004C9, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::bCanPrevPage' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerSelect_C, OnPurchaseAnimFinished) == 0x0004D0, "Member 'UWBP_MachineCustom_Sub_StickerSelect_C::OnPurchaseAnimFinished' has a wrong offset!");

}

