#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EventEndInfo_Sub_Ranking

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EventEndInfo_Sub_Ranking.WBP_EventEndInfo_Sub_Ranking_C
// 0x00B0 (0x0390 - 0x02E0)
class UWBP_EventEndInfo_Sub_Ranking_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Switch_Other;                                      // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Switch_3rd;                                        // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Switch_2nd;                                        // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Switch_1st;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_Ranking;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect01;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect01_2;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect02;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect02_1;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect03;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect04;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_Base_01;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_Base_02;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_Ranking;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_RankingBase;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Rank_1st;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Rank_2nd;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Rank_3rd;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Rank_Other;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Ranking;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Rank;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundAtomCue*                          PraiseSeCue;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetRanking(int32 Ranking);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EventEndInfo_Sub_Ranking_C">();
	}
	static class UWBP_EventEndInfo_Sub_Ranking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EventEndInfo_Sub_Ranking_C>();
	}
};
static_assert(alignof(UWBP_EventEndInfo_Sub_Ranking_C) == 0x000008, "Wrong alignment on UWBP_EventEndInfo_Sub_Ranking_C");
static_assert(sizeof(UWBP_EventEndInfo_Sub_Ranking_C) == 0x000390, "Wrong size on UWBP_EventEndInfo_Sub_Ranking_C");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Switch_Other) == 0x0002E0, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Switch_Other' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Switch_3rd) == 0x0002E8, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Switch_3rd' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Switch_2nd) == 0x0002F0, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Switch_2nd' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Switch_1st) == 0x0002F8, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Switch_1st' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Base_Ranking) == 0x000300, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Base_Ranking' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Effect01) == 0x000308, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Effect01' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Effect01_2) == 0x000310, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Effect01_2' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Effect02) == 0x000318, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Effect02' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Effect02_1) == 0x000320, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Effect02_1' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Effect03) == 0x000328, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Effect03' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Effect04) == 0x000330, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Effect04' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Effect_Base_01) == 0x000338, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Effect_Base_01' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Effect_Base_02) == 0x000340, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Effect_Base_02' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, Line_Ranking) == 0x000348, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::Line_Ranking' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, PAT_RankingBase) == 0x000350, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::PAT_RankingBase' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, TXT_Rank_1st) == 0x000358, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::TXT_Rank_1st' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, TXT_Rank_2nd) == 0x000360, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::TXT_Rank_2nd' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, TXT_Rank_3rd) == 0x000368, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::TXT_Rank_3rd' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, TXT_Rank_Other) == 0x000370, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::TXT_Rank_Other' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, TXT_Ranking) == 0x000378, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::TXT_Ranking' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, WidgetSwitcher_Rank) == 0x000380, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::WidgetSwitcher_Rank' has a wrong offset!");
static_assert(offsetof(UWBP_EventEndInfo_Sub_Ranking_C, PraiseSeCue) == 0x000388, "Member 'UWBP_EventEndInfo_Sub_Ranking_C::PraiseSeCue' has a wrong offset!");

}

