#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetCustom_Sub_GadgetPlate

#include "Basic.hpp"

#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.BindDelegateEvents
// 0x0050 (0x0050 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents final
{
public:
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents) == 0x000004, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents) == 0x000050, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_BindDelegateEvents::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate
// 0x0098 (0x0098 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentGadgetIcon*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_4;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_4;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_4;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_3;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_3;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_3;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_2;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInShouldPlay_1;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInShouldPlay;                        // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEquipmentGadgetIcon*                   CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate) == 0x000098, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, EntryPoint) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_Button_4) == 0x000018, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_PanelIndex_4) == 0x000020, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_PanelIndex_4' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_ButtonIndex_4) == 0x000024, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_ButtonIndex_4' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_Button_3) == 0x000028, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_PanelIndex_3) == 0x000030, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_PanelIndex_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_ButtonIndex_3) == 0x000034, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_ButtonIndex_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_Button_2) == 0x000038, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_PanelIndex_2) == 0x000040, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_PanelIndex_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_ButtonIndex_2) == 0x000044, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_ButtonIndex_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_Button_1) == 0x000048, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_PanelIndex_1) == 0x000050, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_PanelIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_ButtonIndex_1) == 0x000054, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_ButtonIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_Button) == 0x000058, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_PanelIndex) == 0x000060, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_CustomEvent_ButtonIndex) == 0x000064, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_Event_bInShouldPlay_1) == 0x000074, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_Event_bInShouldPlay_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, K2Node_Event_bInShouldPlay) == 0x000075, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::K2Node_Event_bInShouldPlay' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, Temp_int_Array_Index_Variable_1) == 0x000078, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, Temp_int_Loop_Counter_Variable_1) == 0x00007C, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, CallFunc_Add_IntInt_ReturnValue_1) == 0x000088, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, CallFunc_Array_Length_ReturnValue_1) == 0x00008C, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_GadgetPlate::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.GetGadgetIds
// 0x0020 (0x0020 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_GetGadgetIds final
{
public:
	TArray<EGadgetId>                             OutGadgetIds;                                      // 0x0000(0x0010)(Parm, OutParm)
	TArray<EGadgetId>                             CallFunc_ConvertGadgetSlotStatesToIds_OutGadgetIds; // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_GetGadgetIds) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_GetGadgetIds");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_GetGadgetIds) == 0x000020, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_GetGadgetIds");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_GetGadgetIds, OutGadgetIds) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_GetGadgetIds::OutGadgetIds' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_GetGadgetIds, CallFunc_ConvertGadgetSlotStatesToIds_OutGadgetIds) == 0x000010, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_GetGadgetIds::CallFunc_ConvertGadgetSlotStatesToIds_OutGadgetIds' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.InVisiblePreviewEquippedGadget
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_InVisiblePreviewEquippedGadget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_InVisiblePreviewEquippedGadget) == 0x000001, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_InVisiblePreviewEquippedGadget");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_InVisiblePreviewEquippedGadget) == 0x000001, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_InVisiblePreviewEquippedGadget");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_InVisiblePreviewEquippedGadget, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_InVisiblePreviewEquippedGadget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.OnConstDummyWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstDummyWidget final
{
public:
	class UDummyWidget*                           CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstDummyWidget) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstDummyWidget");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstDummyWidget) == 0x000008, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstDummyWidget");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstDummyWidget, CallFunc_Create_ReturnValue) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstDummyWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.OnConstGadgetIconRef
// 0x0010 (0x0010 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconRef final
{
public:
	TArray<class UEquipmentGadgetIcon*>           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconRef) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconRef");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconRef) == 0x000010, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconRef");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconRef, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconRef::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.OnConstGadgetIconSetup
// 0x0010 (0x0010 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconSetup final
{
public:
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_SetupButtonsPanel_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconSetup) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconSetup");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconSetup) == 0x000010, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconSetup");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconSetup, CallFunc_MakeLiteralBool_ReturnValue) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconSetup::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconSetup, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconSetup::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconSetup, CallFunc_SetupButtonsPanel_ReturnValue) == 0x000008, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGadgetIconSetup::CallFunc_SetupButtonsPanel_ReturnValue' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.OnConstGridLayoutControl
// 0x0008 (0x0008 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGridLayoutControl final
{
public:
	class UUnionUIGridLayoutControl*              CallFunc_SpawnObject_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGridLayoutControl) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGridLayoutControl");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGridLayoutControl) == 0x000008, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGridLayoutControl");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGridLayoutControl, CallFunc_SpawnObject_ReturnValue) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_OnConstGridLayoutControl::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.PlayTabSound
// 0x0004 (0x0004 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_PlayTabSound final
{
public:
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0000(0x0004)()
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_PlayTabSound) == 0x000004, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_PlayTabSound");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_PlayTabSound) == 0x000004, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_PlayTabSound");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_PlayTabSound, CallFunc_SoundPlay_ReturnValue) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_PlayTabSound::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.Scene_OnCancel
// 0x0010 (0x0010 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnCancel final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnCancel) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnCancel");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnCancel) == 0x000010, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnCancel");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnCancel, Button) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnCancel::Button' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnCancel, PanelIndex) == 0x000008, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnCancel::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnCancel, ButtonIndex) == 0x00000C, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnCancel::ButtonIndex' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.Scene_OnDecision
// 0x0010 (0x0010 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnDecision final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnDecision) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnDecision");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnDecision) == 0x000010, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnDecision");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnDecision, Button) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnDecision::Button' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnDecision, PanelIndex) == 0x000008, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnDecision::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnDecision, ButtonIndex) == 0x00000C, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnDecision::ButtonIndex' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.Scene_OnFocus
// 0x0010 (0x0010 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnFocus final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnFocus) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnFocus");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnFocus) == 0x000010, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnFocus");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnFocus, Button) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnFocus::Button' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnFocus, PanelIndex) == 0x000008, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnFocus::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnFocus, ButtonIndex) == 0x00000C, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnFocus::ButtonIndex' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.Scene_OnLeftShoulder
// 0x0010 (0x0010 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnLeftShoulder final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnLeftShoulder) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnLeftShoulder");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnLeftShoulder) == 0x000010, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnLeftShoulder");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnLeftShoulder, Button) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnLeftShoulder::Button' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnLeftShoulder, PanelIndex) == 0x000008, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnLeftShoulder::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnLeftShoulder, ButtonIndex) == 0x00000C, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnLeftShoulder::ButtonIndex' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.Scene_OnRightShoulder
// 0x0010 (0x0010 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnRightShoulder final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnRightShoulder) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnRightShoulder");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnRightShoulder) == 0x000010, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnRightShoulder");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnRightShoulder, Button) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnRightShoulder::Button' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnRightShoulder, PanelIndex) == 0x000008, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnRightShoulder::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnRightShoulder, ButtonIndex) == 0x00000C, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Scene_OnRightShoulder::ButtonIndex' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.Set Ready Flag
// 0x0020 (0x0020 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag final
{
public:
	bool                                          IsReady;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEquipmentGadgetIcon*                   CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag) == 0x000020, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag, IsReady) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag::IsReady' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_Set_Ready_Flag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.SetShouldPlayCancelSound
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayCancelSound final
{
public:
	bool                                          bInShouldPlay;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayCancelSound) == 0x000001, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayCancelSound");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayCancelSound) == 0x000001, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayCancelSound");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayCancelSound, bInShouldPlay) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayCancelSound::bInShouldPlay' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.SetShouldPlayDecisionSound
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayDecisionSound final
{
public:
	bool                                          bInShouldPlay;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayDecisionSound) == 0x000001, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayDecisionSound");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayDecisionSound) == 0x000001, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayDecisionSound");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayDecisionSound, bInShouldPlay) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetShouldPlayDecisionSound::bInShouldPlay' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.SetTabWidgetVisible
// 0x0020 (0x0020 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible final
{
public:
	bool                                          bInIsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEquipmentGadgetIcon*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible");
static_assert(sizeof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible) == 0x000020, "Wrong size on WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible, bInIsVisible) == 0x000000, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible::bInIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible, Temp_bool_Variable) == 0x000001, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible, Temp_byte_Variable) == 0x000002, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible, K2Node_Select_Default) == 0x00001D, "Member 'WBP_GadgetCustom_Sub_GadgetPlate_C_SetTabWidgetVisible::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_GadgetPlate.WBP_GadgetCustom_Sub_GadgetPlate_C.SetupGadgetIcons
// 0x0330 (0x0330 - 0x0000)
struct WBP_GadgetCustom_Sub_GadgetPlate_C_SetupGadgetIcons final
{
public:
	bool                                          InRankUp;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InSlotNum;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEquipmentGadgetIcon*                   TempIcon;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         TempSlotState;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempSlotIndex;                                     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentGadgetIcon*                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ConvertGadgetSlotIndexToLocation_OutSlotLocationX; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertGadgetSlotIndexToLocation_OutSlotLocationY; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUnionUIGridLayoutButtonData           K2Node_MakeStruct_UnionUIGridLayoutButtonData;     // 0x0050(0x0038)(NoDestructor, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGadgetData                            CallFunc_GetGadgetData_OutGadgetData;              // 0x0098(0x00C0)()
	bool                                          CallFunc_GetGadgetData_ReturnValue;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableGadget_bIsEmptyDisableList;      // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableGadget_ReturnValue;              // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E[0x2];                                      // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentGadgetIcon*                   CallFunc_Array_Get_Item_1;                         // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0170(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0210(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0220(0x0010)()
	int32                                         CallFunc_ConvertGadgetSlotIndexToLocation_OutSlotLocationX_1; // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertGadgetSlotIndexToLocation_OutSlotLocationY_1; // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUnionUIGridLayoutButtonData           K2Node_MakeStruct_UnionUIGridLayoutButtonData_1;   // 0x0238(0x0038)(NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_ConvertGadgetSlotIndexToLocation_OutSlotLocationX_2; // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertGadgetSlotIndexToLocation_OutSlotLocationY_2; // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGadgetSlotStateFilled_ReturnValue;     // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUnionUIGridLayoutButtonData           K2Node_MakeStruct_UnionUIGridLayoutButtonData_2;   // 0x0280(0x0038)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BB[0x1];                                      // 0x02BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ConvertGadgetSlotIndexToLocation_OutSlotLocationX_3; // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertGadgetSlotIndexToLocation_OutSlotLocationY_3; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUnionUIGridLayoutButtonData           K2Node_MakeStruct_UnionUIGridLayoutButtonData_3;   // 0x02C8(0x0038)(NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_GetGadgetSlotStateLocked_ReturnValue;     // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGadgetSlotStateFilled_ReturnValue_1;   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30E[0x2];                                      // 0x030E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUnionUIGridLayoutButtonData>   CallFunc_GetButtonDataList_ReturnValue;            // 0x0310(0x0010)(ReferenceParm, ContainsInstancedReference)
