#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClassSelect_Sub_CpuLevel

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ClassSelect_Sub_CpuLevel.WBP_ClassSelect_Sub_CpuLevel_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_ClassSelect_Sub_CpuLevel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 PAT_CpuLevel;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_PlatformIcon;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetMenuSpeedClass(EMenuSpeedClassId Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ClassSelect_Sub_CpuLevel_C">();
	}
	static class UWBP_ClassSelect_Sub_CpuLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ClassSelect_Sub_CpuLevel_C>();
	}
};
static_assert(alignof(UWBP_ClassSelect_Sub_CpuLevel_C) == 0x000008, "Wrong alignment on UWBP_ClassSelect_Sub_CpuLevel_C");
static_assert(sizeof(UWBP_ClassSelect_Sub_CpuLevel_C) == 0x0002F8, "Wrong size on UWBP_ClassSelect_Sub_CpuLevel_C");
static_assert(offsetof(UWBP_ClassSelect_Sub_CpuLevel_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ClassSelect_Sub_CpuLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_Sub_CpuLevel_C, PAT_CpuLevel) == 0x0002E8, "Member 'UWBP_ClassSelect_Sub_CpuLevel_C::PAT_CpuLevel' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_Sub_CpuLevel_C, PAT_PlatformIcon) == 0x0002F0, "Member 'UWBP_ClassSelect_Sub_CpuLevel_C::PAT_PlatformIcon' has a wrong offset!");

}

