#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Festa_PointReward_Sub_ItemBtn

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Festa_PointReward_Sub_ItemBtn.WBP_Festa_PointReward_Sub_ItemBtn_C
// 0x0080 (0x0500 - 0x0480)
class UWBP_Festa_PointReward_Sub_ItemBtn_C final : public UUnionUIButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_to_Get;                                     // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Get_Select_Loop;                                   // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Get_Loop;                                          // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_Loop;                                       // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Loop;                                       // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_Left;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Right;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_FestaPoint;                                // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_Item;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ItemIcon_C*                    WBP_CMN_ItemIcon;                                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Base;                               // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          MouseDown;                                         // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LeftEnd;                                           // 0x04F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RightEnd;                                          // 0x04F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F3[0x1];                                      // 0x04F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RewardDataNum;                                     // 0x04F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGet;                                             // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Popup_Sub_Btn_Standard_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_Festa_PointReward_Sub_ItemBtn(int32 EntryPoint);
	void InitializeArrow(int32 ButtonIndex_0, int32 RewardDataNum_0, bool IsLeftEnd, bool IsRightEnd);
	void OnAcceptKeyPressed();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnBackKeyPressed();
	void OnFocus_Imp(class UUnionUIButtonBase* Button);
	void OnFocusAnimStart();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnMouseButtonDownBP();
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnUnFocusAnimStart();
	void SetArrowVisible(bool bInArrowLVisible, bool bInArrowRVisible);
	void SetDisplayGetIcon(bool IsGet_0);
	void SetDisplayGetIconResult(bool bIsGet);
	void SetDisplaySelect(bool IsSelect);
	void SetFestaEventInfoDisplaySelect(bool IsSelect);
	void SetFestaPoint(int32 InFestaPoint);
	void SetItemIcon(ERewardType rewardType, class UTexture2D* Texture);
	void SetItemIconActiveWidgetIndex(ERewardType InRewardType);
	void SetItemIconTexture(class UTexture2D* InItemIconTexture);
	void SetItemNum(bool IsDesplay, int32 InItemNum);
	void SetRewardGetAnim();
	void StopAnim();
	void StopPlayingAnimation(class UWidgetAnimation* InWidgetAnimation);
	void UpdateFestaEventInfoSelect(int32 RewardDataIndex, int32 SelectButtonIndex);
	void UpdateReward(ERewardType rewardType, class UTexture2D* Texture, bool IsNumDisplay, int32 Num, int32 RewardFestaPoint, int32 PlayerFestaPoint, int32 isNext);
	void UpdateRewardFromFestaPointRewardUIData(const struct FFestaPointRewardUIData& UIData, int32 PlayerFestaPoint);
	void UpdateSelect(int32 RewardDataIndex, int32 SelectButtonIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Festa_PointReward_Sub_ItemBtn_C">();
	}
	static class UWBP_Festa_PointReward_Sub_ItemBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Festa_PointReward_Sub_ItemBtn_C>();
	}
};
static_assert(alignof(UWBP_Festa_PointReward_Sub_ItemBtn_C) == 0x000008, "Wrong alignment on UWBP_Festa_PointReward_Sub_ItemBtn_C");
static_assert(sizeof(UWBP_Festa_PointReward_Sub_ItemBtn_C) == 0x000500, "Wrong size on UWBP_Festa_PointReward_Sub_ItemBtn_C");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, UberGraphFrame) == 0x000480, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, Select_to_Get) == 0x000488, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::Select_to_Get' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, Get_Select_Loop) == 0x000490, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::Get_Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, Get_Loop) == 0x000498, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::Get_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, Select_Loop) == 0x0004A0, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, Active_Loop) == 0x0004A8, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, Arrow_Left) == 0x0004B0, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::Arrow_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, Arrow_Right) == 0x0004B8, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::Arrow_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, base) == 0x0004C0, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, Button_0) == 0x0004C8, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::Button_0' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, TXT_Num_FestaPoint) == 0x0004D0, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::TXT_Num_FestaPoint' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, TXT_Num_Item) == 0x0004D8, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::TXT_Num_Item' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, WBP_CMN_ItemIcon) == 0x0004E0, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::WBP_CMN_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, WidgetSwitcher_Base) == 0x0004E8, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::WidgetSwitcher_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, MouseDown) == 0x0004F0, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::MouseDown' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, LeftEnd) == 0x0004F1, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::LeftEnd' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, RightEnd) == 0x0004F2, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::RightEnd' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, RewardDataNum) == 0x0004F4, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::RewardDataNum' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_Sub_ItemBtn_C, IsGet) == 0x0004F8, "Member 'UWBP_Festa_PointReward_Sub_ItemBtn_C::IsGet' has a wrong offset!");

}

