#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Online_MatchingInfo_Sub_WaitingIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Online_MatchingInfo_Sub_WaitingIcon.WBP_Online_MatchingInfo_Sub_WaitingIcon_C
// 0x0068 (0x0348 - 0x02E0)
class UWBP_Online_MatchingInfo_Sub_WaitingIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WaitingIcon_Go;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WaitingIcon_Cancel;                                // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WaitingIcon_Loop;                                  // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WaitingIcon_In;                                    // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Car;                                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_01;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_02;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_03;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_31;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_sonic;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Wheel_Front;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Wheel_Rear;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Online_MatchingInfo_Sub_WaitingIcon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Online_MatchingInfo_Sub_WaitingIcon_C">();
	}
	static class UWBP_Online_MatchingInfo_Sub_WaitingIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Online_MatchingInfo_Sub_WaitingIcon_C>();
	}
};
static_assert(alignof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C) == 0x000008, "Wrong alignment on UWBP_Online_MatchingInfo_Sub_WaitingIcon_C");
static_assert(sizeof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C) == 0x000348, "Wrong size on UWBP_Online_MatchingInfo_Sub_WaitingIcon_C");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, WaitingIcon_Go) == 0x0002E8, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::WaitingIcon_Go' has a wrong offset!");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, WaitingIcon_Cancel) == 0x0002F0, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::WaitingIcon_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, WaitingIcon_Loop) == 0x0002F8, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::WaitingIcon_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, WaitingIcon_In) == 0x000300, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::WaitingIcon_In' has a wrong offset!");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, Car) == 0x000308, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::Car' has a wrong offset!");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, Effect_01) == 0x000310, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::Effect_01' has a wrong offset!");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, Effect_02) == 0x000318, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::Effect_02' has a wrong offset!");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, Effect_03) == 0x000320, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::Effect_03' has a wrong offset!");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, Overlay_31) == 0x000328, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::Overlay_31' has a wrong offset!");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, PAT_sonic) == 0x000330, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::PAT_sonic' has a wrong offset!");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, Wheel_Front) == 0x000338, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::Wheel_Front' has a wrong offset!");
static_assert(offsetof(UWBP_Online_MatchingInfo_Sub_WaitingIcon_C, Wheel_Rear) == 0x000340, "Member 'UWBP_Online_MatchingInfo_Sub_WaitingIcon_C::Wheel_Rear' has a wrong offset!");

}

