#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Player01

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "InputCore_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UnionRun_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.AddCourseMapActor
// 0x0010 (0x0010 - 0x0000)
struct WBP_Race_HUD_Player01_C_AddCourseMapActor final
{
public:
	class AActor*                                 InAttackItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EItemId                                       InItemId;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_AddCourseMapActor) == 0x000008, "Wrong alignment on WBP_Race_HUD_Player01_C_AddCourseMapActor");
static_assert(sizeof(WBP_Race_HUD_Player01_C_AddCourseMapActor) == 0x000010, "Wrong size on WBP_Race_HUD_Player01_C_AddCourseMapActor");
static_assert(offsetof(WBP_Race_HUD_Player01_C_AddCourseMapActor, InAttackItem) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_AddCourseMapActor::InAttackItem' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_AddCourseMapActor, InItemId) == 0x000008, "Member 'WBP_Race_HUD_Player01_C_AddCourseMapActor::InItemId' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.AddToHUDAttackInfoWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_Race_HUD_Player01_C_AddToHUDAttackInfoWidget final
{
public:
	TArray<class URaceUISubApproachWarning*>      InAttackWidget;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EUnionAttackItemInfoType                      InItemType;                                        // 0x0010(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         InId;                                              // 0x0011(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_AddToHUDAttackInfoWidget) == 0x000008, "Wrong alignment on WBP_Race_HUD_Player01_C_AddToHUDAttackInfoWidget");
static_assert(sizeof(WBP_Race_HUD_Player01_C_AddToHUDAttackInfoWidget) == 0x000018, "Wrong size on WBP_Race_HUD_Player01_C_AddToHUDAttackInfoWidget");
static_assert(offsetof(WBP_Race_HUD_Player01_C_AddToHUDAttackInfoWidget, InAttackWidget) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_AddToHUDAttackInfoWidget::InAttackWidget' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_AddToHUDAttackInfoWidget, InItemType) == 0x000010, "Member 'WBP_Race_HUD_Player01_C_AddToHUDAttackInfoWidget::InItemType' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_AddToHUDAttackInfoWidget, InId) == 0x000011, "Member 'WBP_Race_HUD_Player01_C_AddToHUDAttackInfoWidget::InId' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.AfterFireManualAimingUI
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player01_C_AfterFireManualAimingUI final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_AfterFireManualAimingUI) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_AfterFireManualAimingUI");
static_assert(sizeof(WBP_Race_HUD_Player01_C_AfterFireManualAimingUI) == 0x000004, "Wrong size on WBP_Race_HUD_Player01_C_AfterFireManualAimingUI");
static_assert(offsetof(WBP_Race_HUD_Player01_C_AfterFireManualAimingUI, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_AfterFireManualAimingUI::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.ApplyBoost
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player01_C_ApplyBoost final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_ApplyBoost) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_ApplyBoost");
static_assert(sizeof(WBP_Race_HUD_Player01_C_ApplyBoost) == 0x000004, "Wrong size on WBP_Race_HUD_Player01_C_ApplyBoost");
static_assert(offsetof(WBP_Race_HUD_Player01_C_ApplyBoost, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_ApplyBoost::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.ApplyJustBoost
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Player01_C_ApplyJustBoost final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_ApplyJustBoost) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_ApplyJustBoost");
static_assert(sizeof(WBP_Race_HUD_Player01_C_ApplyJustBoost) == 0x000008, "Wrong size on WBP_Race_HUD_Player01_C_ApplyJustBoost");
static_assert(offsetof(WBP_Race_HUD_Player01_C_ApplyJustBoost, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_ApplyJustBoost::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_ApplyJustBoost, Level) == 0x000004, "Member 'WBP_Race_HUD_Player01_C_ApplyJustBoost::Level' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.ChangeRingBoostGaugeToBoost
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToBoost final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToBoost) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToBoost");
static_assert(sizeof(WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToBoost) == 0x000004, "Wrong size on WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToBoost");
static_assert(offsetof(WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToBoost, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToBoost::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.ChangeRingBoostGaugeToNormal
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToNormal final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToNormal) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToNormal");
static_assert(sizeof(WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToNormal) == 0x000004, "Wrong size on WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToNormal");
static_assert(offsetof(WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToNormal, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_ChangeRingBoostGaugeToNormal::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.CheckRivalInScreen
// 0x0050 (0x0050 - 0x0000)
struct WBP_Race_HUD_Player01_C_CheckRivalInScreen final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacerStatusObject*                RivalStatusObj;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisible_0;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRearView_IsRearView;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInScreen_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInScreen_ReturnValue_1;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_CheckRivalInScreen) == 0x000008, "Wrong alignment on WBP_Race_HUD_Player01_C_CheckRivalInScreen");
static_assert(sizeof(WBP_Race_HUD_Player01_C_CheckRivalInScreen) == 0x000050, "Wrong size on WBP_Race_HUD_Player01_C_CheckRivalInScreen");
static_assert(offsetof(WBP_Race_HUD_Player01_C_CheckRivalInScreen, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_CheckRivalInScreen::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_CheckRivalInScreen, RivalStatusObj) == 0x000008, "Member 'WBP_Race_HUD_Player01_C_CheckRivalInScreen::RivalStatusObj' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_CheckRivalInScreen, IsVisible_0) == 0x000010, "Member 'WBP_Race_HUD_Player01_C_CheckRivalInScreen::IsVisible_0' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_CheckRivalInScreen, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WBP_Race_HUD_Player01_C_CheckRivalInScreen::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_CheckRivalInScreen, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'WBP_Race_HUD_Player01_C_CheckRivalInScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_CheckRivalInScreen, CallFunc_Add_VectorVector_ReturnValue) == 0x000028, "Member 'WBP_Race_HUD_Player01_C_CheckRivalInScreen::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_CheckRivalInScreen, CallFunc_IsRearView_IsRearView) == 0x000040, "Member 'WBP_Race_HUD_Player01_C_CheckRivalInScreen::CallFunc_IsRearView_IsRearView' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_CheckRivalInScreen, CallFunc_IsInScreen_ReturnValue) == 0x000041, "Member 'WBP_Race_HUD_Player01_C_CheckRivalInScreen::CallFunc_IsInScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_CheckRivalInScreen, CallFunc_IsInScreen_ReturnValue_1) == 0x000042, "Member 'WBP_Race_HUD_Player01_C_CheckRivalInScreen::CallFunc_IsInScreen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_CheckRivalInScreen, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000048, "Member 'WBP_Race_HUD_Player01_C_CheckRivalInScreen::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.CreateTimeTrialLapWidget
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player01_C_CreateTimeTrialLapWidget final
{
public:
	int32                                         LapNo;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_CreateTimeTrialLapWidget) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_CreateTimeTrialLapWidget");
static_assert(sizeof(WBP_Race_HUD_Player01_C_CreateTimeTrialLapWidget) == 0x000004, "Wrong size on WBP_Race_HUD_Player01_C_CreateTimeTrialLapWidget");
static_assert(offsetof(WBP_Race_HUD_Player01_C_CreateTimeTrialLapWidget, LapNo) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_CreateTimeTrialLapWidget::LapNo' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.DebugUpdate
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Player01_C_DebugUpdate final
{
public:
	double                                        DebugElapsedTime_0;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_DebugUpdate) == 0x000008, "Wrong alignment on WBP_Race_HUD_Player01_C_DebugUpdate");
static_assert(sizeof(WBP_Race_HUD_Player01_C_DebugUpdate) == 0x000008, "Wrong size on WBP_Race_HUD_Player01_C_DebugUpdate");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DebugUpdate, DebugElapsedTime_0) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_DebugUpdate::DebugElapsedTime_0' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.DecideLotteryItem
// 0x000C (0x000C - 0x0000)
struct WBP_Race_HUD_Player01_C_DecideLotteryItem final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemInfoType                                 ItemInfoType;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InItemId;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_DecideLotteryItem) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_DecideLotteryItem");
static_assert(sizeof(WBP_Race_HUD_Player01_C_DecideLotteryItem) == 0x00000C, "Wrong size on WBP_Race_HUD_Player01_C_DecideLotteryItem");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DecideLotteryItem, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_DecideLotteryItem::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DecideLotteryItem, ItemInfoType) == 0x000004, "Member 'WBP_Race_HUD_Player01_C_DecideLotteryItem::ItemInfoType' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DecideLotteryItem, InItemId) == 0x000008, "Member 'WBP_Race_HUD_Player01_C_DecideLotteryItem::InItemId' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.DispOffControlGuideFlight
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player01_C_DispOffControlGuideFlight final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_DispOffControlGuideFlight) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_DispOffControlGuideFlight");
static_assert(sizeof(WBP_Race_HUD_Player01_C_DispOffControlGuideFlight) == 0x000004, "Wrong size on WBP_Race_HUD_Player01_C_DispOffControlGuideFlight");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOffControlGuideFlight, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_DispOffControlGuideFlight::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.DispOffControlItemUse
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player01_C_DispOffControlItemUse final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_DispOffControlItemUse) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_DispOffControlItemUse");
static_assert(sizeof(WBP_Race_HUD_Player01_C_DispOffControlItemUse) == 0x000004, "Wrong size on WBP_Race_HUD_Player01_C_DispOffControlItemUse");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOffControlItemUse, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_DispOffControlItemUse::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.DispOffControlReleaseItemEffect
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player01_C_DispOffControlReleaseItemEffect final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_DispOffControlReleaseItemEffect) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_DispOffControlReleaseItemEffect");
static_assert(sizeof(WBP_Race_HUD_Player01_C_DispOffControlReleaseItemEffect) == 0x000004, "Wrong size on WBP_Race_HUD_Player01_C_DispOffControlReleaseItemEffect");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOffControlReleaseItemEffect, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_DispOffControlReleaseItemEffect::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.DispOffRaceActionTutorial
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player01_C_DispOffRaceActionTutorial final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_DispOffRaceActionTutorial) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_DispOffRaceActionTutorial");
static_assert(sizeof(WBP_Race_HUD_Player01_C_DispOffRaceActionTutorial) == 0x000004, "Wrong size on WBP_Race_HUD_Player01_C_DispOffRaceActionTutorial");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOffRaceActionTutorial, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_DispOffRaceActionTutorial::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.DispOnControlGuideFlight
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Player01_C_DispOnControlGuideFlight final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuggestUpInput;                                   // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_DispOnControlGuideFlight) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_DispOnControlGuideFlight");
static_assert(sizeof(WBP_Race_HUD_Player01_C_DispOnControlGuideFlight) == 0x000008, "Wrong size on WBP_Race_HUD_Player01_C_DispOnControlGuideFlight");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOnControlGuideFlight, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_DispOnControlGuideFlight::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOnControlGuideFlight, bSuggestUpInput) == 0x000004, "Member 'WBP_Race_HUD_Player01_C_DispOnControlGuideFlight::bSuggestUpInput' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.DispOnControlItemUse
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Player01_C_DispOnControlItemUse final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemId                                       ItemId;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFever;                                          // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_DispOnControlItemUse) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_DispOnControlItemUse");
static_assert(sizeof(WBP_Race_HUD_Player01_C_DispOnControlItemUse) == 0x000008, "Wrong size on WBP_Race_HUD_Player01_C_DispOnControlItemUse");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOnControlItemUse, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_DispOnControlItemUse::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOnControlItemUse, ItemId) == 0x000004, "Member 'WBP_Race_HUD_Player01_C_DispOnControlItemUse::ItemId' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOnControlItemUse, bIsFever) == 0x000005, "Member 'WBP_Race_HUD_Player01_C_DispOnControlItemUse::bIsFever' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.DispOnControlReleaseItemEffect
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Player01_C_DispOnControlReleaseItemEffect final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemId                                       ItemId;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_DispOnControlReleaseItemEffect) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_DispOnControlReleaseItemEffect");
static_assert(sizeof(WBP_Race_HUD_Player01_C_DispOnControlReleaseItemEffect) == 0x000008, "Wrong size on WBP_Race_HUD_Player01_C_DispOnControlReleaseItemEffect");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOnControlReleaseItemEffect, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_DispOnControlReleaseItemEffect::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOnControlReleaseItemEffect, ItemId) == 0x000004, "Member 'WBP_Race_HUD_Player01_C_DispOnControlReleaseItemEffect::ItemId' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.DispOnInterimReport
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player01_C_DispOnInterimReport final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_DispOnInterimReport) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_DispOnInterimReport");
static_assert(sizeof(WBP_Race_HUD_Player01_C_DispOnInterimReport) == 0x000004, "Wrong size on WBP_Race_HUD_Player01_C_DispOnInterimReport");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOnInterimReport, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_DispOnInterimReport::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.DispOnRaceActionTutorial
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Player01_C_DispOnRaceActionTutorial final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETutorialAction                               tutorialAction_0;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_DispOnRaceActionTutorial) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_DispOnRaceActionTutorial");
static_assert(sizeof(WBP_Race_HUD_Player01_C_DispOnRaceActionTutorial) == 0x000008, "Wrong size on WBP_Race_HUD_Player01_C_DispOnRaceActionTutorial");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOnRaceActionTutorial, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_DispOnRaceActionTutorial::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispOnRaceActionTutorial, tutorialAction_0) == 0x000004, "Member 'WBP_Race_HUD_Player01_C_DispOnRaceActionTutorial::tutorialAction_0' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.DispTimeTrialLapDiff
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player01_C_DispTimeTrialLapDiff final
{
public:
	int32                                         LapNum;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player01_C_DispTimeTrialLapDiff) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player01_C_DispTimeTrialLapDiff");
static_assert(sizeof(WBP_Race_HUD_Player01_C_DispTimeTrialLapDiff) == 0x000004, "Wrong size on WBP_Race_HUD_Player01_C_DispTimeTrialLapDiff");
static_assert(offsetof(WBP_Race_HUD_Player01_C_DispTimeTrialLapDiff, LapNum) == 0x000000, "Member 'WBP_Race_HUD_Player01_C_DispTimeTrialLapDiff::LapNum' has a wrong offset!");

// Function WBP_Race_HUD_Player01.WBP_Race_HUD_Player01_C.ExecuteUbergraph_WBP_Race_HUD_Player01
// 0x1920 (0x1920 - 0x0000)
struct WBP_Race_HUD_Player01_C_ExecuteUbergraph_WBP_Race_HUD_Player01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFireAttackItemInfo                    K2Node_Event_Info;                                 // 0x0008(0x0030)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRacerIndex_OutRacerIndex;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsViewGhostReplay_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUserGadgetPresetData                  CallFunc_GetTimeTiralGadgetPresetData_ReturnValue; // 0x0048(0x0010)()
	bool                                          CallFunc_IsViewGhostReplay_ReturnValue_1;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0060(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0070(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_DebugElapsedTime;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsViewGhostReplay_ReturnValue_2;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_1;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_2;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_1;       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_3;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_2;       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_2;       // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerControllerIndex_66;             // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InItemId_6;                           // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerControllerIndex_65;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InMinutes;                            // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InSecondes;                           // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InMilliSec;                           // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_64;             // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InRankIndex;                          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x2];                                      // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerControllerIndex_63;             // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InItemId_5;                           // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_AttackToPlayerControllerIndex;        // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_InLoadedPrimaryTextureAsset;    // 0x01B0(0x0028)(HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_InOrthoRatePerCourse;           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 K2Node_Event_CourseTexture;                        // 0x01E0(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	float                                         K2Node_Event_OrthoRate;                            // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Angle;                                // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Offset;                               // 0x0210(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RacerIndex_6;                         // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_62;             // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InRacerIndex_1;                       // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsLocalPlayer;                        // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerControllerIndex_61;             // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_60;             // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ChangeAmount;                         // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_59;             // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible_28;                          // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGhostOnline_ReturnValue;                // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B[0x1];                                      // 0x027B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerControllerIndex_58;             // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InItemId_4;                           // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerControllerIndex_57;             // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_GaugeRate_1;                          // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUnionRaceStartUI*>              K2Node_MakeArray_Array;                            // 0x0298(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         K2Node_Event_StartCount;                           // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* WidgetRef)>     K2Node_CreateDelegate_OutputDelegate;              // 0x02AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_56;             // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemInfoType                                 K2Node_Event_ItemInfoType_7;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerControllerIndex_55;             // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemInfoType                                 K2Node_Event_ItemInfoType_6;                       // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSilent;                            // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_9;          // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_10;         // 0x02CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class URaceUISubApproachWarning*>      K2Node_Event_InAttackWidget_1;                     // 0x02D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	EUnionAttackItemInfoType                      K2Node_Event_InItemType;                           // 0x02E0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_InId;                                 // 0x02E1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URaceUISubApproachWarning*              CallFunc_Array_Get_Item;                           // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemWarning_C*        K2Node_DynamicCast_AsWBP_Race_HUD_Sub_Item_Warning; // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0318(0x0010)()
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0330(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchorData                            CallFunc_GetLayout_ReturnValue;                    // 0x0340(0x0040)(NoDestructor)
	bool                                          K2Node_Event_bIn;                                  // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_Event_OnAnimationEndEvent;                  // 0x0384(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_TimeTrial_Time_C*     K2Node_DynamicCast_AsWBP_Race_HUD_Sub_Time_Trial_Time; // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPause;                               // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x03B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_ItemWarning_C*        K2Node_DynamicCast_AsWBP_Race_HUD_Sub_Item_Warning_1; // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerControllerIndex_54;             // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemInfoType                                 K2Node_Event_ItemInfoType_5;                       // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_NewRate;                              // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_11;         // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible_27;                          // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2[0x2];                                      // 0x03F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_RacerIndex_5;                         // 0x03F4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemId                                       K2Node_Event_InItemId_3;                           // 0x03F8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_RacerIndex_4;                         // 0x03FC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMinimapIconType                              K2Node_Event_InMinimapIconType;                    // 0x0400(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerControllerIndex_53;             // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_RankAfterIndex;                       // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible_26;                          // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
