#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusInfo_Sub_HonorTable_02

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatusInfo_Sub_HonorTable_02.WBP_StatusInfo_Sub_HonorTable_02_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_StatusInfo_Sub_HonorTable_02_C final : public UUserWidget
{
public:
	class UImage*                                 base;                                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base02;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base02_1;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Line;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Check;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_HeaderWin;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HonorTitle_Plate_C*                WBP_HonorTitle_Plate;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetCheckIcon(bool IsTaked);
	void SetTitleText(const class FText& Title);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatusInfo_Sub_HonorTable_02_C">();
	}
	static class UWBP_StatusInfo_Sub_HonorTable_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatusInfo_Sub_HonorTable_02_C>();
	}
};
static_assert(alignof(UWBP_StatusInfo_Sub_HonorTable_02_C) == 0x000008, "Wrong alignment on UWBP_StatusInfo_Sub_HonorTable_02_C");
static_assert(sizeof(UWBP_StatusInfo_Sub_HonorTable_02_C) == 0x000318, "Wrong size on UWBP_StatusInfo_Sub_HonorTable_02_C");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorTable_02_C, base) == 0x0002E0, "Member 'UWBP_StatusInfo_Sub_HonorTable_02_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorTable_02_C, Base02) == 0x0002E8, "Member 'UWBP_StatusInfo_Sub_HonorTable_02_C::Base02' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorTable_02_C, Base02_1) == 0x0002F0, "Member 'UWBP_StatusInfo_Sub_HonorTable_02_C::Base02_1' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorTable_02_C, Base_Line) == 0x0002F8, "Member 'UWBP_StatusInfo_Sub_HonorTable_02_C::Base_Line' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorTable_02_C, DSP_Check) == 0x000300, "Member 'UWBP_StatusInfo_Sub_HonorTable_02_C::DSP_Check' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorTable_02_C, TXT_HeaderWin) == 0x000308, "Member 'UWBP_StatusInfo_Sub_HonorTable_02_C::TXT_HeaderWin' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorTable_02_C, WBP_HonorTitle_Plate) == 0x000310, "Member 'UWBP_StatusInfo_Sub_HonorTable_02_C::WBP_HonorTitle_Plate' has a wrong offset!");

}

