#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_PlayerDetail_Sub_Info_Machine

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_PlayerDetail_Sub_Info_Machine.WBP_CMN_PlayerDetail_Sub_Info_Machine_C
// 0x00E8 (0x03C8 - 0x02E0)
class UWBP_CMN_PlayerDetail_Sub_Info_Machine_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Base_BG_01;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_BG_02;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_BG_03;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_BG_04;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Chara;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Front;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_rear;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Wheel;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Wheel_Off;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_CharaFaceIcon;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_PartsIcon_Front;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_PartsIcon_Rear;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_PartsIcon_Wheel;                               // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameLine_Wheel_Off;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Icon_Type_Chara;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Icon_Type_Front;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Icon_Type_Rear;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Icon_Type_Wheel;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Name_Chara;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Name_Front;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Name_Rear;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Name_Wheel;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_Sub_Parameter_C*            WBP_Window_Sub_Parameter_01;                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_Sub_Parameter_C*            WBP_Window_Sub_Parameter_02;                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_Sub_Parameter_C*            WBP_Window_Sub_Parameter_03;                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_Sub_Parameter_C*            WBP_Window_Sub_Parameter_04;                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_Sub_Parameter_C*            WBP_Window_Sub_Parameter_05;                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_Wheel;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine(int32 EntryPoint);
	void OnLoaded_63E3412942D2292B63AF1FBE0A3214A7(class UObject* Loaded);
	void Set_Racer_Param(EDriverId InDriverId, EMachineId InFrontPartsId, EMachineId InRearPartsId, EMachineId InTirePartsId, TArray<EGadgetId>& InGadgetIds);
	void SetFrontPartsData(const struct FMachinePartsUIData& InUIData);
	void SetRacerData(TSoftObjectPtr<class UTexture2D> RacerTexture, const class FText& RacerName, EDriverType DriverType);
	void SetRearPartsData(const struct FMachinePartsUIData& InUIData, bool bIsHover);
	void SetWheelPartsData(const struct FMachinePartsUIData& InUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_PlayerDetail_Sub_Info_Machine_C">();
	}
	static class UWBP_CMN_PlayerDetail_Sub_Info_Machine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_PlayerDetail_Sub_Info_Machine_C>();
	}
};
static_assert(alignof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C) == 0x000008, "Wrong alignment on UWBP_CMN_PlayerDetail_Sub_Info_Machine_C");
static_assert(sizeof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C) == 0x0003C8, "Wrong size on UWBP_CMN_PlayerDetail_Sub_Info_Machine_C");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, Base_BG_01) == 0x0002E8, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::Base_BG_01' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, Base_BG_02) == 0x0002F0, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::Base_BG_02' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, Base_BG_03) == 0x0002F8, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::Base_BG_03' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, Base_BG_04) == 0x000300, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::Base_BG_04' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, Base_Chara) == 0x000308, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::Base_Chara' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, Base_Front) == 0x000310, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::Base_Front' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, Base_rear) == 0x000318, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::Base_rear' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, Base_Wheel) == 0x000320, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::Base_Wheel' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, Base_Wheel_Off) == 0x000328, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::Base_Wheel_Off' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, DMY_CharaFaceIcon) == 0x000330, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::DMY_CharaFaceIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, DMY_PartsIcon_Front) == 0x000338, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::DMY_PartsIcon_Front' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, DMY_PartsIcon_Rear) == 0x000340, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::DMY_PartsIcon_Rear' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, DMY_PartsIcon_Wheel) == 0x000348, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::DMY_PartsIcon_Wheel' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, NameLine_Wheel_Off) == 0x000350, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::NameLine_Wheel_Off' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, PAT_Icon_Type_Chara) == 0x000358, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::PAT_Icon_Type_Chara' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, PAT_Icon_Type_Front) == 0x000360, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::PAT_Icon_Type_Front' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, PAT_Icon_Type_Rear) == 0x000368, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::PAT_Icon_Type_Rear' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, PAT_Icon_Type_Wheel) == 0x000370, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::PAT_Icon_Type_Wheel' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, TXT_Name_Chara) == 0x000378, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::TXT_Name_Chara' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, TXT_Name_Front) == 0x000380, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::TXT_Name_Front' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, TXT_Name_Rear) == 0x000388, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::TXT_Name_Rear' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, TXT_Name_Wheel) == 0x000390, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::TXT_Name_Wheel' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, WBP_Window_Sub_Parameter_01) == 0x000398, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::WBP_Window_Sub_Parameter_01' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, WBP_Window_Sub_Parameter_02) == 0x0003A0, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::WBP_Window_Sub_Parameter_02' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, WBP_Window_Sub_Parameter_03) == 0x0003A8, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::WBP_Window_Sub_Parameter_03' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, WBP_Window_Sub_Parameter_04) == 0x0003B0, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::WBP_Window_Sub_Parameter_04' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, WBP_Window_Sub_Parameter_05) == 0x0003B8, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::WBP_Window_Sub_Parameter_05' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Machine_C, WS_Wheel) == 0x0003C0, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Machine_C::WS_Wheel' has a wrong offset!");

}

