#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyRace_Sub_Option_SettingBtn

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyRace_Sub_Option_SettingBtn.WBP_PartyRace_Sub_Option_SettingBtn_C
// 0x00A0 (0x0570 - 0x04D0)
class UWBP_PartyRace_Sub_Option_SettingBtn_C final : public UCustomRaceSubOptionSettingBtn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Btn_Active;                                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_Arrow_Left;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_Arrow_Right;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_Cursor;                                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_Ignore;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_NonActive;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_Select;                                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Delete_PAT_BtnBase;                                // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Set_Icon;                                      // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlagWave;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         UnionUIButton_49;                                  // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FontScroll_C*                      WBP_FontScroll_OptionBtn;                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Btn;                                // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UUnionUIButtonBase* Button)> OnCancelKeyDownEvent;           // 0x0540(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnOkKeyDownEvent;                                  // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsSelected;                                        // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PartyRace_Sub_Option_Line_C*       Parent;                                            // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PartyRace_Sub_Option_SettingBtn_UnionUIButton_49_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ChangeControllerType(EAppControllerInputType BeforeType, EAppControllerInputType AfterType);
	void Construct();
	void ExecuteUbergraph_WBP_PartyRace_Sub_Option_SettingBtn(int32 EntryPoint);
	void ForceFocusOutBtnEvent();
	EAppControllerInputType GetCurrentInput();
	class FText GetText();
	void OnAcceptKeyPressed();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnBackKeyPressed();
	void OnDownKeyPressed();
	void OnFocusImpl();
	void OnLeftKeyPressed();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRightKeyPressed();
	void OnUpKeyPressed();
	void PlayActive();
	void PlayNonActive();
	void SetButtonLineParent(class UWBP_PartyRace_Sub_Option_Line_C* Parent_0);
	void SetButtonVisibility(bool Visible);
	void SetIgnoreVisible(bool bIgnore_0);
	void SetIsButtonSelected(bool IsSelected_0);
	void SetLineParent(class UCustomRaceSubOptionSettingLine* LineParent);
	void SetText(const class FText& InText);
	void WidgetAnimationEvt_Btn_Active_Loop_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_Btn_NonActive_Loop_K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_Btn_Select_Loop_K2Node_WidgetAnimationEvent_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyRace_Sub_Option_SettingBtn_C">();
	}
	static class UWBP_PartyRace_Sub_Option_SettingBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyRace_Sub_Option_SettingBtn_C>();
	}
};
static_assert(alignof(UWBP_PartyRace_Sub_Option_SettingBtn_C) == 0x000008, "Wrong alignment on UWBP_PartyRace_Sub_Option_SettingBtn_C");
static_assert(sizeof(UWBP_PartyRace_Sub_Option_SettingBtn_C) == 0x000570, "Wrong size on UWBP_PartyRace_Sub_Option_SettingBtn_C");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, UberGraphFrame) == 0x0004D0, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, Btn_Active) == 0x0004D8, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::Btn_Active' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, Btn_Arrow_Left) == 0x0004E0, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::Btn_Arrow_Left' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, Btn_Arrow_Right) == 0x0004E8, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::Btn_Arrow_Right' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, Btn_Cursor) == 0x0004F0, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::Btn_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, Btn_Ignore) == 0x0004F8, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::Btn_Ignore' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, Btn_NonActive) == 0x000500, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::Btn_NonActive' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, Btn_Select) == 0x000508, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::Btn_Select' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, Delete_PAT_BtnBase) == 0x000510, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::Delete_PAT_BtnBase' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, DSP_Set_Icon) == 0x000518, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::DSP_Set_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, RaceFlagWave) == 0x000520, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::RaceFlagWave' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, UnionUIButton_49) == 0x000528, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::UnionUIButton_49' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, WBP_FontScroll_OptionBtn) == 0x000530, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::WBP_FontScroll_OptionBtn' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, WidgetSwitcher_Btn) == 0x000538, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::WidgetSwitcher_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, OnCancelKeyDownEvent) == 0x000540, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::OnCancelKeyDownEvent' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, OnOkKeyDownEvent) == 0x000550, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::OnOkKeyDownEvent' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, IsSelected) == 0x000560, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_Option_SettingBtn_C, Parent) == 0x000568, "Member 'UWBP_PartyRace_Sub_Option_SettingBtn_C::Parent' has a wrong offset!");

}

