#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeaderMenu_Sub_NewsBtn

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HeaderMenu_Sub_NewsBtn.WBP_HeaderMenu_Sub_NewsBtn_C.ExecuteUbergraph_WBP_HeaderMenu_Sub_NewsBtn
// 0x0014 (0x0014 - 0x0000)
struct WBP_HeaderMenu_Sub_NewsBtn_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_NewsBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HeaderMenu_Sub_NewsBtn_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_NewsBtn) == 0x000004, "Wrong alignment on WBP_HeaderMenu_Sub_NewsBtn_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_NewsBtn");
static_assert(sizeof(WBP_HeaderMenu_Sub_NewsBtn_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_NewsBtn) == 0x000014, "Wrong size on WBP_HeaderMenu_Sub_NewsBtn_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_NewsBtn");
static_assert(offsetof(WBP_HeaderMenu_Sub_NewsBtn_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_NewsBtn, EntryPoint) == 0x000000, "Member 'WBP_HeaderMenu_Sub_NewsBtn_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_NewsBtn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_NewsBtn_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_NewsBtn, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_HeaderMenu_Sub_NewsBtn_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_NewsBtn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_HeaderMenu_Sub_NewsBtn.WBP_HeaderMenu_Sub_NewsBtn_C.PressButtonAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_HeaderMenu_Sub_NewsBtn_C_PressButtonAnimation final
{
public:
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HeaderMenu_Sub_NewsBtn_C_PressButtonAnimation) == 0x000004, "Wrong alignment on WBP_HeaderMenu_Sub_NewsBtn_C_PressButtonAnimation");
static_assert(sizeof(WBP_HeaderMenu_Sub_NewsBtn_C_PressButtonAnimation) == 0x000008, "Wrong size on WBP_HeaderMenu_Sub_NewsBtn_C_PressButtonAnimation");
static_assert(offsetof(WBP_HeaderMenu_Sub_NewsBtn_C_PressButtonAnimation, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000000, "Member 'WBP_HeaderMenu_Sub_NewsBtn_C_PressButtonAnimation::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_NewsBtn_C_PressButtonAnimation, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WBP_HeaderMenu_Sub_NewsBtn_C_PressButtonAnimation::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_HeaderMenu_Sub_NewsBtn.WBP_HeaderMenu_Sub_NewsBtn_C.Set Icon Visibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_HeaderMenu_Sub_NewsBtn_C_Set_Icon_Visibility final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HeaderMenu_Sub_NewsBtn_C_Set_Icon_Visibility) == 0x000001, "Wrong alignment on WBP_HeaderMenu_Sub_NewsBtn_C_Set_Icon_Visibility");
static_assert(sizeof(WBP_HeaderMenu_Sub_NewsBtn_C_Set_Icon_Visibility) == 0x000001, "Wrong size on WBP_HeaderMenu_Sub_NewsBtn_C_Set_Icon_Visibility");
static_assert(offsetof(WBP_HeaderMenu_Sub_NewsBtn_C_Set_Icon_Visibility, Visibility_0) == 0x000000, "Member 'WBP_HeaderMenu_Sub_NewsBtn_C_Set_Icon_Visibility::Visibility_0' has a wrong offset!");

// Function WBP_HeaderMenu_Sub_NewsBtn.WBP_HeaderMenu_Sub_NewsBtn_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WBP_HeaderMenu_Sub_NewsBtn_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_HeaderMenu_Sub_NewsBtn_C_SetText) == 0x000008, "Wrong alignment on WBP_HeaderMenu_Sub_NewsBtn_C_SetText");
static_assert(sizeof(WBP_HeaderMenu_Sub_NewsBtn_C_SetText) == 0x000010, "Wrong size on WBP_HeaderMenu_Sub_NewsBtn_C_SetText");
static_assert(offsetof(WBP_HeaderMenu_Sub_NewsBtn_C_SetText, InText) == 0x000000, "Member 'WBP_HeaderMenu_Sub_NewsBtn_C_SetText::InText' has a wrong offset!");

}

