#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_RivalLevel_Sub_Content

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CMN_RivalLevel_Sub_Content.WBP_CMN_RivalLevel_Sub_Content_C.ExecuteUbergraph_WBP_CMN_RivalLevel_Sub_Content
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_RivalLevel_Sub_Content_C_ExecuteUbergraph_WBP_CMN_RivalLevel_Sub_Content final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InIndex;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_RivalLevel_Sub_Content_C_ExecuteUbergraph_WBP_CMN_RivalLevel_Sub_Content) == 0x000004, "Wrong alignment on WBP_CMN_RivalLevel_Sub_Content_C_ExecuteUbergraph_WBP_CMN_RivalLevel_Sub_Content");
static_assert(sizeof(WBP_CMN_RivalLevel_Sub_Content_C_ExecuteUbergraph_WBP_CMN_RivalLevel_Sub_Content) == 0x000008, "Wrong size on WBP_CMN_RivalLevel_Sub_Content_C_ExecuteUbergraph_WBP_CMN_RivalLevel_Sub_Content");
static_assert(offsetof(WBP_CMN_RivalLevel_Sub_Content_C_ExecuteUbergraph_WBP_CMN_RivalLevel_Sub_Content, EntryPoint) == 0x000000, "Member 'WBP_CMN_RivalLevel_Sub_Content_C_ExecuteUbergraph_WBP_CMN_RivalLevel_Sub_Content::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_RivalLevel_Sub_Content_C_ExecuteUbergraph_WBP_CMN_RivalLevel_Sub_Content, K2Node_CustomEvent_InIndex) == 0x000004, "Member 'WBP_CMN_RivalLevel_Sub_Content_C_ExecuteUbergraph_WBP_CMN_RivalLevel_Sub_Content::K2Node_CustomEvent_InIndex' has a wrong offset!");

// Function WBP_CMN_RivalLevel_Sub_Content.WBP_CMN_RivalLevel_Sub_Content_C.SequenceEventPlayAnimIcon
// 0x0004 (0x0004 - 0x0000)
struct WBP_CMN_RivalLevel_Sub_Content_C_SequenceEventPlayAnimIcon final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_RivalLevel_Sub_Content_C_SequenceEventPlayAnimIcon) == 0x000004, "Wrong alignment on WBP_CMN_RivalLevel_Sub_Content_C_SequenceEventPlayAnimIcon");
static_assert(sizeof(WBP_CMN_RivalLevel_Sub_Content_C_SequenceEventPlayAnimIcon) == 0x000004, "Wrong size on WBP_CMN_RivalLevel_Sub_Content_C_SequenceEventPlayAnimIcon");
static_assert(offsetof(WBP_CMN_RivalLevel_Sub_Content_C_SequenceEventPlayAnimIcon, InIndex) == 0x000000, "Member 'WBP_CMN_RivalLevel_Sub_Content_C_SequenceEventPlayAnimIcon::InIndex' has a wrong offset!");

}

