#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetIcon_Cost01_Icon

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GadgetIcon_Cost01_Icon.WBP_GadgetIcon_Cost01_Icon_C
// 0x0028 (0x0688 - 0x0660)
class UWBP_GadgetIcon_Cost01_Icon_C final : public UMenuGadgetIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Base_01;                                           // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_Icon;                                          // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_Cost;                                          // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Base_Cost;                                     // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon(int32 EntryPoint);
	void SetBaseVisible(bool bInIsVisible);
	void SetCost(int32 InCost);
	void SetCostVisible(bool bInIsVisible);
	void SetGadgetKitBase(const int32 InSizeX, const bool bInGadgetKit);
	void SetTexture(class UTexture2D* InTexture);
	void SetupByGadgetId(EGadgetId InGadgetId, bool bInSetShape);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GadgetIcon_Cost01_Icon_C">();
	}
	static class UWBP_GadgetIcon_Cost01_Icon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GadgetIcon_Cost01_Icon_C>();
	}
};
static_assert(alignof(UWBP_GadgetIcon_Cost01_Icon_C) == 0x000008, "Wrong alignment on UWBP_GadgetIcon_Cost01_Icon_C");
static_assert(sizeof(UWBP_GadgetIcon_Cost01_Icon_C) == 0x000688, "Wrong size on UWBP_GadgetIcon_Cost01_Icon_C");
static_assert(offsetof(UWBP_GadgetIcon_Cost01_Icon_C, UberGraphFrame) == 0x000660, "Member 'UWBP_GadgetIcon_Cost01_Icon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_Cost01_Icon_C, Base_01) == 0x000668, "Member 'UWBP_GadgetIcon_Cost01_Icon_C::Base_01' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_Cost01_Icon_C, DMY_Icon) == 0x000670, "Member 'UWBP_GadgetIcon_Cost01_Icon_C::DMY_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_Cost01_Icon_C, DSP_Cost) == 0x000678, "Member 'UWBP_GadgetIcon_Cost01_Icon_C::DSP_Cost' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_Cost01_Icon_C, PAT_Base_Cost) == 0x000680, "Member 'UWBP_GadgetIcon_Cost01_Icon_C::PAT_Base_Cost' has a wrong offset!");

}

