#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_PlayerNumber_RaceStart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_PlayerNumber_RaceStart.WBP_Race_HUD_Sub_PlayerNumber_RaceStart_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PlayerNumber_RaceStart_InOut;                      // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_PlayerNumber_RaceStart;                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MLC_ColorBase;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_PlayerNumber;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WhiteOutline;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               M_PlayerNumber;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PlayerNumberIndex;                                 // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_PlayerNumber_RaceStart(int32 EntryPoint);
	void FireInAnimation();
	void PreConstruct(bool IsDesignTime);
	void SetBGColorInfo(int32 Index_0, bool IsGroup, bool IsLocalMulti);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_PlayerNumber_RaceStart_C">();
	}
	static class UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C) == 0x000328, "Wrong size on UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C, PlayerNumber_RaceStart_InOut) == 0x0002E8, "Member 'UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C::PlayerNumber_RaceStart_InOut' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C, Arrow) == 0x0002F0, "Member 'UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C::Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C, CanvasPanel_PlayerNumber_RaceStart) == 0x0002F8, "Member 'UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C::CanvasPanel_PlayerNumber_RaceStart' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C, MLC_ColorBase) == 0x000300, "Member 'UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C::MLC_ColorBase' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C, TXT_PlayerNumber) == 0x000308, "Member 'UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C::TXT_PlayerNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C, WhiteOutline) == 0x000310, "Member 'UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C::WhiteOutline' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C, M_PlayerNumber) == 0x000318, "Member 'UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C::M_PlayerNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C, PlayerNumberIndex) == 0x000320, "Member 'UWBP_Race_HUD_Sub_PlayerNumber_RaceStart_C::PlayerNumberIndex' has a wrong offset!");

}

