#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_RSR_5rings_Simple

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UnionRun_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_RSR_5rings_Simple.WBP_Race_HUD_Sub_RSR_5rings_Simple_C
// 0x0088 (0x0380 - 0x02F8)
class UWBP_Race_HUD_Sub_RSR_5rings_Simple_C final : public UUnionRaceUIResultRedStarRings
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 RSR_01;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_02;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_03;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_04;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_05;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              AddPlayTicketInAnimeEvent;                         // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMaterialInstanceDynamic*               RSR_DM01;                                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RSR_DM02;                                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RSR_DM03;                                          // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RSR_DM04;                                          // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RSR_DM05;                                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OffColor;                                          // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OnColor;                                           // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple(int32 EntryPoint);
	void PickupRedStarRing(int32 Index_0);
	void ResetRedStarRing();
	void SetOtherRSRBAnimation(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_RSR_5rings_Simple_C">();
	}
	static class UWBP_Race_HUD_Sub_RSR_5rings_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_RSR_5rings_Simple_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_RSR_5rings_Simple_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C) == 0x000380, "Wrong size on UWBP_Race_HUD_Sub_RSR_5rings_Simple_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, RSR_01) == 0x000300, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::RSR_01' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, RSR_02) == 0x000308, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::RSR_02' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, RSR_03) == 0x000310, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::RSR_03' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, RSR_04) == 0x000318, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::RSR_04' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, RSR_05) == 0x000320, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::RSR_05' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, AddPlayTicketInAnimeEvent) == 0x000328, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::AddPlayTicketInAnimeEvent' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, RSR_DM01) == 0x000338, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::RSR_DM01' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, RSR_DM02) == 0x000340, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::RSR_DM02' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, RSR_DM03) == 0x000348, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::RSR_DM03' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, RSR_DM04) == 0x000350, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::RSR_DM04' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, RSR_DM05) == 0x000358, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::RSR_DM05' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, OffColor) == 0x000360, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::OffColor' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_RSR_5rings_Simple_C, OnColor) == 0x000370, "Member 'UWBP_Race_HUD_Sub_RSR_5rings_Simple_C::OnColor' has a wrong offset!");

}

