#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Ring

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_Ring.WBP_Race_HUD_Sub_Ring_C
// 0x0070 (0x03B0 - 0x0340)
class UWBP_Race_HUD_Sub_Ring_C final : public URaceUISubRing
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCircularThrobber*                      CircularThrobber_Eff;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ring_Head;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RingBase;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RingBase_Eff;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Earned;                                            // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       LoopAnim;                                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         MLC_RingBase_Index;                                // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_SpeedNum_C*           WBP_SpeedNum;                                      // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSoundHandle>                   SoundHandle;                                       // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PlayerIndex;                                       // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  SoundHandleFlag;                                   // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_Ring(int32 EntryPoint);
	void PauseSE(bool IsPause);
	void Play100SE(int32 RingNum);
	void PreConstruct(bool IsDesignTime);
	void SetRingBackColor(int32 Index_0, bool IsGroup, bool IsLocalMulti);
	void SetRingNum(int32 RingNum);
	void WidgetInit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_Ring_C">();
	}
	static class UWBP_Race_HUD_Sub_Ring_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_Ring_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_Ring_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_Ring_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_Ring_C) == 0x0003B0, "Wrong size on UWBP_Race_HUD_Sub_Ring_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_Ring_C, UberGraphFrame) == 0x000340, "Member 'UWBP_Race_HUD_Sub_Ring_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Ring_C, CircularThrobber_Eff) == 0x000348, "Member 'UWBP_Race_HUD_Sub_Ring_C::CircularThrobber_Eff' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Ring_C, Ring_Head) == 0x000350, "Member 'UWBP_Race_HUD_Sub_Ring_C::Ring_Head' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Ring_C, RingBase) == 0x000358, "Member 'UWBP_Race_HUD_Sub_Ring_C::RingBase' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Ring_C, RingBase_Eff) == 0x000360, "Member 'UWBP_Race_HUD_Sub_Ring_C::RingBase_Eff' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Ring_C, Earned) == 0x000368, "Member 'UWBP_Race_HUD_Sub_Ring_C::Earned' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Ring_C, LoopAnim) == 0x000370, "Member 'UWBP_Race_HUD_Sub_Ring_C::LoopAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Ring_C, MLC_RingBase_Index) == 0x000378, "Member 'UWBP_Race_HUD_Sub_Ring_C::MLC_RingBase_Index' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Ring_C, WBP_SpeedNum) == 0x000380, "Member 'UWBP_Race_HUD_Sub_Ring_C::WBP_SpeedNum' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Ring_C, SoundHandle) == 0x000388, "Member 'UWBP_Race_HUD_Sub_Ring_C::SoundHandle' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Ring_C, PlayerIndex) == 0x000398, "Member 'UWBP_Race_HUD_Sub_Ring_C::PlayerIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Ring_C, SoundHandleFlag) == 0x0003A0, "Member 'UWBP_Race_HUD_Sub_Ring_C::SoundHandleFlag' has a wrong offset!");

}

