#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetCustom_Sub_TypeBox

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "EMachineSelectMode_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox
// 0x0268 (0x0268 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bDownRight;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInImmediateReflection;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUILoopScrollBox*                  K2Node_CustomEvent_FinishedWidget;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InCategoryIndex;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGadgetCustomWindow*                    K2Node_Event_InGadgetCustomWindow;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InPlayerControllerIndex;              // 0x0078(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGadgetCustomSubTypeIcon*               CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentCenterBoxGadgetInfo_IndexOnBox; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetCategory                               CallFunc_GetCurrentCenterBoxGadgetInfo_GadgetCategory; // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentCenterBoxGadgetInfo_CenterElementTypeIndex; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetId                                     CallFunc_GetCurrentCenterBoxGadgetInfo_GadgetId;   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetState                                  CallFunc_GetCurrentCenterBoxGadgetInfo_SelectedGadgetState; // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentCenterBoxGadgetInfo_IndexOnBox_1; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetCategory                               CallFunc_GetCurrentCenterBoxGadgetInfo_GadgetCategory_1; // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentCenterBoxGadgetInfo_CenterElementTypeIndex_1; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetId                                     CallFunc_GetCurrentCenterBoxGadgetInfo_GadgetId_1; // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGadgetState                                  CallFunc_GetCurrentCenterBoxGadgetInfo_SelectedGadgetState_1; // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0130(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0140(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0188(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0198(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01A8(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F0(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0200(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0210(0x0010)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x022C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox) == 0x000268, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, EntryPoint) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, Temp_struct_Variable) == 0x000004, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_CustomEvent_bDownRight) == 0x000018, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_CustomEvent_bDownRight' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_CustomEvent_bInImmediateReflection) == 0x000019, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_CustomEvent_bInImmediateReflection' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_CustomEvent_FinishedWidget) == 0x000020, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_CustomEvent_FinishedWidget' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_CustomEvent_InCategoryIndex) == 0x000028, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_CustomEvent_InCategoryIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, Temp_struct_Variable_1) == 0x00003C, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, Temp_struct_Variable_2) == 0x000060, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_Event_InGadgetCustomWindow) == 0x000070, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_Event_InGadgetCustomWindow' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_Event_InPlayerControllerIndex) == 0x000078, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_Event_InPlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_Event_IsDesignTime) == 0x00007C, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, Temp_struct_Variable_3) == 0x000080, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A0, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C0, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, Temp_int_Array_Index_Variable) == 0x0000D0, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_PlayAnimation_ReturnValue) == 0x0000E0, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000E8, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_IsValid_ReturnValue_1) == 0x0000F1, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_GetCurrentCenterBoxGadgetInfo_IndexOnBox) == 0x0000F4, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_GetCurrentCenterBoxGadgetInfo_IndexOnBox' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_GetCurrentCenterBoxGadgetInfo_GadgetCategory) == 0x0000F8, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_GetCurrentCenterBoxGadgetInfo_GadgetCategory' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_GetCurrentCenterBoxGadgetInfo_CenterElementTypeIndex) == 0x0000FC, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_GetCurrentCenterBoxGadgetInfo_CenterElementTypeIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_GetCurrentCenterBoxGadgetInfo_GadgetId) == 0x000100, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_GetCurrentCenterBoxGadgetInfo_GadgetId' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_GetCurrentCenterBoxGadgetInfo_SelectedGadgetState) == 0x000101, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_GetCurrentCenterBoxGadgetInfo_SelectedGadgetState' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_GetCurrentCenterBoxGadgetInfo_IndexOnBox_1) == 0x000104, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_GetCurrentCenterBoxGadgetInfo_IndexOnBox_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_GetCurrentCenterBoxGadgetInfo_GadgetCategory_1) == 0x000108, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_GetCurrentCenterBoxGadgetInfo_GadgetCategory_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_GetCurrentCenterBoxGadgetInfo_CenterElementTypeIndex_1) == 0x00010C, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_GetCurrentCenterBoxGadgetInfo_CenterElementTypeIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_GetCurrentCenterBoxGadgetInfo_GadgetId_1) == 0x000110, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_GetCurrentCenterBoxGadgetInfo_GadgetId_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_GetCurrentCenterBoxGadgetInfo_SelectedGadgetState_1) == 0x000111, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_GetCurrentCenterBoxGadgetInfo_SelectedGadgetState_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, Temp_int_Variable) == 0x000114, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_GetDisplayName_ReturnValue) == 0x000118, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000128, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Conv_StringToText_ReturnValue) == 0x000130, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_MakeStruct_FormatArgumentData) == 0x000140, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000188, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_MakeArray_Array) == 0x000198, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001A8, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Format_ReturnValue) == 0x0001F0, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_MakeArray_Array_1) == 0x000200, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Format_ReturnValue_1) == 0x000210, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Add_IntInt_ReturnValue) == 0x000220, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, Temp_int_Variable_1) == 0x000224, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, Temp_int_Loop_Counter_Variable) == 0x000228, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, K2Node_Select_Default) == 0x00022C, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Less_IntInt_ReturnValue) == 0x00023C, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Add_IntInt_ReturnValue_1) == 0x000240, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000248, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000250, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000258, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000260, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_TypeBox::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.GetCurrentItemDisplayIndex
// 0x0008 (0x0008 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_GetCurrentItemDisplayIndex final
{
public:
	int32                                         OutDisplayIndex;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_GetCurrentItemDisplayIndex) == 0x000004, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_GetCurrentItemDisplayIndex");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_GetCurrentItemDisplayIndex) == 0x000008, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_GetCurrentItemDisplayIndex");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_GetCurrentItemDisplayIndex, OutDisplayIndex) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_GetCurrentItemDisplayIndex::OutDisplayIndex' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_GetCurrentItemDisplayIndex, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_GetCurrentItemDisplayIndex::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.GetGedgetCategory
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_GetGedgetCategory final
{
public:
	EGadgetCategory                               Output_Get;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_GetGedgetCategory) == 0x000001, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_GetGedgetCategory");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_GetGedgetCategory) == 0x000001, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_GetGedgetCategory");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_GetGedgetCategory, Output_Get) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_GetGedgetCategory::Output_Get' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.GetMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_GetMode final
{
public:
	EMachineSelectMode::EMachineSelectMode        OutMode;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_GetMode) == 0x000001, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_GetMode");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_GetMode) == 0x000001, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_GetMode");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_GetMode, OutMode) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_GetMode::OutMode' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.OnInitWidgetReference
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference final
{
public:
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0010(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0040(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0050(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0060(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0088(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0098(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x00A8(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference) == 0x0000C0, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, CallFunc_Format_ReturnValue) == 0x000010, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, K2Node_MakeArray_Array_1) == 0x000028, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, CallFunc_Format_ReturnValue_1) == 0x000040, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, K2Node_MakeArray_Array_2) == 0x000050, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, CallFunc_Format_ReturnValue_2) == 0x000060, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, CallFunc_IsValid_ReturnValue_2) == 0x000070, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, CallFunc_IsValid_ReturnValue_3) == 0x000071, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, K2Node_MakeArray_Array_3) == 0x000078, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, CallFunc_Format_ReturnValue_3) == 0x000088, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, K2Node_MakeArray_Array_4) == 0x000098, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, CallFunc_Format_ReturnValue_4) == 0x0000A8, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference, CallFunc_IsValid_ReturnValue_4) == 0x0000B8, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnInitWidgetReference::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.OnScrollAnimFinishedEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_OnScrollAnimFinishedEvent final
{
public:
	class UUnionUILoopScrollBox*                  FinishedWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_OnScrollAnimFinishedEvent) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_OnScrollAnimFinishedEvent");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_OnScrollAnimFinishedEvent) == 0x000008, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_OnScrollAnimFinishedEvent");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_OnScrollAnimFinishedEvent, FinishedWidget) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_OnScrollAnimFinishedEvent::FinishedWidget' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.PlayScroll
// 0x0002 (0x0002 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_PlayScroll final
{
public:
	bool                                          bDownRight;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInImmediateReflection;                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_PlayScroll) == 0x000001, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_PlayScroll");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_PlayScroll) == 0x000002, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_PlayScroll");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_PlayScroll, bDownRight) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_PlayScroll::bDownRight' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_PlayScroll, bInImmediateReflection) == 0x000001, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_PlayScroll::bInImmediateReflection' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_PreConstruct");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_PreConstruct) == 0x000001, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_PreConstruct");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.SetFocusIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_SetFocusIndex final
{
public:
	int32                                         InCategoryIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_SetFocusIndex) == 0x000004, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_SetFocusIndex");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_SetFocusIndex) == 0x000004, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_SetFocusIndex");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_SetFocusIndex, InCategoryIndex) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_SetFocusIndex::InCategoryIndex' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.SetLightVer
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_SetLightVer final
{
public:
	bool                                          IsLight;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_SetLightVer) == 0x000001, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_SetLightVer");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_SetLightVer) == 0x000001, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_SetLightVer");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_SetLightVer, IsLight) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_SetLightVer::IsLight' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.SetMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_SetMode final
{
public:
	EMachineSelectMode::EMachineSelectMode        InMode;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_SetMode) == 0x000001, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_SetMode");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_SetMode) == 0x000001, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_SetMode");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_SetMode, InMode) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_SetMode::InMode' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.SetPlayerControllerIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_SetPlayerControllerIndex final
{
public:
	int32                                         InPlayerControllerIndex;                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_SetPlayerControllerIndex) == 0x000004, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_SetPlayerControllerIndex");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_SetPlayerControllerIndex) == 0x000004, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_SetPlayerControllerIndex");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_SetPlayerControllerIndex, InPlayerControllerIndex) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_SetPlayerControllerIndex::InPlayerControllerIndex' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.Setup
// 0x0008 (0x0008 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_Setup final
{
public:
	class UGadgetCustomWindow*                    InGadgetCustomWindow;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_Setup) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_Setup");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_Setup) == 0x000008, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_Setup");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_Setup, InGadgetCustomWindow) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_Setup::InGadgetCustomWindow' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_TypeBox.WBP_GadgetCustom_Sub_TypeBox_C.SetupGadgetIconRef
// 0x0078 (0x0078 - 0x0000)
struct WBP_GadgetCustom_Sub_TypeBox_C_SetupGadgetIconRef final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_GadgetCustom_Sub_TypeIcon_C*> K2Node_MakeArray_Array;                          // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWBP_GadgetCustom_Sub_TypeIcon_C*> K2Node_MakeArray_Array_1;                        // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWBP_GadgetCustom_Sub_TypeIcon_C*> K2Node_Select_Default;                           // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_GadgetCustom_Sub_TypeIcon_C*       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_TypeIcon_C*       CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_TypeBox_C_SetupGadgetIconRef) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_TypeBox_C_SetupGadgetIconRef");
static_assert(sizeof(WBP_GadgetCustom_Sub_TypeBox_C_SetupGadgetIconRef) == 0x000078, "Wrong size on WBP_GadgetCustom_Sub_TypeBox_C_SetupGadgetIconRef");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_SetupGadgetIconRef, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_SetupGadgetIconRef::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_TypeBox_C_SetupGadgetIconRef, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_GadgetCustom_Sub_TypeBox_C_SetupGadgetIconRef::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
