#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_GoalText

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Race_GoalText.WBP_Race_GoalText_C.ExecuteUbergraph_WBP_Race_GoalText
// 0x0014 (0x0014 - 0x0000)
struct WBP_Race_GoalText_C_ExecuteUbergraph_WBP_Race_GoalText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_GoalText_C_ExecuteUbergraph_WBP_Race_GoalText) == 0x000004, "Wrong alignment on WBP_Race_GoalText_C_ExecuteUbergraph_WBP_Race_GoalText");
static_assert(sizeof(WBP_Race_GoalText_C_ExecuteUbergraph_WBP_Race_GoalText) == 0x000014, "Wrong size on WBP_Race_GoalText_C_ExecuteUbergraph_WBP_Race_GoalText");
static_assert(offsetof(WBP_Race_GoalText_C_ExecuteUbergraph_WBP_Race_GoalText, EntryPoint) == 0x000000, "Member 'WBP_Race_GoalText_C_ExecuteUbergraph_WBP_Race_GoalText::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_GoalText_C_ExecuteUbergraph_WBP_Race_GoalText, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Race_GoalText_C_ExecuteUbergraph_WBP_Race_GoalText::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Race_GoalText.WBP_Race_GoalText_C.FireGoalAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_GoalText_C_FireGoalAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_GoalText_C_FireGoalAnim) == 0x000008, "Wrong alignment on WBP_Race_GoalText_C_FireGoalAnim");
static_assert(sizeof(WBP_Race_GoalText_C_FireGoalAnim) == 0x000008, "Wrong size on WBP_Race_GoalText_C_FireGoalAnim");
static_assert(offsetof(WBP_Race_GoalText_C_FireGoalAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_Race_GoalText_C_FireGoalAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

