#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClassSelect_Sub_CpuLevel

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_ClassSelect_Sub_CpuLevel.WBP_ClassSelect_Sub_CpuLevel_C.ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel
// 0x0010 (0x0010 - 0x0000)
struct WBP_ClassSelect_Sub_CpuLevel_C_ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_CpuLevel_C_ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel) == 0x000008, "Wrong alignment on WBP_ClassSelect_Sub_CpuLevel_C_ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel");
static_assert(sizeof(WBP_ClassSelect_Sub_CpuLevel_C_ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel) == 0x000010, "Wrong size on WBP_ClassSelect_Sub_CpuLevel_C_ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel, EntryPoint) == 0x000000, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_ExecuteUbergraph_WBP_ClassSelect_Sub_CpuLevel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_ClassSelect_Sub_CpuLevel.WBP_ClassSelect_Sub_CpuLevel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ClassSelect_Sub_CpuLevel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_CpuLevel_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ClassSelect_Sub_CpuLevel_C_PreConstruct");
static_assert(sizeof(WBP_ClassSelect_Sub_CpuLevel_C_PreConstruct) == 0x000001, "Wrong size on WBP_ClassSelect_Sub_CpuLevel_C_PreConstruct");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ClassSelect_Sub_CpuLevel.WBP_ClassSelect_Sub_CpuLevel_C.SetMenuSpeedClass
// 0x0028 (0x0028 - 0x0000)
struct WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass final
{
public:
	EMenuSpeedClassId                             Index_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass) == 0x000008, "Wrong alignment on WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass");
static_assert(sizeof(WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass) == 0x000028, "Wrong size on WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass, Index_0) == 0x000000, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass, Temp_byte_Variable) == 0x000001, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass, Temp_real_Variable) == 0x000004, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass, Temp_real_Variable_1) == 0x000008, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass, Temp_real_Variable_2) == 0x00000C, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass, Temp_real_Variable_3) == 0x000010, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass, Temp_real_Variable_4) == 0x000014, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass, K2Node_Select_Default) == 0x000018, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WBP_ClassSelect_Sub_CpuLevel_C_SetMenuSpeedClass::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

