#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_StickerColorPicker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ST_ColorDetailWindowData_structs.hpp"
#include "EColorDetailWindowMode_structs.hpp"
#include "ST_ColorDetailWindowColorItemData_structs.hpp"


namespace SDK::Params
{

// Function WBP_MachineCustom_Sub_StickerColorPicker.WBP_MachineCustom_Sub_StickerColorPicker_C.ButtonsPanel_OnDecision
// 0x0010 (0x0010 - 0x0000)
struct WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnDecision final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnDecision) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnDecision");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnDecision) == 0x000010, "Wrong size on WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnDecision");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnDecision, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnDecision::Button' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnDecision, ButtonIndex) == 0x000008, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnDecision::ButtonIndex' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerColorPicker.WBP_MachineCustom_Sub_StickerColorPicker_C.ButtonsPanel_OnFocus
// 0x0010 (0x0010 - 0x0000)
struct WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnFocus final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnFocus) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnFocus");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnFocus) == 0x000010, "Wrong size on WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnFocus");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnFocus, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnFocus::Button' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnFocus, ButtonIndex) == 0x000008, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ButtonsPanel_OnFocus::ButtonIndex' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerColorPicker.WBP_MachineCustom_Sub_StickerColorPicker_C.ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker
// 0x02B0 (0x02B0 - 0x0000)
struct WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   CallFunc_CreateButtonsPanel_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_Array_Get_Item_2;                         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<EColorDetailWindowMode, int32>           K2Node_MakeMap_Map;                                // 0x0060(0x0050)()
	TMap<EColorDetailWindowMode, struct FVector2D> K2Node_MakeMap_Map_1;                             // 0x00B0(0x0050)()
	TMap<EColorDetailWindowMode, struct FVector2D> K2Node_MakeMap_Map_2;                             // 0x0100(0x0050)()
	class UUnionUIButtonsPanel*                   CallFunc_Array_Get_Item_3;                         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_3;        // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_3;                       // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_2;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0178(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_1;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon; // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ColorDetailWindowColorItemData     CallFunc_GetItemData_OutItemData;                  // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon_1; // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ColorDetailWindowColorItemData     CallFunc_GetItemData_OutItemData_1;                // 0x01EC(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* CallFunc_Array_Get_Item_4;                // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIGridNavigationBuilder*          CallFunc_SpawnObject_ReturnValue;                  // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtonsByColumnIndex_OutButtons;       // 0x0248(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtonsByColumnIndex_OutButtons_1;     // 0x0260(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_5;                         // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_6;                         // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_7;                         // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon_2; // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker) == 0x0002B0, "Wrong size on WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, EntryPoint) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_MakeLiteralBool_ReturnValue) == 0x000004, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_CreateButtonsPanel_ReturnValue) == 0x000008, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_CreateButtonsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Array_Get_Item_2) == 0x000058, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_MakeMap_Map) == 0x000060, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_MakeMap_Map_1) == 0x0000B0, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_MakeMap_Map_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_MakeMap_Map_2) == 0x000100, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_MakeMap_Map_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Array_Get_Item_3) == 0x000150, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_CreateDelegate_OutputDelegate_3) == 0x000158, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_CustomEvent_Button_3) == 0x000168, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_CustomEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_CustomEvent_PanelIndex) == 0x000170, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_CustomEvent_PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_CustomEvent_ButtonIndex_2) == 0x000174, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_CustomEvent_ButtonIndex_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_GetAllChildren_ReturnValue) == 0x000178, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_CustomEvent_Button_2) == 0x000190, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_CustomEvent_ButtonIndex_1) == 0x000198, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_CustomEvent_ButtonIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon) == 0x0001A0, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Percent_IntInt_ReturnValue) == 0x0001AC, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_GetItemData_OutItemData) == 0x0001B0, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_GetItemData_OutItemData' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, Temp_int_Array_Index_Variable) == 0x0001C8, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_CustomEvent_Button_1) == 0x0001D0, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_CustomEvent_ButtonIndex) == 0x0001D8, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon_1) == 0x0001E0, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_DynamicCast_bSuccess_1) == 0x0001E8, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_GetItemData_OutItemData_1) == 0x0001EC, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_GetItemData_OutItemData_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Array_Get_Item_4) == 0x000208, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Array_Length_ReturnValue_1) == 0x000210, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000214, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, Temp_int_Loop_Counter_Variable) == 0x000218, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Less_IntInt_ReturnValue) == 0x00021C, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Add_IntInt_ReturnValue) == 0x000220, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_CustomEvent_Button) == 0x000228, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, Temp_int_Loop_Counter_Variable_1) == 0x000230, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_SpawnObject_ReturnValue) == 0x000238, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Less_IntInt_ReturnValue_1) == 0x000240, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Add_IntInt_ReturnValue_1) == 0x000244, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_GetButtonsByColumnIndex_OutButtons) == 0x000248, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_GetButtonsByColumnIndex_OutButtons' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Array_Length_ReturnValue_2) == 0x000258, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_GetButtonsByColumnIndex_OutButtons_1) == 0x000260, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_GetButtonsByColumnIndex_OutButtons_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Subtract_IntInt_ReturnValue) == 0x000270, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Array_Get_Item_5) == 0x000278, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Array_Get_Item_6) == 0x000280, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, Temp_int_Variable) == 0x000288, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, Temp_int_Array_Index_Variable_1) == 0x00028C, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Array_Get_Item_7) == 0x000290, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon_2) == 0x000298, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, K2Node_DynamicCast_bSuccess_2) == 0x0002A0, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Array_Add_ReturnValue) == 0x0002A4, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002A8, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker, CallFunc_Add_IntInt_ReturnValue_2) == 0x0002AC, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerColorPicker::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerColorPicker.WBP_MachineCustom_Sub_StickerColorPicker_C.PlayColorPickerIn
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerIn) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerIn");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerIn) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerIn");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerIn, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerIn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerColorPicker.WBP_MachineCustom_Sub_StickerColorPicker_C.PlayColorPickerOut
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerOut final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerOut) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerOut");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerOut) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerOut");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerOut, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_PlayColorPickerOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerColorPicker.WBP_MachineCustom_Sub_StickerColorPicker_C.Scene_OnCancel
// 0x0010 (0x0010 - 0x0000)
struct WBP_MachineCustom_Sub_StickerColorPicker_C_Scene_OnCancel final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerColorPicker_C_Scene_OnCancel) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerColorPicker_C_Scene_OnCancel");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerColorPicker_C_Scene_OnCancel) == 0x000010, "Wrong size on WBP_MachineCustom_Sub_StickerColorPicker_C_Scene_OnCancel");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_Scene_OnCancel, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_Scene_OnCancel::Button' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_Scene_OnCancel, PanelIndex) == 0x000008, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_Scene_OnCancel::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_Scene_OnCancel, ButtonIndex) == 0x00000C, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_Scene_OnCancel::ButtonIndex' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerColorPicker.WBP_MachineCustom_Sub_StickerColorPicker_C.Setup
// 0x0070 (0x0070 - 0x0000)
struct WBP_MachineCustom_Sub_StickerColorPicker_C_Setup final
{
public:
	struct FST_ColorDetailWindowData              InWindowData;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FST_ColorDetailWindowData              WindowData;                                        // 0x0038(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerColorPicker_C_Setup) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerColorPicker_C_Setup");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerColorPicker_C_Setup) == 0x000070, "Wrong size on WBP_MachineCustom_Sub_StickerColorPicker_C_Setup");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_Setup, InWindowData) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_Setup::InWindowData' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_Setup, WindowData) == 0x000038, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_Setup::WindowData' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerColorPicker.WBP_MachineCustom_Sub_StickerColorPicker_C.SurfaceButton_OnFocus
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_StickerColorPicker_C_SurfaceButton_OnFocus final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerColorPicker_C_SurfaceButton_OnFocus) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerColorPicker_C_SurfaceButton_OnFocus");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerColorPicker_C_SurfaceButton_OnFocus) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_StickerColorPicker_C_SurfaceButton_OnFocus");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerColorPicker_C_SurfaceButton_OnFocus, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerColorPicker_C_SurfaceButton_OnFocus::Button' has a wrong offset!");

}

