#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_LAP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_LAP.WBP_Race_HUD_Sub_LAP_C
// 0x0038 (0x0348 - 0x0310)
class UWBP_Race_HUD_Sub_LAP_C final : public URaceUISubLap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 flag;                                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LAP_Base;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LapCountRT;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_Tex_Denominator;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_Tex_Numerator;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Slash;                                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_LAP(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_LAP_C">();
	}
	static class UWBP_Race_HUD_Sub_LAP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_LAP_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_LAP_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_LAP_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_LAP_C) == 0x000348, "Wrong size on UWBP_Race_HUD_Sub_LAP_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_LAP_C, UberGraphFrame) == 0x000310, "Member 'UWBP_Race_HUD_Sub_LAP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_LAP_C, flag) == 0x000318, "Member 'UWBP_Race_HUD_Sub_LAP_C::flag' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_LAP_C, LAP_Base) == 0x000320, "Member 'UWBP_Race_HUD_Sub_LAP_C::LAP_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_LAP_C, LapCountRT) == 0x000328, "Member 'UWBP_Race_HUD_Sub_LAP_C::LapCountRT' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_LAP_C, NUM_Tex_Denominator) == 0x000330, "Member 'UWBP_Race_HUD_Sub_LAP_C::NUM_Tex_Denominator' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_LAP_C, NUM_Tex_Numerator) == 0x000338, "Member 'UWBP_Race_HUD_Sub_LAP_C::NUM_Tex_Numerator' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_LAP_C, Slash) == 0x000340, "Member 'UWBP_Race_HUD_Sub_LAP_C::Slash' has a wrong offset!");

}

