#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Charahead_Player

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_Charahead_Player.WBP_Race_HUD_Sub_Charahead_Player_C
// 0x0138 (0x0418 - 0x02E0)
class UWBP_Race_HUD_Sub_Charahead_Player_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DSP_RivalIcon;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MLC_PAT_CharaHead_Player;                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_CharaHead_Player;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_NUM_Main;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PAT_NUM_Outline;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_PlatformIcon;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_MLC_PlayerName;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_MLC_PlayerNumber;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_MLC_Rank;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_PlayerText;                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PlayerNumberTextMat_Body;                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PlayerNumberTextMat_Outline;                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RankTextMat_Outline;                               // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PlayerNameTextMat_Body;                            // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PlayerNameTextMat_Outline;                         // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<int32, struct FUIColorInfo>              GroupColorMap;                                     // 0x0368(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Group_Index;                                       // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               RankTextMat_Body;                                  // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<int32, struct FUIColorInfo>              PlayerColorMap;                                    // 0x03C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_Charahead_Player(int32 EntryPoint);
	void GetShapeIndex(int32 InIndex, int32* ShapeIndex);
	void PreConstruct(bool IsDesignTime);
	void SetCOMIF(bool IsCom);
	void SetCrossPlayIconIF(ECrossplayPlatform CrossplayType);
	void SetGroupIndexIF(bool IsGroup, int32 GroupIndex, bool IsForce);
	void SetLocalPlayerInfo(bool IsLocalPlayer, int32 PlayerIndex, bool IsGroup);
	void SetNameIF(const class FText& InName);
	void SetOnlineIF(bool IsRival);
	void SetOnlineInfo(bool IsRival);
	void SetPlayerIndexIF(bool IsLocalPlayer, int32 PlayerIndex);
	void SetRank(int32 NewRank);
	void SetRankIF(int32 Rank);
	void SetReaderIF(bool IsReader);
	void SetRivalIF(bool IsRival, bool IsPowerRival);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_Charahead_Player_C">();
	}
	static class UWBP_Race_HUD_Sub_Charahead_Player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_Charahead_Player_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_Charahead_Player_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_Charahead_Player_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_Charahead_Player_C) == 0x000418, "Wrong size on UWBP_Race_HUD_Sub_Charahead_Player_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, DSP_RivalIcon) == 0x0002E8, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::DSP_RivalIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, Line) == 0x0002F0, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, MLC_PAT_CharaHead_Player) == 0x0002F8, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::MLC_PAT_CharaHead_Player' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, PAT_CharaHead_Player) == 0x000300, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::PAT_CharaHead_Player' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, PAT_NUM_Main) == 0x000308, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::PAT_NUM_Main' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, PAT_NUM_Outline) == 0x000310, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::PAT_NUM_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, PAT_PlatformIcon) == 0x000318, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::PAT_PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, TXT_MLC_PlayerName) == 0x000320, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::TXT_MLC_PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, TXT_MLC_PlayerNumber) == 0x000328, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::TXT_MLC_PlayerNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, TXT_MLC_Rank) == 0x000330, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::TXT_MLC_Rank' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, WidgetSwitcher_PlayerText) == 0x000338, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::WidgetSwitcher_PlayerText' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, PlayerNumberTextMat_Body) == 0x000340, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::PlayerNumberTextMat_Body' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, PlayerNumberTextMat_Outline) == 0x000348, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::PlayerNumberTextMat_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, RankTextMat_Outline) == 0x000350, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::RankTextMat_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, PlayerNameTextMat_Body) == 0x000358, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::PlayerNameTextMat_Body' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, PlayerNameTextMat_Outline) == 0x000360, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::PlayerNameTextMat_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, GroupColorMap) == 0x000368, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::GroupColorMap' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, Group_Index) == 0x0003B8, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::Group_Index' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, RankTextMat_Body) == 0x0003C0, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::RankTextMat_Body' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Charahead_Player_C, PlayerColorMap) == 0x0003C8, "Member 'UWBP_Race_HUD_Sub_Charahead_Player_C::PlayerColorMap' has a wrong offset!");

}

