#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_GadgetCountFullWindow

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_GadgetCountFullWindow.WBP_CMN_GadgetCountFullWindow_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_CMN_GadgetCountFullWindow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USafeZone*                              SafeZone;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_GadgetCount_C*                 WBP_CMN_GadgetCount;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnAnimationOutFinished;                            // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bCountEndOut;                                      // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindItemCountWidgetAnimationEvent();
	void Construct();
	void EndCountItemCountWidget();
	void ExecuteUbergraph_WBP_CMN_GadgetCountFullWindow(int32 EntryPoint);
	void GetGadgetCountWidget(class UWBP_CMN_GadgetCount_C** OutGadgetCountWidget);
	void OnCountWidgetCountEnd();
	void OnCountWidgetInAnimFinished();
	void OnCountWidgetOutAnimFinished();
	void PlayAnimationInItemCountWidget();
	void PlayAnimationOutItemCountWidget();
	void SetupItemCountWidget(int32 InStartNumber, int32 InEndNumber, ERewardType InIconType, class UTexture2D* InIconTexture, bool bInCountEndOut, double InMaxEndTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_GadgetCountFullWindow_C">();
	}
	static class UWBP_CMN_GadgetCountFullWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_GadgetCountFullWindow_C>();
	}
};
static_assert(alignof(UWBP_CMN_GadgetCountFullWindow_C) == 0x000008, "Wrong alignment on UWBP_CMN_GadgetCountFullWindow_C");
static_assert(sizeof(UWBP_CMN_GadgetCountFullWindow_C) == 0x000310, "Wrong size on UWBP_CMN_GadgetCountFullWindow_C");
static_assert(offsetof(UWBP_CMN_GadgetCountFullWindow_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_CMN_GadgetCountFullWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCountFullWindow_C, SafeZone) == 0x0002E8, "Member 'UWBP_CMN_GadgetCountFullWindow_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCountFullWindow_C, WBP_CMN_GadgetCount) == 0x0002F0, "Member 'UWBP_CMN_GadgetCountFullWindow_C::WBP_CMN_GadgetCount' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCountFullWindow_C, OnAnimationOutFinished) == 0x0002F8, "Member 'UWBP_CMN_GadgetCountFullWindow_C::OnAnimationOutFinished' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_GadgetCountFullWindow_C, bCountEndOut) == 0x000308, "Member 'UWBP_CMN_GadgetCountFullWindow_C::bCountEndOut' has a wrong offset!");

}

