#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSwitch_Sub_DetailAnother

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CourseSwitch_Sub_DetailAnother.WBP_CourseSwitch_Sub_DetailAnother_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_CourseSwitch_Sub_DetailAnother_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG_Base;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_UVScroll;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameLine;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_CourseName;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSwitch_Sub_RingBase_C*       WBP_CourseSwitch_Sub_RingBase;                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CourseSwitch_Sub_DetailAnother(int32 EntryPoint);
	void SetCourseName(const class FText& Text);
	void Update(const struct FStageDataAssetTableRow& Table);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CourseSwitch_Sub_DetailAnother_C">();
	}
	static class UWBP_CourseSwitch_Sub_DetailAnother_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CourseSwitch_Sub_DetailAnother_C>();
	}
};
static_assert(alignof(UWBP_CourseSwitch_Sub_DetailAnother_C) == 0x000008, "Wrong alignment on UWBP_CourseSwitch_Sub_DetailAnother_C");
static_assert(sizeof(UWBP_CourseSwitch_Sub_DetailAnother_C) == 0x000310, "Wrong size on UWBP_CourseSwitch_Sub_DetailAnother_C");
static_assert(offsetof(UWBP_CourseSwitch_Sub_DetailAnother_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_CourseSwitch_Sub_DetailAnother_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_DetailAnother_C, BG_Base) == 0x0002E8, "Member 'UWBP_CourseSwitch_Sub_DetailAnother_C::BG_Base' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_DetailAnother_C, BG_UVScroll) == 0x0002F0, "Member 'UWBP_CourseSwitch_Sub_DetailAnother_C::BG_UVScroll' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_DetailAnother_C, NameLine) == 0x0002F8, "Member 'UWBP_CourseSwitch_Sub_DetailAnother_C::NameLine' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_DetailAnother_C, TXT_CourseName) == 0x000300, "Member 'UWBP_CourseSwitch_Sub_DetailAnother_C::TXT_CourseName' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSwitch_Sub_DetailAnother_C, WBP_CourseSwitch_Sub_RingBase) == 0x000308, "Member 'UWBP_CourseSwitch_Sub_DetailAnother_C::WBP_CourseSwitch_Sub_RingBase' has a wrong offset!");

}

