#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_RaceMenu_Sub_Btn

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_RaceMenu_Sub_Btn.WBP_CMN_RaceMenu_Sub_Btn_C
// 0x00D8 (0x05B8 - 0x04E0)
class UWBP_CMN_RaceMenu_Sub_Btn_C final : public UCommonRaceMenuButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Select_to_Active;                              // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_CancelBack;                             // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_Out;                                    // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_Out;                                    // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_to_Select;                              // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_Loop;                                   // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_Loop;                                   // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DSP_LobbyInvitation;                               // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NewIconWave;                                   // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Non_ActiveCover;                               // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_BtnColor;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_BtnPict;                                       // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Btn_Active;                                    // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Btn_Select;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DonpaTicketApp_Sub_TicketNumber_OnBtn_C* WBP_DonpaTicketApp_Sub_TicketNumber_OnBtn;   // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ButtonPictIndex;                                   // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonText;                                        // 0x0568(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UWidgetAnimation*                       NowLoopAnim;                                       // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         FocusAnimStatus;                                   // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnRightStickButtonPressedEvent;                    // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         NeedDonpaTicketCount;                              // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAccept;                                          // 0x059C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D[0x3];                                      // 0x059D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CMN_RaceMenu_Sub_Btn_C*>    OtherBtn;                                          // 0x05A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bIsNonActiveBtn;                                   // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AcceptKeyIgnored;                                  // 0x05B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNotAnim;                                         // 0x05B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CMN_RaceMenu_Sub_Btn(int32 EntryPoint);
	void Finished_40BD929F4097DA16BEB9BA8D6C482ACA();
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnContentSet();
	void OnFocusAnimFinished();
	void OnFocusAnimStart();
	void OnFocusBegin(const struct FFocusEvent& InFocusEvent);
	void OnFocusEnd(const struct FFocusEvent& InFocusEvent);
	void OnFocusLoop();
	void OnFocusStart();
	void OnRightStickButtonPressed();
	void OnSpecialPressed();
	void OnUnFocusAnimFinished();
	void OnUnFocusAnimStart();
	void OnUnFocusLoop();
	void OnUnFocusStart();
	void PlayOutAnim();
	void PlayUnFocusAnimation();
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent__ENTRYPOINTWBP_CMN_RaceMenu_Sub_Btn();
	void SequenceEvent__ENTRYPOINTWBP_CMN_RaceMenu_Sub_Btn_0();
	void SequenceEvent__ENTRYPOINTWBP_CMN_RaceMenu_Sub_Btn_1();
	void SequenceEvent__ENTRYPOINTWBP_CMN_RaceMenu_Sub_Btn_2();
	void SequenceEvent__ENTRYPOINTWBP_CMN_RaceMenu_Sub_Btn_3();
	void SequenceEvent__ENTRYPOINTWBP_CMN_RaceMenu_Sub_Btn_4();
	void SequenceEvent__ENTRYPOINTWBP_CMN_RaceMenu_Sub_Btn_5();
	void SequenceEvent__ENTRYPOINTWBP_CMN_RaceMenu_Sub_Btn_6();
	void SequenceEvent__ENTRYPOINTWBP_CMN_RaceMenu_Sub_Btn_7();
	void SetAccept(bool Is);
	void SetAcceptKeyIgnored(bool Value);
	void SetBtnColorIndex(int32 InIndex);
	void SetBtnPictIndex(int32 InEndMenuBtnPictIndex);
	void SetButtonText(const class FText& InText);
	void SetNewIconVisible(bool bVisible);
	void SetupLobbyInvitation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_RaceMenu_Sub_Btn_C">();
	}
	static class UWBP_CMN_RaceMenu_Sub_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_RaceMenu_Sub_Btn_C>();
	}
};
static_assert(alignof(UWBP_CMN_RaceMenu_Sub_Btn_C) == 0x000008, "Wrong alignment on UWBP_CMN_RaceMenu_Sub_Btn_C");
static_assert(sizeof(UWBP_CMN_RaceMenu_Sub_Btn_C) == 0x0005B8, "Wrong size on UWBP_CMN_RaceMenu_Sub_Btn_C");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, UberGraphFrame) == 0x0004E0, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, Btn_Select_to_Active) == 0x0004E8, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::Btn_Select_to_Active' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, Btn_Select_CancelBack) == 0x0004F0, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::Btn_Select_CancelBack' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, Btn_Active_Out) == 0x0004F8, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::Btn_Active_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, Btn_Select_Out) == 0x000500, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::Btn_Select_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, Btn_Active_to_Select) == 0x000508, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::Btn_Active_to_Select' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, Btn_Select_Loop) == 0x000510, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::Btn_Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, Btn_Active_Loop) == 0x000518, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::Btn_Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, DSP_LobbyInvitation) == 0x000520, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::DSP_LobbyInvitation' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, DSP_NewIconWave) == 0x000528, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::DSP_NewIconWave' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, DSP_Non_ActiveCover) == 0x000530, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::DSP_Non_ActiveCover' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, PAT_BtnColor) == 0x000538, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::PAT_BtnColor' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, PAT_BtnPict) == 0x000540, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::PAT_BtnPict' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, TXT_Btn_Active) == 0x000548, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::TXT_Btn_Active' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, TXT_Btn_Select) == 0x000550, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::TXT_Btn_Select' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, WBP_DonpaTicketApp_Sub_TicketNumber_OnBtn) == 0x000558, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::WBP_DonpaTicketApp_Sub_TicketNumber_OnBtn' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, ButtonPictIndex) == 0x000560, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::ButtonPictIndex' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, ButtonText) == 0x000568, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, NowLoopAnim) == 0x000578, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::NowLoopAnim' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, FocusAnimStatus) == 0x000580, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::FocusAnimStatus' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, OnRightStickButtonPressedEvent) == 0x000588, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::OnRightStickButtonPressedEvent' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, NeedDonpaTicketCount) == 0x000598, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::NeedDonpaTicketCount' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, IsAccept) == 0x00059C, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::IsAccept' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, OtherBtn) == 0x0005A0, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::OtherBtn' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, bIsNonActiveBtn) == 0x0005B0, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::bIsNonActiveBtn' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, AcceptKeyIgnored) == 0x0005B1, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::AcceptKeyIgnored' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RaceMenu_Sub_Btn_C, IsNotAnim) == 0x0005B2, "Member 'UWBP_CMN_RaceMenu_Sub_Btn_C::IsNotAnim' has a wrong offset!");

}

