#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01.WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C
// 0x0088 (0x0368 - 0x02E0)
class UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Plan_SP_Loop;                                      // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Plan_Normal_Loop;                                  // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_01;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_02;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_03;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Base_01;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Base_02;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Base_03;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Icon;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Text;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_RuleIcon;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_TimeInfo;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_L;                                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_S;                                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Rule;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Time;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FontScroll_C*                      WBP_FontScroll_Rule;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Fixed_Display(bool Fixed);
	void StartAnimation(bool Normal, bool Sp);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C">();
	}
	static class UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C>();
	}
};
static_assert(alignof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C) == 0x000008, "Wrong alignment on UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C");
static_assert(sizeof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C) == 0x000368, "Wrong size on UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, Plan_SP_Loop) == 0x0002E0, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::Plan_SP_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, Plan_Normal_Loop) == 0x0002E8, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::Plan_Normal_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, Arrow_01) == 0x0002F0, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::Arrow_01' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, Arrow_02) == 0x0002F8, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::Arrow_02' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, Arrow_03) == 0x000300, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::Arrow_03' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, Arrow_Base_01) == 0x000308, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::Arrow_Base_01' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, Arrow_Base_02) == 0x000310, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::Arrow_Base_02' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, Arrow_Base_03) == 0x000318, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::Arrow_Base_03' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, Base_Icon) == 0x000320, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::Base_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, Base_Text) == 0x000328, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::Base_Text' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, DMY_RuleIcon) == 0x000330, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::DMY_RuleIcon' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, DSP_TimeInfo) == 0x000338, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::DSP_TimeInfo' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, Line_L) == 0x000340, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::Line_L' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, Line_S) == 0x000348, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::Line_S' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, TXT_Rule) == 0x000350, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::TXT_Rule' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, TXT_Time) == 0x000358, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::TXT_Time' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C, WBP_FontScroll_Rule) == 0x000360, "Member 'UWBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C::WBP_FontScroll_Rule' has a wrong offset!");

}

