#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_Sub_RSR_5rings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UnionRun_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Result_Sub_RSR_5rings.WBP_Result_Sub_RSR_5rings_C.ExecuteUbergraph_WBP_Result_Sub_RSR_5rings
// 0x0BB0 (0x0BB0 - 0x0000)
struct WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERedstarRingAllGetType                        Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0010)(ConstParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0040(0x0010)()
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERedStarRingAcquisitionType                   Temp_byte_Variable_1;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable_1;                            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_2;                              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable_2;                              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable_3;                              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable_4;                              // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable_5;                              // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable_6;                              // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00A0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00B8(0x0010)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedStarRingAcquisitionType                   Temp_byte_Variable_7;                              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00FC(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAppRaceConfigData                     CallFunc_GetAppRaceConfigData_OutData;             // 0x0140(0x0490)()
	TArray<class UUnionRaceUIResultRedStarRing*>  K2Node_MakeArray_Array_2;                          // 0x05D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<ERedStarRingAcquisitionType>           CallFunc_GetResultRedStarRingAcquisitionType_ReturnValue; // 0x05E0(0x0010)(ReferenceParm)
	int32                                         K2Node_CustomEvent_PlayerIndex_1;                  // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedStarRingAcquisitionType                   CallFunc_Array_Get_Item;                           // 0x05F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F5[0x3];                                      // 0x05F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x05FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x05FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FE[0x2];                                      // 0x05FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PlayerIndex;                    // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedstarRingAllGetType                        CallFunc_GetResultRedStarRingAllGetType_ReturnValue; // 0x0604(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_605[0x3];                                      // 0x0605(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0610(0x0010)(ConstParm)
	class UWBP_Result_Sub_RSR_C*                  K2Node_Select_Default_1;                           // 0x0620(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index_1;                        // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x063C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63D[0x3];                                      // 0x063D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ERedStarRingAcquisitionType>           CallFunc_GetOtherResultRedStarRingAcquisitionType_ReturnValue; // 0x0640(0x0010)(ReferenceParm)
	float                                         K2Node_Select_Default_3;                           // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERedStarRingAcquisitionType                   CallFunc_Array_Get_Item_1;                         // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679[0x3];                                      // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Result_Sub_RSR_C*                  K2Node_Select_Default_5;                           // 0x0688(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_6;                           // 0x0690(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0698(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ERedStarRingAcquisitionType>           CallFunc_GetOtherResultRedStarRingAcquisitionType_ReturnValue_1; // 0x06A8(0x0010)(ReferenceParm)
	class UWBP_Result_Sub_RSR_C*                  K2Node_Select_Default_7;                           // 0x06B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAppRaceConfigData                     CallFunc_GetAppRaceConfigData_OutData_1;           // 0x06C0(0x0490)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x0B50(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0B58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedstarRingAllGetType                        CallFunc_GetResultRedStarRingAllGetType_ReturnValue_1; // 0x0B5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0B5D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5E[0x2];                                      // 0x0B5E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ERedStarRingAcquisitionType>           CallFunc_GetResultRedStarRingAcquisitionType_ReturnValue_1; // 0x0B60(0x0010)(ReferenceParm)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0B70(0x0004)()
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x0B74(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0B78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedStarRingAcquisitionType                   CallFunc_Array_Get_Item_2;                         // 0x0B79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0B7A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7B[0x1];                                      // 0x0B7B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0B7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0B80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     K2Node_Select_Default_8;                           // 0x0B81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B82[0x2];                                      // 0x0B82(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x0B84(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     K2Node_Select_Default_9;                           // 0x0B88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B89[0x3];                                      // 0x0B89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue;                  // 0x0B8C(0x0004)()
	class UWBP_Result_Sub_RSR_C*                  K2Node_Select_Default_10;                          // 0x0B90(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x0B98(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_8;              // 0x0BA0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERedstarRingAllGetType                        CallFunc_GetResultRedStarRingAllGetType_ReturnValue_2; // 0x0BA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0BA9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings) == 0x000010, "Wrong alignment on WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings");
static_assert(sizeof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings) == 0x000BB0, "Wrong size on WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, EntryPoint) == 0x000000, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_object_Variable) == 0x000008, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_byte_Variable) == 0x000018, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_text_Variable) == 0x000020, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_MakeArray_Array) == 0x000030, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Format_ReturnValue) == 0x000040, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Variable) == 0x000050, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_byte_Variable_1) == 0x000064, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_object_Variable_1) == 0x000068, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_bool_Variable) == 0x000070, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_real_Variable) == 0x000074, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_real_Variable_1) == 0x000078, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_bool_Variable_1) == 0x00007C, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_real_Variable_2) == 0x000080, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_real_Variable_3) == 0x000084, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Variable_1) == 0x000088, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_bool_Variable_2) == 0x00008C, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_byte_Variable_2) == 0x000094, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Variable_2) == 0x000098, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_byte_Variable_3) == 0x00009C, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_byte_Variable_4) == 0x00009D, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_byte_Variable_5) == 0x00009E, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_byte_Variable_6) == 0x00009F, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_MakeArray_Array_1) == 0x0000A0, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Array_Index_Variable) == 0x0000B0, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Format_ReturnValue_1) == 0x0000B8, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Loop_Counter_Variable) == 0x0000C8, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Loop_Counter_Variable_1) == 0x0000CC, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Add_IntInt_ReturnValue) == 0x0000D0, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D4, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Loop_Counter_Variable_2) == 0x0000D8, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000DC, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Array_Index_Variable_1) == 0x0000E0, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_byte_Variable_7) == 0x0000E4, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Array_Index_Variable_2) == 0x0000E8, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Loop_Counter_Variable_3) == 0x0000EC, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Less_IntInt_ReturnValue) == 0x0000F0, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000F4, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Array_Index_Variable_3) == 0x0000F8, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Event_MyGeometry) == 0x0000FC, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Event_InDeltaTime) == 0x000134, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_GetAppRaceConfigData_OutData) == 0x000140, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_GetAppRaceConfigData_OutData' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_MakeArray_Array_2) == 0x0005D0, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_GetResultRedStarRingAcquisitionType_ReturnValue) == 0x0005E0, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_GetResultRedStarRingAcquisitionType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_CustomEvent_PlayerIndex_1) == 0x0005F0, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_CustomEvent_PlayerIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Array_Get_Item) == 0x0005F4, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Array_Length_ReturnValue_1) == 0x0005F8, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Less_IntInt_ReturnValue_1) == 0x0005FC, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_SwitchEnum_CmpSuccess) == 0x0005FD, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_CustomEvent_PlayerIndex) == 0x000600, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_CustomEvent_PlayerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_GetResultRedStarRingAllGetType_ReturnValue) == 0x000604, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_GetResultRedStarRingAllGetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Variable_3) == 0x000608, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Select_Default) == 0x000610, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Select_Default_1) == 0x000620, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_SwitchEnum_CmpSuccess_1) == 0x000628, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Select_Default_2) == 0x000630, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_CustomEvent_Index_1) == 0x000638, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_CustomEvent_Index_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00063C, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_GetOtherResultRedStarRingAcquisitionType_ReturnValue) == 0x000640, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_GetOtherResultRedStarRingAcquisitionType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Select_Default_3) == 0x000650, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Select_Default_4) == 0x000654, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_PlayAnimation_ReturnValue_1) == 0x000658, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_PlayAnimation_ReturnValue_2) == 0x000660, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_PlayAnimation_ReturnValue_3) == 0x000668, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_PlayAnimation_ReturnValue_4) == 0x000670, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Array_Get_Item_1) == 0x000678, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Array_Length_ReturnValue_2) == 0x00067C, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Less_IntInt_ReturnValue_2) == 0x000680, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Select_Default_5) == 0x000688, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Select_Default_6) == 0x000690, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_PlayAnimation_ReturnValue_5) == 0x000698, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_CustomEvent_Index) == 0x0006A0, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_GetOtherResultRedStarRingAcquisitionType_ReturnValue_1) == 0x0006A8, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_GetOtherResultRedStarRingAcquisitionType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Select_Default_7) == 0x0006B8, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_GetAppRaceConfigData_OutData_1) == 0x0006C0, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_GetAppRaceConfigData_OutData_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_PlayAnimation_ReturnValue_6) == 0x000B50, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Array_LastIndex_ReturnValue) == 0x000B58, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_GetResultRedStarRingAllGetType_ReturnValue_1) == 0x000B5C, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_GetResultRedStarRingAllGetType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_SwitchEnum_CmpSuccess_2) == 0x000B5D, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_GetResultRedStarRingAcquisitionType_ReturnValue_1) == 0x000B60, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_GetResultRedStarRingAcquisitionType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_SoundPlay_ReturnValue) == 0x000B70, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x000B74, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000B78, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Array_Get_Item_2) == 0x000B79, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_SwitchEnum_CmpSuccess_3) == 0x000B7A, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Array_Length_ReturnValue_3) == 0x000B7C, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_Less_IntInt_ReturnValue_3) == 0x000B80, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Select_Default_8) == 0x000B81, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, Temp_int_Variable_4) == 0x000B84, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Select_Default_9) == 0x000B88, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_SetPanSplit_ReturnValue) == 0x000B8C, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_SetPanSplit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_Select_Default_10) == 0x000B90, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_PlayAnimation_ReturnValue_7) == 0x000B98, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_PlayAnimation_ReturnValue_8) == 0x000BA0, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_PlayAnimation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, CallFunc_GetResultRedStarRingAllGetType_ReturnValue_2) == 0x000BA8, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::CallFunc_GetResultRedStarRingAllGetType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings, K2Node_SwitchEnum_CmpSuccess_4) == 0x000BA9, "Member 'WBP_Result_Sub_RSR_5rings_C_ExecuteUbergraph_WBP_Result_Sub_RSR_5rings::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");

// Function WBP_Result_Sub_RSR_5rings.WBP_Result_Sub_RSR_5rings_C.PlayAllGetAnimation
// 0x0004 (0x0004 - 0x0000)
struct WBP_Result_Sub_RSR_5rings_C_PlayAllGetAnimation final
{
public:
	int32                                         PlayerIndex_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Sub_RSR_5rings_C_PlayAllGetAnimation) == 0x000004, "Wrong alignment on WBP_Result_Sub_RSR_5rings_C_PlayAllGetAnimation");
static_assert(sizeof(WBP_Result_Sub_RSR_5rings_C_PlayAllGetAnimation) == 0x000004, "Wrong size on WBP_Result_Sub_RSR_5rings_C_PlayAllGetAnimation");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_PlayAllGetAnimation, PlayerIndex_0) == 0x000000, "Member 'WBP_Result_Sub_RSR_5rings_C_PlayAllGetAnimation::PlayerIndex_0' has a wrong offset!");

// Function WBP_Result_Sub_RSR_5rings.WBP_Result_Sub_RSR_5rings_C.PlayRSRAnimation
// 0x0004 (0x0004 - 0x0000)
struct WBP_Result_Sub_RSR_5rings_C_PlayRSRAnimation final
{
public:
	int32                                         PlayerIndex_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Sub_RSR_5rings_C_PlayRSRAnimation) == 0x000004, "Wrong alignment on WBP_Result_Sub_RSR_5rings_C_PlayRSRAnimation");
static_assert(sizeof(WBP_Result_Sub_RSR_5rings_C_PlayRSRAnimation) == 0x000004, "Wrong size on WBP_Result_Sub_RSR_5rings_C_PlayRSRAnimation");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_PlayRSRAnimation, PlayerIndex_0) == 0x000000, "Member 'WBP_Result_Sub_RSR_5rings_C_PlayRSRAnimation::PlayerIndex_0' has a wrong offset!");

// Function WBP_Result_Sub_RSR_5rings.WBP_Result_Sub_RSR_5rings_C.SetGrayColor
// 0x0044 (0x0044 - 0x0000)
struct WBP_Result_Sub_RSR_5rings_C_SetGrayColor final
{
public:
	bool                                          IsGray;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_1;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_1;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_1;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_1;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor) == 0x000004, "Wrong alignment on WBP_Result_Sub_RSR_5rings_C_SetGrayColor");
static_assert(sizeof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor) == 0x000044, "Wrong size on WBP_Result_Sub_RSR_5rings_C_SetGrayColor");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor, IsGray) == 0x000000, "Member 'WBP_Result_Sub_RSR_5rings_C_SetGrayColor::IsGray' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor, CallFunc_BreakColor_R) == 0x000004, "Member 'WBP_Result_Sub_RSR_5rings_C_SetGrayColor::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor, CallFunc_BreakColor_G) == 0x000008, "Member 'WBP_Result_Sub_RSR_5rings_C_SetGrayColor::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor, CallFunc_BreakColor_B) == 0x00000C, "Member 'WBP_Result_Sub_RSR_5rings_C_SetGrayColor::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor, CallFunc_BreakColor_A) == 0x000010, "Member 'WBP_Result_Sub_RSR_5rings_C_SetGrayColor::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor, CallFunc_BreakColor_R_1) == 0x000014, "Member 'WBP_Result_Sub_RSR_5rings_C_SetGrayColor::CallFunc_BreakColor_R_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor, CallFunc_BreakColor_G_1) == 0x000018, "Member 'WBP_Result_Sub_RSR_5rings_C_SetGrayColor::CallFunc_BreakColor_G_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor, CallFunc_BreakColor_B_1) == 0x00001C, "Member 'WBP_Result_Sub_RSR_5rings_C_SetGrayColor::CallFunc_BreakColor_B_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor, CallFunc_BreakColor_A_1) == 0x000020, "Member 'WBP_Result_Sub_RSR_5rings_C_SetGrayColor::CallFunc_BreakColor_A_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor, CallFunc_MakeColor_ReturnValue) == 0x000024, "Member 'WBP_Result_Sub_RSR_5rings_C_SetGrayColor::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SetGrayColor, CallFunc_MakeColor_ReturnValue_1) == 0x000034, "Member 'WBP_Result_Sub_RSR_5rings_C_SetGrayColor::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");

// Function WBP_Result_Sub_RSR_5rings.WBP_Result_Sub_RSR_5rings_C.SetOtherRSRBAnimation
// 0x0004 (0x0004 - 0x0000)
struct WBP_Result_Sub_RSR_5rings_C_SetOtherRSRBAnimation final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Sub_RSR_5rings_C_SetOtherRSRBAnimation) == 0x000004, "Wrong alignment on WBP_Result_Sub_RSR_5rings_C_SetOtherRSRBAnimation");
static_assert(sizeof(WBP_Result_Sub_RSR_5rings_C_SetOtherRSRBAnimation) == 0x000004, "Wrong size on WBP_Result_Sub_RSR_5rings_C_SetOtherRSRBAnimation");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SetOtherRSRBAnimation, Index_0) == 0x000000, "Member 'WBP_Result_Sub_RSR_5rings_C_SetOtherRSRBAnimation::Index_0' has a wrong offset!");

// Function WBP_Result_Sub_RSR_5rings.WBP_Result_Sub_RSR_5rings_C.SkipRSRAnimation
// 0x0004 (0x0004 - 0x0000)
struct WBP_Result_Sub_RSR_5rings_C_SkipRSRAnimation final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Sub_RSR_5rings_C_SkipRSRAnimation) == 0x000004, "Wrong alignment on WBP_Result_Sub_RSR_5rings_C_SkipRSRAnimation");
static_assert(sizeof(WBP_Result_Sub_RSR_5rings_C_SkipRSRAnimation) == 0x000004, "Wrong size on WBP_Result_Sub_RSR_5rings_C_SkipRSRAnimation");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_SkipRSRAnimation, Index_0) == 0x000000, "Member 'WBP_Result_Sub_RSR_5rings_C_SkipRSRAnimation::Index_0' has a wrong offset!");

// Function WBP_Result_Sub_RSR_5rings.WBP_Result_Sub_RSR_5rings_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Result_Sub_RSR_5rings_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Sub_RSR_5rings_C_Tick) == 0x000004, "Wrong alignment on WBP_Result_Sub_RSR_5rings_C_Tick");
static_assert(sizeof(WBP_Result_Sub_RSR_5rings_C_Tick) == 0x00003C, "Wrong size on WBP_Result_Sub_RSR_5rings_C_Tick");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Result_Sub_RSR_5rings_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_RSR_5rings_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Result_Sub_RSR_5rings_C_Tick::InDeltaTime' has a wrong offset!");

}

