#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupSelect_2Layout

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GroupSelect_2Layout.WBP_GroupSelect_2Layout_C
// 0x0108 (0x0540 - 0x0438)
class UWBP_GroupSelect_2Layout_C final : public UGroupSelect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_Blue;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Red;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Black;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Blue;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Red;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NonActive_Base_Blue;                               // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NonActive_Base_Red;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton_80;                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         Team1MouseInteraction;                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         Team2MouseInteraction;                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      WBP_GroupSelect_Sub_Table_Line_10;                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      WBP_GroupSelect_Sub_Table_Line_11;                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      WBP_GroupSelect_Sub_Table_Line_12;                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      WBP_GroupSelect_Sub_Table_Line_01;                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      WBP_GroupSelect_Sub_Table_Line_02;                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      WBP_GroupSelect_Sub_Table_Line_03;                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      WBP_GroupSelect_Sub_Table_Line_04;                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      WBP_GroupSelect_Sub_Table_Line_05;                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      WBP_GroupSelect_Sub_Table_Line_06;                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      WBP_GroupSelect_Sub_Table_Line_07;                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      WBP_GroupSelect_Sub_Table_Line_08;                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupSelect_Sub_Table_Line_C*      WBP_GroupSelect_Sub_Table_Line_09;                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              UIEnd;                                             // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsWait;                                           // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAppPlayerController*>           PlayerControllers;                                 // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                           WatchPlateAnimationTimerHandle;                    // 0x0538(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GroupSelect_2Layout_Team1MouseInteraction_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GroupSelect_2Layout_Team2MouseInteraction_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void DeleteController();
	class UWidget* DoCustomNavigation(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_GroupSelect_2Layout(int32 EntryPoint);
	void FinishPlateMoving();
	void FocusToTop();
	void ForceDecisionGroupEvent();
	void OnCancelEvent_Event(class UUnionUIButtonBase* Button);
	void OnCancelOutAnimFinished();
	void OnChangeControllerEvent(EAppControllerInputType BeforeType, EAppControllerInputType AfterType);
	void OnDecisionEvent_Event(class UUnionUIButtonBase* Button);
	void OnDecisionOutAnimFinished();
	void OnDirectionEvent_Event(class UUnionUIButtonBase* Button, EUnionUIControlDir Dir);
	void OnInAnimFinished();
	void OnRandomTeamSelect();
	void ResetNavigation();
	void SetComHide();
	void SetUpAfterDecsition();
	void StartWatchPlateMoveFinish();
	void UpdateComponents();
	void WatchPlateMoveFinish();
	void When_Host_Event(bool IsHost);
	void WhenHostNavigation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GroupSelect_2Layout_C">();
	}
	static class UWBP_GroupSelect_2Layout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GroupSelect_2Layout_C>();
	}
};
static_assert(alignof(UWBP_GroupSelect_2Layout_C) == 0x000008, "Wrong alignment on UWBP_GroupSelect_2Layout_C");
static_assert(sizeof(UWBP_GroupSelect_2Layout_C) == 0x000540, "Wrong size on UWBP_GroupSelect_2Layout_C");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, UberGraphFrame) == 0x000438, "Member 'UWBP_GroupSelect_2Layout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, Out) == 0x000440, "Member 'UWBP_GroupSelect_2Layout_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, Loop) == 0x000448, "Member 'UWBP_GroupSelect_2Layout_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, In) == 0x000450, "Member 'UWBP_GroupSelect_2Layout_C::In' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, Base_Blue) == 0x000458, "Member 'UWBP_GroupSelect_2Layout_C::Base_Blue' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, Base_Red) == 0x000460, "Member 'UWBP_GroupSelect_2Layout_C::Base_Red' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, BG_Black) == 0x000468, "Member 'UWBP_GroupSelect_2Layout_C::BG_Black' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, Icon_Blue) == 0x000470, "Member 'UWBP_GroupSelect_2Layout_C::Icon_Blue' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, Icon_Red) == 0x000478, "Member 'UWBP_GroupSelect_2Layout_C::Icon_Red' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, NonActive_Base_Blue) == 0x000480, "Member 'UWBP_GroupSelect_2Layout_C::NonActive_Base_Blue' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, NonActive_Base_Red) == 0x000488, "Member 'UWBP_GroupSelect_2Layout_C::NonActive_Base_Red' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, OutOfContentButton_80) == 0x000490, "Member 'UWBP_GroupSelect_2Layout_C::OutOfContentButton_80' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, SafeZone) == 0x000498, "Member 'UWBP_GroupSelect_2Layout_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, Team1MouseInteraction) == 0x0004A0, "Member 'UWBP_GroupSelect_2Layout_C::Team1MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, Team2MouseInteraction) == 0x0004A8, "Member 'UWBP_GroupSelect_2Layout_C::Team2MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WBP_GroupSelect_Sub_Table_Line_10) == 0x0004B0, "Member 'UWBP_GroupSelect_2Layout_C::WBP_GroupSelect_Sub_Table_Line_10' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WBP_GroupSelect_Sub_Table_Line_11) == 0x0004B8, "Member 'UWBP_GroupSelect_2Layout_C::WBP_GroupSelect_Sub_Table_Line_11' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WBP_GroupSelect_Sub_Table_Line_12) == 0x0004C0, "Member 'UWBP_GroupSelect_2Layout_C::WBP_GroupSelect_Sub_Table_Line_12' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WBP_GroupSelect_Sub_Table_Line_01) == 0x0004C8, "Member 'UWBP_GroupSelect_2Layout_C::WBP_GroupSelect_Sub_Table_Line_01' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WBP_GroupSelect_Sub_Table_Line_02) == 0x0004D0, "Member 'UWBP_GroupSelect_2Layout_C::WBP_GroupSelect_Sub_Table_Line_02' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WBP_GroupSelect_Sub_Table_Line_03) == 0x0004D8, "Member 'UWBP_GroupSelect_2Layout_C::WBP_GroupSelect_Sub_Table_Line_03' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WBP_GroupSelect_Sub_Table_Line_04) == 0x0004E0, "Member 'UWBP_GroupSelect_2Layout_C::WBP_GroupSelect_Sub_Table_Line_04' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WBP_GroupSelect_Sub_Table_Line_05) == 0x0004E8, "Member 'UWBP_GroupSelect_2Layout_C::WBP_GroupSelect_Sub_Table_Line_05' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WBP_GroupSelect_Sub_Table_Line_06) == 0x0004F0, "Member 'UWBP_GroupSelect_2Layout_C::WBP_GroupSelect_Sub_Table_Line_06' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WBP_GroupSelect_Sub_Table_Line_07) == 0x0004F8, "Member 'UWBP_GroupSelect_2Layout_C::WBP_GroupSelect_Sub_Table_Line_07' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WBP_GroupSelect_Sub_Table_Line_08) == 0x000500, "Member 'UWBP_GroupSelect_2Layout_C::WBP_GroupSelect_Sub_Table_Line_08' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WBP_GroupSelect_Sub_Table_Line_09) == 0x000508, "Member 'UWBP_GroupSelect_2Layout_C::WBP_GroupSelect_Sub_Table_Line_09' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, UIEnd) == 0x000510, "Member 'UWBP_GroupSelect_2Layout_C::UIEnd' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, bIsWait) == 0x000520, "Member 'UWBP_GroupSelect_2Layout_C::bIsWait' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, PlayerControllers) == 0x000528, "Member 'UWBP_GroupSelect_2Layout_C::PlayerControllers' has a wrong offset!");
static_assert(offsetof(UWBP_GroupSelect_2Layout_C, WatchPlateAnimationTimerHandle) == 0x000538, "Member 'UWBP_GroupSelect_2Layout_C::WatchPlateAnimationTimerHandle' has a wrong offset!");

}

