#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSelect_Sub_CourseIcon

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CourseSelect_Sub_CourseIcon.WBP_CourseSelect_Sub_CourseIcon_C
// 0x00E8 (0x0788 - 0x06A0)
class UWBP_CourseSelect_Sub_CourseIcon_C final : public UCourseSelectSubCategoryIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Select_Loop_ForPartyRace;                      // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_TimeTrial_Select_Out;                          // 0x06B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_TimeTrial_Select_Loop;                         // 0x06B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               AnotherIcon;                                       // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CourseIcon;                                        // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Coursor_Icon_Eff;                                  // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Coursor_Icon_Eff2;                                 // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Coursor_Icon_Eff_Core;                             // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Coursor_Icon_Eff_Core2;                            // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Coursor_Icon_LightGlare;                           // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_CourseSelect;                               // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_CourseSelect_1;                             // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_GrandPrixIcon_Eff;                             // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockIcon;                                          // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MedalSlot_Set;                                     // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MF_GateQuestion;                                   // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseInteraction;                                  // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Eff_Set;                                   // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_CourseIcon;                                    // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_CourseIcon_EmeraldMask;                        // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RingEff_Light;                                     // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_C*                 WBP_CMN_TextBalloon;                               // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_Trophy_C*         WBP_CourseSelect_Sub_Trophy;                       // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TimeTrial_MedalSlot_C*             WBP_TimeTrial_MedalSlot;                           // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_CourseIcon;                         // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Cursor;                             // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Locking;                                           // 0x0778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_779[0x7];                                      // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       NowLoopAnim;                                       // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon(int32 EntryPoint);
	void OnBackKeyPressed();
	void OnLeftKeyPressed();
	void OnLeftShoulderPressed();
	void OnRightKeyPressed();
	void OnRightShoulderPressed();
	void SelectMedalView(int32 InIndex);
	void SelectMedalViewEnd();
	void SetGrandprixIconId(EGrandPrixId IconId);
	void SetGrandprixId(uint8 GrandPrixId_0);
	void SetLock(bool bLock, bool DecidableIfLocked);
	void SetLockStatus(bool bLock, bool DecidableIfLocked);
	void SetMouseInteractionButtonVisible(ESlateVisibility InVisibility);
	void SetTimeTrialMedal(const TArray<ETimeTrialClearRankId>& InTimeTrialClearRanks);
	void SetWaitAnimationDecide();
	void StartSelectAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CourseSelect_Sub_CourseIcon_C">();
	}
	static class UWBP_CourseSelect_Sub_CourseIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CourseSelect_Sub_CourseIcon_C>();
	}
};
static_assert(alignof(UWBP_CourseSelect_Sub_CourseIcon_C) == 0x000008, "Wrong alignment on UWBP_CourseSelect_Sub_CourseIcon_C");
static_assert(sizeof(UWBP_CourseSelect_Sub_CourseIcon_C) == 0x000788, "Wrong size on UWBP_CourseSelect_Sub_CourseIcon_C");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, UberGraphFrame) == 0x0006A0, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, Btn_Select_Loop_ForPartyRace) == 0x0006A8, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::Btn_Select_Loop_ForPartyRace' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, Btn_TimeTrial_Select_Out) == 0x0006B0, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::Btn_TimeTrial_Select_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, Btn_TimeTrial_Select_Loop) == 0x0006B8, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::Btn_TimeTrial_Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, AnotherIcon) == 0x0006C0, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::AnotherIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, CourseIcon) == 0x0006C8, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::CourseIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, Coursor_Icon_Eff) == 0x0006D0, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::Coursor_Icon_Eff' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, Coursor_Icon_Eff2) == 0x0006D8, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::Coursor_Icon_Eff2' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, Coursor_Icon_Eff_Core) == 0x0006E0, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::Coursor_Icon_Eff_Core' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, Coursor_Icon_Eff_Core2) == 0x0006E8, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::Coursor_Icon_Eff_Core2' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, Coursor_Icon_LightGlare) == 0x0006F0, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::Coursor_Icon_LightGlare' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, Cursor_CourseSelect) == 0x0006F8, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::Cursor_CourseSelect' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, Cursor_CourseSelect_1) == 0x000700, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::Cursor_CourseSelect_1' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, DSP_GrandPrixIcon_Eff) == 0x000708, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::DSP_GrandPrixIcon_Eff' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, LockIcon) == 0x000710, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::LockIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, MedalSlot_Set) == 0x000718, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::MedalSlot_Set' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, MF_GateQuestion) == 0x000720, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::MF_GateQuestion' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, MouseInteraction) == 0x000728, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, Overlay_Eff_Set) == 0x000730, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::Overlay_Eff_Set' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, PAT_CourseIcon) == 0x000738, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::PAT_CourseIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, PAT_CourseIcon_EmeraldMask) == 0x000740, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::PAT_CourseIcon_EmeraldMask' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, RingEff_Light) == 0x000748, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::RingEff_Light' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, WBP_CMN_TextBalloon) == 0x000750, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::WBP_CMN_TextBalloon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, WBP_CourseSelect_Sub_Trophy) == 0x000758, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::WBP_CourseSelect_Sub_Trophy' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, WBP_TimeTrial_MedalSlot) == 0x000760, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::WBP_TimeTrial_MedalSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, WidgetSwitcher_CourseIcon) == 0x000768, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::WidgetSwitcher_CourseIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, WidgetSwitcher_Cursor) == 0x000770, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::WidgetSwitcher_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, Locking) == 0x000778, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::Locking' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_CourseIcon_C, NowLoopAnim) == 0x000780, "Member 'UWBP_CourseSelect_Sub_CourseIcon_C::NowLoopAnim' has a wrong offset!");

}

