#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetCustom_ScrollSnapPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GadgetCustom_ScrollSnapPoint.WBP_GadgetCustom_ScrollSnapPoint_C.ExecuteUbergraph_WBP_GadgetCustom_ScrollSnapPoint
// 0x0004 (0x0004 - 0x0000)
struct WBP_GadgetCustom_ScrollSnapPoint_C_ExecuteUbergraph_WBP_GadgetCustom_ScrollSnapPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_ScrollSnapPoint_C_ExecuteUbergraph_WBP_GadgetCustom_ScrollSnapPoint) == 0x000004, "Wrong alignment on WBP_GadgetCustom_ScrollSnapPoint_C_ExecuteUbergraph_WBP_GadgetCustom_ScrollSnapPoint");
static_assert(sizeof(WBP_GadgetCustom_ScrollSnapPoint_C_ExecuteUbergraph_WBP_GadgetCustom_ScrollSnapPoint) == 0x000004, "Wrong size on WBP_GadgetCustom_ScrollSnapPoint_C_ExecuteUbergraph_WBP_GadgetCustom_ScrollSnapPoint");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_ExecuteUbergraph_WBP_GadgetCustom_ScrollSnapPoint, EntryPoint) == 0x000000, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_ExecuteUbergraph_WBP_GadgetCustom_ScrollSnapPoint::EntryPoint' has a wrong offset!");

// Function WBP_GadgetCustom_ScrollSnapPoint.WBP_GadgetCustom_ScrollSnapPoint_C.Resize
// 0x0060 (0x0060 - 0x0000)
struct WBP_GadgetCustom_ScrollSnapPoint_C_Resize final
{
public:
	int32                                         InNewSize;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_GadgetCustom_SnapPoint_C*          CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize) == 0x000008, "Wrong alignment on WBP_GadgetCustom_ScrollSnapPoint_C_Resize");
static_assert(sizeof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize) == 0x000060, "Wrong size on WBP_GadgetCustom_ScrollSnapPoint_C_Resize");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, InNewSize) == 0x000000, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::InNewSize' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, Temp_int_Variable) == 0x000014, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, CallFunc_Create_ReturnValue) == 0x000048, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_ScrollSnapPoint_C_Resize, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000058, "Member 'WBP_GadgetCustom_ScrollSnapPoint_C_Resize::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

}

