#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo.WBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C final : public UUserWidget
{
public:
	class UImage*                                 RedBase_s;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RivalIcon_High;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RivalIcon_Normal;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_RivalRacer_2;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_RivalIcon;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetRivalType(ERivalType In_RivalType);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C">();
	}
	static class UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C>();
	}
};
static_assert(alignof(UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C) == 0x000008, "Wrong alignment on UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C");
static_assert(sizeof(UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C) == 0x000308, "Wrong size on UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C, RedBase_s) == 0x0002E0, "Member 'UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C::RedBase_s' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C, RivalIcon_High) == 0x0002E8, "Member 'UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C::RivalIcon_High' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C, RivalIcon_Normal) == 0x0002F0, "Member 'UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C::RivalIcon_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C, TXT_RivalRacer_2) == 0x0002F8, "Member 'UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C::TXT_RivalRacer_2' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C, WS_RivalIcon) == 0x000300, "Member 'UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C::WS_RivalIcon' has a wrong offset!");

}

