#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SonicLogo_Movie

#include "Basic.hpp"

#include "CriWareRuntime_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SonicLogo_Movie.WBP_SonicLogo_Movie_C
// 0x0078 (0x0458 - 0x03E0)
class UWBP_SonicLogo_Movie_C final : public UAdvertiseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ManaImage;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           WaitTimerLogoHandle;                               // 0x0410(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              FinishedLogosOutAnimation;                         // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUnionManaPlayer*                       UnionManaPlayer;                                   // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   MovieName;                                         // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAtomComponent*                         AtomComp;                                          // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              SkipSonicLogoMovie;                                // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         MovieIndex;                                        // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MovieCount;                                        // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimationIn();
	void Construct();
	void Conv_Timeto_Text(int32 Min, int32 Sec, int32 MiliSec, class FText* Text);
	void ExecuteUbergraph_WBP_SonicLogo_Movie(int32 EntryPoint);
	void FinishAdvertiseMovie();
	void FinishedMovie();
	void InitialiseMovie(const int32 MovieListIndex);
	void OnMovieClosedEvent();
	void SkipAdvertiseLogo();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SonicLogo_Movie_C">();
	}
	static class UWBP_SonicLogo_Movie_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SonicLogo_Movie_C>();
	}
};
static_assert(alignof(UWBP_SonicLogo_Movie_C) == 0x000008, "Wrong alignment on UWBP_SonicLogo_Movie_C");
static_assert(sizeof(UWBP_SonicLogo_Movie_C) == 0x000458, "Wrong size on UWBP_SonicLogo_Movie_C");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, UberGraphFrame) == 0x0003E0, "Member 'UWBP_SonicLogo_Movie_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, Out) == 0x0003E8, "Member 'UWBP_SonicLogo_Movie_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, Loop) == 0x0003F0, "Member 'UWBP_SonicLogo_Movie_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, In) == 0x0003F8, "Member 'UWBP_SonicLogo_Movie_C::In' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, CanvasPanel) == 0x000400, "Member 'UWBP_SonicLogo_Movie_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, ManaImage) == 0x000408, "Member 'UWBP_SonicLogo_Movie_C::ManaImage' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, WaitTimerLogoHandle) == 0x000410, "Member 'UWBP_SonicLogo_Movie_C::WaitTimerLogoHandle' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, FinishedLogosOutAnimation) == 0x000418, "Member 'UWBP_SonicLogo_Movie_C::FinishedLogosOutAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, UnionManaPlayer) == 0x000428, "Member 'UWBP_SonicLogo_Movie_C::UnionManaPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, MovieName) == 0x000430, "Member 'UWBP_SonicLogo_Movie_C::MovieName' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, AtomComp) == 0x000438, "Member 'UWBP_SonicLogo_Movie_C::AtomComp' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, SkipSonicLogoMovie) == 0x000440, "Member 'UWBP_SonicLogo_Movie_C::SkipSonicLogoMovie' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, MovieIndex) == 0x000450, "Member 'UWBP_SonicLogo_Movie_C::MovieIndex' has a wrong offset!");
static_assert(offsetof(UWBP_SonicLogo_Movie_C, MovieCount) == 0x000454, "Member 'UWBP_SonicLogo_Movie_C::MovieCount' has a wrong offset!");

}

