#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_Sub_RankingTable_MatchPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result_Sub_RankingTable_MatchPoint.WBP_Result_Sub_RankingTable_MatchPoint_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_Result_Sub_RankingTable_MatchPoint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MatchPoint_Out;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MatchPoint_Loop;                                   // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MatchPoint_In;                                     // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_MatchPoint;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Close();
	void ExecuteUbergraph_WBP_Result_Sub_RankingTable_MatchPoint(int32 EntryPoint);
	void Open();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Result_Sub_RankingTable_MatchPoint_C">();
	}
	static class UWBP_Result_Sub_RankingTable_MatchPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_Sub_RankingTable_MatchPoint_C>();
	}
};
static_assert(alignof(UWBP_Result_Sub_RankingTable_MatchPoint_C) == 0x000008, "Wrong alignment on UWBP_Result_Sub_RankingTable_MatchPoint_C");
static_assert(sizeof(UWBP_Result_Sub_RankingTable_MatchPoint_C) == 0x000308, "Wrong size on UWBP_Result_Sub_RankingTable_MatchPoint_C");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_MatchPoint_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Result_Sub_RankingTable_MatchPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_MatchPoint_C, MatchPoint_Out) == 0x0002E8, "Member 'UWBP_Result_Sub_RankingTable_MatchPoint_C::MatchPoint_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_MatchPoint_C, MatchPoint_Loop) == 0x0002F0, "Member 'UWBP_Result_Sub_RankingTable_MatchPoint_C::MatchPoint_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_MatchPoint_C, MatchPoint_In) == 0x0002F8, "Member 'UWBP_Result_Sub_RankingTable_MatchPoint_C::MatchPoint_In' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_MatchPoint_C, TXT_MatchPoint) == 0x000300, "Member 'UWBP_Result_Sub_RankingTable_MatchPoint_C::TXT_MatchPoint' has a wrong offset!");

}

