#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_System_Loading_Simple

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_System_Loading_Simple.WBP_System_Loading_Simple_C
// 0x0058 (0x0358 - 0x0300)
class UWBP_System_Loading_Simple_C final : public UUnionUILoadingDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loading_Short_Out;                                 // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loading_Short_Loop;                                // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loading_Short_In;                                  // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Balloon_01;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Balloon_02;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cloud_01;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cloud_02;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_System;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_System_Sub_LoadingSonic_C*         WBP_System_Sub_LoadingSonic;                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_System_Loading_Simple(int32 EntryPoint);
	ELoadingDisplayType GetLoadingDisplayType();
	void Hide();
	void OnHideAnimationFinished();
	void ProceedLoadingPhase();
	void SetLoadingGaugeParam(int32 LoadingPhaseNum, bool bSetProgress);
	void SetLoadingProgress(float LoadingProgress);
	void Show();
	void StartLoading();
	void UpdateLoadingPhase(int32 EndLoadingPhase);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_System_Loading_Simple_C">();
	}
	static class UWBP_System_Loading_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_System_Loading_Simple_C>();
	}
};
static_assert(alignof(UWBP_System_Loading_Simple_C) == 0x000008, "Wrong alignment on UWBP_System_Loading_Simple_C");
static_assert(sizeof(UWBP_System_Loading_Simple_C) == 0x000358, "Wrong size on UWBP_System_Loading_Simple_C");
static_assert(offsetof(UWBP_System_Loading_Simple_C, UberGraphFrame) == 0x000300, "Member 'UWBP_System_Loading_Simple_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_System_Loading_Simple_C, Loading_Short_Out) == 0x000308, "Member 'UWBP_System_Loading_Simple_C::Loading_Short_Out' has a wrong offset!");
static_assert(offsetof(UWBP_System_Loading_Simple_C, Loading_Short_Loop) == 0x000310, "Member 'UWBP_System_Loading_Simple_C::Loading_Short_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_System_Loading_Simple_C, Loading_Short_In) == 0x000318, "Member 'UWBP_System_Loading_Simple_C::Loading_Short_In' has a wrong offset!");
static_assert(offsetof(UWBP_System_Loading_Simple_C, Balloon_01) == 0x000320, "Member 'UWBP_System_Loading_Simple_C::Balloon_01' has a wrong offset!");
static_assert(offsetof(UWBP_System_Loading_Simple_C, Balloon_02) == 0x000328, "Member 'UWBP_System_Loading_Simple_C::Balloon_02' has a wrong offset!");
static_assert(offsetof(UWBP_System_Loading_Simple_C, CanvasPanel_0) == 0x000330, "Member 'UWBP_System_Loading_Simple_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_System_Loading_Simple_C, Cloud_01) == 0x000338, "Member 'UWBP_System_Loading_Simple_C::Cloud_01' has a wrong offset!");
static_assert(offsetof(UWBP_System_Loading_Simple_C, Cloud_02) == 0x000340, "Member 'UWBP_System_Loading_Simple_C::Cloud_02' has a wrong offset!");
static_assert(offsetof(UWBP_System_Loading_Simple_C, SafeZone_System) == 0x000348, "Member 'UWBP_System_Loading_Simple_C::SafeZone_System' has a wrong offset!");
static_assert(offsetof(UWBP_System_Loading_Simple_C, WBP_System_Sub_LoadingSonic) == 0x000350, "Member 'UWBP_System_Loading_Simple_C::WBP_System_Sub_LoadingSonic' has a wrong offset!");

}

