#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_SubMenu_Btn

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.Check Release Response InputType
// 0x0028 (0x0028 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType final
{
public:
	bool                                          bOutReleaseResponseInput;                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppControllerInputType                       CallFunc_GetCurrentInputType_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType) == 0x000008, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType) == 0x000028, "Wrong size on WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType, bOutReleaseResponseInput) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType::bOutReleaseResponseInput' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000018, "Member 'WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType, CallFunc_GetCurrentInputType_ReturnValue) == 0x000021, "Member 'WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType, K2Node_SwitchEnum_CmpSuccess) == 0x000022, "Member 'WBP_Friend_SubMenu_Btn_C_Check_Release_Response_InputType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.ExecuteUbergraph_WBP_Friend_SubMenu_Btn
// 0x0138 (0x0138 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIButtonSoundSetting                    Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIButtonSoundSetting                    Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIButtonSoundSetting                    Temp_byte_Variable_3;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIButtonSoundSetting                    Temp_byte_Variable_4;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0014(0x0004)()
	EButtonFocusType                              Temp_byte_Variable_6;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText_1;                       // 0x0020(0x0010)()
	bool                                          K2Node_CustomEvent_bInVisible_1;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTerminologyTextByText_ReturnValue;     // 0x0038(0x0010)()
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0048(0x0010)()
	class FText                                   CallFunc_GetTerminologyTextByText_ReturnValue_1;   // 0x0058(0x0010)()
	bool                                          K2Node_CustomEvent_bInEnable_3;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInVisible;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              K2Node_CustomEvent_InButtonFocusType;              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInEnable_2;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              K2Node_Select_Default;                             // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInPlayFocusSound;              // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIButtonSoundSetting                    K2Node_Select_Default_1;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInEnable_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_2;                       // 0x0074(0x0008)(NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0088(0x0008)(NoDestructor)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue_1;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUserIndexByFocusEvent_ReturnValue;     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00A0(0x0008)(NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x00B0(0x0004)()
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue_2;            // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInEnable;                      // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_4;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionUIButtonSoundSetting                    K2Node_Select_Default_5;                           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x00E4(0x0004)()
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_2;      // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue;           // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue_1;         // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn) == 0x000008, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn) == 0x000138, "Wrong size on WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, EntryPoint) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_byte_Variable) == 0x000004, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_Variable) == 0x000005, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_byte_Variable_2) == 0x000007, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_Variable_1) == 0x000008, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_Variable_2) == 0x000009, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_Variable_3) == 0x00000A, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_Variable_4) == 0x00000B, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_byte_Variable_3) == 0x00000C, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_byte_Variable_4) == 0x00000D, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_IsClosed_Variable) == 0x00000E, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_byte_Variable_5) == 0x00000F, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000010, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x000011, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_Has_Been_Initd_Variable) == 0x000012, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_SwitchEnum_CmpSuccess) == 0x000013, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_SoundPlay_ReturnValue) == 0x000014, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_byte_Variable_6) == 0x000018, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_CustomEvent_InText_1) == 0x000020, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_CustomEvent_InText_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_CustomEvent_bInVisible_1) == 0x000030, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_CustomEvent_bInVisible_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_GetTerminologyTextByText_ReturnValue) == 0x000038, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_GetTerminologyTextByText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_CustomEvent_InText) == 0x000048, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_GetTerminologyTextByText_ReturnValue_1) == 0x000058, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_GetTerminologyTextByText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_CustomEvent_bInEnable_3) == 0x000068, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_CustomEvent_bInEnable_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_CustomEvent_bInVisible) == 0x000069, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_CustomEvent_bInVisible' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_CustomEvent_InButtonFocusType) == 0x00006A, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_CustomEvent_InButtonFocusType' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_CustomEvent_bInEnable_2) == 0x00006B, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_CustomEvent_bInEnable_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_Variable_5) == 0x00006C, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_HasAnyUserFocus_ReturnValue) == 0x00006D, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_Select_Default) == 0x00006E, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_CustomEvent_bInPlayFocusSound) == 0x00006F, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_CustomEvent_bInPlayFocusSound' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_Select_Default_1) == 0x000070, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_CustomEvent_bInEnable_1) == 0x000071, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_CustomEvent_bInEnable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_Event_InFocusEvent_2) == 0x000074, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_Event_InFocusEvent_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_CustomEvent_Button) == 0x000080, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_Event_InFocusEvent_1) == 0x000088, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_HasAnyUserFocus_ReturnValue_1) == 0x000090, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_HasAnyUserFocus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_GetUserIndexByFocusEvent_ReturnValue) == 0x000094, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_GetUserIndexByFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_GetPlayerController_ReturnValue) == 0x000098, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_Event_InFocusEvent) == 0x0000A0, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_Has_Been_Initd_Variable_1) == 0x0000A8, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_Variable_6) == 0x0000A9, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_IsClosed_Variable_1) == 0x0000AA, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000AB, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_byte_Variable_7) == 0x0000AC, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000AD, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_SoundPlay_ReturnValue_1) == 0x0000B0, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_HasAnyUserFocus_ReturnValue_2) == 0x0000B4, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_HasAnyUserFocus_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_CustomEvent_bInEnable) == 0x0000B5, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_CustomEvent_bInEnable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_byte_Variable_8) == 0x0000B6, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_Select_Default_2) == 0x0000B8, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_Select_Default_3) == 0x0000C0, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_Select_Default_4) == 0x0000C8, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_Select_Default_5) == 0x0000D0, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_PlayAnimation_ReturnValue) == 0x0000D8, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_bool_Variable_7) == 0x0000E0, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_SoundPlay_ReturnValue_2) == 0x0000E4, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_Select_Default_6) == 0x0000E8, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, Temp_byte_Variable_9) == 0x0000E9, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000F0, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_DynamicCast_AsApp_Player_Controller) == 0x0000F8, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_Select_Default_7) == 0x000101, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_GetPlayerController_ReturnValue_2) == 0x000108, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_GetPlayerController_ReturnValue_3) == 0x000110, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x000118, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_DynamicCast_bSuccess_1) == 0x000120, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_DynamicCast_AsApp_Player_Controller_2) == 0x000128, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_DynamicCast_AsApp_Player_Controller_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_UnregisterMainMenu_ReturnValue) == 0x000131, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_UnregisterMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn, CallFunc_UnregisterMainMenu_ReturnValue_1) == 0x000132, "Member 'WBP_Friend_SubMenu_Btn_C_ExecuteUbergraph_WBP_Friend_SubMenu_Btn::CallFunc_UnregisterMainMenu_ReturnValue_1' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_Friend_SubMenu_Btn_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.OnFocusImpl
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_OnFocusImpl final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_OnFocusImpl) == 0x000008, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_OnFocusImpl");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_OnFocusImpl) == 0x000008, "Wrong size on WBP_Friend_SubMenu_Btn_C_OnFocusImpl");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_OnFocusImpl, Button) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_OnFocusImpl::Button' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_OnFocusLost");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_OnFocusLost) == 0x000008, "Wrong size on WBP_Friend_SubMenu_Btn_C_OnFocusLost");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_OnFocusReceived");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Friend_SubMenu_Btn_C_OnFocusReceived");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Friend_SubMenu_Btn_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Friend_SubMenu_Btn_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'WBP_Friend_SubMenu_Btn_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_Friend_SubMenu_Btn_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.SetButtonDetailText
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_SetButtonDetailText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_SetButtonDetailText) == 0x000008, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_SetButtonDetailText");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_SetButtonDetailText) == 0x000010, "Wrong size on WBP_Friend_SubMenu_Btn_C_SetButtonDetailText");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_SetButtonDetailText, InText) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_SetButtonDetailText::InText' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.SetButtonExplansion
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_SetButtonExplansion final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_SetButtonExplansion) == 0x000001, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_SetButtonExplansion");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_SetButtonExplansion) == 0x000001, "Wrong size on WBP_Friend_SubMenu_Btn_C_SetButtonExplansion");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_SetButtonExplansion, bInEnable) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_SetButtonExplansion::bInEnable' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.SetButtonFocusType
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_SetButtonFocusType final
{
public:
	EButtonFocusType                              InButtonFocusType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_SetButtonFocusType) == 0x000001, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_SetButtonFocusType");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_SetButtonFocusType) == 0x000001, "Wrong size on WBP_Friend_SubMenu_Btn_C_SetButtonFocusType");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_SetButtonFocusType, InButtonFocusType) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_SetButtonFocusType::InButtonFocusType' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.SetButtonText
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_SetButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_SetButtonText) == 0x000008, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_SetButtonText");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_SetButtonText) == 0x000010, "Wrong size on WBP_Friend_SubMenu_Btn_C_SetButtonText");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_SetButtonText, InText) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_SetButtonText::InText' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.SetCursorTextureVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_SetCursorTextureVisible final
{
public:
	bool                                          bInVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_SetCursorTextureVisible) == 0x000001, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_SetCursorTextureVisible");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_SetCursorTextureVisible) == 0x000001, "Wrong size on WBP_Friend_SubMenu_Btn_C_SetCursorTextureVisible");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_SetCursorTextureVisible, bInVisible) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_SetCursorTextureVisible::bInVisible' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.SetDecisionEnable
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_SetDecisionEnable final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_SetDecisionEnable) == 0x000001, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_SetDecisionEnable");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_SetDecisionEnable) == 0x000001, "Wrong size on WBP_Friend_SubMenu_Btn_C_SetDecisionEnable");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_SetDecisionEnable, bInEnable) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_SetDecisionEnable::bInEnable' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.SetFocusDisplay
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_SetFocusDisplay final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_SetFocusDisplay) == 0x000001, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_SetFocusDisplay");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_SetFocusDisplay) == 0x000001, "Wrong size on WBP_Friend_SubMenu_Btn_C_SetFocusDisplay");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_SetFocusDisplay, bInEnable) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_SetFocusDisplay::bInEnable' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.SetMouseInteractionVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_SetMouseInteractionVisible final
{
public:
	bool                                          bInVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_SetMouseInteractionVisible) == 0x000001, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_SetMouseInteractionVisible");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_SetMouseInteractionVisible) == 0x000001, "Wrong size on WBP_Friend_SubMenu_Btn_C_SetMouseInteractionVisible");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_SetMouseInteractionVisible, bInVisible) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_SetMouseInteractionVisible::bInVisible' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.SetPlayDecisionSe
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_SetPlayDecisionSe final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_SetPlayDecisionSe) == 0x000001, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_SetPlayDecisionSe");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_SetPlayDecisionSe) == 0x000001, "Wrong size on WBP_Friend_SubMenu_Btn_C_SetPlayDecisionSe");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_SetPlayDecisionSe, bInEnable) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_SetPlayDecisionSe::bInEnable' has a wrong offset!");

// Function WBP_Friend_SubMenu_Btn.WBP_Friend_SubMenu_Btn_C.SetWidgetFocus
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_SubMenu_Btn_C_SetWidgetFocus final
{
public:
	bool                                          bInPlayFocusSound;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_SubMenu_Btn_C_SetWidgetFocus) == 0x000001, "Wrong alignment on WBP_Friend_SubMenu_Btn_C_SetWidgetFocus");
static_assert(sizeof(WBP_Friend_SubMenu_Btn_C_SetWidgetFocus) == 0x000001, "Wrong size on WBP_Friend_SubMenu_Btn_C_SetWidgetFocus");
static_assert(offsetof(WBP_Friend_SubMenu_Btn_C_SetWidgetFocus, bInPlayFocusSound) == 0x000000, "Member 'WBP_Friend_SubMenu_Btn_C_SetWidgetFocus::bInPlayFocusSound' has a wrong offset!");

}

