#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu_Sub_BtnMode_Offline

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TopMenu_Sub_BtnMode_Offline.WBP_TopMenu_Sub_BtnMode_Offline_C
// 0x0090 (0x0560 - 0x04D0)
class UWBP_TopMenu_Sub_BtnMode_Offline_C final : public UTopMenuGameModeButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Active_Out;                                    // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_NonActive_Loop;                                // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_Left_02;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Right_02;                                    // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corsor_BtnPlay;                                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DSP_Racepark_Pop;                                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopMenu_Sub_Icon_PlayBonus_C*      DSP_WBP_TopMenu_Sub_Icon_PlayBonus;                // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlagWave;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlagWave_Cover;                                // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_BtnMode;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FontScroll_C*                      WBP_FontScroll_RacePark;                           // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopMenu_Btnmode_Sub_Offine_Grandprix_C* WBP_TopMenu_Btnmode_Sub_Offine_Grandprix;     // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopMenu_Btnmode_Sub_Offine_Party_C* WBP_TopMenu_Btnmode_Sub_Offine_Party;             // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C* WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack;   // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Btn_Image;                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TopMenu_Sub_BtnMode_Offline(int32 EntryPoint);
	void JudgeMenuClose();
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInitialize();
	void PreConstruct(bool IsDesignTime);
	void SetIcon(ECommonMenuButtonType Type);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TopMenu_Sub_BtnMode_Offline_C">();
	}
	static class UWBP_TopMenu_Sub_BtnMode_Offline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TopMenu_Sub_BtnMode_Offline_C>();
	}
};
static_assert(alignof(UWBP_TopMenu_Sub_BtnMode_Offline_C) == 0x000008, "Wrong alignment on UWBP_TopMenu_Sub_BtnMode_Offline_C");
static_assert(sizeof(UWBP_TopMenu_Sub_BtnMode_Offline_C) == 0x000560, "Wrong size on UWBP_TopMenu_Sub_BtnMode_Offline_C");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, UberGraphFrame) == 0x0004D0, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, Btn_Active_Out) == 0x0004D8, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::Btn_Active_Out' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, Btn_NonActive_Loop) == 0x0004E0, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::Btn_NonActive_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, Arrow_Left_02) == 0x0004E8, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::Arrow_Left_02' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, Arrow_Right_02) == 0x0004F0, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::Arrow_Right_02' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, Border_0) == 0x0004F8, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::Border_0' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, Corsor_BtnPlay) == 0x000500, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::Corsor_BtnPlay' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, DSP_Racepark_Pop) == 0x000508, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::DSP_Racepark_Pop' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, DSP_WBP_TopMenu_Sub_Icon_PlayBonus) == 0x000510, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::DSP_WBP_TopMenu_Sub_Icon_PlayBonus' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, MouseInteraction) == 0x000518, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, RaceFlagWave) == 0x000520, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::RaceFlagWave' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, RaceFlagWave_Cover) == 0x000528, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::RaceFlagWave_Cover' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, TXT_BtnMode) == 0x000530, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::TXT_BtnMode' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, WBP_FontScroll_RacePark) == 0x000538, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::WBP_FontScroll_RacePark' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, WBP_TopMenu_Btnmode_Sub_Offine_Grandprix) == 0x000540, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::WBP_TopMenu_Btnmode_Sub_Offine_Grandprix' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, WBP_TopMenu_Btnmode_Sub_Offine_Party) == 0x000548, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::WBP_TopMenu_Btnmode_Sub_Offine_Party' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack) == 0x000550, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnMode_Offline_C, WidgetSwitcher_Btn_Image) == 0x000558, "Member 'UWBP_TopMenu_Sub_BtnMode_Offline_C::WidgetSwitcher_Btn_Image' has a wrong offset!");

}

