#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_Tab

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_Tab.WBP_MachineCustom_Sub_Tab_C
// 0x0048 (0x0360 - 0x0318)
class UWBP_MachineCustom_Sub_Tab_C final : public UMachineCustomTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_FooterMenu_Sub_ControllerBtn_C*    WBP_FooterMenu_Sub_ControllerBtn_L;                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_ControllerBtn_C*    WBP_FooterMenu_Sub_ControllerBtn_R;                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_TabBtn_C*        WBP_MachineCustom_Sub_Tab_01;                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_TabBtn_C*        WBP_MachineCustom_Sub_Tab_02;                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_TabBtn_C*        WBP_MachineCustom_Sub_Tab_03;                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_TabBtn_C*        WBP_MachineCustom_Sub_Tab_04;                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_TabBtn_C*        WBP_MachineCustom_Sub_Tab_05;                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_TabBtn_C*        WBP_MachineCustom_Sub_Tab_06;                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MachineCustom_Sub_Tab_WBP_MachineCustom_Sub_Tab_01_K2Node_ComponentBoundEvent_0_OnEventMachineCustomTabButton__DelegateSignature(EMachineCustomizeTabID InTabID);
	void BndEvt__WBP_MachineCustom_Sub_Tab_WBP_MachineCustom_Sub_Tab_02_K2Node_ComponentBoundEvent_3_OnEventMachineCustomTabButton__DelegateSignature(EMachineCustomizeTabID InTabID);
	void BndEvt__WBP_MachineCustom_Sub_Tab_WBP_MachineCustom_Sub_Tab_03_K2Node_ComponentBoundEvent_4_OnEventMachineCustomTabButton__DelegateSignature(EMachineCustomizeTabID InTabID);
	void BndEvt__WBP_MachineCustom_Sub_Tab_WBP_MachineCustom_Sub_Tab_04_K2Node_ComponentBoundEvent_5_OnEventMachineCustomTabButton__DelegateSignature(EMachineCustomizeTabID InTabID);
	void BndEvt__WBP_MachineCustom_Sub_Tab_WBP_MachineCustom_Sub_Tab_05_K2Node_ComponentBoundEvent_6_OnEventMachineCustomTabButton__DelegateSignature(EMachineCustomizeTabID InTabID);
	void BndEvt__WBP_MachineCustom_Sub_Tab_WBP_MachineCustom_Sub_Tab_06_K2Node_ComponentBoundEvent_7_OnEventMachineCustomTabButton__DelegateSignature(EMachineCustomizeTabID InTabID);
	void Construct();
	void ExecuteUbergraph_WBP_MachineCustom_Sub_Tab(int32 EntryPoint);
	void PlaySE();
	void PreConstruct(bool IsDesignTime);

	TArray<class UWidget*> GetIcons() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_Tab_C">();
	}
	static class UWBP_MachineCustom_Sub_Tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_Tab_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_Tab_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_Tab_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_Tab_C) == 0x000360, "Wrong size on UWBP_MachineCustom_Sub_Tab_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_Tab_C, UberGraphFrame) == 0x000318, "Member 'UWBP_MachineCustom_Sub_Tab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Tab_C, WBP_FooterMenu_Sub_ControllerBtn_L) == 0x000320, "Member 'UWBP_MachineCustom_Sub_Tab_C::WBP_FooterMenu_Sub_ControllerBtn_L' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Tab_C, WBP_FooterMenu_Sub_ControllerBtn_R) == 0x000328, "Member 'UWBP_MachineCustom_Sub_Tab_C::WBP_FooterMenu_Sub_ControllerBtn_R' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Tab_C, WBP_MachineCustom_Sub_Tab_01) == 0x000330, "Member 'UWBP_MachineCustom_Sub_Tab_C::WBP_MachineCustom_Sub_Tab_01' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Tab_C, WBP_MachineCustom_Sub_Tab_02) == 0x000338, "Member 'UWBP_MachineCustom_Sub_Tab_C::WBP_MachineCustom_Sub_Tab_02' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Tab_C, WBP_MachineCustom_Sub_Tab_03) == 0x000340, "Member 'UWBP_MachineCustom_Sub_Tab_C::WBP_MachineCustom_Sub_Tab_03' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Tab_C, WBP_MachineCustom_Sub_Tab_04) == 0x000348, "Member 'UWBP_MachineCustom_Sub_Tab_C::WBP_MachineCustom_Sub_Tab_04' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Tab_C, WBP_MachineCustom_Sub_Tab_05) == 0x000350, "Member 'UWBP_MachineCustom_Sub_Tab_C::WBP_MachineCustom_Sub_Tab_05' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Tab_C, WBP_MachineCustom_Sub_Tab_06) == 0x000358, "Member 'UWBP_MachineCustom_Sub_Tab_C::WBP_MachineCustom_Sub_Tab_06' has a wrong offset!");

}

