#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_Sub_Omochao

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Popup_Sub_Omochao.WBP_Popup_Sub_Omochao_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_Popup_Sub_Omochao_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Omochao_Out;                                       // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Omochao_Loop;                                      // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Omochao_In;                                        // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Omochao;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Popup_Sub_Omochao_C">();
	}
	static class UWBP_Popup_Sub_Omochao_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Popup_Sub_Omochao_C>();
	}
};
static_assert(alignof(UWBP_Popup_Sub_Omochao_C) == 0x000008, "Wrong alignment on UWBP_Popup_Sub_Omochao_C");
static_assert(sizeof(UWBP_Popup_Sub_Omochao_C) == 0x000300, "Wrong size on UWBP_Popup_Sub_Omochao_C");
static_assert(offsetof(UWBP_Popup_Sub_Omochao_C, Omochao_Out) == 0x0002E0, "Member 'UWBP_Popup_Sub_Omochao_C::Omochao_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Omochao_C, Omochao_Loop) == 0x0002E8, "Member 'UWBP_Popup_Sub_Omochao_C::Omochao_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Omochao_C, Omochao_In) == 0x0002F0, "Member 'UWBP_Popup_Sub_Omochao_C::Omochao_In' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Sub_Omochao_C, Image_Omochao) == 0x0002F8, "Member 'UWBP_Popup_Sub_Omochao_C::Image_Omochao' has a wrong offset!");

}

