#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_SubMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_SubMenu.WBP_CMN_SubMenu_C.ExecuteUbergraph_WBP_CMN_SubMenu
// 0x0108 (0x0108 - 0x0000)
struct WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ECommonMenuButtonType>                 K2Node_Event_InButtonArr;                          // 0x0020(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_SetupButtonsPanel_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_2;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIControlDir                            K2Node_CustomEvent_Dir;                            // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCommonMenuButtonBase*>          K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableFriendlistMilestoneVersion_ReturnValue; // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CMN_SubMenu_MenuBtn_C*             K2Node_DynamicCast_AsWBP_CMN_Sub_Menu_Menu_Btn;    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_2;           // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeZOrder_ReturnValue;                 // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonMenuSubMenuButton*               CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USessionManager*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLoginComplete_ReturnValue;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu) == 0x000008, "Wrong alignment on WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu");
static_assert(sizeof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu) == 0x000108, "Wrong size on WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, EntryPoint) == 0x000000, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_Event_InButtonArr) == 0x000020, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_Event_InButtonArr' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_MakeLiteralInt_ReturnValue) == 0x000030, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_MakeLiteralBool_ReturnValue) == 0x000034, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_SetupButtonsPanel_ReturnValue) == 0x000048, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_SetupButtonsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_CustomEvent_Button_2) == 0x000060, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_CustomEvent_ButtonIndex_2) == 0x000068, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_CustomEvent_ButtonIndex_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_CustomEvent_Button_1) == 0x000070, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_CustomEvent_ButtonIndex_1) == 0x000078, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_CustomEvent_ButtonIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_CustomEvent_Button) == 0x000080, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_CustomEvent_ButtonIndex) == 0x000088, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_CustomEvent_Dir) == 0x00008C, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_CustomEvent_Dir' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_MakeArray_Array) == 0x000090, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_CustomEvent_InVisibility) == 0x0000A0, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A1, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_IsDisableFriendlistMilestoneVersion_ReturnValue) == 0x0000A2, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_IsDisableFriendlistMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_DynamicCast_AsWBP_CMN_Sub_Menu_Menu_Btn) == 0x0000B0, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_DynamicCast_AsWBP_CMN_Sub_Menu_Menu_Btn' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_Array_Length_ReturnValue) == 0x0000BC, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C4, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000D4, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000D8, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_ChangeZOrder_ReturnValue) == 0x0000DC, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_ChangeZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_Array_Length_ReturnValue_1) == 0x0000E8, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000EC, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_PlayAnimation_ReturnValue) == 0x0000F0, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000F8, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu, CallFunc_GetLoginComplete_ReturnValue) == 0x000100, "Member 'WBP_CMN_SubMenu_C_ExecuteUbergraph_WBP_CMN_SubMenu::CallFunc_GetLoginComplete_ReturnValue' has a wrong offset!");

// Function WBP_CMN_SubMenu.WBP_CMN_SubMenu_C.InitializeCommonMenuSubMenu
// 0x0010 (0x0010 - 0x0000)
struct WBP_CMN_SubMenu_C_InitializeCommonMenuSubMenu final
{
public:
	TArray<ECommonMenuButtonType>                 InButtonArr;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CMN_SubMenu_C_InitializeCommonMenuSubMenu) == 0x000008, "Wrong alignment on WBP_CMN_SubMenu_C_InitializeCommonMenuSubMenu");
static_assert(sizeof(WBP_CMN_SubMenu_C_InitializeCommonMenuSubMenu) == 0x000010, "Wrong size on WBP_CMN_SubMenu_C_InitializeCommonMenuSubMenu");
static_assert(offsetof(WBP_CMN_SubMenu_C_InitializeCommonMenuSubMenu, InButtonArr) == 0x000000, "Member 'WBP_CMN_SubMenu_C_InitializeCommonMenuSubMenu::InButtonArr' has a wrong offset!");

// Function WBP_CMN_SubMenu.WBP_CMN_SubMenu_C.Judge Sub Menu Close
// 0x0005 (0x0005 - 0x0000)
struct WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close final
{
public:
	bool                                          CallFunc_IsOpenMenuByConditions_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenMenuByConditions_ReturnValue_1;     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenMenuByConditions_ReturnValue_2;     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenMenuByConditions_ReturnValue_3;     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenMenuByConditions_ReturnValue_4;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close) == 0x000001, "Wrong alignment on WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close");
static_assert(sizeof(WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close) == 0x000005, "Wrong size on WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close");
static_assert(offsetof(WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close, CallFunc_IsOpenMenuByConditions_ReturnValue) == 0x000000, "Member 'WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close::CallFunc_IsOpenMenuByConditions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close, CallFunc_IsOpenMenuByConditions_ReturnValue_1) == 0x000001, "Member 'WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close::CallFunc_IsOpenMenuByConditions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close, CallFunc_IsOpenMenuByConditions_ReturnValue_2) == 0x000002, "Member 'WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close::CallFunc_IsOpenMenuByConditions_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close, CallFunc_IsOpenMenuByConditions_ReturnValue_3) == 0x000003, "Member 'WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close::CallFunc_IsOpenMenuByConditions_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close, CallFunc_IsOpenMenuByConditions_ReturnValue_4) == 0x000004, "Member 'WBP_CMN_SubMenu_C_Judge_Sub_Menu_Close::CallFunc_IsOpenMenuByConditions_ReturnValue_4' has a wrong offset!");

// Function WBP_CMN_SubMenu.WBP_CMN_SubMenu_C.OnCancelButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_CMN_SubMenu_C_OnCancelButton final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_SubMenu_C_OnCancelButton) == 0x000008, "Wrong alignment on WBP_CMN_SubMenu_C_OnCancelButton");
static_assert(sizeof(WBP_CMN_SubMenu_C_OnCancelButton) == 0x000010, "Wrong size on WBP_CMN_SubMenu_C_OnCancelButton");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnCancelButton, Button) == 0x000000, "Member 'WBP_CMN_SubMenu_C_OnCancelButton::Button' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnCancelButton, ButtonIndex) == 0x000008, "Member 'WBP_CMN_SubMenu_C_OnCancelButton::ButtonIndex' has a wrong offset!");

// Function WBP_CMN_SubMenu.WBP_CMN_SubMenu_C.OnDecisionButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_CMN_SubMenu_C_OnDecisionButton final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_SubMenu_C_OnDecisionButton) == 0x000008, "Wrong alignment on WBP_CMN_SubMenu_C_OnDecisionButton");
static_assert(sizeof(WBP_CMN_SubMenu_C_OnDecisionButton) == 0x000010, "Wrong size on WBP_CMN_SubMenu_C_OnDecisionButton");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnDecisionButton, Button) == 0x000000, "Member 'WBP_CMN_SubMenu_C_OnDecisionButton::Button' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnDecisionButton, ButtonIndex) == 0x000008, "Member 'WBP_CMN_SubMenu_C_OnDecisionButton::ButtonIndex' has a wrong offset!");

// Function WBP_CMN_SubMenu.WBP_CMN_SubMenu_C.OnDIrectionButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_CMN_SubMenu_C_OnDIrectionButton final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIControlDir                            Dir;                                               // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_SubMenu_C_OnDIrectionButton) == 0x000008, "Wrong alignment on WBP_CMN_SubMenu_C_OnDIrectionButton");
static_assert(sizeof(WBP_CMN_SubMenu_C_OnDIrectionButton) == 0x000010, "Wrong size on WBP_CMN_SubMenu_C_OnDIrectionButton");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnDIrectionButton, Button) == 0x000000, "Member 'WBP_CMN_SubMenu_C_OnDIrectionButton::Button' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnDIrectionButton, ButtonIndex) == 0x000008, "Member 'WBP_CMN_SubMenu_C_OnDIrectionButton::ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnDIrectionButton, Dir) == 0x00000C, "Member 'WBP_CMN_SubMenu_C_OnDIrectionButton::Dir' has a wrong offset!");

// Function WBP_CMN_SubMenu.WBP_CMN_SubMenu_C.OnFocusReceived
// 0x01D0 (0x01D0 - 0x0000)
struct WBP_CMN_SubMenu_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetLastFocusedButton_ReturnValue;         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0118(0x00B8)()
};
static_assert(alignof(WBP_CMN_SubMenu_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_CMN_SubMenu_C_OnFocusReceived");
static_assert(sizeof(WBP_CMN_SubMenu_C_OnFocusReceived) == 0x0001D0, "Wrong size on WBP_CMN_SubMenu_C_OnFocusReceived");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_CMN_SubMenu_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_CMN_SubMenu_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_CMN_SubMenu_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnFocusReceived, CallFunc_GetPlayerController_ReturnValue) == 0x0000F8, "Member 'WBP_CMN_SubMenu_C_OnFocusReceived::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnFocusReceived, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'WBP_CMN_SubMenu_C_OnFocusReceived::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnFocusReceived, CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex) == 0x000104, "Member 'WBP_CMN_SubMenu_C_OnFocusReceived::CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnFocusReceived, CallFunc_GetLastFocusedButton_ReturnValue) == 0x000108, "Member 'WBP_CMN_SubMenu_C_OnFocusReceived::CallFunc_GetLastFocusedButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnFocusReceived, CallFunc_IsValid_ReturnValue_1) == 0x000110, "Member 'WBP_CMN_SubMenu_C_OnFocusReceived::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x000118, "Member 'WBP_CMN_SubMenu_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function WBP_CMN_SubMenu.WBP_CMN_SubMenu_C.OnVisibilityChangedEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_CMN_SubMenu_C_OnVisibilityChangedEvent final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_SubMenu_C_OnVisibilityChangedEvent) == 0x000001, "Wrong alignment on WBP_CMN_SubMenu_C_OnVisibilityChangedEvent");
static_assert(sizeof(WBP_CMN_SubMenu_C_OnVisibilityChangedEvent) == 0x000001, "Wrong size on WBP_CMN_SubMenu_C_OnVisibilityChangedEvent");
static_assert(offsetof(WBP_CMN_SubMenu_C_OnVisibilityChangedEvent, InVisibility) == 0x000000, "Member 'WBP_CMN_SubMenu_C_OnVisibilityChangedEvent::InVisibility' has a wrong offset!");

}

