#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_LobbyNotice

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Friend_LobbyNotice.WBP_Friend_LobbyNotice_C.ExecuteUbergraph_WBP_Friend_LobbyNotice
// 0x01E8 (0x01E8 - 0x0000)
struct WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CountValue;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_1;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayCountDisable_ReturnValue;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLobbyInvitationNoticeInfo             K2Node_Event_InLobbyInfo;                          // 0x0098(0x0090)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetPlayerIconBgColor_OutColor;            // 0x012C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerIconBgColor_ReturnValue;         // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetPlayerIconTexture_OutIconTexture;      // 0x0140(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerIconTexture_ReturnValue;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrossplayPlatform                            CallFunc_GetPlatformTypeByStringData_ReturnValue;  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0170(0x0010)()
	class UMenuInputRecieveObject*                CallFunc_SpawnObject_ReturnValue;                  // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELobbyInvitationSequenceType                  K2Node_Event_SequenceType;                         // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue_1;     // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C7[0x1];                                      // 0x01C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetControlGaugeValue_InValue_ImplicitCast; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice) == 0x000008, "Wrong alignment on WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice");
static_assert(sizeof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice) == 0x0001E8, "Wrong size on WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, EntryPoint) == 0x000000, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_Event_CountValue) == 0x000028, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_Event_CountValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_CustomEvent_Object_1) == 0x000030, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_CustomEvent_Object_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_CustomEvent_Object) == 0x000038, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_CustomEvent_Object' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_GetDisplayCountDisable_ReturnValue) == 0x000060, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_GetDisplayCountDisable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_GetOwningPlayer_ReturnValue) == 0x000068, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000070, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000080, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x000088, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_Event_InLobbyInfo) == 0x000098, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_Event_InLobbyInfo' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_Event_IsDesignTime) == 0x000128, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_GetPlayerIconBgColor_OutColor) == 0x00012C, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_GetPlayerIconBgColor_OutColor' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_GetPlayerIconBgColor_ReturnValue) == 0x00013C, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_GetPlayerIconBgColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_GetPlayerIconTexture_OutIconTexture) == 0x000140, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_GetPlayerIconTexture_OutIconTexture' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_GetPlayerIconTexture_ReturnValue) == 0x000168, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_GetPlayerIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_GetPlatformTypeByStringData_ReturnValue) == 0x000169, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_GetPlatformTypeByStringData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_Conv_StringToText_ReturnValue) == 0x000170, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_SpawnObject_ReturnValue) == 0x000180, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_Not_PreBool_ReturnValue) == 0x000188, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_Not_PreBool_ReturnValue_1) == 0x000189, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_Event_SequenceType) == 0x00018A, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_Event_SequenceType' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_SwitchEnum_CmpSuccess) == 0x00018B, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_GetAppPlayerController_ReturnValue) == 0x000190, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_GetAppPlayerController_ReturnValue_1) == 0x000198, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_GetAppPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_IsValid_ReturnValue) == 0x0001A0, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_IsValid_ReturnValue_1) == 0x0001A1, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001A4, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001B4, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_IsValid_ReturnValue_2) == 0x0001C4, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001C5, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_UnregisterSingleSubMenu_ReturnValue) == 0x0001C6, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_UnregisterSingleSubMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0001C8, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0001D0, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001D8, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_IsValid_ReturnValue_3) == 0x0001D9, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_IsValid_ReturnValue_4) == 0x0001DA, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001DB, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice, CallFunc_SetControlGaugeValue_InValue_ImplicitCast) == 0x0001E0, "Member 'WBP_Friend_LobbyNotice_C_ExecuteUbergraph_WBP_Friend_LobbyNotice::CallFunc_SetControlGaugeValue_InValue_ImplicitCast' has a wrong offset!");

// Function WBP_Friend_LobbyNotice.WBP_Friend_LobbyNotice_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_Friend_LobbyNotice_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
	int32                                         CallFunc_GetUserIndexByFocusEvent_ReturnValue;     // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_LobbyNotice_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Friend_LobbyNotice_C_OnFocusReceived");
static_assert(sizeof(WBP_Friend_LobbyNotice_C_OnFocusReceived) == 0x0001C0, "Wrong size on WBP_Friend_LobbyNotice_C_OnFocusReceived");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Friend_LobbyNotice_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Friend_LobbyNotice_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Friend_LobbyNotice_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'WBP_Friend_LobbyNotice_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_OnFocusReceived, CallFunc_GetUserIndexByFocusEvent_ReturnValue) == 0x0001B0, "Member 'WBP_Friend_LobbyNotice_C_OnFocusReceived::CallFunc_GetUserIndexByFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_OnFocusReceived, CallFunc_GetPlayerController_ReturnValue) == 0x0001B8, "Member 'WBP_Friend_LobbyNotice_C_OnFocusReceived::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function WBP_Friend_LobbyNotice.WBP_Friend_LobbyNotice_C.OnSpecialPressedEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_LobbyNotice_C_OnSpecialPressedEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_LobbyNotice_C_OnSpecialPressedEvent) == 0x000008, "Wrong alignment on WBP_Friend_LobbyNotice_C_OnSpecialPressedEvent");
static_assert(sizeof(WBP_Friend_LobbyNotice_C_OnSpecialPressedEvent) == 0x000008, "Wrong size on WBP_Friend_LobbyNotice_C_OnSpecialPressedEvent");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_OnSpecialPressedEvent, Object) == 0x000000, "Member 'WBP_Friend_LobbyNotice_C_OnSpecialPressedEvent::Object' has a wrong offset!");

// Function WBP_Friend_LobbyNotice.WBP_Friend_LobbyNotice_C.OnSpecialReleasedEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_LobbyNotice_C_OnSpecialReleasedEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_LobbyNotice_C_OnSpecialReleasedEvent) == 0x000008, "Wrong alignment on WBP_Friend_LobbyNotice_C_OnSpecialReleasedEvent");
static_assert(sizeof(WBP_Friend_LobbyNotice_C_OnSpecialReleasedEvent) == 0x000008, "Wrong size on WBP_Friend_LobbyNotice_C_OnSpecialReleasedEvent");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_OnSpecialReleasedEvent, Object) == 0x000000, "Member 'WBP_Friend_LobbyNotice_C_OnSpecialReleasedEvent::Object' has a wrong offset!");

// Function WBP_Friend_LobbyNotice.WBP_Friend_LobbyNotice_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_LobbyNotice_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_LobbyNotice_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Friend_LobbyNotice_C_PreConstruct");
static_assert(sizeof(WBP_Friend_LobbyNotice_C_PreConstruct) == 0x000001, "Wrong size on WBP_Friend_LobbyNotice_C_PreConstruct");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Friend_LobbyNotice_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Friend_LobbyNotice.WBP_Friend_LobbyNotice_C.SetupNoticeSequenceType
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_LobbyNotice_C_SetupNoticeSequenceType final
{
public:
	ELobbyInvitationSequenceType                  SequenceType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_LobbyNotice_C_SetupNoticeSequenceType) == 0x000001, "Wrong alignment on WBP_Friend_LobbyNotice_C_SetupNoticeSequenceType");
static_assert(sizeof(WBP_Friend_LobbyNotice_C_SetupNoticeSequenceType) == 0x000001, "Wrong size on WBP_Friend_LobbyNotice_C_SetupNoticeSequenceType");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_SetupNoticeSequenceType, SequenceType) == 0x000000, "Member 'WBP_Friend_LobbyNotice_C_SetupNoticeSequenceType::SequenceType' has a wrong offset!");

// Function WBP_Friend_LobbyNotice.WBP_Friend_LobbyNotice_C.UpdateHoldInputCountDisplay
// 0x0004 (0x0004 - 0x0000)
struct WBP_Friend_LobbyNotice_C_UpdateHoldInputCountDisplay final
{
public:
	float                                         CountValue;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_LobbyNotice_C_UpdateHoldInputCountDisplay) == 0x000004, "Wrong alignment on WBP_Friend_LobbyNotice_C_UpdateHoldInputCountDisplay");
static_assert(sizeof(WBP_Friend_LobbyNotice_C_UpdateHoldInputCountDisplay) == 0x000004, "Wrong size on WBP_Friend_LobbyNotice_C_UpdateHoldInputCountDisplay");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_UpdateHoldInputCountDisplay, CountValue) == 0x000000, "Member 'WBP_Friend_LobbyNotice_C_UpdateHoldInputCountDisplay::CountValue' has a wrong offset!");

// Function WBP_Friend_LobbyNotice.WBP_Friend_LobbyNotice_C.UpdateLobbyInfoDisplay
// 0x0090 (0x0090 - 0x0000)
struct WBP_Friend_LobbyNotice_C_UpdateLobbyInfoDisplay final
{
public:
	struct FLobbyInvitationNoticeInfo             InLobbyInfo;                                       // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Friend_LobbyNotice_C_UpdateLobbyInfoDisplay) == 0x000008, "Wrong alignment on WBP_Friend_LobbyNotice_C_UpdateLobbyInfoDisplay");
static_assert(sizeof(WBP_Friend_LobbyNotice_C_UpdateLobbyInfoDisplay) == 0x000090, "Wrong size on WBP_Friend_LobbyNotice_C_UpdateLobbyInfoDisplay");
static_assert(offsetof(WBP_Friend_LobbyNotice_C_UpdateLobbyInfoDisplay, InLobbyInfo) == 0x000000, "Member 'WBP_Friend_LobbyNotice_C_UpdateLobbyInfoDisplay::InLobbyInfo' has a wrong offset!");

}

