#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_TimeTrial_TimeDiff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_TimeTrial_TimeDiff.WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C
// 0x0060 (0x0378 - 0x0318)
class UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C final : public URaceUISubTimeTrialTimeLap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_0000001;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_0000010;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_0000100;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_0001000;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_0010000;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NUM_0100000;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Sign;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Close();
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff(int32 EntryPoint);
	void Finished_A18423164BEDD168331A63AB0CE535A5();
	void Open();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C">();
	}
	static class UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C) == 0x000378, "Wrong size on UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C, UberGraphFrame) == 0x000318, "Member 'UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C, Out) == 0x000320, "Member 'UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C, In) == 0x000328, "Member 'UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C::In' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C, base) == 0x000330, "Member 'UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C, Border_0) == 0x000338, "Member 'UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C::Border_0' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C, NUM_0000001) == 0x000340, "Member 'UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C::NUM_0000001' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C, NUM_0000010) == 0x000348, "Member 'UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C::NUM_0000010' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C, NUM_0000100) == 0x000350, "Member 'UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C::NUM_0000100' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C, NUM_0001000) == 0x000358, "Member 'UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C::NUM_0001000' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C, NUM_0010000) == 0x000360, "Member 'UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C::NUM_0010000' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C, NUM_0100000) == 0x000368, "Member 'UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C::NUM_0100000' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C, TXT_Sign) == 0x000370, "Member 'UWBP_Race_HUD_Sub_TimeTrial_TimeDiff_C::TXT_Sign' has a wrong offset!");

}

