#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_Window_Tutorial

#include "Basic.hpp"

#include "CriWareRuntime_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Popup_Window_Tutorial.WBP_Popup_Window_Tutorial_C
// 0x00E8 (0x0430 - 0x0348)
class UWBP_Popup_Window_Tutorial_C final : public UPopupWindowTutorial
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Info_Out;                                          // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Info_In;                                           // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_Out;                                         // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_Loop;                                        // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_In;                                          // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               DSP_Cover;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MovieImage;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Movie;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Tutorial_Controller;                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextBase;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Info;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_C*                      WBP_FooterMenu;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Window_Tutorial_Sub_Cover_C* WBP_Popup_Window_Tutorial_Sub_Cover;               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tutorial_Controller_Wrapper_C*     WBP_Tutorial_Controller_Wrapper;                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBase;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionManaPlayer*                       UnionManaPlayer;                                   // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPopupTutorial;                                   // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           MovieRawName;                                      // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PlayMovieIndex;                                    // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxMovieIndex;                                     // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           SoundHandle;                                       // 0x0408(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsCancelMovie;                                     // 0x040C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CancelTimer;                                       // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnd;                                             // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCreated;                                         // 0x0419(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayingOpening;                                  // 0x041A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B[0x5];                                      // 0x041B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PlayTimer;                                         // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayingEnding;                                   // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionPlatform                                PlatformType;                                      // 0x0429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRealClosing;                                     // 0x042A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOkClosing;                                       // 0x042B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOkSupend;                                        // 0x042C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckOkClosing(bool* newParam);
	void ClosePopup();
	void Construct();
	void CreateMoviePlayer();
	void Destruct();
	void DispText(bool IsOnDisp);
	void EndMovie();
	void EndMovieClosed();
	void ExecuteUbergraph_WBP_Popup_Window_Tutorial(int32 EntryPoint);
	void Finished_B427BEC14DE6B237A2D786AD5B646806();
	void FuncNantoka();
	void isEnableMovingNextCursor(bool* newParam);
	void OnAcceptKeyPressed();
	void OnAcceptKeyReleased();
	void OnBackKeyPressed();
	void OnBackKeyReleased();
	void OpenPopup();
	void PauseMovie(bool IsPause, bool IsRealClose);
	void PlayMovie();
	void PlayMovie_Test(int32 Index_0, bool IsRepeat);
	void PlayNext(bool* IsEnd_0);
	void ReleasePopup();
	void SetCancelIconGauge(float InGaugeParam);
	void SetFooterMenu();
	void SetTextDispTime();
	void Setup(bool IsPopup);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateContoroller();
	void UpdateInfoTxt(const class FText& InTxt);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Popup_Window_Tutorial_C">();
	}
	static class UWBP_Popup_Window_Tutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Popup_Window_Tutorial_C>();
	}
};
static_assert(alignof(UWBP_Popup_Window_Tutorial_C) == 0x000008, "Wrong alignment on UWBP_Popup_Window_Tutorial_C");
static_assert(sizeof(UWBP_Popup_Window_Tutorial_C) == 0x000430, "Wrong size on UWBP_Popup_Window_Tutorial_C");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, UberGraphFrame) == 0x000348, "Member 'UWBP_Popup_Window_Tutorial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, Info_Out) == 0x000350, "Member 'UWBP_Popup_Window_Tutorial_C::Info_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, Info_In) == 0x000358, "Member 'UWBP_Popup_Window_Tutorial_C::Info_In' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, Popup_Out) == 0x000360, "Member 'UWBP_Popup_Window_Tutorial_C::Popup_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, Popup_Loop) == 0x000368, "Member 'UWBP_Popup_Window_Tutorial_C::Popup_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, Popup_In) == 0x000370, "Member 'UWBP_Popup_Window_Tutorial_C::Popup_In' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, BackgroundBlur) == 0x000378, "Member 'UWBP_Popup_Window_Tutorial_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, DSP_Cover) == 0x000380, "Member 'UWBP_Popup_Window_Tutorial_C::DSP_Cover' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, Frame) == 0x000388, "Member 'UWBP_Popup_Window_Tutorial_C::Frame' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, MovieImage) == 0x000390, "Member 'UWBP_Popup_Window_Tutorial_C::MovieImage' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, OutOfContentButton) == 0x000398, "Member 'UWBP_Popup_Window_Tutorial_C::OutOfContentButton' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, Overlay_Movie) == 0x0003A0, "Member 'UWBP_Popup_Window_Tutorial_C::Overlay_Movie' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, Overlay_Tutorial_Controller) == 0x0003A8, "Member 'UWBP_Popup_Window_Tutorial_C::Overlay_Tutorial_Controller' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, TextBase) == 0x0003B0, "Member 'UWBP_Popup_Window_Tutorial_C::TextBase' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, TXT_Info) == 0x0003B8, "Member 'UWBP_Popup_Window_Tutorial_C::TXT_Info' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, WBP_FooterMenu) == 0x0003C0, "Member 'UWBP_Popup_Window_Tutorial_C::WBP_FooterMenu' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, WBP_Popup_Window_Tutorial_Sub_Cover) == 0x0003C8, "Member 'UWBP_Popup_Window_Tutorial_C::WBP_Popup_Window_Tutorial_Sub_Cover' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, WBP_Tutorial_Controller_Wrapper) == 0x0003D0, "Member 'UWBP_Popup_Window_Tutorial_C::WBP_Tutorial_Controller_Wrapper' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, WindowBase) == 0x0003D8, "Member 'UWBP_Popup_Window_Tutorial_C::WindowBase' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, UnionManaPlayer) == 0x0003E0, "Member 'UWBP_Popup_Window_Tutorial_C::UnionManaPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, IsPopupTutorial) == 0x0003E8, "Member 'UWBP_Popup_Window_Tutorial_C::IsPopupTutorial' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, MovieRawName) == 0x0003F0, "Member 'UWBP_Popup_Window_Tutorial_C::MovieRawName' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, PlayMovieIndex) == 0x000400, "Member 'UWBP_Popup_Window_Tutorial_C::PlayMovieIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, MaxMovieIndex) == 0x000404, "Member 'UWBP_Popup_Window_Tutorial_C::MaxMovieIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, SoundHandle) == 0x000408, "Member 'UWBP_Popup_Window_Tutorial_C::SoundHandle' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, IsCancelMovie) == 0x00040C, "Member 'UWBP_Popup_Window_Tutorial_C::IsCancelMovie' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, CancelTimer) == 0x000410, "Member 'UWBP_Popup_Window_Tutorial_C::CancelTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, IsEnd) == 0x000418, "Member 'UWBP_Popup_Window_Tutorial_C::IsEnd' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, IsCreated) == 0x000419, "Member 'UWBP_Popup_Window_Tutorial_C::IsCreated' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, IsPlayingOpening) == 0x00041A, "Member 'UWBP_Popup_Window_Tutorial_C::IsPlayingOpening' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, PlayTimer) == 0x000420, "Member 'UWBP_Popup_Window_Tutorial_C::PlayTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, IsPlayingEnding) == 0x000428, "Member 'UWBP_Popup_Window_Tutorial_C::IsPlayingEnding' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, PlatformType) == 0x000429, "Member 'UWBP_Popup_Window_Tutorial_C::PlatformType' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, IsRealClosing) == 0x00042A, "Member 'UWBP_Popup_Window_Tutorial_C::IsRealClosing' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, IsOkClosing) == 0x00042B, "Member 'UWBP_Popup_Window_Tutorial_C::IsOkClosing' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Tutorial_C, IsOkSupend) == 0x00042C, "Member 'UWBP_Popup_Window_Tutorial_C::IsOkSupend' has a wrong offset!");

}

