#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_Sub_BtnPlay_Offline

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TimeTrial_Sub_BtnPlay_Offline.WBP_TimeTrial_Sub_BtnPlay_Offline_C
// 0x0078 (0x0560 - 0x04E8)
class UWBP_TimeTrial_Sub_BtnPlay_Offline_C final : public UTopMenuPlayModeButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Active_Out;                                    // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_NonActive_Loop;                                // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_Left_02;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Right_02;                                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corsor;                                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_Charactor;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_Image_IconRank;                                // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_Machine;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DSP_Ghost;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlagWave;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_BtnTitle;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Time;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_TimeLabel;                                     // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TimeTrial_Sub_BtnPlay_Offline(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnFocusLostImpl(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInitialize();
	void SetGhostRaceData(const struct FUserTimeTrialRaceData& InTimeTrialRaceData);
	void SetupOfflinePanel(bool bTimeClear, const class FText& TimeText, const struct FUserTimeTrialRaceData& RaceData, EStageId StageId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TimeTrial_Sub_BtnPlay_Offline_C">();
	}
	static class UWBP_TimeTrial_Sub_BtnPlay_Offline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TimeTrial_Sub_BtnPlay_Offline_C>();
	}
};
static_assert(alignof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C) == 0x000008, "Wrong alignment on UWBP_TimeTrial_Sub_BtnPlay_Offline_C");
static_assert(sizeof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C) == 0x000560, "Wrong size on UWBP_TimeTrial_Sub_BtnPlay_Offline_C");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, UberGraphFrame) == 0x0004E8, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, Btn_Active_Out) == 0x0004F0, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::Btn_Active_Out' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, Btn_NonActive_Loop) == 0x0004F8, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::Btn_NonActive_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, Arrow_Left_02) == 0x000500, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::Arrow_Left_02' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, Arrow_Right_02) == 0x000508, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::Arrow_Right_02' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, Corsor) == 0x000510, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::Corsor' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, DMY_Charactor) == 0x000518, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::DMY_Charactor' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, DMY_Image_IconRank) == 0x000520, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::DMY_Image_IconRank' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, DMY_Machine) == 0x000528, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::DMY_Machine' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, DSP_Ghost) == 0x000530, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::DSP_Ghost' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, MouseInteraction) == 0x000538, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, RaceFlagWave) == 0x000540, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::RaceFlagWave' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, TXT_BtnTitle) == 0x000548, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::TXT_BtnTitle' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, TXT_Time) == 0x000550, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::TXT_Time' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Offline_C, TXT_TimeLabel) == 0x000558, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Offline_C::TXT_TimeLabel' has a wrong offset!");

}

