#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge.WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C.ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge
// 0x0020 (0x0020 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge) == 0x000020, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge, EntryPoint) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge.WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_PreConstruct");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_PreConstruct) == 0x000001, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_PreConstruct");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge.WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C.SetUsedCounts
// 0x0058 (0x0058 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts final
{
public:
	int32                                         InCounts;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxCounts;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0010)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationTimeRange_EndAtTime_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts) == 0x000058, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts, InCounts) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts::InCounts' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts, InMaxCounts) == 0x000004, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts::InMaxCounts' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000018, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000040, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts, CallFunc_PlayAnimationTimeRange_EndAtTime_ImplicitCast) == 0x000050, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Number_Machine_Gauge_C_SetUsedCounts::CallFunc_PlayAnimationTimeRange_EndAtTime_ImplicitCast' has a wrong offset!");

}

