#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FullScreenClickButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_FullScreenClickButton.WBP_FullScreenClickButton_C.ExecuteUbergraph_WBP_FullScreenClickButton
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLeftMouseButtonPressing_ReturnValue;   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetRegisteredSubMenu_ReturnValue;         // 0x0080(0x0010)(ReferenceParm)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuInputRecieveInterface> K2Node_DynamicCast_AsMenu_Input_Recieve_Interface; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuInputRecieveInterface> K2Node_DynamicCast_AsMenu_Input_Recieve_Interface_1; // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetRegisteredMenu_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuInputRecieveInterface> K2Node_DynamicCast_AsMenu_Input_Recieve_Interface_2; // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuInputRecieveInterface> K2Node_DynamicCast_AsMenu_Input_Recieve_Interface_3; // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ClampAxes2D_ReturnValue;                  // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingFade_ReturnValue;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue_1; // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton) == 0x000008, "Wrong alignment on WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton");
static_assert(sizeof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton) == 0x0001B0, "Wrong size on WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, EntryPoint) == 0x000000, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, Temp_int_Array_Index_Variable) == 0x000048, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000050, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_GetPlayerController_ReturnValue_1) == 0x000060, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x000070, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_GetLeftMouseButtonPressing_ReturnValue) == 0x000079, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_GetLeftMouseButtonPressing_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_GetRegisteredSubMenu_ReturnValue) == 0x000080, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_GetRegisteredSubMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_DynamicCast_AsMenu_Input_Recieve_Interface) == 0x0000A0, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_DynamicCast_AsMenu_Input_Recieve_Interface' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_DynamicCast_AsMenu_Input_Recieve_Interface_1) == 0x0000B8, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_DynamicCast_AsMenu_Input_Recieve_Interface_1' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_GetRegisteredMenu_ReturnValue) == 0x0000D0, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_GetRegisteredMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_DynamicCast_AsMenu_Input_Recieve_Interface_2) == 0x0000D8, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_DynamicCast_AsMenu_Input_Recieve_Interface_2' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_DynamicCast_bSuccess_4) == 0x0000E8, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_DynamicCast_AsMenu_Input_Recieve_Interface_3) == 0x0000F0, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_DynamicCast_AsMenu_Input_Recieve_Interface_3' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, K2Node_DynamicCast_bSuccess_5) == 0x000100, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_IsValid_ReturnValue_2) == 0x000101, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x000108, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000118, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_ClampAxes2D_ReturnValue) == 0x000128, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_ClampAxes2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_BreakVector2D_X) == 0x000138, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_BreakVector2D_Y) == 0x000140, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000148, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000150, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000158, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000160, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, Temp_int_Loop_Counter_Variable) == 0x000168, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_MakeVector2D_ReturnValue) == 0x000170, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_Less_IntInt_ReturnValue) == 0x000180, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_Add_IntInt_ReturnValue) == 0x000184, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_MakeLiteralInt_ReturnValue) == 0x000188, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x00018C, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000190, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_IsPlayingFade_ReturnValue) == 0x000198, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_IsPlayingFade_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_Not_PreBool_ReturnValue) == 0x000199, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton, CallFunc_GetMousePositionOnViewport_ReturnValue_1) == 0x0001A0, "Member 'WBP_FullScreenClickButton_C_ExecuteUbergraph_WBP_FullScreenClickButton::CallFunc_GetMousePositionOnViewport_ReturnValue_1' has a wrong offset!");

// Function WBP_FullScreenClickButton.WBP_FullScreenClickButton_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_FullScreenClickButton_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FullScreenClickButton_C_Tick) == 0x000004, "Wrong alignment on WBP_FullScreenClickButton_C_Tick");
static_assert(sizeof(WBP_FullScreenClickButton_C_Tick) == 0x00003C, "Wrong size on WBP_FullScreenClickButton_C_Tick");
static_assert(offsetof(WBP_FullScreenClickButton_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_FullScreenClickButton_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_FullScreenClickButton_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_FullScreenClickButton_C_Tick::InDeltaTime' has a wrong offset!");

}

