#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_ItemWarning

#include "Basic.hpp"

#include "UnionRun_structs.hpp"
#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Sub_ItemWarning.WBP_Race_HUD_Sub_ItemWarning_C.ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning
// 0x0140 (0x0140 - 0x0000)
struct WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0038(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FItemDataAssetTableRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x0098)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning) == 0x000140, "Wrong size on WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, EntryPoint) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000020, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000038, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000F0, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_Array_Length_ReturnValue) == 0x0000F4, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000F8, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, K2Node_DynamicCast_As_____2D) == 0x000108, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000118, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000120, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000128, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000130, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000138, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Race_HUD_Sub_ItemWarning.WBP_Race_HUD_Sub_ItemWarning_C.SetAttackTypeAndId_BP
// 0x0003 (0x0003 - 0x0000)
struct WBP_Race_HUD_Sub_ItemWarning_C_SetAttackTypeAndId_BP final
{
public:
	EUnionAttackItemInfoType                      AttackType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ID;                                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemWarning_C_SetAttackTypeAndId_BP) == 0x000001, "Wrong alignment on WBP_Race_HUD_Sub_ItemWarning_C_SetAttackTypeAndId_BP");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemWarning_C_SetAttackTypeAndId_BP) == 0x000003, "Wrong size on WBP_Race_HUD_Sub_ItemWarning_C_SetAttackTypeAndId_BP");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_SetAttackTypeAndId_BP, AttackType) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_SetAttackTypeAndId_BP::AttackType' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_SetAttackTypeAndId_BP, ID) == 0x000001, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_SetAttackTypeAndId_BP::ID' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_SetAttackTypeAndId_BP, CallFunc_GetValidValue_ReturnValue) == 0x000002, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_SetAttackTypeAndId_BP::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_ItemWarning.WBP_Race_HUD_Sub_ItemWarning_C.SetItemId_BP
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Sub_ItemWarning_C_SetItemId_BP final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalItemTextureIndex;                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemWarning_C_SetItemId_BP) == 0x000004, "Wrong alignment on WBP_Race_HUD_Sub_ItemWarning_C_SetItemId_BP");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemWarning_C_SetItemId_BP) == 0x000008, "Wrong size on WBP_Race_HUD_Sub_ItemWarning_C_SetItemId_BP");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_SetItemId_BP, ItemIndex) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_SetItemId_BP::ItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemWarning_C_SetItemId_BP, LocalItemTextureIndex) == 0x000004, "Member 'WBP_Race_HUD_Sub_ItemWarning_C_SetItemId_BP::LocalItemTextureIndex' has a wrong offset!");

}

