#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharaSelect_Sub_Window

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharaSelect_Sub_Window.WBP_CharaSelect_Sub_Window_C.CalcButtonNavigation
// 0x0248 (0x0248 - 0x0000)
struct WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation final
{
public:
	class UUnionUIButtonBase*                     InCurrent;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         InButtonIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ColumnMax;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UnderIconCount;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonNumber;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     Current;                                           // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetColumnMax_ColumnMax;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue;                   // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue_1;                 // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue_2;                 // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue_3;                 // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue_4;                 // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue_5;                 // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue_6;                 // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue_7;                 // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue_8;                 // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue_9;                 // 0x00F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue_10;                // 0x0108(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue_11;                // 0x0118(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_2;            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_3;            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUnionUIButtonBase*>             CallFunc_GetButtons_ReturnValue_12;                // 0x0130(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_1;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_2;                         // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_3;                         // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue_3;             // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_4;                         // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_6;            // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_5;                         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_4;             // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_7;            // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_6;                         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_7;                         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_8;            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_8;                         // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_9;                         // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_4;         // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x1];                                      // 0x0203(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_10;                        // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_9;            // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_11;                        // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue_5;             // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_12;                        // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_13;                        // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_5;         // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation) == 0x000008, "Wrong alignment on WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation");
static_assert(sizeof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation) == 0x000248, "Wrong size on WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, InCurrent) == 0x000000, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::InCurrent' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, InButtonIndex) == 0x000008, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::InButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, ColumnMax) == 0x00000C, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::ColumnMax' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, UnderIconCount) == 0x000010, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::UnderIconCount' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, ButtonNumber) == 0x000014, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::ButtonNumber' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, ButtonIndex) == 0x000018, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, Current) == 0x000020, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::Current' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetColumnMax_ColumnMax) == 0x00002C, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetColumnMax_ColumnMax' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue) == 0x000030, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue_1) == 0x000048, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue_2) == 0x000060, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue_3) == 0x000078, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue_4) == 0x000088, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue_5) == 0x000098, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_LastIndex_ReturnValue) == 0x0000A8, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue_6) == 0x0000B0, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Divide_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_LastIndex_ReturnValue_1) == 0x0000C4, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Multiply_IntInt_ReturnValue) == 0x0000C8, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000CC, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue_7) == 0x0000D0, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x0000E0, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue_8) == 0x0000E8, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue_9) == 0x0000F8, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue_10) == 0x000108, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue_11) == 0x000118, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_LastIndex_ReturnValue_2) == 0x000128, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_LastIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_LastIndex_ReturnValue_3) == 0x00012C, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_LastIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_GetButtons_ReturnValue_12) == 0x000130, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_GetButtons_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_1) == 0x000140, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Length_ReturnValue_1) == 0x000148, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Percent_IntInt_ReturnValue) == 0x00014C, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000150, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000154, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000158, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Add_IntInt_ReturnValue_2) == 0x00015C, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Subtract_IntInt_ReturnValue_4) == 0x000160, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Subtract_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Less_IntInt_ReturnValue) == 0x000164, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000168, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_BooleanAND_ReturnValue) == 0x00016C, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_2) == 0x000170, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000178, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Percent_IntInt_ReturnValue_2) == 0x00017C, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000180, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_3) == 0x000188, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000190, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Percent_IntInt_ReturnValue_3) == 0x000194, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Percent_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Subtract_IntInt_ReturnValue_5) == 0x000198, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Subtract_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00019C, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_4) == 0x0001A0, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0001A8, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Subtract_IntInt_ReturnValue_6) == 0x0001AC, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Subtract_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_5) == 0x0001B0, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Percent_IntInt_ReturnValue_4) == 0x0001B8, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Percent_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0001BC, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001C0, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001C4, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Subtract_IntInt_ReturnValue_7) == 0x0001C8, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Subtract_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_6) == 0x0001D0, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_7) == 0x0001D8, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x0001E0, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_IsValidIndex_ReturnValue_3) == 0x0001E1, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_IsValidIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Add_IntInt_ReturnValue_5) == 0x0001E4, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Subtract_IntInt_ReturnValue_8) == 0x0001E8, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Subtract_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_8) == 0x0001F0, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_9) == 0x0001F8, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_9' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_IsValid_ReturnValue_1) == 0x000200, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_IsValidIndex_ReturnValue_4) == 0x000201, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_IsValidIndex_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000202, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Add_IntInt_ReturnValue_6) == 0x000204, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_10) == 0x000208, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_10' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Subtract_IntInt_ReturnValue_9) == 0x000210, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Subtract_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_11) == 0x000218, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_11' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000220, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Percent_IntInt_ReturnValue_5) == 0x000224, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Percent_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_12) == 0x000228, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_12' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Add_IntInt_ReturnValue_7) == 0x000230, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_Get_Item_13) == 0x000238, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_Get_Item_13' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation, CallFunc_Array_IsValidIndex_ReturnValue_5) == 0x000240, "Member 'WBP_CharaSelect_Sub_Window_C_CalcButtonNavigation::CallFunc_Array_IsValidIndex_ReturnValue_5' has a wrong offset!");

// Function WBP_CharaSelect_Sub_Window.WBP_CharaSelect_Sub_Window_C.ExecuteUbergraph_WBP_CharaSelect_Sub_Window
// 0x0050 (0x0050 - 0x0000)
struct WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaSelectCharaIcon*                  K2Node_Event_InIcon_1;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharaSelectCharaIcon*                  K2Node_Event_InIcon;                               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CharaSelect_Sub_CharaIcon_C*       K2Node_DynamicCast_AsWBP_Chara_Select_Sub_Chara_Icon; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharaSelect_Sub_CharaIcon_C*       K2Node_DynamicCast_AsWBP_Chara_Select_Sub_Chara_Icon_1; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_CharaIndex;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_SelectedPowerRival;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMilestoneVersion                             CallFunc_GetMileStoneVersion_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window) == 0x000008, "Wrong alignment on WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window");
static_assert(sizeof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window) == 0x000050, "Wrong size on WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window, EntryPoint) == 0x000000, "Member 'WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window, K2Node_Event_InIcon_1) == 0x000018, "Member 'WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window::K2Node_Event_InIcon_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window, K2Node_Event_InIcon) == 0x000020, "Member 'WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window::K2Node_Event_InIcon' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window, K2Node_DynamicCast_AsWBP_Chara_Select_Sub_Chara_Icon) == 0x000028, "Member 'WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window::K2Node_DynamicCast_AsWBP_Chara_Select_Sub_Chara_Icon' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window, K2Node_DynamicCast_AsWBP_Chara_Select_Sub_Chara_Icon_1) == 0x000038, "Member 'WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window::K2Node_DynamicCast_AsWBP_Chara_Select_Sub_Chara_Icon_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window, K2Node_Event_CharaIndex) == 0x000044, "Member 'WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window::K2Node_Event_CharaIndex' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window, K2Node_Event_SelectedPowerRival) == 0x000048, "Member 'WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window::K2Node_Event_SelectedPowerRival' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window, CallFunc_GetMileStoneVersion_ReturnValue) == 0x000049, "Member 'WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window::CallFunc_GetMileStoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004A, "Member 'WBP_CharaSelect_Sub_Window_C_ExecuteUbergraph_WBP_CharaSelect_Sub_Window::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_CharaSelect_Sub_Window.WBP_CharaSelect_Sub_Window_C.InitializeRivalSelect
// 0x0050 (0x0050 - 0x0000)
struct WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect final
{
public:
	EDriverId                                     SelectedRivalDriverId;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RivalLevelEnhanced;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelectRival;                                      // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelectPowerRival;                                 // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelectNroamlRival;                                // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharaSelect_Sub_CharaIcon_C*       Icon;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharaSelect_Sub_CharaIcon_C*       K2Node_DynamicCast_AsWBP_Chara_Select_Sub_Chara_Icon; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetDriverId_ReturnValue;                  // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect) == 0x000008, "Wrong alignment on WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect");
static_assert(sizeof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect) == 0x000050, "Wrong size on WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, SelectedRivalDriverId) == 0x000000, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::SelectedRivalDriverId' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, RivalLevelEnhanced) == 0x000001, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::RivalLevelEnhanced' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, bSelectRival) == 0x000002, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::bSelectRival' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, bSelectPowerRival) == 0x000003, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::bSelectPowerRival' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, bSelectNroamlRival) == 0x000004, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::bSelectNroamlRival' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, Icon) == 0x000008, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::Icon' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, K2Node_DynamicCast_AsWBP_Chara_Select_Sub_Chara_Icon) == 0x000040, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::K2Node_DynamicCast_AsWBP_Chara_Select_Sub_Chara_Icon' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, CallFunc_IsVisible_ReturnValue) == 0x00004A, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, CallFunc_GetDriverId_ReturnValue) == 0x00004B, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::CallFunc_GetDriverId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004C, "Member 'WBP_CharaSelect_Sub_Window_C_InitializeRivalSelect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_CharaSelect_Sub_Window.WBP_CharaSelect_Sub_Window_C.OnBindIcons
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharaSelect_Sub_Window_C_OnBindIcons final
{
public:
	class UCharaSelectCharaIcon*                  InIcon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharaSelect_Sub_Window_C_OnBindIcons) == 0x000008, "Wrong alignment on WBP_CharaSelect_Sub_Window_C_OnBindIcons");
static_assert(sizeof(WBP_CharaSelect_Sub_Window_C_OnBindIcons) == 0x000008, "Wrong size on WBP_CharaSelect_Sub_Window_C_OnBindIcons");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_OnBindIcons, InIcon) == 0x000000, "Member 'WBP_CharaSelect_Sub_Window_C_OnBindIcons::InIcon' has a wrong offset!");

// Function WBP_CharaSelect_Sub_Window.WBP_CharaSelect_Sub_Window_C.OnUnbindIcons
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharaSelect_Sub_Window_C_OnUnbindIcons final
{
public:
	class UCharaSelectCharaIcon*                  InIcon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharaSelect_Sub_Window_C_OnUnbindIcons) == 0x000008, "Wrong alignment on WBP_CharaSelect_Sub_Window_C_OnUnbindIcons");
static_assert(sizeof(WBP_CharaSelect_Sub_Window_C_OnUnbindIcons) == 0x000008, "Wrong size on WBP_CharaSelect_Sub_Window_C_OnUnbindIcons");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_OnUnbindIcons, InIcon) == 0x000000, "Member 'WBP_CharaSelect_Sub_Window_C_OnUnbindIcons::InIcon' has a wrong offset!");

// Function WBP_CharaSelect_Sub_Window.WBP_CharaSelect_Sub_Window_C.PlayRivalInIcon
// 0x0048 (0x0048 - 0x0000)
struct WBP_CharaSelect_Sub_Window_C_PlayRivalInIcon final
{
public:
	EDriverId                                     PlayDriverId;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharaSelect_Sub_CharaIcon_C*       K2Node_DynamicCast_AsWBP_Chara_Select_Sub_Chara_Icon; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharaSelect_Sub_Window_C_PlayRivalInIcon) == 0x000008, "Wrong alignment on WBP_CharaSelect_Sub_Window_C_PlayRivalInIcon");
static_assert(sizeof(WBP_CharaSelect_Sub_Window_C_PlayRivalInIcon) == 0x000048, "Wrong size on WBP_CharaSelect_Sub_Window_C_PlayRivalInIcon");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_PlayRivalInIcon, PlayDriverId) == 0x000000, "Member 'WBP_CharaSelect_Sub_Window_C_PlayRivalInIcon::PlayDriverId' has a wrong offset!");
static_assert(offsetof(WBP_CharaSelect_Sub_Window_C_PlayRivalInIcon, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_CharaSelect_Sub_Window_C_PlayRivalInIcon::Temp_int_Array_Index_Variable' has a wrong offset!");
