#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GrandPrix_SpeechBelt

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GrandPrix_SpeechBelt.WBP_GrandPrix_SpeechBelt_C
// 0x0040 (0x03A8 - 0x0368)
class UWBP_GrandPrix_SpeechBelt_C final : public UDodonpaEventSpeechBeltBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SpeechBelt_Loop;                                   // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 NameBase;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_All;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UVScroll_01;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UVScroll_02;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UVScroll_03;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UVScroll_04;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void CloseMessageSpeechArrow();
	void ExecuteUbergraph_WBP_GrandPrix_SpeechBelt(int32 EntryPoint);
	void OnInitialized();
	void SetMessageSpeechArrow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GrandPrix_SpeechBelt_C">();
	}
	static class UWBP_GrandPrix_SpeechBelt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GrandPrix_SpeechBelt_C>();
	}
};
static_assert(alignof(UWBP_GrandPrix_SpeechBelt_C) == 0x000008, "Wrong alignment on UWBP_GrandPrix_SpeechBelt_C");
static_assert(sizeof(UWBP_GrandPrix_SpeechBelt_C) == 0x0003A8, "Wrong size on UWBP_GrandPrix_SpeechBelt_C");
static_assert(offsetof(UWBP_GrandPrix_SpeechBelt_C, UberGraphFrame) == 0x000368, "Member 'UWBP_GrandPrix_SpeechBelt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrix_SpeechBelt_C, SpeechBelt_Loop) == 0x000370, "Member 'UWBP_GrandPrix_SpeechBelt_C::SpeechBelt_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrix_SpeechBelt_C, NameBase) == 0x000378, "Member 'UWBP_GrandPrix_SpeechBelt_C::NameBase' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrix_SpeechBelt_C, Overlay_All) == 0x000380, "Member 'UWBP_GrandPrix_SpeechBelt_C::Overlay_All' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrix_SpeechBelt_C, UVScroll_01) == 0x000388, "Member 'UWBP_GrandPrix_SpeechBelt_C::UVScroll_01' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrix_SpeechBelt_C, UVScroll_02) == 0x000390, "Member 'UWBP_GrandPrix_SpeechBelt_C::UVScroll_02' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrix_SpeechBelt_C, UVScroll_03) == 0x000398, "Member 'UWBP_GrandPrix_SpeechBelt_C::UVScroll_03' has a wrong offset!");
static_assert(offsetof(UWBP_GrandPrix_SpeechBelt_C, UVScroll_04) == 0x0003A0, "Member 'UWBP_GrandPrix_SpeechBelt_C::UVScroll_04' has a wrong offset!");

}

