#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetIcon

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GadgetIcon.WBP_GadgetIcon_C
// 0x00C0 (0x0708 - 0x0648)
class UWBP_GadgetIcon_C final : public UEquipmentGadgetIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GadgetIcon_Loop_Blink;                             // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GadgetIcon_Loop_Unselected;                        // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GadgetIcon_Loop_Blank;                             // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GadgetIcon_Loop_Cost3;                             // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GadgetIcon_Loop_Cost2;                             // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GadgetIcon_Loop_Cost1;                             // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_01;                                           // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_02;                                           // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_03;                                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_Icon;                                          // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_Cost;                                          // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Cursor_Texture;                                // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Icon_Lock;                                     // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Icon_Plus;                                     // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NewIconWave;                                   // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NGPowerMark;                                   // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_C*                 DSP_WBP_CMN_TextBalloon;                           // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_02_C*              DSP_WBP_CMN_TextBalloon_02;                        // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_HexagonCursor_C*  DSP_WBP_GadgetCustom_Sub_HexagonCursor;            // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Base_Cost;                                     // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0700(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GadgetIcon(int32 EntryPoint);
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnConstInitBpWidgetRef();
	void OnConstMouseInteraction();
	void OnConstUseType();
	void OnDownKeyPressed();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnFocusReceivedInternal(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnLeftKeyPressed();
	void OnLeftShoulderPressed();
	void OnRightKeyPressed();
	void OnRightShoulderPressed();
	void OnUpKeyPressed();
	void PlayUnselectedAnimation();
	void SetGadgetSelectCursorColor(const int32 InPlayerIndex);
	void SetIconBaseShape(const int32 InSizeX, const int32 InSizeY);
	void SetReadyWindowFlag(bool InFlag);
	void SoundPlayMenuCancel();
	void SoundPlayMenuError();
	void SoundPlayMenuFix();
	void SoundPlayMenuTab();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GadgetIcon_C">();
	}
	static class UWBP_GadgetIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GadgetIcon_C>();
	}
};
static_assert(alignof(UWBP_GadgetIcon_C) == 0x000008, "Wrong alignment on UWBP_GadgetIcon_C");
static_assert(sizeof(UWBP_GadgetIcon_C) == 0x000708, "Wrong size on UWBP_GadgetIcon_C");
static_assert(offsetof(UWBP_GadgetIcon_C, UberGraphFrame) == 0x000648, "Member 'UWBP_GadgetIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, GadgetIcon_Loop_Blink) == 0x000650, "Member 'UWBP_GadgetIcon_C::GadgetIcon_Loop_Blink' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, GadgetIcon_Loop_Unselected) == 0x000658, "Member 'UWBP_GadgetIcon_C::GadgetIcon_Loop_Unselected' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, GadgetIcon_Loop_Blank) == 0x000660, "Member 'UWBP_GadgetIcon_C::GadgetIcon_Loop_Blank' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, GadgetIcon_Loop_Cost3) == 0x000668, "Member 'UWBP_GadgetIcon_C::GadgetIcon_Loop_Cost3' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, GadgetIcon_Loop_Cost2) == 0x000670, "Member 'UWBP_GadgetIcon_C::GadgetIcon_Loop_Cost2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, GadgetIcon_Loop_Cost1) == 0x000678, "Member 'UWBP_GadgetIcon_C::GadgetIcon_Loop_Cost1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, Base_01) == 0x000680, "Member 'UWBP_GadgetIcon_C::Base_01' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, Base_02) == 0x000688, "Member 'UWBP_GadgetIcon_C::Base_02' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, Base_03) == 0x000690, "Member 'UWBP_GadgetIcon_C::Base_03' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, DMY_Icon) == 0x000698, "Member 'UWBP_GadgetIcon_C::DMY_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, DSP_Cost) == 0x0006A0, "Member 'UWBP_GadgetIcon_C::DSP_Cost' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, DSP_Cursor_Texture) == 0x0006A8, "Member 'UWBP_GadgetIcon_C::DSP_Cursor_Texture' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, DSP_Icon_Lock) == 0x0006B0, "Member 'UWBP_GadgetIcon_C::DSP_Icon_Lock' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, DSP_Icon_Plus) == 0x0006B8, "Member 'UWBP_GadgetIcon_C::DSP_Icon_Plus' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, DSP_NewIconWave) == 0x0006C0, "Member 'UWBP_GadgetIcon_C::DSP_NewIconWave' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, DSP_NGPowerMark) == 0x0006C8, "Member 'UWBP_GadgetIcon_C::DSP_NGPowerMark' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, DSP_WBP_CMN_TextBalloon) == 0x0006D0, "Member 'UWBP_GadgetIcon_C::DSP_WBP_CMN_TextBalloon' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, DSP_WBP_CMN_TextBalloon_02) == 0x0006D8, "Member 'UWBP_GadgetIcon_C::DSP_WBP_CMN_TextBalloon_02' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, DSP_WBP_GadgetCustom_Sub_HexagonCursor) == 0x0006E0, "Member 'UWBP_GadgetIcon_C::DSP_WBP_GadgetCustom_Sub_HexagonCursor' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, MouseInteraction) == 0x0006E8, "Member 'UWBP_GadgetIcon_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, Panel) == 0x0006F0, "Member 'UWBP_GadgetIcon_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, PAT_Base_Cost) == 0x0006F8, "Member 'UWBP_GadgetIcon_C::PAT_Base_Cost' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetIcon_C, PlayerIndex) == 0x000700, "Member 'UWBP_GadgetIcon_C::PlayerIndex' has a wrong offset!");

}

