#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack.WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Loop;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_Normal;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_image;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Normal;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_Count_Normal;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_Medal_Count_Normal;                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         TotalMedalCount;                                   // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack(int32 EntryPoint);
	void Init();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C">();
	}
	static class UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C>();
	}
};
static_assert(alignof(UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C) == 0x000008, "Wrong alignment on UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C");
static_assert(sizeof(UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C) == 0x000320, "Wrong size on UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C, Btn_Loop) == 0x0002E8, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C::Btn_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C, Base_Normal) == 0x0002F0, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C::Base_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C, Btn_image) == 0x0002F8, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C::Btn_image' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C, Icon_Normal) == 0x000300, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C::Icon_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C, TXT_Num_Count_Normal) == 0x000308, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C::TXT_Num_Count_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C, TXT_Num_Medal_Count_Normal) == 0x000310, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C::TXT_Num_Medal_Count_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C, TotalMedalCount) == 0x000318, "Member 'UWBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C::TotalMedalCount' has a wrong offset!");

}

