#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Festa_TeamGroup_Rank

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_Festa_TeamGroup_Rank.WBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 MLC_Base;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_1st;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_2nd;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_3rd;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Text;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUnionRichTextBlock*>            TxtRankArr;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         NowTeamRank;                                       // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamGroup_Rank(int32 EntryPoint);
	void SetBaseColor(const struct FLinearColor& NewColor);
	void SetTeamRank(int32 TeamRank);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C">();
	}
	static class UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C) == 0x000328, "Wrong size on UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C, MLC_Base) == 0x0002E8, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C::MLC_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C, TXT_1st) == 0x0002F0, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C::TXT_1st' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C, TXT_2nd) == 0x0002F8, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C::TXT_2nd' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C, TXT_3rd) == 0x000300, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C::TXT_3rd' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C, WidgetSwitcher_Text) == 0x000308, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C::WidgetSwitcher_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C, TxtRankArr) == 0x000310, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C::TxtRankArr' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C, NowTeamRank) == 0x000320, "Member 'UWBP_Race_HUD_Sub_Festa_TeamGroup_Rank_C::NowTeamRank' has a wrong offset!");

}

