#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_Sub_Result

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_TimeTrial_Sub_Result.WBP_TimeTrial_Sub_Result_C.ExecuteUbergraph_WBP_TimeTrial_Sub_Result
// 0x0310 (0x0310 - 0x0000)
struct WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_TimeTrial_Sub_Lap_C*               Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Result_DonpaTicket_C*              CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemGet_Window_C*                  CallFunc_Create_ReturnValue_1;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable_2;                            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_3;                            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetSelectedMenuSpeedClassId_ReturnValue;  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x00D4(0x0004)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRewardDispComplete_bIsComplete;         // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F7[0x1];                                       // 0x00F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTicketNum_num;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable_4;                            // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_2;  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_5;                            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_3;  // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDataOnline_ReturnValue;           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x014C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTotalLapTimeText_ReturnValue;          // 0x0160(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue;           // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpeedClassId                                 CallFunc_GetSelectedClassId_ReturnValue;           // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x1];                                      // 0x01AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTimeTrialMedalAcquisitionPerClass_ReturnValue; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTimeTrialMedalAcquisitionPerClass_ReturnValue_1; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable_6;                            // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTimeTrialRewardReceived_ReturnValue;    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableGhost_ReturnValue;                // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableGhost_ReturnValue_1;              // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableGhost_ReturnValue_2;              // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDiffTotalLapTime_OutIsUpTime;     // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDiffTotalLapTime_OutIsSameTime;   // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C7[0x1];                                      // 0x01C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGhostDiffTotalLapTime_ReturnValue;     // 0x01C8(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TimeTrial_Sub_Lap_C*               K2Node_Select_Default_1;                           // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDiffLapTime_OutIsUpTime;          // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGhostDiffLapTime_OutIsSameTime;        // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGhostDiffLapTime_ReturnValue;          // 0x0218(0x0010)()
	bool                                          CallFunc_IsViewDiffLapTime_ReturnValue;            // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLapTimeText_ReturnValue;               // 0x0230(0x0010)()
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_2;      // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_3;      // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeTrialClearRankId                         Temp_byte_Variable_4;                              // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          K2Node_Select_Default_3;                           // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0280(0x0004)()
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeTrialResultRewardTableData        CallFunc_GetCurrentRewardData_ReturnValue;         // 0x0288(0x0068)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x02F0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0300(0x0010)()
};
static_assert(alignof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result) == 0x000008, "Wrong alignment on WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result");
static_assert(sizeof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result) == 0x000310, "Wrong size on WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, EntryPoint) == 0x000000, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_int_Variable) == 0x000004, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_object_Variable) == 0x000018, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_MakeLiteralByte_ReturnValue) == 0x000028, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000029, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00003C, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_Create_ReturnValue_1) == 0x000050, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000058, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000059, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00005C, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_bool_Variable) == 0x000070, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_byte_Variable) == 0x000071, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_byte_Variable_1) == 0x000072, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_bool_Variable_1) == 0x000073, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_byte_Variable_2) == 0x000074, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_byte_Variable_3) == 0x000075, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_CustomEvent_Loaded) == 0x000078, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_object_Variable_1) == 0x000080, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_DynamicCast_As_____2D) == 0x000088, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_object_Variable_2) == 0x000098, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_object_Variable_3) == 0x0000A0, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000A8, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000B0, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x0000C0, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x0000C8, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetSelectedMenuSpeedClassId_ReturnValue) == 0x0000D1, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetSelectedMenuSpeedClassId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_SoundPlay_ReturnValue) == 0x0000D4, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_PlayAnimation_ReturnValue) == 0x0000D8, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000E0, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000E8, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0000F0, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x0000F1, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_BooleanOR_ReturnValue) == 0x0000F2, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsRewardDispComplete_bIsComplete) == 0x0000F3, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsRewardDispComplete_bIsComplete' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_Not_PreBool_ReturnValue) == 0x0000F4, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_BooleanOR_ReturnValue_1) == 0x0000F5, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_SwitchEnum_CmpSuccess) == 0x0000F6, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetTicketNum_num) == 0x0000F8, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetTicketNum_num' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_object_Variable_4) == 0x000100, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_Greater_IntInt_ReturnValue) == 0x000108, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_PlayAnimation_ReturnValue_3) == 0x000110, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_CreatePlayAnimationProxyObject_Result_2) == 0x000118, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_CreatePlayAnimationProxyObject_Result_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2) == 0x000120, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_object_Variable_5) == 0x000128, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsValid_ReturnValue_2) == 0x000130, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_CreatePlayAnimationProxyObject_Result_3) == 0x000138, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_CreatePlayAnimationProxyObject_Result_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3) == 0x000140, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsValid_ReturnValue_3) == 0x000148, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetGhostDataOnline_ReturnValue) == 0x000149, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetGhostDataOnline_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_CreateDelegate_OutputDelegate_4) == 0x00014C, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_SelectInt_ReturnValue) == 0x00015C, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetTotalLapTimeText_ReturnValue) == 0x000160, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetTotalLapTimeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_CreateDelegate_OutputDelegate_5) == 0x000170, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetPlayerController_ReturnValue) == 0x000180, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000188, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetPlayerController_ReturnValue_1) == 0x000198, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x0001A0, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_DynamicCast_bSuccess_2) == 0x0001A8, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_UnregisterMainMenu_ReturnValue) == 0x0001A9, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_UnregisterMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetSelectedClassId_ReturnValue) == 0x0001AA, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetSelectedClassId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetTimeTrialMedalAcquisitionPerClass_ReturnValue) == 0x0001AC, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetTimeTrialMedalAcquisitionPerClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetTimeTrialMedalAcquisitionPerClass_ReturnValue_1) == 0x0001B0, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetTimeTrialMedalAcquisitionPerClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_object_Variable_6) == 0x0001B8, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsTimeTrialRewardReceived_ReturnValue) == 0x0001C0, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsTimeTrialRewardReceived_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsEnableGhost_ReturnValue) == 0x0001C1, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsEnableGhost_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsEnableGhost_ReturnValue_1) == 0x0001C2, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsEnableGhost_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsEnableGhost_ReturnValue_2) == 0x0001C3, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsEnableGhost_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_Select_Default) == 0x0001C4, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetGhostDiffTotalLapTime_OutIsUpTime) == 0x0001C5, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetGhostDiffTotalLapTime_OutIsUpTime' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetGhostDiffTotalLapTime_OutIsSameTime) == 0x0001C6, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetGhostDiffTotalLapTime_OutIsSameTime' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetGhostDiffTotalLapTime_ReturnValue) == 0x0001C8, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetGhostDiffTotalLapTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001D8, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001E8, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetPlayerController_ReturnValue_2) == 0x0001F8, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_int_Variable_1) == 0x000200, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsValid_ReturnValue_4) == 0x000204, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_Select_Default_1) == 0x000208, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetGhostDiffLapTime_OutIsUpTime) == 0x000210, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetGhostDiffLapTime_OutIsUpTime' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetGhostDiffLapTime_OutIsSameTime) == 0x000211, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetGhostDiffLapTime_OutIsSameTime' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetGhostDiffLapTime_ReturnValue) == 0x000218, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetGhostDiffLapTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsViewDiffLapTime_ReturnValue) == 0x000228, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsViewDiffLapTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetLapTimeText_ReturnValue) == 0x000230, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetLapTimeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_Select_Default_2) == 0x000240, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000241, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_Add_IntInt_ReturnValue) == 0x000244, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_DynamicCast_AsApp_Player_Controller_2) == 0x000248, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_DynamicCast_AsApp_Player_Controller_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_DynamicCast_bSuccess_3) == 0x000250, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetPlayerController_ReturnValue_3) == 0x000258, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_IsValid_ReturnValue_5) == 0x000260, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_DynamicCast_AsApp_Player_Controller_3) == 0x000268, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_DynamicCast_AsApp_Player_Controller_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_DynamicCast_bSuccess_4) == 0x000270, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, Temp_byte_Variable_4) == 0x000271, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, K2Node_Select_Default_3) == 0x000278, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_SoundPlay_ReturnValue_1) == 0x000280, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_GetCurrentRewardData_ReturnValue) == 0x000288, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_GetCurrentRewardData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_MakeLiteralText_ReturnValue) == 0x0002F0, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000300, "Member 'WBP_TimeTrial_Sub_Result_C_ExecuteUbergraph_WBP_TimeTrial_Sub_Result::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");

// Function WBP_TimeTrial_Sub_Result.WBP_TimeTrial_Sub_Result_C.GetTextRank
// 0x0080 (0x0080 - 0x0000)
struct WBP_TimeTrial_Sub_Result_C_GetTextRank final
{
public:
	ETimeTrialClearRankId                         InRank;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RankText;                                          // 0x0008(0x0010)(Parm, OutParm)
	ETimeTrialClearRankId                         Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0010)(ConstParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0030(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0040(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0050(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0060(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0070(0x0010)(ConstParm)
};
static_assert(alignof(WBP_TimeTrial_Sub_Result_C_GetTextRank) == 0x000008, "Wrong alignment on WBP_TimeTrial_Sub_Result_C_GetTextRank");
static_assert(sizeof(WBP_TimeTrial_Sub_Result_C_GetTextRank) == 0x000080, "Wrong size on WBP_TimeTrial_Sub_Result_C_GetTextRank");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_GetTextRank, InRank) == 0x000000, "Member 'WBP_TimeTrial_Sub_Result_C_GetTextRank::InRank' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_GetTextRank, RankText) == 0x000008, "Member 'WBP_TimeTrial_Sub_Result_C_GetTextRank::RankText' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_GetTextRank, Temp_byte_Variable) == 0x000018, "Member 'WBP_TimeTrial_Sub_Result_C_GetTextRank::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_GetTextRank, Temp_text_Variable) == 0x000020, "Member 'WBP_TimeTrial_Sub_Result_C_GetTextRank::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_GetTextRank, CallFunc_MakeLiteralText_ReturnValue) == 0x000030, "Member 'WBP_TimeTrial_Sub_Result_C_GetTextRank::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_GetTextRank, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000040, "Member 'WBP_TimeTrial_Sub_Result_C_GetTextRank::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_GetTextRank, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000050, "Member 'WBP_TimeTrial_Sub_Result_C_GetTextRank::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_GetTextRank, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000060, "Member 'WBP_TimeTrial_Sub_Result_C_GetTextRank::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_GetTextRank, K2Node_Select_Default) == 0x000070, "Member 'WBP_TimeTrial_Sub_Result_C_GetTextRank::K2Node_Select_Default' has a wrong offset!");

// Function WBP_TimeTrial_Sub_Result.WBP_TimeTrial_Sub_Result_C.OnLoaded_CA088C7945633BF8179E10AB5B1C85B0
// 0x0008 (0x0008 - 0x0000)
struct WBP_TimeTrial_Sub_Result_C_OnLoaded_CA088C7945633BF8179E10AB5B1C85B0 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_Sub_Result_C_OnLoaded_CA088C7945633BF8179E10AB5B1C85B0) == 0x000008, "Wrong alignment on WBP_TimeTrial_Sub_Result_C_OnLoaded_CA088C7945633BF8179E10AB5B1C85B0");
static_assert(sizeof(WBP_TimeTrial_Sub_Result_C_OnLoaded_CA088C7945633BF8179E10AB5B1C85B0) == 0x000008, "Wrong size on WBP_TimeTrial_Sub_Result_C_OnLoaded_CA088C7945633BF8179E10AB5B1C85B0");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_OnLoaded_CA088C7945633BF8179E10AB5B1C85B0, Loaded) == 0x000000, "Member 'WBP_TimeTrial_Sub_Result_C_OnLoaded_CA088C7945633BF8179E10AB5B1C85B0::Loaded' has a wrong offset!");

// Function WBP_TimeTrial_Sub_Result.WBP_TimeTrial_Sub_Result_C.SetData
// 0x0028 (0x0028 - 0x0000)
struct WBP_TimeTrial_Sub_Result_C_SetData final
{
public:
	TArray<EStageId>                              CallFunc_GetSelectedStageIds_ReturnValue;          // 0x0000(0x0010)(ReferenceParm)
	ESpeedClassId                                 CallFunc_GetSelectedClassId_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalLapTime_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimeTrialRankData                     CallFunc_GetTimeTrialRankData_ReturnValue;         // 0x0018(0x000C)(NoDestructor)
};
static_assert(alignof(WBP_TimeTrial_Sub_Result_C_SetData) == 0x000008, "Wrong alignment on WBP_TimeTrial_Sub_Result_C_SetData");
static_assert(sizeof(WBP_TimeTrial_Sub_Result_C_SetData) == 0x000028, "Wrong size on WBP_TimeTrial_Sub_Result_C_SetData");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_SetData, CallFunc_GetSelectedStageIds_ReturnValue) == 0x000000, "Member 'WBP_TimeTrial_Sub_Result_C_SetData::CallFunc_GetSelectedStageIds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_SetData, CallFunc_GetSelectedClassId_ReturnValue) == 0x000010, "Member 'WBP_TimeTrial_Sub_Result_C_SetData::CallFunc_GetSelectedClassId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_SetData, CallFunc_GetTotalLapTime_ReturnValue) == 0x000014, "Member 'WBP_TimeTrial_Sub_Result_C_SetData::CallFunc_GetTotalLapTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_Result_C_SetData, CallFunc_GetTimeTrialRankData_ReturnValue) == 0x000018, "Member 'WBP_TimeTrial_Sub_Result_C_SetData::CallFunc_GetTimeTrialRankData_ReturnValue' has a wrong offset!");

// Function WBP_TimeTrial_Sub_Result.WBP_TimeTrial_Sub_Result_C.SetTimeTrialClearRank
// 0x0100 (0x0100 - 0x0000)
struct WBP_TimeTrial_Sub_Result_C_SetTimeTrialClearRank final
{
public:
