#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu_Sub_ShopInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TopMenu_Sub_ShopInfo.WBP_TopMenu_Sub_ShopInfo_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_TopMenu_Sub_ShopInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_FontScroll_C*                      WBP_FontScroll_ShopText;                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_CommonBtn_C*        WBP_FooterMenu_Sub_CommonBtn;                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_TopMenu_Sub_ShopInfo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TopMenu_Sub_ShopInfo_C">();
	}
	static class UWBP_TopMenu_Sub_ShopInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TopMenu_Sub_ShopInfo_C>();
	}
};
static_assert(alignof(UWBP_TopMenu_Sub_ShopInfo_C) == 0x000008, "Wrong alignment on UWBP_TopMenu_Sub_ShopInfo_C");
static_assert(sizeof(UWBP_TopMenu_Sub_ShopInfo_C) == 0x0002F8, "Wrong size on UWBP_TopMenu_Sub_ShopInfo_C");
static_assert(offsetof(UWBP_TopMenu_Sub_ShopInfo_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_TopMenu_Sub_ShopInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_ShopInfo_C, WBP_FontScroll_ShopText) == 0x0002E8, "Member 'UWBP_TopMenu_Sub_ShopInfo_C::WBP_FontScroll_ShopText' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_ShopInfo_C, WBP_FooterMenu_Sub_CommonBtn) == 0x0002F0, "Member 'UWBP_TopMenu_Sub_ShopInfo_C::WBP_FooterMenu_Sub_CommonBtn' has a wrong offset!");

}

