#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FooterMenu

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FooterMenu.WBP_FooterMenu_C
// 0x0068 (0x03D8 - 0x0370)
class UWBP_FooterMenu_C final : public UCommonMenuFooterMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FooterMenu_Out;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FooterMenu_Loop;                                   // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FooterMenu_In;                                     // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                MouseInteraction_Cancel;                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseInteraction_OK;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseInteraction_Sub_0;                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseInteraction_Sub_1;                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseInteraction_Sub_2;                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseInteraction_Sub_3;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseInteraction_Sub_4;                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseInteraction_Sub_5;                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Showing;                                           // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_FooterMenu_MouseInteraction_Cancel_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Cancel_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Cancel_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_OK_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_OK_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_OK_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Sub_0_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Sub_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Sub_1_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Sub_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Sub_2_K2Node_ComponentBoundEvent_10_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Sub_2_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Sub_3_K2Node_ComponentBoundEvent_12_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Sub_3_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Sub_4_K2Node_ComponentBoundEvent_14_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Sub_4_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Sub_5_K2Node_ComponentBoundEvent_16_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_FooterMenu_MouseInteraction_Sub_5_K2Node_ComponentBoundEvent_17_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_FooterMenu(int32 EntryPoint);
	void Hide();
	void OnHovered(class UButton* HoveredObject);
	void PlayAnimIn();
	void PlayAnimOut();
	void Show();
	void WidgetAnimationEvt_FooterMenu_In_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FooterMenu_C">();
	}
	static class UWBP_FooterMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FooterMenu_C>();
	}
};
static_assert(alignof(UWBP_FooterMenu_C) == 0x000008, "Wrong alignment on UWBP_FooterMenu_C");
static_assert(sizeof(UWBP_FooterMenu_C) == 0x0003D8, "Wrong size on UWBP_FooterMenu_C");
static_assert(offsetof(UWBP_FooterMenu_C, UberGraphFrame) == 0x000370, "Member 'UWBP_FooterMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_C, FooterMenu_Out) == 0x000378, "Member 'UWBP_FooterMenu_C::FooterMenu_Out' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_C, FooterMenu_Loop) == 0x000380, "Member 'UWBP_FooterMenu_C::FooterMenu_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_C, FooterMenu_In) == 0x000388, "Member 'UWBP_FooterMenu_C::FooterMenu_In' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_C, MouseInteraction_Cancel) == 0x000390, "Member 'UWBP_FooterMenu_C::MouseInteraction_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_C, MouseInteraction_OK) == 0x000398, "Member 'UWBP_FooterMenu_C::MouseInteraction_OK' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_C, MouseInteraction_Sub_0) == 0x0003A0, "Member 'UWBP_FooterMenu_C::MouseInteraction_Sub_0' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_C, MouseInteraction_Sub_1) == 0x0003A8, "Member 'UWBP_FooterMenu_C::MouseInteraction_Sub_1' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_C, MouseInteraction_Sub_2) == 0x0003B0, "Member 'UWBP_FooterMenu_C::MouseInteraction_Sub_2' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_C, MouseInteraction_Sub_3) == 0x0003B8, "Member 'UWBP_FooterMenu_C::MouseInteraction_Sub_3' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_C, MouseInteraction_Sub_4) == 0x0003C0, "Member 'UWBP_FooterMenu_C::MouseInteraction_Sub_4' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_C, MouseInteraction_Sub_5) == 0x0003C8, "Member 'UWBP_FooterMenu_C::MouseInteraction_Sub_5' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_C, Showing) == 0x0003D0, "Member 'UWBP_FooterMenu_C::Showing' has a wrong offset!");

}

