#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tutorial_Controller_Key

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Tutorial_Controller_Key.WBP_Tutorial_Controller_Key_C
// 0x0118 (0x03F8 - 0x02E0)
class UWBP_Tutorial_Controller_Key_C final : public URaceUITutorialControllerKey
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               airTrick;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Down;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Left;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Left_1;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Left_02;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Right_02;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Up;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ChargeJump;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChargeJump_Arrow;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Key_C*                ChargeJump_Btn_Key;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ChargeJump_Hold;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ChargeJump_Release;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChargeJump_Release_Image;                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Drift;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OneKey;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Key_C*                OneKeyButton;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plus_02;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               StartDash;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Key_C*                StartDash_Btn_Key;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Btn_Trigger_L_Hold;                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Btn_Trigger_L_Hold_1;                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Btn_Trigger_L_Release;                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               UseItem;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Key_C*                UseItem_Btn_Key;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Key_C*                WBP_Race_Sub_Btn_Key;                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Key_C*                WBP_Race_Sub_Btn_Key_1;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Key_C*                WBP_Race_Sub_Btn_Key_2;                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Key_C*                WBP_Race_Sub_Btn_Key_3;                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Key_C*                WBP_Race_Sub_Btn_Key_4;                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Key_C*                WBP_Race_Sub_Btn_Key_5;                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Key_C*                WBP_Race_Sub_Btn_Key_6;                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_BasicInfo;                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EHintId                                       Hint_Id;                                           // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Tutorial_Controller_Key(int32 EntryPoint);
	void GetKeyWidgets(ETutorialAction tutorialAction, TArray<class UWBP_Race_Sub_Btn_Key_C*>* KeyWidgets);
	void SetHintAction(EHintId HintId);
	void SetTutorialAction(ETutorialAction tutorialAction);
	void UpdateHintIndex(int32 InIndex);
	void UpdateTutorialIndex(int32 InIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Tutorial_Controller_Key_C">();
	}
	static class UWBP_Tutorial_Controller_Key_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Tutorial_Controller_Key_C>();
	}
};
static_assert(alignof(UWBP_Tutorial_Controller_Key_C) == 0x000008, "Wrong alignment on UWBP_Tutorial_Controller_Key_C");
static_assert(sizeof(UWBP_Tutorial_Controller_Key_C) == 0x0003F8, "Wrong size on UWBP_Tutorial_Controller_Key_C");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Tutorial_Controller_Key_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, airTrick) == 0x0002E8, "Member 'UWBP_Tutorial_Controller_Key_C::airTrick' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, Arrow) == 0x0002F0, "Member 'UWBP_Tutorial_Controller_Key_C::Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, Arrow_Down) == 0x0002F8, "Member 'UWBP_Tutorial_Controller_Key_C::Arrow_Down' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, Arrow_Left) == 0x000300, "Member 'UWBP_Tutorial_Controller_Key_C::Arrow_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, Arrow_Left_1) == 0x000308, "Member 'UWBP_Tutorial_Controller_Key_C::Arrow_Left_1' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, Arrow_Left_02) == 0x000310, "Member 'UWBP_Tutorial_Controller_Key_C::Arrow_Left_02' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, Arrow_Right_02) == 0x000318, "Member 'UWBP_Tutorial_Controller_Key_C::Arrow_Right_02' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, Arrow_Up) == 0x000320, "Member 'UWBP_Tutorial_Controller_Key_C::Arrow_Up' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, ChargeJump) == 0x000328, "Member 'UWBP_Tutorial_Controller_Key_C::ChargeJump' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, ChargeJump_Arrow) == 0x000330, "Member 'UWBP_Tutorial_Controller_Key_C::ChargeJump_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, ChargeJump_Btn_Key) == 0x000338, "Member 'UWBP_Tutorial_Controller_Key_C::ChargeJump_Btn_Key' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, ChargeJump_Hold) == 0x000340, "Member 'UWBP_Tutorial_Controller_Key_C::ChargeJump_Hold' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, ChargeJump_Release) == 0x000348, "Member 'UWBP_Tutorial_Controller_Key_C::ChargeJump_Release' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, ChargeJump_Release_Image) == 0x000350, "Member 'UWBP_Tutorial_Controller_Key_C::ChargeJump_Release_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, Drift) == 0x000358, "Member 'UWBP_Tutorial_Controller_Key_C::Drift' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, OneKey) == 0x000360, "Member 'UWBP_Tutorial_Controller_Key_C::OneKey' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, OneKeyButton) == 0x000368, "Member 'UWBP_Tutorial_Controller_Key_C::OneKeyButton' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, Plus_02) == 0x000370, "Member 'UWBP_Tutorial_Controller_Key_C::Plus_02' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, StartDash) == 0x000378, "Member 'UWBP_Tutorial_Controller_Key_C::StartDash' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, StartDash_Btn_Key) == 0x000380, "Member 'UWBP_Tutorial_Controller_Key_C::StartDash_Btn_Key' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, TXT_Btn_Trigger_L_Hold) == 0x000388, "Member 'UWBP_Tutorial_Controller_Key_C::TXT_Btn_Trigger_L_Hold' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, TXT_Btn_Trigger_L_Hold_1) == 0x000390, "Member 'UWBP_Tutorial_Controller_Key_C::TXT_Btn_Trigger_L_Hold_1' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, TXT_Btn_Trigger_L_Release) == 0x000398, "Member 'UWBP_Tutorial_Controller_Key_C::TXT_Btn_Trigger_L_Release' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, UseItem) == 0x0003A0, "Member 'UWBP_Tutorial_Controller_Key_C::UseItem' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, UseItem_Btn_Key) == 0x0003A8, "Member 'UWBP_Tutorial_Controller_Key_C::UseItem_Btn_Key' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, WBP_Race_Sub_Btn_Key) == 0x0003B0, "Member 'UWBP_Tutorial_Controller_Key_C::WBP_Race_Sub_Btn_Key' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, WBP_Race_Sub_Btn_Key_1) == 0x0003B8, "Member 'UWBP_Tutorial_Controller_Key_C::WBP_Race_Sub_Btn_Key_1' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, WBP_Race_Sub_Btn_Key_2) == 0x0003C0, "Member 'UWBP_Tutorial_Controller_Key_C::WBP_Race_Sub_Btn_Key_2' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, WBP_Race_Sub_Btn_Key_3) == 0x0003C8, "Member 'UWBP_Tutorial_Controller_Key_C::WBP_Race_Sub_Btn_Key_3' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, WBP_Race_Sub_Btn_Key_4) == 0x0003D0, "Member 'UWBP_Tutorial_Controller_Key_C::WBP_Race_Sub_Btn_Key_4' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, WBP_Race_Sub_Btn_Key_5) == 0x0003D8, "Member 'UWBP_Tutorial_Controller_Key_C::WBP_Race_Sub_Btn_Key_5' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, WBP_Race_Sub_Btn_Key_6) == 0x0003E0, "Member 'UWBP_Tutorial_Controller_Key_C::WBP_Race_Sub_Btn_Key_6' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, WidgetSwitcher_BasicInfo) == 0x0003E8, "Member 'UWBP_Tutorial_Controller_Key_C::WidgetSwitcher_BasicInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_Controller_Key_C, Hint_Id) == 0x0003F0, "Member 'UWBP_Tutorial_Controller_Key_C::Hint_Id' has a wrong offset!");

}

