#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetCustom_Sub_HexagonCursor

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GadgetCustom_Sub_HexagonCursor.WBP_GadgetCustom_Sub_HexagonCursor_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_GadgetCustom_Sub_HexagonCursor_C final : public UUserWidget
{
public:
	class UImage*                                 Cursor_01;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_02;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_03;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetShape(int32 InSizeX, int32 InSizeY);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GadgetCustom_Sub_HexagonCursor_C">();
	}
	static class UWBP_GadgetCustom_Sub_HexagonCursor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GadgetCustom_Sub_HexagonCursor_C>();
	}
};
static_assert(alignof(UWBP_GadgetCustom_Sub_HexagonCursor_C) == 0x000008, "Wrong alignment on UWBP_GadgetCustom_Sub_HexagonCursor_C");
static_assert(sizeof(UWBP_GadgetCustom_Sub_HexagonCursor_C) == 0x000300, "Wrong size on UWBP_GadgetCustom_Sub_HexagonCursor_C");
static_assert(offsetof(UWBP_GadgetCustom_Sub_HexagonCursor_C, Cursor_01) == 0x0002E0, "Member 'UWBP_GadgetCustom_Sub_HexagonCursor_C::Cursor_01' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Sub_HexagonCursor_C, Cursor_02) == 0x0002E8, "Member 'UWBP_GadgetCustom_Sub_HexagonCursor_C::Cursor_02' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Sub_HexagonCursor_C, Cursor_03) == 0x0002F0, "Member 'UWBP_GadgetCustom_Sub_HexagonCursor_C::Cursor_03' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Sub_HexagonCursor_C, WidgetSwitcher) == 0x0002F8, "Member 'UWBP_GadgetCustom_Sub_HexagonCursor_C::WidgetSwitcher' has a wrong offset!");

}

