#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_ColorPicker_LiquidIcon

#include "Basic.hpp"

#include "ST_ColorDetailWindowColorItemData_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_ColorPicker_LiquidIcon.WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C
// 0x0050 (0x04D0 - 0x0480)
class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C final : public UUnionUIButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Select_Loop;                                   // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_Loop;                                   // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DSP_Cursor_PaintIcon;                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Set_Icon;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MLC_LiquidIcon;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FST_ColorDetailWindowColorItemData     ItemData;                                          // 0x04B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaySound;                                       // 0x04CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_LiquidIcon(int32 EntryPoint);
	void GetItemData(struct FST_ColorDetailWindowColorItemData* OutItemData);
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnDownKeyPressed();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnFocusReceivedInternal(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnLeftKeyPressed();
	void OnLeftShoulderPressed();
	void OnRightKeyPressed();
	void OnRightShoulderPressed();
	void OnUpKeyPressed();
	void SetColor(const struct FLinearColor& InColor);
	void SetCursorVisible(bool bInIsVisible);
	void SetSelectIconVisible(bool bInIsVisible);
	void Setup(const struct FST_ColorDetailWindowColorItemData& InItemData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C">();
	}
	static class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C) == 0x0004D0, "Wrong size on UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C, UberGraphFrame) == 0x000480, "Member 'UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C, Btn_Select_Loop) == 0x000488, "Member 'UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C::Btn_Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C, Btn_Active_Loop) == 0x000490, "Member 'UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C::Btn_Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C, DSP_Cursor_PaintIcon) == 0x000498, "Member 'UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C::DSP_Cursor_PaintIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C, DSP_Set_Icon) == 0x0004A0, "Member 'UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C::DSP_Set_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C, MLC_LiquidIcon) == 0x0004A8, "Member 'UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C::MLC_LiquidIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C, ItemData) == 0x0004B0, "Member 'UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C::ItemData' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C, PlayerIndex) == 0x0004C8, "Member 'UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C::PlayerIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C, IsPlaySound) == 0x0004CC, "Member 'UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C::IsPlaySound' has a wrong offset!");

}

