#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FestaResult_Sub_Lead_no1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FestaResult_Sub_Lead_no1.WBP_FestaResult_Sub_Lead_no1_C
// 0x0060 (0x0340 - 0x02E0)
class UWBP_FestaResult_Sub_Lead_no1_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InLoop;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_cross;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_cross_1;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_cross_2;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Laurl_L;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Laurl_R;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_LeadTime_Ranking;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_FestaResult_Sub_Lead_no1(int32 EntryPoint);
	void Open();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FestaResult_Sub_Lead_no1_C">();
	}
	static class UWBP_FestaResult_Sub_Lead_no1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FestaResult_Sub_Lead_no1_C>();
	}
};
static_assert(alignof(UWBP_FestaResult_Sub_Lead_no1_C) == 0x000008, "Wrong alignment on UWBP_FestaResult_Sub_Lead_no1_C");
static_assert(sizeof(UWBP_FestaResult_Sub_Lead_no1_C) == 0x000340, "Wrong size on UWBP_FestaResult_Sub_Lead_no1_C");
static_assert(offsetof(UWBP_FestaResult_Sub_Lead_no1_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_FestaResult_Sub_Lead_no1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_Sub_Lead_no1_C, Out) == 0x0002E8, "Member 'UWBP_FestaResult_Sub_Lead_no1_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_Sub_Lead_no1_C, InLoop) == 0x0002F0, "Member 'UWBP_FestaResult_Sub_Lead_no1_C::InLoop' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_Sub_Lead_no1_C, base) == 0x0002F8, "Member 'UWBP_FestaResult_Sub_Lead_no1_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_Sub_Lead_no1_C, Eff_cross) == 0x000300, "Member 'UWBP_FestaResult_Sub_Lead_no1_C::Eff_cross' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_Sub_Lead_no1_C, Eff_cross_1) == 0x000308, "Member 'UWBP_FestaResult_Sub_Lead_no1_C::Eff_cross_1' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_Sub_Lead_no1_C, Eff_cross_2) == 0x000310, "Member 'UWBP_FestaResult_Sub_Lead_no1_C::Eff_cross_2' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_Sub_Lead_no1_C, Laurl_L) == 0x000318, "Member 'UWBP_FestaResult_Sub_Lead_no1_C::Laurl_L' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_Sub_Lead_no1_C, Laurl_R) == 0x000320, "Member 'UWBP_FestaResult_Sub_Lead_no1_C::Laurl_R' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_Sub_Lead_no1_C, Line) == 0x000328, "Member 'UWBP_FestaResult_Sub_Lead_no1_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_Sub_Lead_no1_C, Line_1) == 0x000330, "Member 'UWBP_FestaResult_Sub_Lead_no1_C::Line_1' has a wrong offset!");
static_assert(offsetof(UWBP_FestaResult_Sub_Lead_no1_C, TXT_LeadTime_Ranking) == 0x000338, "Member 'UWBP_FestaResult_Sub_Lead_no1_C::TXT_LeadTime_Ranking' has a wrong offset!");

}

