#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Online_PlayerDetail

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Online_PlayerDetail.WBP_Online_PlayerDetail_C
// 0x0090 (0x0610 - 0x0580)
class UWBP_Online_PlayerDetail_C final : public UOnlinePlayerDetailBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PlayerDetail_Out;                                  // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayerDetail_Loop;                                 // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayerDetail_In;                                   // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_L_01;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_L_02;                                        // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_R_01;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_R_02;                                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_Arrow_L;                                       // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_Arrow_R;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteractionLeft;                              // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteractionRight;                             // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_BlockWindow_C*                 WBP_CMN_BlockWindow;                               // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_Nice_C*                        WBP_CMN_Nice;                                      // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerDetail_C*                WBP_CMN_PlayerDetail;                              // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 ProductUserId;                                     // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsShowFooterMenu;                                  // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Online_PlayerDetail_MouseInteractionLeft_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_Online_PlayerDetail_MouseInteractionRight_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Online_PlayerDetail(int32 EntryPoint);
	void Finished_2C2E66D04B49E1E67A141281AAECF75E();
	void Finished_313853F64CC3D4D327F064BECA46477C();
	void Finished_3F374074423901EAE5BD6BA0AE4BA0CA();
	void Finished_4038A3DD4AD1DD246A76F9BC3D2446A5();
	void Finished_5D342DE8494A7409EAD869BF14F136F8();
	void OnAcceptKeyPressed();
	void OnAcceptNiceEvent();
	void OnBackKeyPressed();
	void OnClosedBlockWindowEvent();
	void OnFaceButtonLeftPressed();
	void OnFaceButtonTopPressed();
	void OnLeftKeyPressed();
	void OnPlayDetailInAnimEvent();
	void OnPlayDetailOutAnimEvent();
	void OnPlayerProfileFocusEndEvent();
	void OnRightKeyPressed();
	void OnUpdateNiceCount(int32 InNiceCount);
	void PreConstruct(bool IsDesignTime);
	void Set_Lobby_Player_Data(const struct FLobbyPlayerData& InPlayerData, bool bIsBlocked, bool bIsOwn, bool bIsSentNice, int32 NiceCounts, const class FString& ProductUserId_0, EBlockPlayerState BlockType, bool bIsNPC);
	void SetPlayerDetailData(const struct FLobbyPlayerData& InPlayerData, EBlockPlayerState InBlockType, bool bInIsOwn, bool bInIsSendNice, bool bInIsNPC, int32 InNiceCount, const class FString& InProductUserId, bool bInIsOwnHost, EMatchingLobbyType InLobbyType, const class FString& InPlatformId, const class FString& InPlatform, bool bInIsEnableBlockWindowButton);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Online_PlayerDetail_C">();
	}
	static class UWBP_Online_PlayerDetail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Online_PlayerDetail_C>();
	}
};
static_assert(alignof(UWBP_Online_PlayerDetail_C) == 0x000008, "Wrong alignment on UWBP_Online_PlayerDetail_C");
static_assert(sizeof(UWBP_Online_PlayerDetail_C) == 0x000610, "Wrong size on UWBP_Online_PlayerDetail_C");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, UberGraphFrame) == 0x000580, "Member 'UWBP_Online_PlayerDetail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, PlayerDetail_Out) == 0x000588, "Member 'UWBP_Online_PlayerDetail_C::PlayerDetail_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, PlayerDetail_Loop) == 0x000590, "Member 'UWBP_Online_PlayerDetail_C::PlayerDetail_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, PlayerDetail_In) == 0x000598, "Member 'UWBP_Online_PlayerDetail_C::PlayerDetail_In' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, Arrow_L_01) == 0x0005A0, "Member 'UWBP_Online_PlayerDetail_C::Arrow_L_01' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, Arrow_L_02) == 0x0005A8, "Member 'UWBP_Online_PlayerDetail_C::Arrow_L_02' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, Arrow_R_01) == 0x0005B0, "Member 'UWBP_Online_PlayerDetail_C::Arrow_R_01' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, Arrow_R_02) == 0x0005B8, "Member 'UWBP_Online_PlayerDetail_C::Arrow_R_02' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, DSP_Arrow_L) == 0x0005C0, "Member 'UWBP_Online_PlayerDetail_C::DSP_Arrow_L' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, DSP_Arrow_R) == 0x0005C8, "Member 'UWBP_Online_PlayerDetail_C::DSP_Arrow_R' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, MouseInteractionLeft) == 0x0005D0, "Member 'UWBP_Online_PlayerDetail_C::MouseInteractionLeft' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, MouseInteractionRight) == 0x0005D8, "Member 'UWBP_Online_PlayerDetail_C::MouseInteractionRight' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, WBP_CMN_BlockWindow) == 0x0005E0, "Member 'UWBP_Online_PlayerDetail_C::WBP_CMN_BlockWindow' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, WBP_CMN_Nice) == 0x0005E8, "Member 'UWBP_Online_PlayerDetail_C::WBP_CMN_Nice' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, WBP_CMN_PlayerDetail) == 0x0005F0, "Member 'UWBP_Online_PlayerDetail_C::WBP_CMN_PlayerDetail' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, ProductUserId) == 0x0005F8, "Member 'UWBP_Online_PlayerDetail_C::ProductUserId' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerDetail_C, IsShowFooterMenu) == 0x000608, "Member 'UWBP_Online_PlayerDetail_C::IsShowFooterMenu' has a wrong offset!");

}

