#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSelect_Sub_Thumbnail_CrossWorld

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CourseSelect_Sub_Thumbnail_CrossWorld.WBP_CourseSelect_Sub_Thumbnail_CrossWorld_C
// 0x0150 (0x0560 - 0x0410)
class UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C final : public UMultiplePanelLoopScrollControl
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ScrollAnim;                                        // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUnionUILoopScrollBox*                  UnionScroll;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_StageBox_Multiple_C* WBP_CourseSelect_Sub_StageBox_Multiple_01;      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_StageBox_Multiple_C* WBP_CourseSelect_Sub_StageBox_Multiple_02;      // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_StageBox_Multiple_C* WBP_CourseSelect_Sub_StageBox_Multiple_03;      // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_StageBox_Multiple_C* WBP_CourseSelect_Sub_StageBox_Multiple_04;      // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_StageBox_Multiple_C* WBP_CourseSelect_Sub_StageBox_Multiple_05;      // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_CourseSelect_Sub_StageBox_Multiple_C*> CourseSelectSubStageBoxArray;           // 0x0450(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<EStageId>                              CrossWorldStageIds;                                // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_CourseSelect_Sub_StageBox_Multiple_C* LastFocusCourseWidget;                          // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(EStageId StageId, int32 PanelIndex, int32 ButtonIndex)> OnFocusThumbnail; // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<EStageId, double>                        CourseCompleteRate;                                // 0x0488(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EStageId, class FText>                   ValidStageId;                                      // 0x04D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bLastAnimDownRight;                                // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x3];                                      // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scroll_Width;                                      // 0x052C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pivot_Rate;                                        // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFocusSoundEnable;                                 // 0x0534(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_535[0x3];                                      // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> OnDecideCrossWorld; // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> OnCancelCrossWorld; // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsScrollActive;                                   // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CourseSelect_Sub_Thumbnail_CrossWorld(int32 EntryPoint);
	void InitializeCrossWorldCourseSelect(ESpeedClassId InSpeedClassId);
	void NextPanelNavigation(EUINavigation Selection);
	void OnCancelCourseEvent(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnDecideCourseEvent(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnFocusCourseEvent(class UUnionUIButtonBase* Button);
	void OnFocusPanel();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void SetFocusIndex(int32 InIndex);
	void SetGameModeId(EGameModeId InGameModeId);
	void SetMedalView(class UWBP_CourseSelect_Sub_StageBox_Multiple_C* InCourseSelect, int32 InPageIndex, const TArray<ETimeTrialClearRankId>& TimeTrialClearRanks);
	void SetScrollActiveFlag(bool bIsScrollActive_0);
	void SetStageBoxInteractableState(bool Interactable);
	void Setup_Medal_Acquisitions(ESpeedClassId InSpeedClass);
	void Setup_Tmb(const TMap<EStageId, TSoftObjectPtr<class UTexture2D>>& StageId_Tmb);
	void SetupCourseSelectSubStageBox(class UWBP_CourseSelect_Sub_StageBox_Multiple_C* InCourseSelect, int32 InPageIndex, TArray<EStageId>& InStageIds, TArray<bool>& InMedalAcuisitions);
	void ThumbnailBindEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CourseSelect_Sub_Thumbnail_CrossWorld_C">();
	}
	static class UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C>();
	}
};
static_assert(alignof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C) == 0x000008, "Wrong alignment on UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C");
static_assert(sizeof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C) == 0x000560, "Wrong size on UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, UberGraphFrame) == 0x000410, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, ScrollAnim) == 0x000418, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::ScrollAnim' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, UnionScroll) == 0x000420, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::UnionScroll' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, WBP_CourseSelect_Sub_StageBox_Multiple_01) == 0x000428, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::WBP_CourseSelect_Sub_StageBox_Multiple_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, WBP_CourseSelect_Sub_StageBox_Multiple_02) == 0x000430, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::WBP_CourseSelect_Sub_StageBox_Multiple_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, WBP_CourseSelect_Sub_StageBox_Multiple_03) == 0x000438, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::WBP_CourseSelect_Sub_StageBox_Multiple_03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, WBP_CourseSelect_Sub_StageBox_Multiple_04) == 0x000440, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::WBP_CourseSelect_Sub_StageBox_Multiple_04' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, WBP_CourseSelect_Sub_StageBox_Multiple_05) == 0x000448, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::WBP_CourseSelect_Sub_StageBox_Multiple_05' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, CourseSelectSubStageBoxArray) == 0x000450, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::CourseSelectSubStageBoxArray' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, CrossWorldStageIds) == 0x000460, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::CrossWorldStageIds' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, LastFocusCourseWidget) == 0x000470, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::LastFocusCourseWidget' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, OnFocusThumbnail) == 0x000478, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::OnFocusThumbnail' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, CourseCompleteRate) == 0x000488, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::CourseCompleteRate' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, ValidStageId) == 0x0004D8, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::ValidStageId' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, bLastAnimDownRight) == 0x000528, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::bLastAnimDownRight' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, Scroll_Width) == 0x00052C, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::Scroll_Width' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, Pivot_Rate) == 0x000530, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::Pivot_Rate' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, bFocusSoundEnable) == 0x000534, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::bFocusSoundEnable' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, OnDecideCrossWorld) == 0x000538, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::OnDecideCrossWorld' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, OnCancelCrossWorld) == 0x000548, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::OnCancelCrossWorld' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C, bIsScrollActive) == 0x000558, "Member 'UWBP_CourseSelect_Sub_Thumbnail_CrossWorld_C::bIsScrollActive' has a wrong offset!");

}

