#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ready_Sub_ChanaWindow_P1

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Ready_Sub_ChanaWindow_P1.WBP_Ready_Sub_ChanaWindow_P1_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_Ready_Sub_ChanaWindow_P1_C final : public UReadyWindowCharacterIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Chara_Base;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Chara_NameBase;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_CharaCutIn;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_CharaName;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             CharaIconTexture;                                  // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   CharaName;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Ready_Sub_ChanaWindow_P1(int32 EntryPoint);
	void OnLoaded_CA3D935E44192617A2D48ABBF6E232A2(class UObject* Loaded);
	void SetCharacterIconCheckMark(bool bIsCheck);
	void SetCharacterIconData();
	void SetCharacterIconTexture(const TSoftObjectPtr<class UTexture2D>& Texture, const class FText& Name_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Ready_Sub_ChanaWindow_P1_C">();
	}
	static class UWBP_Ready_Sub_ChanaWindow_P1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Ready_Sub_ChanaWindow_P1_C>();
	}
};
static_assert(alignof(UWBP_Ready_Sub_ChanaWindow_P1_C) == 0x000008, "Wrong alignment on UWBP_Ready_Sub_ChanaWindow_P1_C");
static_assert(sizeof(UWBP_Ready_Sub_ChanaWindow_P1_C) == 0x000320, "Wrong size on UWBP_Ready_Sub_ChanaWindow_P1_C");
static_assert(offsetof(UWBP_Ready_Sub_ChanaWindow_P1_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Ready_Sub_ChanaWindow_P1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_ChanaWindow_P1_C, Chara_Base) == 0x0002E8, "Member 'UWBP_Ready_Sub_ChanaWindow_P1_C::Chara_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_ChanaWindow_P1_C, Chara_NameBase) == 0x0002F0, "Member 'UWBP_Ready_Sub_ChanaWindow_P1_C::Chara_NameBase' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_ChanaWindow_P1_C, DMY_CharaCutIn) == 0x0002F8, "Member 'UWBP_Ready_Sub_ChanaWindow_P1_C::DMY_CharaCutIn' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_ChanaWindow_P1_C, TXT_CharaName) == 0x000300, "Member 'UWBP_Ready_Sub_ChanaWindow_P1_C::TXT_CharaName' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_ChanaWindow_P1_C, CharaIconTexture) == 0x000308, "Member 'UWBP_Ready_Sub_ChanaWindow_P1_C::CharaIconTexture' has a wrong offset!");
static_assert(offsetof(UWBP_Ready_Sub_ChanaWindow_P1_C, CharaName) == 0x000310, "Member 'UWBP_Ready_Sub_ChanaWindow_P1_C::CharaName' has a wrong offset!");

}

