#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineSelect_Sub_PartsIcon_FR

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MachineSelect_Sub_PartsIcon_FR.WBP_MachineSelect_Sub_PartsIcon_FR_C.ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR
// 0x0028 (0x0028 - 0x0000)
struct WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocus_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR) == 0x000008, "Wrong alignment on WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR");
static_assert(sizeof(WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR) == 0x000028, "Wrong size on WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR");
static_assert(offsetof(WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR, EntryPoint) == 0x000000, "Member 'WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR, CallFunc_HasUserFocus_ReturnValue) == 0x000010, "Member 'WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR::CallFunc_HasUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR, K2Node_Event_Animation) == 0x000018, "Member 'WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000020, "Member 'WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR, CallFunc_GetSelected_ReturnValue) == 0x000021, "Member 'WBP_MachineSelect_Sub_PartsIcon_FR_C_ExecuteUbergraph_WBP_MachineSelect_Sub_PartsIcon_FR::CallFunc_GetSelected_ReturnValue' has a wrong offset!");

// Function WBP_MachineSelect_Sub_PartsIcon_FR.WBP_MachineSelect_Sub_PartsIcon_FR_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineSelect_Sub_PartsIcon_FR_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineSelect_Sub_PartsIcon_FR_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_MachineSelect_Sub_PartsIcon_FR_C_OnAnimationFinished");
static_assert(sizeof(WBP_MachineSelect_Sub_PartsIcon_FR_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_MachineSelect_Sub_PartsIcon_FR_C_OnAnimationFinished");
static_assert(offsetof(WBP_MachineSelect_Sub_PartsIcon_FR_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_MachineSelect_Sub_PartsIcon_FR_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_MachineSelect_Sub_PartsIcon_FR.WBP_MachineSelect_Sub_PartsIcon_FR_C.PlayAnimDefault
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimDefault final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimDefault) == 0x000008, "Wrong alignment on WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimDefault");
static_assert(sizeof(WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimDefault) == 0x000008, "Wrong size on WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimDefault");
static_assert(offsetof(WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimDefault, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimDefault::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MachineSelect_Sub_PartsIcon_FR.WBP_MachineSelect_Sub_PartsIcon_FR_C.PlayAnimLock
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimLock final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimLock) == 0x000008, "Wrong alignment on WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimLock");
static_assert(sizeof(WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimLock) == 0x000008, "Wrong size on WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimLock");
static_assert(offsetof(WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimLock, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimLock::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MachineSelect_Sub_PartsIcon_FR.WBP_MachineSelect_Sub_PartsIcon_FR_C.PlayAnimUnLock
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimUnLock final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimUnLock) == 0x000008, "Wrong alignment on WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimUnLock");
static_assert(sizeof(WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimUnLock) == 0x000008, "Wrong size on WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimUnLock");
static_assert(offsetof(WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimUnLock, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_MachineSelect_Sub_PartsIcon_FR_C_PlayAnimUnLock::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

