#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_Sub_PlayerPlate_Small

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Friend_Sub_PlayerPlate_Small.WBP_Friend_Sub_PlayerPlate_Small_C
// 0x0020 (0x04A0 - 0x0480)
class UWBP_Friend_Sub_PlayerPlate_Small_C final : public UUnionUIButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PlayerPlate_Out;                                   // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayerPlate_Loop;                                  // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_PlayerPlate_C*          WBP_Friend_Sub_PlayerPlate;                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Friend_Sub_PlayerPlate_Small(int32 EntryPoint);
	void GetMainWidget(class UWBP_Friend_Sub_PlayerPlate_C** OutMainWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Friend_Sub_PlayerPlate_Small_C">();
	}
	static class UWBP_Friend_Sub_PlayerPlate_Small_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Friend_Sub_PlayerPlate_Small_C>();
	}
};
static_assert(alignof(UWBP_Friend_Sub_PlayerPlate_Small_C) == 0x000008, "Wrong alignment on UWBP_Friend_Sub_PlayerPlate_Small_C");
static_assert(sizeof(UWBP_Friend_Sub_PlayerPlate_Small_C) == 0x0004A0, "Wrong size on UWBP_Friend_Sub_PlayerPlate_Small_C");
static_assert(offsetof(UWBP_Friend_Sub_PlayerPlate_Small_C, UberGraphFrame) == 0x000480, "Member 'UWBP_Friend_Sub_PlayerPlate_Small_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_Sub_PlayerPlate_Small_C, PlayerPlate_Out) == 0x000488, "Member 'UWBP_Friend_Sub_PlayerPlate_Small_C::PlayerPlate_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_Sub_PlayerPlate_Small_C, PlayerPlate_Loop) == 0x000490, "Member 'UWBP_Friend_Sub_PlayerPlate_Small_C::PlayerPlate_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_Sub_PlayerPlate_Small_C, WBP_Friend_Sub_PlayerPlate) == 0x000498, "Member 'UWBP_Friend_Sub_PlayerPlate_Small_C::WBP_Friend_Sub_PlayerPlate' has a wrong offset!");

}

