#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_Sub_PlayerPlate_Small

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Friend_Sub_PlayerPlate_Small.WBP_Friend_Sub_PlayerPlate_Small_C.ExecuteUbergraph_WBP_Friend_Sub_PlayerPlate_Small
// 0x0004 (0x0004 - 0x0000)
struct WBP_Friend_Sub_PlayerPlate_Small_C_ExecuteUbergraph_WBP_Friend_Sub_PlayerPlate_Small final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_PlayerPlate_Small_C_ExecuteUbergraph_WBP_Friend_Sub_PlayerPlate_Small) == 0x000004, "Wrong alignment on WBP_Friend_Sub_PlayerPlate_Small_C_ExecuteUbergraph_WBP_Friend_Sub_PlayerPlate_Small");
static_assert(sizeof(WBP_Friend_Sub_PlayerPlate_Small_C_ExecuteUbergraph_WBP_Friend_Sub_PlayerPlate_Small) == 0x000004, "Wrong size on WBP_Friend_Sub_PlayerPlate_Small_C_ExecuteUbergraph_WBP_Friend_Sub_PlayerPlate_Small");
static_assert(offsetof(WBP_Friend_Sub_PlayerPlate_Small_C_ExecuteUbergraph_WBP_Friend_Sub_PlayerPlate_Small, EntryPoint) == 0x000000, "Member 'WBP_Friend_Sub_PlayerPlate_Small_C_ExecuteUbergraph_WBP_Friend_Sub_PlayerPlate_Small::EntryPoint' has a wrong offset!");

// Function WBP_Friend_Sub_PlayerPlate_Small.WBP_Friend_Sub_PlayerPlate_Small_C.GetMainWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_PlayerPlate_Small_C_GetMainWidget final
{
public:
	class UWBP_Friend_Sub_PlayerPlate_C*          OutMainWidget;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_PlayerPlate_Small_C_GetMainWidget) == 0x000008, "Wrong alignment on WBP_Friend_Sub_PlayerPlate_Small_C_GetMainWidget");
static_assert(sizeof(WBP_Friend_Sub_PlayerPlate_Small_C_GetMainWidget) == 0x000008, "Wrong size on WBP_Friend_Sub_PlayerPlate_Small_C_GetMainWidget");
static_assert(offsetof(WBP_Friend_Sub_PlayerPlate_Small_C_GetMainWidget, OutMainWidget) == 0x000000, "Member 'WBP_Friend_Sub_PlayerPlate_Small_C_GetMainWidget::OutMainWidget' has a wrong offset!");

}

