#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HonorTitle_Plate

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HonorTitle_Plate.WBP_HonorTitle_Plate_C.ExecuteUbergraph_WBP_HonorTitle_Plate
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHonorTitleListData                    K2Node_Event_SetupData;                            // 0x0018(0x0050)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHonorTitleFontColor                          Temp_byte_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionFontScroll*                       K2Node_Select_Default;                             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_1;           // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate) == 0x000008, "Wrong alignment on WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate");
static_assert(sizeof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate) == 0x0000D0, "Wrong size on WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, EntryPoint) == 0x000000, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, K2Node_Event_SetupData) == 0x000018, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::K2Node_Event_SetupData' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00006C, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000078, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, K2Node_CustomEvent_Loaded) == 0x000080, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, Temp_byte_Variable) == 0x000088, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, K2Node_Select_Default) == 0x000090, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, K2Node_CreateDelegate_OutputDelegate_1) == 0x000098, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, K2Node_CustomEvent_InVisibility) == 0x0000A8, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, Temp_object_Variable) == 0x0000B0, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000B8, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, K2Node_DynamicCast_As_____2D) == 0x0000C0, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000C9, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate, CallFunc_BooleanAND_ReturnValue) == 0x0000CA, "Member 'WBP_HonorTitle_Plate_C_ExecuteUbergraph_WBP_HonorTitle_Plate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_HonorTitle_Plate.WBP_HonorTitle_Plate_C.OnLoaded_EEF55983447D6E2AAAF1AB9849C4A735
// 0x0008 (0x0008 - 0x0000)
struct WBP_HonorTitle_Plate_C_OnLoaded_EEF55983447D6E2AAAF1AB9849C4A735 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HonorTitle_Plate_C_OnLoaded_EEF55983447D6E2AAAF1AB9849C4A735) == 0x000008, "Wrong alignment on WBP_HonorTitle_Plate_C_OnLoaded_EEF55983447D6E2AAAF1AB9849C4A735");
static_assert(sizeof(WBP_HonorTitle_Plate_C_OnLoaded_EEF55983447D6E2AAAF1AB9849C4A735) == 0x000008, "Wrong size on WBP_HonorTitle_Plate_C_OnLoaded_EEF55983447D6E2AAAF1AB9849C4A735");
static_assert(offsetof(WBP_HonorTitle_Plate_C_OnLoaded_EEF55983447D6E2AAAF1AB9849C4A735, Loaded) == 0x000000, "Member 'WBP_HonorTitle_Plate_C_OnLoaded_EEF55983447D6E2AAAF1AB9849C4A735::Loaded' has a wrong offset!");

// Function WBP_HonorTitle_Plate.WBP_HonorTitle_Plate_C.SetHonorTitle
// 0x0088 (0x0088 - 0x0000)
struct WBP_HonorTitle_Plate_C_SetHonorTitle final
{
public:
	int32                                         InHonorId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SetHonorTitleId;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsHonorTitleReleased_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHonorTitleListDataAsset*               K2Node_DynamicCast_AsHonor_Title_List_Data_Asset;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHonorTitleListData                    CallFunc_Map_Find_Value;                           // 0x0030(0x0050)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HonorTitle_Plate_C_SetHonorTitle) == 0x000008, "Wrong alignment on WBP_HonorTitle_Plate_C_SetHonorTitle");
static_assert(sizeof(WBP_HonorTitle_Plate_C_SetHonorTitle) == 0x000088, "Wrong size on WBP_HonorTitle_Plate_C_SetHonorTitle");
static_assert(offsetof(WBP_HonorTitle_Plate_C_SetHonorTitle, InHonorId) == 0x000000, "Member 'WBP_HonorTitle_Plate_C_SetHonorTitle::InHonorId' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_SetHonorTitle, SetHonorTitleId) == 0x000004, "Member 'WBP_HonorTitle_Plate_C_SetHonorTitle::SetHonorTitleId' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_SetHonorTitle, CallFunc_GetIsHonorTitleReleased_ReturnValue) == 0x000008, "Member 'WBP_HonorTitle_Plate_C_SetHonorTitle::CallFunc_GetIsHonorTitleReleased_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_SetHonorTitle, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_HonorTitle_Plate_C_SetHonorTitle::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_SetHonorTitle, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_HonorTitle_Plate_C_SetHonorTitle::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_SetHonorTitle, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_HonorTitle_Plate_C_SetHonorTitle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_SetHonorTitle, K2Node_DynamicCast_AsHonor_Title_List_Data_Asset) == 0x000020, "Member 'WBP_HonorTitle_Plate_C_SetHonorTitle::K2Node_DynamicCast_AsHonor_Title_List_Data_Asset' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_SetHonorTitle, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_HonorTitle_Plate_C_SetHonorTitle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_SetHonorTitle, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'WBP_HonorTitle_Plate_C_SetHonorTitle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_SetHonorTitle, CallFunc_Map_Find_Value) == 0x000030, "Member 'WBP_HonorTitle_Plate_C_SetHonorTitle::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_HonorTitle_Plate_C_SetHonorTitle, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'WBP_HonorTitle_Plate_C_SetHonorTitle::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_HonorTitle_Plate.WBP_HonorTitle_Plate_C.SetupTitlePlate
// 0x0050 (0x0050 - 0x0000)
struct WBP_HonorTitle_Plate_C_SetupTitlePlate final
{
public:
	struct FHonorTitleListData                    SetUpData;                                         // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_HonorTitle_Plate_C_SetupTitlePlate) == 0x000008, "Wrong alignment on WBP_HonorTitle_Plate_C_SetupTitlePlate");
static_assert(sizeof(WBP_HonorTitle_Plate_C_SetupTitlePlate) == 0x000050, "Wrong size on WBP_HonorTitle_Plate_C_SetupTitlePlate");
static_assert(offsetof(WBP_HonorTitle_Plate_C_SetupTitlePlate, SetUpData) == 0x000000, "Member 'WBP_HonorTitle_Plate_C_SetupTitlePlate::SetUpData' has a wrong offset!");

// Function WBP_HonorTitle_Plate.WBP_HonorTitle_Plate_C.UpdateWhenVisbilityChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_HonorTitle_Plate_C_UpdateWhenVisbilityChanged final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HonorTitle_Plate_C_UpdateWhenVisbilityChanged) == 0x000001, "Wrong alignment on WBP_HonorTitle_Plate_C_UpdateWhenVisbilityChanged");
static_assert(sizeof(WBP_HonorTitle_Plate_C_UpdateWhenVisbilityChanged) == 0x000001, "Wrong size on WBP_HonorTitle_Plate_C_UpdateWhenVisbilityChanged");
static_assert(offsetof(WBP_HonorTitle_Plate_C_UpdateWhenVisbilityChanged, InVisibility) == 0x000000, "Member 'WBP_HonorTitle_Plate_C_UpdateWhenVisbilityChanged::InVisibility' has a wrong offset!");

}

