#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_Window_Simple

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Popup_Window_Simple.WBP_Popup_Window_Simple_C
// 0x0058 (0x0448 - 0x03F0)
class UWBP_Popup_Window_Simple_C final : public UUnionUIPopupWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Popup_Out;                                         // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_Loop;                                        // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_In;                                          // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Info;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          WBP_Popup_Sub_Btn_Standard_01;                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Sub_Btn_Standard_C*          WBP_Popup_Sub_Btn_Standard_02;                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBase;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Popup_Sub_Btn_Standard_C*>  Buttons;                                           // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_WBP_Popup_Window_Simple(int32 EntryPoint);
	class UWidgetAnimation* GetAnimationIn();
	class UWidgetAnimation* GetAnimationLoop();
	class UWidgetAnimation* GetAnimationOut();
	EPopupWindowButtonType GetPopupWindowButtonType();
	EPopupWindowType GetPopupWindowType();
	void InitParam(EPopupWindowButtonType ButtonType);
	void PlayAnimationIn();
	void PreConstruct(bool IsDesignTime);
	void SetButtonControlDelayTime(float InTime);
	void SetButtonText(const TArray<class FText>& BtnTextArray);
	void SetDisplayFooterButton(const bool InDisplay);
	void SetDonpaTicketCount(int32 CurrentCount, int32 AfterCount);
	void SetEnableInput(bool InEnable);
	void SetFooterMenuBtn(int32 BtnIconIndex, int32 BtnIconType, const class FText& BtnText);
	void SetImageButtonSelectText(const class FText& InText);
	void SetImageTexture(const class UTexture2D* Texture2D);
	void SetInitialFocusButtonIndex(const int32 InButtonIndex);
	void SetPopupInfoDisplayIndex(int32 Index_0);
	void SetPopupInfoMainMenuButtonIconIndex(int32 Btn01IconIndex, int32 Btn02IconIndex);
	void SetPopupWindowButtonType(EPopupWindowButtonType ButtonType);
	void SetPopupWindowType(EPopupWindowType WindowType);
	void SetTextMessege(const class FText& Text);
	void SetTextTitle(const class FText& Text, bool Attension);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Popup_Window_Simple_C">();
	}
	static class UWBP_Popup_Window_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Popup_Window_Simple_C>();
	}
};
static_assert(alignof(UWBP_Popup_Window_Simple_C) == 0x000008, "Wrong alignment on UWBP_Popup_Window_Simple_C");
static_assert(sizeof(UWBP_Popup_Window_Simple_C) == 0x000448, "Wrong size on UWBP_Popup_Window_Simple_C");
static_assert(offsetof(UWBP_Popup_Window_Simple_C, UberGraphFrame) == 0x0003F0, "Member 'UWBP_Popup_Window_Simple_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Simple_C, Popup_Out) == 0x0003F8, "Member 'UWBP_Popup_Window_Simple_C::Popup_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Simple_C, Popup_Loop) == 0x000400, "Member 'UWBP_Popup_Window_Simple_C::Popup_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Simple_C, Popup_In) == 0x000408, "Member 'UWBP_Popup_Window_Simple_C::Popup_In' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Simple_C, SafeZone_0) == 0x000410, "Member 'UWBP_Popup_Window_Simple_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Simple_C, TXT_Info) == 0x000418, "Member 'UWBP_Popup_Window_Simple_C::TXT_Info' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Simple_C, WBP_Popup_Sub_Btn_Standard_01) == 0x000420, "Member 'UWBP_Popup_Window_Simple_C::WBP_Popup_Sub_Btn_Standard_01' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Simple_C, WBP_Popup_Sub_Btn_Standard_02) == 0x000428, "Member 'UWBP_Popup_Window_Simple_C::WBP_Popup_Sub_Btn_Standard_02' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Simple_C, WindowBase) == 0x000430, "Member 'UWBP_Popup_Window_Simple_C::WindowBase' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Simple_C, Buttons) == 0x000438, "Member 'UWBP_Popup_Window_Simple_C::Buttons' has a wrong offset!");

}

