#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_Sub_SpeedClassInfo

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_Sub_SpeedClassInfo.WBP_CMN_Sub_SpeedClassInfo_C.ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo
// 0x0090 (0x0090 - 0x0000)
struct WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0018(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0028(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0038(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0048(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0058(0x0010)()
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableGlobalInvalidation_ReturnValue;   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             K2Node_CustomEvent_SpeedClassId;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableGlobalInvalidation_ReturnValue_1; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             Temp_byte_Variable;                                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0080(0x0010)(ConstParm)
};
static_assert(alignof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo) == 0x000008, "Wrong alignment on WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo");
static_assert(sizeof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo) == 0x000090, "Wrong size on WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, EntryPoint) == 0x000000, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000004, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000018, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000028, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000038, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_MakeLiteralText_ReturnValue_4) == 0x000048, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_MakeLiteralText_ReturnValue_5) == 0x000058, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_GetIsOnlineGameMode_ReturnValue) == 0x000068, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_GetIsOnlineGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_IsEnableGlobalInvalidation_ReturnValue) == 0x000069, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_IsEnableGlobalInvalidation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, K2Node_CustomEvent_SpeedClassId) == 0x00006A, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::K2Node_CustomEvent_SpeedClassId' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00006C, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_MakeLiteralByte_ReturnValue) == 0x000070, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000074, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, CallFunc_IsEnableGlobalInvalidation_ReturnValue_1) == 0x000078, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::CallFunc_IsEnableGlobalInvalidation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, Temp_byte_Variable) == 0x000079, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo, K2Node_Select_Default) == 0x000080, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CMN_Sub_SpeedClassInfo.WBP_CMN_Sub_SpeedClassInfo_C.SetMenuSpeedClassId
// 0x0001 (0x0001 - 0x0000)
struct WBP_CMN_Sub_SpeedClassInfo_C_SetMenuSpeedClassId final
{
public:
	EMenuSpeedClassId                             SpeedClassId;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_Sub_SpeedClassInfo_C_SetMenuSpeedClassId) == 0x000001, "Wrong alignment on WBP_CMN_Sub_SpeedClassInfo_C_SetMenuSpeedClassId");
static_assert(sizeof(WBP_CMN_Sub_SpeedClassInfo_C_SetMenuSpeedClassId) == 0x000001, "Wrong size on WBP_CMN_Sub_SpeedClassInfo_C_SetMenuSpeedClassId");
static_assert(offsetof(WBP_CMN_Sub_SpeedClassInfo_C_SetMenuSpeedClassId, SpeedClassId) == 0x000000, "Member 'WBP_CMN_Sub_SpeedClassInfo_C_SetMenuSpeedClassId::SpeedClassId' has a wrong offset!");

}

