#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_ColorPicker_TextureText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_ColorPicker_TextureText.WBP_MachineCustom_Sub_ColorPicker_TextureText_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_MachineCustom_Sub_ColorPicker_TextureText_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DSP_Set_Icon;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_TextureName;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker_TextureText(int32 EntryPoint);
	void SetSelectIconVisible(bool bInIsVisible);
	void SetSurfaceName(const class FText& InSurfaceName);
	void Setup(const struct FST_ColorDetailWindowSurfaceItemData& InItemData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_ColorPicker_TextureText_C">();
	}
	static class UWBP_MachineCustom_Sub_ColorPicker_TextureText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_ColorPicker_TextureText_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_ColorPicker_TextureText_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_ColorPicker_TextureText_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_ColorPicker_TextureText_C) == 0x0002F8, "Wrong size on UWBP_MachineCustom_Sub_ColorPicker_TextureText_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_TextureText_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_MachineCustom_Sub_ColorPicker_TextureText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_TextureText_C, DSP_Set_Icon) == 0x0002E8, "Member 'UWBP_MachineCustom_Sub_ColorPicker_TextureText_C::DSP_Set_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_ColorPicker_TextureText_C, TXT_TextureName) == 0x0002F0, "Member 'UWBP_MachineCustom_Sub_ColorPicker_TextureText_C::TXT_TextureName' has a wrong offset!");

}

