#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineSelect_Sub_CrossButton

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineSelect_Sub_CrossButton.WBP_MachineSelect_Sub_CrossButton_C
// 0x0038 (0x04C0 - 0x0488)
class UWBP_MachineSelect_Sub_CrossButton_C final : public UCommonMenuCrossButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 MLC_PlayerNumber;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bEnableInput;                                      // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnTakePicture;                                     // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnTriggerFocus;                                    // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_MachineSelect_Sub_CrossButton(int32 EntryPoint);
	class UWidget* NavigationDown(EUINavigation Navigation_0);
	class UWidget* NavigationLeft(EUINavigation Navigation_0);
	class UWidget* NavigationRight(EUINavigation Navigation_0);
	class UWidget* NavigationUp(EUINavigation Navigation_0);
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnFocus_Impl(class UUnionUIButtonBase* Button);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnSpecialPressed();
	void PlaySEError();
	void PlaySESelect();
	void SetEnableInput(bool IsEnable);
	void SetPlayerControllerIndex(const int32 InPlayerControllerIndex);

	void IsEnableInput(bool* Enable) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineSelect_Sub_CrossButton_C">();
	}
	static class UWBP_MachineSelect_Sub_CrossButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineSelect_Sub_CrossButton_C>();
	}
};
static_assert(alignof(UWBP_MachineSelect_Sub_CrossButton_C) == 0x000008, "Wrong alignment on UWBP_MachineSelect_Sub_CrossButton_C");
static_assert(sizeof(UWBP_MachineSelect_Sub_CrossButton_C) == 0x0004C0, "Wrong size on UWBP_MachineSelect_Sub_CrossButton_C");
static_assert(offsetof(UWBP_MachineSelect_Sub_CrossButton_C, UberGraphFrame) == 0x000488, "Member 'UWBP_MachineSelect_Sub_CrossButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_CrossButton_C, MLC_PlayerNumber) == 0x000490, "Member 'UWBP_MachineSelect_Sub_CrossButton_C::MLC_PlayerNumber' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_CrossButton_C, bEnableInput) == 0x000498, "Member 'UWBP_MachineSelect_Sub_CrossButton_C::bEnableInput' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_CrossButton_C, OnTakePicture) == 0x0004A0, "Member 'UWBP_MachineSelect_Sub_CrossButton_C::OnTakePicture' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_CrossButton_C, OnTriggerFocus) == 0x0004B0, "Member 'UWBP_MachineSelect_Sub_CrossButton_C::OnTriggerFocus' has a wrong offset!");

}

