#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_Sub_RankingTable_Bonus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result_Sub_RankingTable_Bonus.WBP_Result_Sub_RankingTable_Bonus_C
// 0x0070 (0x0350 - 0x02E0)
class UWBP_Result_Sub_RankingTable_Bonus_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Bonus_Out;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bonus_Loop;                                        // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bonus_In;                                          // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 base_1;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_01;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_02;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Bonus;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_BonusNum;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_MVP;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Close();
	void ExecuteUbergraph_WBP_Result_Sub_RankingTable_Bonus(int32 EntryPoint);
	void Open(const class FText& BonusText, const class FText& BonusNumText);
	void OpenMVP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Result_Sub_RankingTable_Bonus_C">();
	}
	static class UWBP_Result_Sub_RankingTable_Bonus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_Sub_RankingTable_Bonus_C>();
	}
};
static_assert(alignof(UWBP_Result_Sub_RankingTable_Bonus_C) == 0x000008, "Wrong alignment on UWBP_Result_Sub_RankingTable_Bonus_C");
static_assert(sizeof(UWBP_Result_Sub_RankingTable_Bonus_C) == 0x000350, "Wrong size on UWBP_Result_Sub_RankingTable_Bonus_C");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, Bonus_Out) == 0x0002E8, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::Bonus_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, Bonus_Loop) == 0x0002F0, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::Bonus_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, Bonus_In) == 0x0002F8, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::Bonus_In' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, base) == 0x000300, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, base_1) == 0x000308, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::base_1' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, Eff_01) == 0x000310, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::Eff_01' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, Eff_02) == 0x000318, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::Eff_02' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, Line) == 0x000320, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, Line_1) == 0x000328, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::Line_1' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, TXT_Bonus) == 0x000330, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::TXT_Bonus' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, TXT_BonusNum) == 0x000338, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::TXT_BonusNum' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, TXT_MVP) == 0x000340, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::TXT_MVP' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RankingTable_Bonus_C, WidgetSwitcher_0) == 0x000348, "Member 'UWBP_Result_Sub_RankingTable_Bonus_C::WidgetSwitcher_0' has a wrong offset!");

}

