#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_Reward

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_Result_Reward.WBP_Result_Reward_C.ExecuteUbergraph_WBP_Result_Reward
// 0x02F0 (0x02F0 - 0x0000)
struct WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommendationCategory                         Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_1;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_2;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_3;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommendationCategory                         Temp_byte_Variable_1;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable_4;                            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_5;                            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_6;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_7;                            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable_8;                            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_9;                            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommendationCategory                         Temp_byte_Variable_2;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable_10;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_11;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_12;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_13;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommendationCategory                         Temp_byte_Variable_3;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable_14;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_15;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_16;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_17;                           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable_18;                           // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_19;                           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommendationCategory                         Temp_byte_Variable_4;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable_20;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_21;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_22;                           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_23;                           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<ERewardRedStarRingType>                CallFunc_GetRewardRedStarRingTypeList_OutRewardRedStarRingTypes; // 0x0130(0x0010)(ReferenceParm)
	TArray<struct FHonorCommendationData>         CallFunc_GetRewardRedStarRingTypeList_OutRSRHonorList; // 0x0140(0x0010)(ReferenceParm)
	struct FPlayerLevelInfo                       CallFunc_SaveResult_OutPlayerLevelInfo;            // 0x0150(0x0014)(NoDestructor)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRewardRedStarRingData>         CallFunc_SaveResult_OutRedStarRingData;            // 0x0168(0x0010)(ReferenceParm)
	TArray<struct FHonorCommendationData>         K2Node_CustomEvent_HonorList;                      // 0x0178(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResultOtherPlayerRank_ReturnValue;     // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          K2Node_Select_Default;                             // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRewardRedStarRingHonorTableRow        CallFunc_FindRewardRedStarRingHonorTableRow_OutData; // 0x01A0(0x0020)()
	bool                                          CallFunc_FindRewardRedStarRingHonorTableRow_ReturnValue; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          K2Node_Select_Default_1;                           // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleRSR_visisble;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_2;  // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2; // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_3;  // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3; // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_4;  // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_4; // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResultReward_bIsResultReward;           // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResultReward_bIsResultReward_1;         // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResultReward_bIsResultReward_2;         // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_256[0x2];                                      // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x026C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27E[0x2];                                      // 0x027E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Result_Sub_DonpaTicket_Details_C*  CallFunc_GetItemWidget_Widget;                     // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          K2Node_Select_Default_2;                           // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_Select_Default_3;                           // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_Select_Default_4;                           // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_Select_Default_5;                           // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x02B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x02C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_Select_Default_6;                           // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward) == 0x000008, "Wrong alignment on WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward");
static_assert(sizeof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward) == 0x0002F0, "Wrong size on WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, EntryPoint) == 0x000000, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_int_Variable) == 0x000004, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_byte_Variable) == 0x000038, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable) == 0x000040, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_1) == 0x000048, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_2) == 0x000050, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_3) == 0x000058, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_byte_Variable_1) == 0x000060, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_4) == 0x000068, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_5) == 0x000070, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_6) == 0x000078, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_7) == 0x000080, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_bool_Variable) == 0x000088, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_8) == 0x000090, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_9) == 0x000098, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_byte_Variable_2) == 0x0000A0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_10) == 0x0000A8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_11) == 0x0000B0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_12) == 0x0000B8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_13) == 0x0000C0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_byte_Variable_3) == 0x0000C8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_14) == 0x0000D0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_15) == 0x0000D8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_16) == 0x0000E0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_17) == 0x0000E8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_bool_Variable_1) == 0x0000F0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_18) == 0x0000F8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_18' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_19) == 0x000100, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_19' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_byte_Variable_4) == 0x000108, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_20) == 0x000110, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_20' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_21) == 0x000118, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_21' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_22) == 0x000120, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_22' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, Temp_object_Variable_23) == 0x000128, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::Temp_object_Variable_23' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_GetRewardRedStarRingTypeList_OutRewardRedStarRingTypes) == 0x000130, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_GetRewardRedStarRingTypeList_OutRewardRedStarRingTypes' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_GetRewardRedStarRingTypeList_OutRSRHonorList) == 0x000140, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_GetRewardRedStarRingTypeList_OutRSRHonorList' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_SaveResult_OutPlayerLevelInfo) == 0x000150, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_SaveResult_OutPlayerLevelInfo' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_SaveResult_OutRedStarRingData) == 0x000168, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_SaveResult_OutRedStarRingData' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_CustomEvent_HonorList) == 0x000178, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_CustomEvent_HonorList' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_CustomEvent_Index) == 0x000188, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_GetResultOtherPlayerRank_ReturnValue) == 0x00018C, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_GetResultOtherPlayerRank_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000190, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000191, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_Select_Default) == 0x000198, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_FindRewardRedStarRingHonorTableRow_OutData) == 0x0001A0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_FindRewardRedStarRingHonorTableRow_OutData' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_FindRewardRedStarRingHonorTableRow_ReturnValue) == 0x0001C0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_FindRewardRedStarRingHonorTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_Select_Default_1) == 0x0001C8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_IsVisibleRSR_visisble) == 0x0001D0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_IsVisibleRSR_visisble' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0001D8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0001E0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_IsValid_ReturnValue) == 0x0001E8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001EC, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000200, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000208, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_IsValid_ReturnValue_1) == 0x000210, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_CreatePlayAnimationProxyObject_Result_2) == 0x000218, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_CreatePlayAnimationProxyObject_Result_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2) == 0x000220, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_IsValid_ReturnValue_2) == 0x000228, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_CreatePlayAnimationProxyObject_Result_3) == 0x000230, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_CreatePlayAnimationProxyObject_Result_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3) == 0x000238, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_CreatePlayAnimationProxyObject_Result_4) == 0x000240, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_CreatePlayAnimationProxyObject_Result_4' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_4) == 0x000248, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_IsValid_ReturnValue_3) == 0x000250, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_IsValid_ReturnValue_4) == 0x000251, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_IsResultReward_bIsResultReward) == 0x000252, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_IsResultReward_bIsResultReward' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_IsResultReward_bIsResultReward_1) == 0x000253, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_IsResultReward_bIsResultReward_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_IsResultReward_bIsResultReward_2) == 0x000254, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_IsResultReward_bIsResultReward_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_Not_PreBool_ReturnValue) == 0x000255, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_CreateDelegate_OutputDelegate_4) == 0x000258, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_Add_IntInt_ReturnValue) == 0x000268, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_CreateDelegate_OutputDelegate_5) == 0x00026C, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00027C, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_SwitchEnum_CmpSuccess) == 0x00027D, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_GetItemWidget_Widget) == 0x000280, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_GetItemWidget_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000288, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_Select_Default_2) == 0x000290, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_PlayAnimation_ReturnValue) == 0x000298, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_Select_Default_3) == 0x0002A0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_Select_Default_4) == 0x0002A8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_Select_Default_5) == 0x0002B0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_CreateDelegate_OutputDelegate_6) == 0x0002B8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_CreateDelegate_OutputDelegate_7) == 0x0002C8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002D8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, CallFunc_PlayAnimation_ReturnValue_1) == 0x0002E0, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward, K2Node_Select_Default_6) == 0x0002E8, "Member 'WBP_Result_Reward_C_ExecuteUbergraph_WBP_Result_Reward::K2Node_Select_Default_6' has a wrong offset!");

// Function WBP_Result_Reward.WBP_Result_Reward_C.GetItemWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_Result_Reward_C_GetItemWidget final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Result_Sub_DonpaTicket_Details_C*  Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Result_Sub_DonpaTicket_Details_C*  K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Reward_C_GetItemWidget) == 0x000008, "Wrong alignment on WBP_Result_Reward_C_GetItemWidget");
static_assert(sizeof(WBP_Result_Reward_C_GetItemWidget) == 0x000020, "Wrong size on WBP_Result_Reward_C_GetItemWidget");
static_assert(offsetof(WBP_Result_Reward_C_GetItemWidget, Index_0) == 0x000000, "Member 'WBP_Result_Reward_C_GetItemWidget::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_GetItemWidget, Widget) == 0x000008, "Member 'WBP_Result_Reward_C_GetItemWidget::Widget' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_GetItemWidget, Temp_int_Variable) == 0x000010, "Member 'WBP_Result_Reward_C_GetItemWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_GetItemWidget, K2Node_Select_Default) == 0x000018, "Member 'WBP_Result_Reward_C_GetItemWidget::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Result_Reward.WBP_Result_Reward_C.IsResultReward
// 0x0005 (0x0005 - 0x0000)
struct WBP_Result_Reward_C_IsResultReward final
{
public:
	bool                                          bIsResultReward;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGroupRaceFestaColor_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Reward_C_IsResultReward) == 0x000001, "Wrong alignment on WBP_Result_Reward_C_IsResultReward");
static_assert(sizeof(WBP_Result_Reward_C_IsResultReward) == 0x000005, "Wrong size on WBP_Result_Reward_C_IsResultReward");
static_assert(offsetof(WBP_Result_Reward_C_IsResultReward, bIsResultReward) == 0x000000, "Member 'WBP_Result_Reward_C_IsResultReward::bIsResultReward' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_IsResultReward, CallFunc_IsGroupRaceFestaColor_ReturnValue) == 0x000001, "Member 'WBP_Result_Reward_C_IsResultReward::CallFunc_IsGroupRaceFestaColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_IsResultReward, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000002, "Member 'WBP_Result_Reward_C_IsResultReward::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_IsResultReward, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_Result_Reward_C_IsResultReward::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_IsResultReward, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'WBP_Result_Reward_C_IsResultReward::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Result_Reward.WBP_Result_Reward_C.IsRewardDispComplete
// 0x0001 (0x0001 - 0x0000)
struct WBP_Result_Reward_C_IsRewardDispComplete final
{
public:
	bool                                          bIsComplete;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Reward_C_IsRewardDispComplete) == 0x000001, "Wrong alignment on WBP_Result_Reward_C_IsRewardDispComplete");
static_assert(sizeof(WBP_Result_Reward_C_IsRewardDispComplete) == 0x000001, "Wrong size on WBP_Result_Reward_C_IsRewardDispComplete");
static_assert(offsetof(WBP_Result_Reward_C_IsRewardDispComplete, bIsComplete) == 0x000000, "Member 'WBP_Result_Reward_C_IsRewardDispComplete::bIsComplete' has a wrong offset!");

// Function WBP_Result_Reward.WBP_Result_Reward_C.IsVisibleRSR
// 0x0018 (0x0018 - 0x0000)
struct WBP_Result_Reward_C_IsVisibleRSR final
{
public:
	bool                                          visisble;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionStatsManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRaceRedStarRingDisplay_ReturnValue;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Reward_C_IsVisibleRSR) == 0x000008, "Wrong alignment on WBP_Result_Reward_C_IsVisibleRSR");
static_assert(sizeof(WBP_Result_Reward_C_IsVisibleRSR) == 0x000018, "Wrong size on WBP_Result_Reward_C_IsVisibleRSR");
static_assert(offsetof(WBP_Result_Reward_C_IsVisibleRSR, visisble) == 0x000000, "Member 'WBP_Result_Reward_C_IsVisibleRSR::visisble' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_IsVisibleRSR, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Result_Reward_C_IsVisibleRSR::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_IsVisibleRSR, CallFunc_IsRaceRedStarRingDisplay_ReturnValue) == 0x000010, "Member 'WBP_Result_Reward_C_IsVisibleRSR::CallFunc_IsRaceRedStarRingDisplay_ReturnValue' has a wrong offset!");

// Function WBP_Result_Reward.WBP_Result_Reward_C.PlayOtherResultReward
// 0x0018 (0x0018 - 0x0000)
struct WBP_Result_Reward_C_PlayOtherResultReward final
{
public:
	TArray<struct FHonorCommendationData>         HonorList;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Reward_C_PlayOtherResultReward) == 0x000008, "Wrong alignment on WBP_Result_Reward_C_PlayOtherResultReward");
static_assert(sizeof(WBP_Result_Reward_C_PlayOtherResultReward) == 0x000018, "Wrong size on WBP_Result_Reward_C_PlayOtherResultReward");
static_assert(offsetof(WBP_Result_Reward_C_PlayOtherResultReward, HonorList) == 0x000000, "Member 'WBP_Result_Reward_C_PlayOtherResultReward::HonorList' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayOtherResultReward, Index_0) == 0x000010, "Member 'WBP_Result_Reward_C_PlayOtherResultReward::Index_0' has a wrong offset!");

// Function WBP_Result_Reward.WBP_Result_Reward_C.PlayOtherSE
// 0x0020 (0x0020 - 0x0000)
struct WBP_Result_Reward_C_PlayOtherSE final
{
public:
	class USoundAtomCue*                          SoundID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0010(0x0004)()
	ESoundPan                                     Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable_2;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable_3;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue;                  // 0x001C(0x0004)()
};
static_assert(alignof(WBP_Result_Reward_C_PlayOtherSE) == 0x000008, "Wrong alignment on WBP_Result_Reward_C_PlayOtherSE");
static_assert(sizeof(WBP_Result_Reward_C_PlayOtherSE) == 0x000020, "Wrong size on WBP_Result_Reward_C_PlayOtherSE");
static_assert(offsetof(WBP_Result_Reward_C_PlayOtherSE, SoundID) == 0x000000, "Member 'WBP_Result_Reward_C_PlayOtherSE::SoundID' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayOtherSE, PlayerIndex) == 0x000008, "Member 'WBP_Result_Reward_C_PlayOtherSE::PlayerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayOtherSE, Temp_int_Variable) == 0x00000C, "Member 'WBP_Result_Reward_C_PlayOtherSE::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayOtherSE, CallFunc_SoundPlay_ReturnValue) == 0x000010, "Member 'WBP_Result_Reward_C_PlayOtherSE::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayOtherSE, Temp_byte_Variable) == 0x000014, "Member 'WBP_Result_Reward_C_PlayOtherSE::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayOtherSE, Temp_byte_Variable_1) == 0x000015, "Member 'WBP_Result_Reward_C_PlayOtherSE::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayOtherSE, Temp_byte_Variable_2) == 0x000016, "Member 'WBP_Result_Reward_C_PlayOtherSE::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayOtherSE, Temp_byte_Variable_3) == 0x000017, "Member 'WBP_Result_Reward_C_PlayOtherSE::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayOtherSE, K2Node_Select_Default) == 0x000018, "Member 'WBP_Result_Reward_C_PlayOtherSE::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayOtherSE, CallFunc_SetPanSplit_ReturnValue) == 0x00001C, "Member 'WBP_Result_Reward_C_PlayOtherSE::CallFunc_SetPanSplit_ReturnValue' has a wrong offset!");

// Function WBP_Result_Reward.WBP_Result_Reward_C.PlayPlayerSE
// 0x0020 (0x0020 - 0x0000)
struct WBP_Result_Reward_C_PlayPlayerSE final
{
public:
	class USoundAtomCue*                          SoundID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x000C(0x0004)()
	ESoundPan                                     Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue;                  // 0x001C(0x0004)()
};
static_assert(alignof(WBP_Result_Reward_C_PlayPlayerSE) == 0x000008, "Wrong alignment on WBP_Result_Reward_C_PlayPlayerSE");
static_assert(sizeof(WBP_Result_Reward_C_PlayPlayerSE) == 0x000020, "Wrong size on WBP_Result_Reward_C_PlayPlayerSE");
static_assert(offsetof(WBP_Result_Reward_C_PlayPlayerSE, SoundID) == 0x000000, "Member 'WBP_Result_Reward_C_PlayPlayerSE::SoundID' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayPlayerSE, Temp_bool_Variable) == 0x000008, "Member 'WBP_Result_Reward_C_PlayPlayerSE::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayPlayerSE, CallFunc_SoundPlay_ReturnValue) == 0x00000C, "Member 'WBP_Result_Reward_C_PlayPlayerSE::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayPlayerSE, Temp_byte_Variable) == 0x000010, "Member 'WBP_Result_Reward_C_PlayPlayerSE::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayPlayerSE, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_Result_Reward_C_PlayPlayerSE::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayPlayerSE, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x000014, "Member 'WBP_Result_Reward_C_PlayPlayerSE::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayPlayerSE, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Result_Reward_C_PlayPlayerSE::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayPlayerSE, K2Node_Select_Default) == 0x000019, "Member 'WBP_Result_Reward_C_PlayPlayerSE::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_PlayPlayerSE, CallFunc_SetPanSplit_ReturnValue) == 0x00001C, "Member 'WBP_Result_Reward_C_PlayPlayerSE::CallFunc_SetPanSplit_ReturnValue' has a wrong offset!");

// Function WBP_Result_Reward.WBP_Result_Reward_C.SetRewardInfo
// 0x0020 (0x0020 - 0x0000)
struct WBP_Result_Reward_C_SetRewardInfo final
{
public:
	TArray<struct FRewardRedStarRingData>         RSRList;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FResultRewardItemInfo>          CallFunc_MakeResultRewardItemInfos_Output;         // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_Result_Reward_C_SetRewardInfo) == 0x000008, "Wrong alignment on WBP_Result_Reward_C_SetRewardInfo");
static_assert(sizeof(WBP_Result_Reward_C_SetRewardInfo) == 0x000020, "Wrong size on WBP_Result_Reward_C_SetRewardInfo");
static_assert(offsetof(WBP_Result_Reward_C_SetRewardInfo, RSRList) == 0x000000, "Member 'WBP_Result_Reward_C_SetRewardInfo::RSRList' has a wrong offset!");
static_assert(offsetof(WBP_Result_Reward_C_SetRewardInfo, CallFunc_MakeResultRewardItemInfos_Output) == 0x000010, "Member 'WBP_Result_Reward_C_SetRewardInfo::CallFunc_MakeResultRewardItemInfos_Output' has a wrong offset!");

}

