#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_MessageBar

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_MessageBar.WBP_CMN_MessageBar_C
// 0x0068 (0x0368 - 0x0300)
class UWBP_CMN_MessageBar_C final : public UCommonMessageBar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Messege_Out;                                       // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Messege_Loop;                                      // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Messege_In;                                        // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BarBase;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_AlertPict;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NGPict;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceCheck;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Massage;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TXT_Waiting;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TXT_Waiting_Before;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Pict;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableBlinkLoopAnim;                               // 0x0364(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CMN_MessageBar(int32 EntryPoint);
	void PlayInAnim();
	void PlayOutAnim();
	void SetText(const class FText& InText);
	void SetupDisableGadgetMessage();
	void SetWaitingTextVisible(bool bInIsVisible);
	void SetWarningIconVisible(bool bInIsVisible);
	void SetWidgetSwitcherActiveWidgetIndex(int32 Index_0);
	void StartWaitingText();
	void WidgetAnimationEvt_Messege_In_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_Messege_Out_K2Node_WidgetAnimationEvent_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_MessageBar_C">();
	}
	static class UWBP_CMN_MessageBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_MessageBar_C>();
	}
};
static_assert(alignof(UWBP_CMN_MessageBar_C) == 0x000008, "Wrong alignment on UWBP_CMN_MessageBar_C");
static_assert(sizeof(UWBP_CMN_MessageBar_C) == 0x000368, "Wrong size on UWBP_CMN_MessageBar_C");
static_assert(offsetof(UWBP_CMN_MessageBar_C, UberGraphFrame) == 0x000300, "Member 'UWBP_CMN_MessageBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, Messege_Out) == 0x000308, "Member 'UWBP_CMN_MessageBar_C::Messege_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, Messege_Loop) == 0x000310, "Member 'UWBP_CMN_MessageBar_C::Messege_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, Messege_In) == 0x000318, "Member 'UWBP_CMN_MessageBar_C::Messege_In' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, BarBase) == 0x000320, "Member 'UWBP_CMN_MessageBar_C::BarBase' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, DSP_AlertPict) == 0x000328, "Member 'UWBP_CMN_MessageBar_C::DSP_AlertPict' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, DSP_NGPict) == 0x000330, "Member 'UWBP_CMN_MessageBar_C::DSP_NGPict' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, RaceCheck) == 0x000338, "Member 'UWBP_CMN_MessageBar_C::RaceCheck' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, TXT_Massage) == 0x000340, "Member 'UWBP_CMN_MessageBar_C::TXT_Massage' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, TXT_Waiting) == 0x000348, "Member 'UWBP_CMN_MessageBar_C::TXT_Waiting' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, TXT_Waiting_Before) == 0x000350, "Member 'UWBP_CMN_MessageBar_C::TXT_Waiting_Before' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, WidgetSwitcher_Pict) == 0x000358, "Member 'UWBP_CMN_MessageBar_C::WidgetSwitcher_Pict' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, Count) == 0x000360, "Member 'UWBP_CMN_MessageBar_C::Count' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_MessageBar_C, EnableBlinkLoopAnim) == 0x000364, "Member 'UWBP_CMN_MessageBar_C::EnableBlinkLoopAnim' has a wrong offset!");

}

