#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FestaResult_ContributionRate

#include "Basic.hpp"

#include "UnionRun_structs.hpp"


namespace SDK::Params
{

// Function WBP_FestaResult_ContributionRate.WBP_FestaResult_ContributionRate_C.ExecuteUbergraph_WBP_FestaResult_ContributionRate
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFestaRacerContribution>        K2Node_CustomEvent_List;                           // 0x0048(0x0010)(ConstParm, ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFestaRacerContribution                CallFunc_Array_Get_Item;                           // 0x0060(0x0014)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_FestaResult_Sub_ContributionRate_Table_C*> K2Node_MakeArray_Array;             // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_FestaResult_Sub_ContributionRate_Table_C* CallFunc_Array_Get_Item_1;                  // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_FestaResult_Sub_ContributionRate_Table_C* CallFunc_Array_Get_Item_2;                  // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableGlobalInvalidation_ReturnValue;   // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate) == 0x000008, "Wrong alignment on WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate");
static_assert(sizeof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate) == 0x0000B8, "Wrong size on WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, EntryPoint) == 0x000000, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, Temp_string_Variable) == 0x000010, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, Temp_string_Variable_1) == 0x000020, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, Temp_bool_Variable) == 0x000030, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, K2Node_Event_IsDesignTime) == 0x000044, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, K2Node_CustomEvent_List) == 0x000048, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::K2Node_CustomEvent_List' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, K2Node_MakeArray_Array) == 0x000080, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, CallFunc_Array_Get_Item_2) == 0x000098, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A4, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, CallFunc_IsEnableGlobalInvalidation_ReturnValue) == 0x0000A5, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::CallFunc_IsEnableGlobalInvalidation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate, K2Node_Select_Default) == 0x0000A8, "Member 'WBP_FestaResult_ContributionRate_C_ExecuteUbergraph_WBP_FestaResult_ContributionRate::K2Node_Select_Default' has a wrong offset!");

// Function WBP_FestaResult_ContributionRate.WBP_FestaResult_ContributionRate_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_FestaResult_ContributionRate_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FestaResult_ContributionRate_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_FestaResult_ContributionRate_C_PreConstruct");
static_assert(sizeof(WBP_FestaResult_ContributionRate_C_PreConstruct) == 0x000001, "Wrong size on WBP_FestaResult_ContributionRate_C_PreConstruct");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_FestaResult_ContributionRate_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_FestaResult_ContributionRate.WBP_FestaResult_ContributionRate_C.SetRacerDataAll
// 0x0010 (0x0010 - 0x0000)
struct WBP_FestaResult_ContributionRate_C_SetRacerDataAll final
{
public:
	TArray<struct FFestaRacerContribution>        list;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_FestaResult_ContributionRate_C_SetRacerDataAll) == 0x000008, "Wrong alignment on WBP_FestaResult_ContributionRate_C_SetRacerDataAll");
static_assert(sizeof(WBP_FestaResult_ContributionRate_C_SetRacerDataAll) == 0x000010, "Wrong size on WBP_FestaResult_ContributionRate_C_SetRacerDataAll");
static_assert(offsetof(WBP_FestaResult_ContributionRate_C_SetRacerDataAll, list) == 0x000000, "Member 'WBP_FestaResult_ContributionRate_C_SetRacerDataAll::list' has a wrong offset!");

}

