#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClassSelect

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ClassSelect.WBP_ClassSelect_C
// 0x0100 (0x0520 - 0x0420)
class UWBP_ClassSelect_C final : public UClassSelectSceneBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Filter;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_Title;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate;                                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TrophyPanel_Bottom;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TrophyPanel_Top;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Detail;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Title;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Btn_Class_C*       WBP_ClassSelect_Sub_Btn_Class_01;                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Btn_Class_C*       WBP_ClassSelect_Sub_Btn_Class_02;                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Btn_Class_C*       WBP_ClassSelect_Sub_Btn_Class_03;                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Btn_Class_C*       WBP_ClassSelect_Sub_Btn_Class_04;                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Btn_Class_C*       WBP_ClassSelect_Sub_Btn_Class_05;                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Trophy_C*          WBP_ClassSelect_Sub_Trophy_10;                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Trophy_C*          WBP_ClassSelect_Sub_Trophy_01;                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Trophy_C*          WBP_ClassSelect_Sub_Trophy_02;                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Trophy_C*          WBP_ClassSelect_Sub_Trophy_03;                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Trophy_C*          WBP_ClassSelect_Sub_Trophy_04;                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Trophy_C*          WBP_ClassSelect_Sub_Trophy_05;                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Trophy_C*          WBP_ClassSelect_Sub_Trophy_06;                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Trophy_C*          WBP_ClassSelect_Sub_Trophy_07;                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Trophy_C*          WBP_ClassSelect_Sub_Trophy_08;                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Trophy_C*          WBP_ClassSelect_Sub_Trophy_09;                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   ClassButtonsPanel;                                 // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   NewVar_0;                                          // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnInFinished;                                      // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnOutFinished;                                     // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          TrophyEnabled;                                     // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             LastFocusedMenuSpeedClassId;                       // 0x0519(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckComplete(EMenuSpeedClassId MenuSpeed, bool* OutComplete, int32* Current, int32* Max);
	void Construct();
	void ExecuteUbergraph_WBP_ClassSelect(int32 EntryPoint);
	void Focus(EMenuSpeedClassId FirstSelectedClass);
	void FocusToLastClassContent();
	void In(EMenuSpeedClassId FirstSelectedClass);
	void MakeButtonsPanel();
	void OnFocusEvent_Event(class UUnionUIButtonBase* Button);
	void OnInAnimationFinished();
	void OnOutAnimationFinished();
	void OnUISceneDecision(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void Out(bool Immediate);
	void PreConstruct(bool IsDesignTime);
	void SetDetailText(EMenuSpeedClassId SpeedClass);
	void UnbindAllEvents();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ClassSelect_C">();
	}
	static class UWBP_ClassSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ClassSelect_C>();
	}
};
static_assert(alignof(UWBP_ClassSelect_C) == 0x000008, "Wrong alignment on UWBP_ClassSelect_C");
static_assert(sizeof(UWBP_ClassSelect_C) == 0x000520, "Wrong size on UWBP_ClassSelect_C");
static_assert(offsetof(UWBP_ClassSelect_C, UberGraphFrame) == 0x000420, "Member 'UWBP_ClassSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, Filter) == 0x000428, "Member 'UWBP_ClassSelect_C::Filter' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, Line_Title) == 0x000430, "Member 'UWBP_ClassSelect_C::Line_Title' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, Panel) == 0x000438, "Member 'UWBP_ClassSelect_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, Plate) == 0x000440, "Member 'UWBP_ClassSelect_C::Plate' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, Spacer) == 0x000448, "Member 'UWBP_ClassSelect_C::Spacer' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, TrophyPanel_Bottom) == 0x000450, "Member 'UWBP_ClassSelect_C::TrophyPanel_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, TrophyPanel_Top) == 0x000458, "Member 'UWBP_ClassSelect_C::TrophyPanel_Top' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, TXT_Detail) == 0x000460, "Member 'UWBP_ClassSelect_C::TXT_Detail' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, TXT_Title) == 0x000468, "Member 'UWBP_ClassSelect_C::TXT_Title' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Btn_Class_01) == 0x000470, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Btn_Class_01' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Btn_Class_02) == 0x000478, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Btn_Class_02' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Btn_Class_03) == 0x000480, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Btn_Class_03' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Btn_Class_04) == 0x000488, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Btn_Class_04' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Btn_Class_05) == 0x000490, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Btn_Class_05' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Trophy_10) == 0x000498, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Trophy_10' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Trophy_01) == 0x0004A0, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Trophy_01' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Trophy_02) == 0x0004A8, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Trophy_02' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Trophy_03) == 0x0004B0, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Trophy_03' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Trophy_04) == 0x0004B8, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Trophy_04' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Trophy_05) == 0x0004C0, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Trophy_05' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Trophy_06) == 0x0004C8, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Trophy_06' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Trophy_07) == 0x0004D0, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Trophy_07' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Trophy_08) == 0x0004D8, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Trophy_08' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, WBP_ClassSelect_Sub_Trophy_09) == 0x0004E0, "Member 'UWBP_ClassSelect_C::WBP_ClassSelect_Sub_Trophy_09' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, ClassButtonsPanel) == 0x0004E8, "Member 'UWBP_ClassSelect_C::ClassButtonsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, NewVar_0) == 0x0004F0, "Member 'UWBP_ClassSelect_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, OnInFinished) == 0x0004F8, "Member 'UWBP_ClassSelect_C::OnInFinished' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, OnOutFinished) == 0x000508, "Member 'UWBP_ClassSelect_C::OnOutFinished' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, TrophyEnabled) == 0x000518, "Member 'UWBP_ClassSelect_C::TrophyEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_C, LastFocusedMenuSpeedClassId) == 0x000519, "Member 'UWBP_ClassSelect_C::LastFocusedMenuSpeedClassId' has a wrong offset!");

}

