#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_System_Transition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_System_Transition.WBP_System_Transition_C
// 0x0060 (0x0368 - 0x0308)
class UWBP_System_Transition_C final : public UUnionUIFade
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade_Out_Black;                                    // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fade_Loop_Black;                                   // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fade_In_Black;                                     // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fade_Out_White;                                    // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fade_Loop_White;                                   // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fade_In_White;                                     // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Left;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Right;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WhiteBlack;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LastDirectionAnim;                                 // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LastLoopAnim;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AutoReverseFade();
	void AutoStartLoopFade();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_System_Transition(int32 EntryPoint);
	void OnFadeIn();
	void OnFadeOut();
	void StartFade(EUnionUIFadeColor FadeColor, EUnionUIFadeDirection FadeDirection);
	void StartLoopFade(EUnionUIFadeColor FadeColor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_System_Transition_C">();
	}
	static class UWBP_System_Transition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_System_Transition_C>();
	}
};
static_assert(alignof(UWBP_System_Transition_C) == 0x000008, "Wrong alignment on UWBP_System_Transition_C");
static_assert(sizeof(UWBP_System_Transition_C) == 0x000368, "Wrong size on UWBP_System_Transition_C");
static_assert(offsetof(UWBP_System_Transition_C, UberGraphFrame) == 0x000308, "Member 'UWBP_System_Transition_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_System_Transition_C, Fade_Out_Black) == 0x000310, "Member 'UWBP_System_Transition_C::Fade_Out_Black' has a wrong offset!");
static_assert(offsetof(UWBP_System_Transition_C, Fade_Loop_Black) == 0x000318, "Member 'UWBP_System_Transition_C::Fade_Loop_Black' has a wrong offset!");
static_assert(offsetof(UWBP_System_Transition_C, Fade_In_Black) == 0x000320, "Member 'UWBP_System_Transition_C::Fade_In_Black' has a wrong offset!");
static_assert(offsetof(UWBP_System_Transition_C, Fade_Out_White) == 0x000328, "Member 'UWBP_System_Transition_C::Fade_Out_White' has a wrong offset!");
static_assert(offsetof(UWBP_System_Transition_C, Fade_Loop_White) == 0x000330, "Member 'UWBP_System_Transition_C::Fade_Loop_White' has a wrong offset!");
static_assert(offsetof(UWBP_System_Transition_C, Fade_In_White) == 0x000338, "Member 'UWBP_System_Transition_C::Fade_In_White' has a wrong offset!");
static_assert(offsetof(UWBP_System_Transition_C, RaceFlag_Left) == 0x000340, "Member 'UWBP_System_Transition_C::RaceFlag_Left' has a wrong offset!");
static_assert(offsetof(UWBP_System_Transition_C, RaceFlag_Right) == 0x000348, "Member 'UWBP_System_Transition_C::RaceFlag_Right' has a wrong offset!");
static_assert(offsetof(UWBP_System_Transition_C, WhiteBlack) == 0x000350, "Member 'UWBP_System_Transition_C::WhiteBlack' has a wrong offset!");
static_assert(offsetof(UWBP_System_Transition_C, LastDirectionAnim) == 0x000358, "Member 'UWBP_System_Transition_C::LastDirectionAnim' has a wrong offset!");
static_assert(offsetof(UWBP_System_Transition_C, LastLoopAnim) == 0x000360, "Member 'UWBP_System_Transition_C::LastLoopAnim' has a wrong offset!");

}

