#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetInfo_Sub_Category

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function WBP_GadgetInfo_Sub_Category.WBP_GadgetInfo_Sub_Category_C.ExecuteUbergraph_WBP_GadgetInfo_Sub_Category
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)(ConstParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0028(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0038(0x0010)(ReferenceParm)
	EEventInfomationType                          Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0050(0x0010)()
	float                                         Temp_real_Variable;                                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventInfomationType                          Temp_byte_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventInfomationType                          K2Node_CustomEvent_EventInfomation;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0088(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0098(0x0010)(ConstParm)
	float                                         K2Node_Select_Default_1;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_GadgetIcon_Cost01_Icon_C*>  K2Node_MakeArray_Array_3;                          // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category) == 0x000008, "Wrong alignment on WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category");
static_assert(sizeof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category) == 0x0000C8, "Wrong size on WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, EntryPoint) == 0x000000, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, Temp_text_Variable) == 0x000008, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, CallFunc_Format_ReturnValue) == 0x000028, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, K2Node_MakeArray_Array_1) == 0x000038, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, Temp_byte_Variable) == 0x000048, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, CallFunc_Format_ReturnValue_1) == 0x000050, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, Temp_real_Variable) == 0x000060, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, Temp_real_Variable_1) == 0x000064, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, Temp_real_Variable_2) == 0x000068, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, Temp_real_Variable_3) == 0x00006C, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, Temp_byte_Variable_1) == 0x000070, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, K2Node_CustomEvent_EventInfomation) == 0x000071, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::K2Node_CustomEvent_EventInfomation' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, K2Node_MakeArray_Array_2) == 0x000078, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, CallFunc_Format_ReturnValue_2) == 0x000088, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, K2Node_Select_Default) == 0x000098, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, K2Node_Select_Default_1) == 0x0000A8, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000B0, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category, K2Node_MakeArray_Array_3) == 0x0000B8, "Member 'WBP_GadgetInfo_Sub_Category_C_ExecuteUbergraph_WBP_GadgetInfo_Sub_Category::K2Node_MakeArray_Array_3' has a wrong offset!");

// Function WBP_GadgetInfo_Sub_Category.WBP_GadgetInfo_Sub_Category_C.IsListOver
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetInfo_Sub_Category_C_IsListOver final
{
public:
	bool                                          IsOver;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetInfo_Sub_Category_C_IsListOver) == 0x000001, "Wrong alignment on WBP_GadgetInfo_Sub_Category_C_IsListOver");
static_assert(sizeof(WBP_GadgetInfo_Sub_Category_C_IsListOver) == 0x000001, "Wrong size on WBP_GadgetInfo_Sub_Category_C_IsListOver");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_IsListOver, IsOver) == 0x000000, "Member 'WBP_GadgetInfo_Sub_Category_C_IsListOver::IsOver' has a wrong offset!");

// Function WBP_GadgetInfo_Sub_Category.WBP_GadgetInfo_Sub_Category_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetInfo_Sub_Category_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetInfo_Sub_Category_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GadgetInfo_Sub_Category_C_PreConstruct");
static_assert(sizeof(WBP_GadgetInfo_Sub_Category_C_PreConstruct) == 0x000001, "Wrong size on WBP_GadgetInfo_Sub_Category_C_PreConstruct");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GadgetInfo_Sub_Category_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GadgetInfo_Sub_Category.WBP_GadgetInfo_Sub_Category_C.SetIconList
// 0x0060 (0x0060 - 0x0000)
struct WBP_GadgetInfo_Sub_Category_C_SetIconList final
{
public:
	TArray<int32>                                 GadgetIds;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 L_GadgetIds;                                       // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GadgetIcon_Cost01_Icon_C*          CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetInfo_Sub_Category_C_SetIconList) == 0x000008, "Wrong alignment on WBP_GadgetInfo_Sub_Category_C_SetIconList");
static_assert(sizeof(WBP_GadgetInfo_Sub_Category_C_SetIconList) == 0x000060, "Wrong size on WBP_GadgetInfo_Sub_Category_C_SetIconList");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, GadgetIds) == 0x000000, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::GadgetIds' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, L_GadgetIds) == 0x000010, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::L_GadgetIds' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, Temp_byte_Variable) == 0x000024, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, Temp_byte_Variable_1) == 0x000025, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, Temp_bool_Variable) == 0x00002C, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, CallFunc_Conv_IntToByte_ReturnValue) == 0x00002D, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, CallFunc_GetValidValue_ReturnValue) == 0x00002E, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, K2Node_Select_Default) == 0x00002F, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000030, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, CallFunc_Array_Length_ReturnValue_2) == 0x000054, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetIconList, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'WBP_GadgetInfo_Sub_Category_C_SetIconList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GadgetInfo_Sub_Category.WBP_GadgetInfo_Sub_Category_C.SetModeStyle
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetInfo_Sub_Category_C_SetModeStyle final
{
public:
	EEventInfomationType                          EventInfomation;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetInfo_Sub_Category_C_SetModeStyle) == 0x000001, "Wrong alignment on WBP_GadgetInfo_Sub_Category_C_SetModeStyle");
static_assert(sizeof(WBP_GadgetInfo_Sub_Category_C_SetModeStyle) == 0x000001, "Wrong size on WBP_GadgetInfo_Sub_Category_C_SetModeStyle");
static_assert(offsetof(WBP_GadgetInfo_Sub_Category_C_SetModeStyle, EventInfomation) == 0x000000, "Member 'WBP_GadgetInfo_Sub_Category_C_SetModeStyle::EventInfomation' has a wrong offset!");

}

