#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_ControllerBtn

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_ControllerBtn.WBP_CMN_ControllerBtn_C.ExecuteUbergraph_WBP_CMN_ControllerBtn
// 0x0040 (0x0040 - 0x0000)
struct WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_ControllerBtn_C*    K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Controller_Btn; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SwitherIndex;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn) == 0x000008, "Wrong alignment on WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn");
static_assert(sizeof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn) == 0x000040, "Wrong size on WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, EntryPoint) == 0x000000, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, Temp_int_Variable) == 0x000008, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Controller_Btn) == 0x000010, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::K2Node_DynamicCast_AsWBP_Footer_Menu_Sub_Controller_Btn' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000019, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00001A, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00001C, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000020, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000024, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, Temp_int_Variable_1) == 0x000028, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00002C, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, K2Node_CustomEvent_SwitherIndex) == 0x000030, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::K2Node_CustomEvent_SwitherIndex' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, K2Node_CustomEvent_ButtonIndex) == 0x000034, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, K2Node_Select_Default) == 0x000038, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn, K2Node_Select_Default_1) == 0x00003C, "Member 'WBP_CMN_ControllerBtn_C_ExecuteUbergraph_WBP_CMN_ControllerBtn::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_CMN_ControllerBtn.WBP_CMN_ControllerBtn_C.SetIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_ControllerBtn_C_SetIcon final
{
public:
	int32                                         SwitherIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_ControllerBtn_C_SetIcon) == 0x000004, "Wrong alignment on WBP_CMN_ControllerBtn_C_SetIcon");
static_assert(sizeof(WBP_CMN_ControllerBtn_C_SetIcon) == 0x000008, "Wrong size on WBP_CMN_ControllerBtn_C_SetIcon");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_SetIcon, SwitherIndex) == 0x000000, "Member 'WBP_CMN_ControllerBtn_C_SetIcon::SwitherIndex' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_SetIcon, ButtonIndex) == 0x000004, "Member 'WBP_CMN_ControllerBtn_C_SetIcon::ButtonIndex' has a wrong offset!");

// Function WBP_CMN_ControllerBtn.WBP_CMN_ControllerBtn_C.SetMeterParam
// 0x0028 (0x0028 - 0x0000)
struct WBP_CMN_ControllerBtn_C_SetMeterParam final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_Int64Int64_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_ControllerBtn_C_SetMeterParam) == 0x000008, "Wrong alignment on WBP_CMN_ControllerBtn_C_SetMeterParam");
static_assert(sizeof(WBP_CMN_ControllerBtn_C_SetMeterParam) == 0x000028, "Wrong size on WBP_CMN_ControllerBtn_C_SetMeterParam");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_SetMeterParam, Value) == 0x000000, "Member 'WBP_CMN_ControllerBtn_C_SetMeterParam::Value' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_SetMeterParam, Temp_bool_Variable) == 0x000004, "Member 'WBP_CMN_ControllerBtn_C_SetMeterParam::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_SetMeterParam, CallFunc_Conv_DoubleToInt64_ReturnValue) == 0x000008, "Member 'WBP_CMN_ControllerBtn_C_SetMeterParam::CallFunc_Conv_DoubleToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_SetMeterParam, Temp_byte_Variable) == 0x000010, "Member 'WBP_CMN_ControllerBtn_C_SetMeterParam::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_SetMeterParam, CallFunc_Greater_Int64Int64_ReturnValue) == 0x000011, "Member 'WBP_CMN_ControllerBtn_C_SetMeterParam::CallFunc_Greater_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_SetMeterParam, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_CMN_ControllerBtn_C_SetMeterParam::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_SetMeterParam, K2Node_Select_Default) == 0x000013, "Member 'WBP_CMN_ControllerBtn_C_SetMeterParam::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_SetMeterParam, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_CMN_ControllerBtn_C_SetMeterParam::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_ControllerBtn_C_SetMeterParam, CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast) == 0x000020, "Member 'WBP_CMN_ControllerBtn_C_SetMeterParam::CallFunc_Conv_DoubleToInt64_InDouble_ImplicitCast' has a wrong offset!");

}

