#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ResultRate_Sub_RankUp_Window

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ResultRate_Sub_RankUp_Window.WBP_ResultRate_Sub_RankUp_Window_C
// 0x0120 (0x0400 - 0x02E0)
class UWBP_ResultRate_Sub_RankUp_Window_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pyramid_Active_In;                                 // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pyramid_Active_Loop;                               // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Loop;                                       // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_In;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Flag;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Screen;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_2;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff;                                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_00;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_01;                                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_02;                                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_03;                                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_04;                                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_05;                                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_06;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_07;                                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_08;                                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_09;                                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_Core_Add_01;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_Core_Add_02;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_CoreInvert_Add;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_Light;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_RankUp;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TXTBase;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ResultRate_Sub_RankIcon_C*         WBP_Result_Sub_Rate_RankIcon_01;                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ResultRate_Sub_RankIcon_C*         WBP_Result_Sub_Rate_RankIcon_02;                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ResultRate_Sub_RankUp_Pyramid_C*   WBP_ResultRate_Sub_RankUp_Pyramid;                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ERateRank                                     NowRank;                                           // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERateRank                                     NextRank;                                          // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x03CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLoop;                                           // 0x03CB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOpen;                                           // 0x03CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnd;                                            // 0x03CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CE[0x2];                                      // 0x03CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WaitCount;                                         // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              PanelDebugTexture;                                 // 0x03D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ResultRate_Sub_RankUp_Window_Button_Screen_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_ResultRate_Sub_RankUp_Window(int32 EntryPoint);
	void Open();
	void PreConstruct(bool IsDesignTime);
	void Set_Rank_Move_Impl(ERateRank NowRank_in, ERateRank NextRank_in);
	void SetRank2(ERateRank NowRank_0, ERateRank NextParam);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ResultRate_Sub_RankUp_Window_C">();
	}
	static class UWBP_ResultRate_Sub_RankUp_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ResultRate_Sub_RankUp_Window_C>();
	}
};
static_assert(alignof(UWBP_ResultRate_Sub_RankUp_Window_C) == 0x000008, "Wrong alignment on UWBP_ResultRate_Sub_RankUp_Window_C");
static_assert(sizeof(UWBP_ResultRate_Sub_RankUp_Window_C) == 0x000400, "Wrong size on UWBP_ResultRate_Sub_RankUp_Window_C");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Pyramid_Active_In) == 0x0002E8, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Pyramid_Active_In' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Pyramid_Active_Loop) == 0x0002F0, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Pyramid_Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Active_Loop) == 0x0002F8, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Active_In) == 0x000300, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Active_In' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, base) == 0x000308, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Base_Flag) == 0x000310, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Base_Flag' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Button_Screen) == 0x000318, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Button_Screen' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, CanvasPanel_2) == 0x000320, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::CanvasPanel_2' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff) == 0x000328, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_00) == 0x000330, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_00' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_01) == 0x000338, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_01' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_02) == 0x000340, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_02' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_03) == 0x000348, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_03' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_04) == 0x000350, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_04' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_05) == 0x000358, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_05' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_06) == 0x000360, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_06' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_07) == 0x000368, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_07' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_08) == 0x000370, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_08' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_09) == 0x000378, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_09' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_Core_Add_01) == 0x000380, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_Core_Add_01' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_Core_Add_02) == 0x000388, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_Core_Add_02' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_CoreInvert_Add) == 0x000390, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_CoreInvert_Add' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, Eff_Light) == 0x000398, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::Eff_Light' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, TXT_RankUp) == 0x0003A0, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::TXT_RankUp' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, TXTBase) == 0x0003A8, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::TXTBase' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, WBP_Result_Sub_Rate_RankIcon_01) == 0x0003B0, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::WBP_Result_Sub_Rate_RankIcon_01' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, WBP_Result_Sub_Rate_RankIcon_02) == 0x0003B8, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::WBP_Result_Sub_Rate_RankIcon_02' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, WBP_ResultRate_Sub_RankUp_Pyramid) == 0x0003C0, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::WBP_ResultRate_Sub_RankUp_Pyramid' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, NowRank) == 0x0003C8, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::NowRank' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, NextRank) == 0x0003C9, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::NextRank' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, bIsPressed) == 0x0003CA, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::bIsPressed' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, bIsLoop) == 0x0003CB, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::bIsLoop' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, bIsOpen) == 0x0003CC, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::bIsOpen' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, bIsEnd) == 0x0003CD, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::bIsEnd' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, WaitCount) == 0x0003D0, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::WaitCount' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RankUp_Window_C, PanelDebugTexture) == 0x0003D8, "Member 'UWBP_ResultRate_Sub_RankUp_Window_C::PanelDebugTexture' has a wrong offset!");

}

