#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_BG_01

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_BG_01.WBP_CMN_BG_01_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_CMN_BG_01_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       BG_Out;                                            // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BG_Loop;                                           // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BG_In;                                             // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_Blue;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Blue_Addtive;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Right_2;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_BG_01_C">();
	}
	static class UWBP_CMN_BG_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_BG_01_C>();
	}
};
static_assert(alignof(UWBP_CMN_BG_01_C) == 0x000008, "Wrong alignment on UWBP_CMN_BG_01_C");
static_assert(sizeof(UWBP_CMN_BG_01_C) == 0x000310, "Wrong size on UWBP_CMN_BG_01_C");
static_assert(offsetof(UWBP_CMN_BG_01_C, BG_Out) == 0x0002E0, "Member 'UWBP_CMN_BG_01_C::BG_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_01_C, BG_Loop) == 0x0002E8, "Member 'UWBP_CMN_BG_01_C::BG_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_01_C, BG_In) == 0x0002F0, "Member 'UWBP_CMN_BG_01_C::BG_In' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_01_C, BG_Blue) == 0x0002F8, "Member 'UWBP_CMN_BG_01_C::BG_Blue' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_01_C, BG_Blue_Addtive) == 0x000300, "Member 'UWBP_CMN_BG_01_C::BG_Blue_Addtive' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_BG_01_C, YellowLine_Right_2) == 0x000308, "Member 'UWBP_CMN_BG_01_C::YellowLine_Right_2' has a wrong offset!");

}

