#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_ColorPicker

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "ST_PullDownMenuData_structs.hpp"
#include "ST_ColorDetailWindowData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_PullDownMenuItemData_structs.hpp"
#include "ST_ColorDetailWindowColorItemData_structs.hpp"
#include "EColorDetailWindowMode_structs.hpp"


namespace SDK::Params
{

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.Bind
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_Bind final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FST_PullDownMenuItemData& InItemData)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FST_PullDownMenuItemData& InItemData)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_4;        // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_5;        // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_6;        // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_7; // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_8; // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_9; // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_Bind) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_Bind");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_Bind) == 0x0000B0, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_Bind");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Bind, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Bind::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Bind, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Bind::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Bind, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Bind::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Bind, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Bind::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Bind, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Bind::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Bind, K2Node_CreateDelegate_OutputDelegate_5) == 0x000050, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Bind::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Bind, K2Node_CreateDelegate_OutputDelegate_6) == 0x000060, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Bind::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Bind, K2Node_CreateDelegate_OutputDelegate_7) == 0x000070, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Bind::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Bind, K2Node_CreateDelegate_OutputDelegate_8) == 0x000080, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Bind::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Bind, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Bind::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Bind, K2Node_CreateDelegate_OutputDelegate_9) == 0x000098, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Bind::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Bind, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Bind::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.ButtonsPanel0_OnDecision
// 0x0050 (0x0050 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ColorDetailWindowColorItemData     CallFunc_GetItemData_OutItemData;                  // 0x001C(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* CallFunc_Array_Get_Item;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision) == 0x000050, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision::Button' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision, ButtonIndex) == 0x000008, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision::ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon) == 0x000010, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision, CallFunc_GetItemData_OutItemData) == 0x00001C, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision::CallFunc_GetItemData_OutItemData' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000049, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnDecision::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.ButtonsPanel0_OnFocus
// 0x0038 (0x0038 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ColorDetailWindowColorItemData     CallFunc_GetItemData_OutItemData;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus) == 0x000038, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus::Button' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus, ButtonIndex) == 0x000008, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus::ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon) == 0x000010, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus, CallFunc_Percent_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus, CallFunc_GetItemData_OutItemData) == 0x000020, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ButtonsPanel0_OnFocus::CallFunc_GetItemData_OutItemData' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.CreatePanel
// 0x0020 (0x0020 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel final
{
public:
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   CallFunc_CreateButtonsPanel_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel) == 0x000020, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel, CallFunc_MakeLiteralBool_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel, CallFunc_CreateButtonsPanel_ReturnValue) == 0x000008, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel::CallFunc_CreateButtonsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel, Temp_int_Variable) == 0x000010, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_CreatePanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker
// 0x0148 (0x0148 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIGridNavigationBuilder*          CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EColorDetailWindowMode, int32>           K2Node_MakeMap_Map;                                // 0x0048(0x0050)()
	class UUnionUIButtonsPanel*                   CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<EColorDetailWindowMode, struct FVector2D> K2Node_MakeMap_Map_1;                             // 0x00A0(0x0050)()
	TMap<EColorDetailWindowMode, struct FVector2D> K2Node_MakeMap_Map_2;                             // 0x00F0(0x0050)()
	class UUnionUIButtonsPanel*                   CallFunc_Array_Get_Item_2;                         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker) == 0x000148, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, EntryPoint) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon) == 0x000038, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, K2Node_MakeMap_Map) == 0x000048, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, K2Node_MakeMap_Map_1) == 0x0000A0, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::K2Node_MakeMap_Map_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, K2Node_MakeMap_Map_2) == 0x0000F0, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::K2Node_MakeMap_Map_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker, CallFunc_Array_Get_Item_2) == 0x000140, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_ExecuteUbergraph_WBP_MachineCustom_Sub_ColorPicker::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.PullDownMenu_OnCancel
// 0x0040 (0x0040 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel final
{
public:
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_PullDownMenuItemData               CallFunc_Array_Get_Item;                           // 0x0018(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel) == 0x000040, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel, Temp_bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnCancel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.PullDownMenu_OnItemFocused
// 0x0020 (0x0020 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemFocused final
{
public:
	struct FST_PullDownMenuItemData               InItemData;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemFocused) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemFocused");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemFocused) == 0x000020, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemFocused");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemFocused, InItemData) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemFocused::InItemData' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.PullDownMenu_OnItemSelected
// 0x0078 (0x0078 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected final
{
public:
	struct FST_PullDownMenuItemData               InItemData;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_PullDownMenuItemData               CallFunc_Array_Get_Item;                           // 0x0030(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_PullDownMenuItemData               K2Node_SetFieldsInStruct_StructOut;                // 0x0058(0x0020)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected) == 0x000078, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected, InItemData) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected::InItemData' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000054, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected, K2Node_SetFieldsInStruct_StructOut) == 0x000058, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_PullDownMenu_OnItemSelected::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.Scene_OnCancel
// 0x0010 (0x0010 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_Scene_OnCancel final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_Scene_OnCancel) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_Scene_OnCancel");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_Scene_OnCancel) == 0x000010, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_Scene_OnCancel");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Scene_OnCancel, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Scene_OnCancel::Button' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Scene_OnCancel, PanelIndex) == 0x000008, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Scene_OnCancel::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Scene_OnCancel, ButtonIndex) == 0x00000C, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Scene_OnCancel::ButtonIndex' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.SetInitialFocus
// 0x0050 (0x0050 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFound;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* CallFunc_Array_Get_Item;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* CallFunc_Array_Get_Item_1;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ColorDetailWindowColorItemData     CallFunc_GetItemData_OutItemData;                  // 0x0034(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus) == 0x000050, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus, InPlayerController) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus::InPlayerController' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus, bIsFound) == 0x000008, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus::bIsFound' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus, CallFunc_GetItemData_OutItemData) == 0x000034, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetInitialFocus::CallFunc_GetItemData_OutItemData' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.SetIsPlaySound
// 0x0048 (0x0048 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound final
{
public:
	bool                                          bIsPlay;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound) == 0x000048, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound, bIsPlay) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound::bIsPlay' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon) == 0x000030, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Color_Picker_Liquid_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetIsPlaySound::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.Setup
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_Setup final
{
public:
	struct FST_ColorDetailWindowData              InWindowData;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Map_Find_Value;                           // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Map_Find_Value_1;                         // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value_2;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_ColorPicker_LiquidIcon_C* CallFunc_Array_Get_Item;                  // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_Setup) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_Setup");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_Setup) == 0x0000A0, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_Setup");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, InWindowData) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::InWindowData' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Map_Find_Value) == 0x000038, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000050, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Map_Find_Value_1) == 0x000058, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Map_Find_ReturnValue_1) == 0x000068, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Map_Find_Value_2) == 0x00006C, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Map_Find_ReturnValue_2) == 0x000070, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, Temp_int_Array_Index_Variable) == 0x00007C, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Percent_IntInt_ReturnValue) == 0x000080, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Divide_IntInt_ReturnValue) == 0x000084, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000090, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_ColorPicker.WBP_MachineCustom_Sub_ColorPicker_C.SetupPullDownMenu
// 0x0010 (0x0010 - 0x0000)
struct WBP_MachineCustom_Sub_ColorPicker_C_SetupPullDownMenu final
{
public:
	struct FST_PullDownMenuData                   InMenuData;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_ColorPicker_C_SetupPullDownMenu) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_ColorPicker_C_SetupPullDownMenu");
static_assert(sizeof(WBP_MachineCustom_Sub_ColorPicker_C_SetupPullDownMenu) == 0x000010, "Wrong size on WBP_MachineCustom_Sub_ColorPicker_C_SetupPullDownMenu");
static_assert(offsetof(WBP_MachineCustom_Sub_ColorPicker_C_SetupPullDownMenu, InMenuData) == 0x000000, "Member 'WBP_MachineCustom_Sub_ColorPicker_C_SetupPullDownMenu::InMenuData' has a wrong offset!");

