#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetIcon_Cost01_Icon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_GadgetIcon_Cost01_Icon.WBP_GadgetIcon_Cost01_Icon_C.ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon
// 0x0048 (0x0048 - 0x0000)
struct WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_InTexture;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsVisible_1;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InCost;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsVisible;                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon) == 0x000008, "Wrong alignment on WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon");
static_assert(sizeof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon) == 0x000048, "Wrong size on WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, EntryPoint) == 0x000000, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, Temp_bool_Variable) == 0x000004, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, Temp_byte_Variable) == 0x000005, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, K2Node_Event_InTexture) == 0x000008, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::K2Node_Event_InTexture' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, Temp_byte_Variable_2) == 0x000011, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, Temp_byte_Variable_3) == 0x000012, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, K2Node_Event_bInIsVisible_1) == 0x000020, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::K2Node_Event_bInIsVisible_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, K2Node_Event_InCost) == 0x000024, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::K2Node_Event_InCost' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000030, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, Temp_bool_Variable_1) == 0x000040, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, K2Node_Event_bInIsVisible) == 0x000041, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::K2Node_Event_bInIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, K2Node_Select_Default) == 0x000042, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, K2Node_Select_Default_1) == 0x000043, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000044, "Member 'WBP_GadgetIcon_Cost01_Icon_C_ExecuteUbergraph_WBP_GadgetIcon_Cost01_Icon::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_GadgetIcon_Cost01_Icon.WBP_GadgetIcon_Cost01_Icon_C.SetBaseVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetIcon_Cost01_Icon_C_SetBaseVisible final
{
public:
	bool                                          bInIsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetIcon_Cost01_Icon_C_SetBaseVisible) == 0x000001, "Wrong alignment on WBP_GadgetIcon_Cost01_Icon_C_SetBaseVisible");
static_assert(sizeof(WBP_GadgetIcon_Cost01_Icon_C_SetBaseVisible) == 0x000001, "Wrong size on WBP_GadgetIcon_Cost01_Icon_C_SetBaseVisible");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetBaseVisible, bInIsVisible) == 0x000000, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetBaseVisible::bInIsVisible' has a wrong offset!");

// Function WBP_GadgetIcon_Cost01_Icon.WBP_GadgetIcon_Cost01_Icon_C.SetCost
// 0x0004 (0x0004 - 0x0000)
struct WBP_GadgetIcon_Cost01_Icon_C_SetCost final
{
public:
	int32                                         InCost;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetIcon_Cost01_Icon_C_SetCost) == 0x000004, "Wrong alignment on WBP_GadgetIcon_Cost01_Icon_C_SetCost");
static_assert(sizeof(WBP_GadgetIcon_Cost01_Icon_C_SetCost) == 0x000004, "Wrong size on WBP_GadgetIcon_Cost01_Icon_C_SetCost");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetCost, InCost) == 0x000000, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetCost::InCost' has a wrong offset!");

// Function WBP_GadgetIcon_Cost01_Icon.WBP_GadgetIcon_Cost01_Icon_C.SetCostVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetIcon_Cost01_Icon_C_SetCostVisible final
{
public:
	bool                                          bInIsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetIcon_Cost01_Icon_C_SetCostVisible) == 0x000001, "Wrong alignment on WBP_GadgetIcon_Cost01_Icon_C_SetCostVisible");
static_assert(sizeof(WBP_GadgetIcon_Cost01_Icon_C_SetCostVisible) == 0x000001, "Wrong size on WBP_GadgetIcon_Cost01_Icon_C_SetCostVisible");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetCostVisible, bInIsVisible) == 0x000000, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetCostVisible::bInIsVisible' has a wrong offset!");

// Function WBP_GadgetIcon_Cost01_Icon.WBP_GadgetIcon_Cost01_Icon_C.SetGadgetKitBase
// 0x0008 (0x0008 - 0x0000)
struct WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase final
{
public:
	int32                                         InSizeX;                                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInGadgetKit;                                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase) == 0x000004, "Wrong alignment on WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase");
static_assert(sizeof(WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase) == 0x000008, "Wrong size on WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase, InSizeX) == 0x000000, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase::InSizeX' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase, bInGadgetKit) == 0x000004, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase::bInGadgetKit' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase, CallFunc_IsValid_ReturnValue_1) == 0x000006, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase, CallFunc_IsValid_ReturnValue_2) == 0x000007, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetGadgetKitBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_GadgetIcon_Cost01_Icon.WBP_GadgetIcon_Cost01_Icon_C.SetTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_GadgetIcon_Cost01_Icon_C_SetTexture final
{
public:
	class UTexture2D*                             InTexture;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetIcon_Cost01_Icon_C_SetTexture) == 0x000008, "Wrong alignment on WBP_GadgetIcon_Cost01_Icon_C_SetTexture");
static_assert(sizeof(WBP_GadgetIcon_Cost01_Icon_C_SetTexture) == 0x000008, "Wrong size on WBP_GadgetIcon_Cost01_Icon_C_SetTexture");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetTexture, InTexture) == 0x000000, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetTexture::InTexture' has a wrong offset!");

// Function WBP_GadgetIcon_Cost01_Icon.WBP_GadgetIcon_Cost01_Icon_C.SetupByGadgetId
// 0x0188 (0x0188 - 0x0000)
struct WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId final
{
public:
	EGadgetId                                     InGadgetId;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInSetShape;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGadgetData                            CallFunc_GetGadgetData_OutGadgetData;              // 0x0008(0x00C0)()
	bool                                          CallFunc_GetGadgetData_ReturnValue;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F8(0x0010)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0110(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0158(0x0010)(ReferenceParm)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0170(0x0010)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId) == 0x000008, "Wrong alignment on WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId");
static_assert(sizeof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId) == 0x000188, "Wrong size on WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, InGadgetId) == 0x000000, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::InGadgetId' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, bInSetShape) == 0x000001, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::bInSetShape' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, CallFunc_GetGadgetData_OutGadgetData) == 0x000008, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::CallFunc_GetGadgetData_OutGadgetData' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, CallFunc_GetGadgetData_ReturnValue) == 0x0000C8, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::CallFunc_GetGadgetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, CallFunc_Multiply_IntInt_ReturnValue) == 0x0000CC, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000D0, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, K2Node_DynamicCast_As_____2D) == 0x0000D8, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000E8, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F8, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, CallFunc_MakeLiteralByte_ReturnValue) == 0x000108, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, K2Node_MakeStruct_FormatArgumentData) == 0x000110, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, K2Node_MakeArray_Array) == 0x000158, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000168, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, CallFunc_Format_ReturnValue) == 0x000170, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000180, "Member 'WBP_GadgetIcon_Cost01_Icon_C_SetupByGadgetId::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");

}

