#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Movie_Subtitles

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Movie_Subtitles.WBP_Movie_Subtitles_C
// 0x0060 (0x0340 - 0x02E0)
class UWBP_Movie_Subtitles_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CMN_RivalLevel_C*                  DSP_WBP_CMN_RivalLevel;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Movie_Subtitles_Sub_WinLose_C*     DSP_WBP_Movie_Subtitles_Sub_WinLose;               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RaceBefore_RivalRacer_Sub_RivalRacerInfo_C* DSP_WBP_RivalRacer_Sub_RivalRacerInfo;    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Subtitles;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              PanelDebugTexture;                                 // 0x0318(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Movie_Subtitles(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetVisibleForRivalRacerSubRivalRacerInfo(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Movie_Subtitles_C">();
	}
	static class UWBP_Movie_Subtitles_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Movie_Subtitles_C>();
	}
};
static_assert(alignof(UWBP_Movie_Subtitles_C) == 0x000008, "Wrong alignment on UWBP_Movie_Subtitles_C");
static_assert(sizeof(UWBP_Movie_Subtitles_C) == 0x000340, "Wrong size on UWBP_Movie_Subtitles_C");
static_assert(offsetof(UWBP_Movie_Subtitles_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Movie_Subtitles_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Movie_Subtitles_C, DSP_WBP_CMN_RivalLevel) == 0x0002E8, "Member 'UWBP_Movie_Subtitles_C::DSP_WBP_CMN_RivalLevel' has a wrong offset!");
static_assert(offsetof(UWBP_Movie_Subtitles_C, DSP_WBP_Movie_Subtitles_Sub_WinLose) == 0x0002F0, "Member 'UWBP_Movie_Subtitles_C::DSP_WBP_Movie_Subtitles_Sub_WinLose' has a wrong offset!");
static_assert(offsetof(UWBP_Movie_Subtitles_C, DSP_WBP_RivalRacer_Sub_RivalRacerInfo) == 0x0002F8, "Member 'UWBP_Movie_Subtitles_C::DSP_WBP_RivalRacer_Sub_RivalRacerInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Movie_Subtitles_C, Panel) == 0x000300, "Member 'UWBP_Movie_Subtitles_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Movie_Subtitles_C, SafeZone) == 0x000308, "Member 'UWBP_Movie_Subtitles_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UWBP_Movie_Subtitles_C, TXT_Subtitles) == 0x000310, "Member 'UWBP_Movie_Subtitles_C::TXT_Subtitles' has a wrong offset!");
static_assert(offsetof(UWBP_Movie_Subtitles_C, PanelDebugTexture) == 0x000318, "Member 'UWBP_Movie_Subtitles_C::PanelDebugTexture' has a wrong offset!");

}

