#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_Sub_PullDownMenu_Text

#include "Basic.hpp"

#include "ST_PullDownMenuItemData_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_Sub_PullDownMenu_Text.WBP_CMN_Sub_PullDownMenu_Text_C.SetSelectIconVisible
// 0x0006 (0x0006 - 0x0000)
struct WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible final
{
public:
	bool                                          bInIsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible) == 0x000001, "Wrong alignment on WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible");
static_assert(sizeof(WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible) == 0x000006, "Wrong size on WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible");
static_assert(offsetof(WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible, bInIsVisible) == 0x000000, "Member 'WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible::bInIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible, NewLocalVar) == 0x000001, "Member 'WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible, Temp_bool_Variable) == 0x000002, "Member 'WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible, Temp_byte_Variable) == 0x000003, "Member 'WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible, K2Node_Select_Default) == 0x000005, "Member 'WBP_CMN_Sub_PullDownMenu_Text_C_SetSelectIconVisible::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CMN_Sub_PullDownMenu_Text.WBP_CMN_Sub_PullDownMenu_Text_C.Setup
// 0x0020 (0x0020 - 0x0000)
struct WBP_CMN_Sub_PullDownMenu_Text_C_Setup final
{
public:
	struct FST_PullDownMenuItemData               InItemData;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_Sub_PullDownMenu_Text_C_Setup) == 0x000008, "Wrong alignment on WBP_CMN_Sub_PullDownMenu_Text_C_Setup");
static_assert(sizeof(WBP_CMN_Sub_PullDownMenu_Text_C_Setup) == 0x000020, "Wrong size on WBP_CMN_Sub_PullDownMenu_Text_C_Setup");
static_assert(offsetof(WBP_CMN_Sub_PullDownMenu_Text_C_Setup, InItemData) == 0x000000, "Member 'WBP_CMN_Sub_PullDownMenu_Text_C_Setup::InItemData' has a wrong offset!");

// Function WBP_CMN_Sub_PullDownMenu_Text.WBP_CMN_Sub_PullDownMenu_Text_C.GetItemData
// 0x0020 (0x0020 - 0x0000)
struct WBP_CMN_Sub_PullDownMenu_Text_C_GetItemData final
{
public:
	struct FST_PullDownMenuItemData               OutItemData;                                       // 0x0000(0x0020)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_Sub_PullDownMenu_Text_C_GetItemData) == 0x000008, "Wrong alignment on WBP_CMN_Sub_PullDownMenu_Text_C_GetItemData");
static_assert(sizeof(WBP_CMN_Sub_PullDownMenu_Text_C_GetItemData) == 0x000020, "Wrong size on WBP_CMN_Sub_PullDownMenu_Text_C_GetItemData");
static_assert(offsetof(WBP_CMN_Sub_PullDownMenu_Text_C_GetItemData, OutItemData) == 0x000000, "Member 'WBP_CMN_Sub_PullDownMenu_Text_C_GetItemData::OutItemData' has a wrong offset!");

}

