#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupResult_Sub_Table_Line

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GroupResult_Sub_Table_Line.WBP_GroupResult_Sub_Table_Line_C
// 0x0058 (0x04C8 - 0x0470)
class UWBP_GroupResult_Sub_Table_Line_C final : public UUnionRaceUIResultPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Result_Loop;                                       // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Result_In;                                         // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_01;                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_02;                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_03;                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_04;                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_05;                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   WBP_Result_Sub_RankingTable_06;                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Result_Sub_RankingTable_GP_02_C*> SubTableList;                                // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line(int32 EntryPoint);
	void OpenFestaBonusAll();
	void OpenImpl();
	void Set_Racer_Data_Impl(const struct FPartyResultRacer& RacerData, int32 Index_0, bool bIsTimeMode, double Time1st, bool bIsLoading);
	void SetFestaBonusPoint(const TArray<struct FFestaRacerResultInfo>& RacerList);
	void SetMVPAnim(int32 RacerIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GroupResult_Sub_Table_Line_C">();
	}
	static class UWBP_GroupResult_Sub_Table_Line_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GroupResult_Sub_Table_Line_C>();
	}
};
static_assert(alignof(UWBP_GroupResult_Sub_Table_Line_C) == 0x000008, "Wrong alignment on UWBP_GroupResult_Sub_Table_Line_C");
static_assert(sizeof(UWBP_GroupResult_Sub_Table_Line_C) == 0x0004C8, "Wrong size on UWBP_GroupResult_Sub_Table_Line_C");
static_assert(offsetof(UWBP_GroupResult_Sub_Table_Line_C, UberGraphFrame) == 0x000470, "Member 'UWBP_GroupResult_Sub_Table_Line_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_Table_Line_C, Result_Loop) == 0x000478, "Member 'UWBP_GroupResult_Sub_Table_Line_C::Result_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_Table_Line_C, Result_In) == 0x000480, "Member 'UWBP_GroupResult_Sub_Table_Line_C::Result_In' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_Table_Line_C, WBP_Result_Sub_RankingTable_01) == 0x000488, "Member 'UWBP_GroupResult_Sub_Table_Line_C::WBP_Result_Sub_RankingTable_01' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_Table_Line_C, WBP_Result_Sub_RankingTable_02) == 0x000490, "Member 'UWBP_GroupResult_Sub_Table_Line_C::WBP_Result_Sub_RankingTable_02' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_Table_Line_C, WBP_Result_Sub_RankingTable_03) == 0x000498, "Member 'UWBP_GroupResult_Sub_Table_Line_C::WBP_Result_Sub_RankingTable_03' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_Table_Line_C, WBP_Result_Sub_RankingTable_04) == 0x0004A0, "Member 'UWBP_GroupResult_Sub_Table_Line_C::WBP_Result_Sub_RankingTable_04' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_Table_Line_C, WBP_Result_Sub_RankingTable_05) == 0x0004A8, "Member 'UWBP_GroupResult_Sub_Table_Line_C::WBP_Result_Sub_RankingTable_05' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_Table_Line_C, WBP_Result_Sub_RankingTable_06) == 0x0004B0, "Member 'UWBP_GroupResult_Sub_Table_Line_C::WBP_Result_Sub_RankingTable_06' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_Table_Line_C, SubTableList) == 0x0004B8, "Member 'UWBP_GroupResult_Sub_Table_Line_C::SubTableList' has a wrong offset!");

}

