#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_PlayerDetail_Sub_Info_Gadget_List

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_PlayerDetail_Sub_Info_Gadget_List.WBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C final : public UUserWidget
{
public:
	class UImage*                                 Base_Empty;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Frame;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Lock;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_On;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FontScroll_C*                      WBP_FontScroll_GadgetName;                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetIcon_C*                      WBP_GadgetIcon;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_List;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetCostOverGadgetStatus();
	void SetEmptyGadgetStatus();
	void SetGadgetData(EGadgetId InGadgetId, bool bIsDisable);
	void SetLockGadgetStatus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C">();
	}
	static class UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C>();
	}
};
static_assert(alignof(UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C) == 0x000008, "Wrong alignment on UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C");
static_assert(sizeof(UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C) == 0x000318, "Wrong size on UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C, Base_Empty) == 0x0002E0, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C::Base_Empty' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C, Base_Frame) == 0x0002E8, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C::Base_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C, Base_Lock) == 0x0002F0, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C::Base_Lock' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C, Base_On) == 0x0002F8, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C::Base_On' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C, WBP_FontScroll_GadgetName) == 0x000300, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C::WBP_FontScroll_GadgetName' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C, WBP_GadgetIcon) == 0x000308, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C::WBP_GadgetIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C, WS_List) == 0x000310, "Member 'UWBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C::WS_List' has a wrong offset!");

}

