#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_System_Transition

#include "Basic.hpp"

#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_System_Transition.WBP_System_Transition_C.ExecuteUbergraph_WBP_System_Transition
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeColor                             Temp_byte_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         Temp_byte_Variable_2;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeColor                             Temp_byte_Variable_3;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeColor                             K2Node_Event_FadeColor_1;                          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         K2Node_Event_FadeDirection;                        // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeColor                             K2Node_Event_FadeColor;                            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeColor                             Temp_byte_Variable_4;                              // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeColor                             Temp_byte_Variable_5;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_4;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeColor                             Temp_byte_Variable_6;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_5;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_6;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition) == 0x000008, "Wrong alignment on WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition");
static_assert(sizeof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition) == 0x0000A8, "Wrong size on WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, EntryPoint) == 0x000000, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, Temp_byte_Variable) == 0x000010, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, Temp_byte_Variable_1) == 0x000030, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, Temp_byte_Variable_2) == 0x000031, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, Temp_byte_Variable_3) == 0x000044, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_Select_Default) == 0x000048, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, Temp_bool_IsClosed_Variable) == 0x000050, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, Temp_bool_Has_Been_Initd_Variable) == 0x000051, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_Event_FadeColor_1) == 0x000052, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_Event_FadeColor_1' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_Event_FadeDirection) == 0x000053, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_Event_FadeDirection' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_Event_FadeColor) == 0x000054, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_Event_FadeColor' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, Temp_byte_Variable_4) == 0x000055, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_Select_Default_1) == 0x000058, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_SwitchEnum_CmpSuccess) == 0x000060, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_Select_Default_2) == 0x000068, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, Temp_byte_Variable_5) == 0x000070, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_Select_Default_3) == 0x000078, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_Select_Default_4) == 0x000080, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, CallFunc_PlayAnimation_ReturnValue_2) == 0x000088, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, Temp_byte_Variable_6) == 0x000090, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_Select_Default_5) == 0x000098, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition, K2Node_Select_Default_6) == 0x0000A0, "Member 'WBP_System_Transition_C_ExecuteUbergraph_WBP_System_Transition::K2Node_Select_Default_6' has a wrong offset!");

// Function WBP_System_Transition.WBP_System_Transition_C.StartFade
// 0x0002 (0x0002 - 0x0000)
struct WBP_System_Transition_C_StartFade final
{
public:
	EUnionUIFadeColor                             FadeColor;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_System_Transition_C_StartFade) == 0x000001, "Wrong alignment on WBP_System_Transition_C_StartFade");
static_assert(sizeof(WBP_System_Transition_C_StartFade) == 0x000002, "Wrong size on WBP_System_Transition_C_StartFade");
static_assert(offsetof(WBP_System_Transition_C_StartFade, FadeColor) == 0x000000, "Member 'WBP_System_Transition_C_StartFade::FadeColor' has a wrong offset!");
static_assert(offsetof(WBP_System_Transition_C_StartFade, FadeDirection) == 0x000001, "Member 'WBP_System_Transition_C_StartFade::FadeDirection' has a wrong offset!");

// Function WBP_System_Transition.WBP_System_Transition_C.StartLoopFade
// 0x0001 (0x0001 - 0x0000)
struct WBP_System_Transition_C_StartLoopFade final
{
public:
	EUnionUIFadeColor                             FadeColor;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_System_Transition_C_StartLoopFade) == 0x000001, "Wrong alignment on WBP_System_Transition_C_StartLoopFade");
static_assert(sizeof(WBP_System_Transition_C_StartLoopFade) == 0x000001, "Wrong size on WBP_System_Transition_C_StartLoopFade");
static_assert(offsetof(WBP_System_Transition_C_StartLoopFade, FadeColor) == 0x000000, "Member 'WBP_System_Transition_C_StartLoopFade::FadeColor' has a wrong offset!");

}

