#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_SpeedNum

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Sub_SpeedNum.WBP_Race_HUD_Sub_SpeedNum_C.ExecuteUbergraph_WBP_Race_HUD_Sub_SpeedNum
// 0x0018 (0x0018 - 0x0000)
struct WBP_Race_HUD_Sub_SpeedNum_C_ExecuteUbergraph_WBP_Race_HUD_Sub_SpeedNum final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_Race_HUD_Sub_SpeedNum_C_ExecuteUbergraph_WBP_Race_HUD_Sub_SpeedNum) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_SpeedNum_C_ExecuteUbergraph_WBP_Race_HUD_Sub_SpeedNum");
static_assert(sizeof(WBP_Race_HUD_Sub_SpeedNum_C_ExecuteUbergraph_WBP_Race_HUD_Sub_SpeedNum) == 0x000018, "Wrong size on WBP_Race_HUD_Sub_SpeedNum_C_ExecuteUbergraph_WBP_Race_HUD_Sub_SpeedNum");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_ExecuteUbergraph_WBP_Race_HUD_Sub_SpeedNum, EntryPoint) == 0x000000, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_ExecuteUbergraph_WBP_Race_HUD_Sub_SpeedNum::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_ExecuteUbergraph_WBP_Race_HUD_Sub_SpeedNum, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_ExecuteUbergraph_WBP_Race_HUD_Sub_SpeedNum::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_Race_HUD_Sub_SpeedNum.WBP_Race_HUD_Sub_SpeedNum_C.PauseSound
// 0x0030 (0x0030 - 0x0000)
struct WBP_Race_HUD_Sub_SpeedNum_C_PauseSound final
{
public:
	bool                                          IsPause;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0010(0x0004)()
	struct FSoundHandle                           CallFunc_Array_Get_Item;                           // 0x0014(0x0004)()
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue;                  // 0x0018(0x0004)()
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_Stop_ReturnValue;                         // 0x0020(0x0004)()
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound) == 0x000004, "Wrong alignment on WBP_Race_HUD_Sub_SpeedNum_C_PauseSound");
static_assert(sizeof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound) == 0x000030, "Wrong size on WBP_Race_HUD_Sub_SpeedNum_C_PauseSound");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, IsPause) == 0x000000, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::IsPause' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, CallFunc_SoundPlay_ReturnValue) == 0x000010, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, CallFunc_Array_Get_Item) == 0x000014, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, CallFunc_SetPanSplit_ReturnValue) == 0x000018, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::CallFunc_SetPanSplit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, CallFunc_IsPlaying_ReturnValue) == 0x00001C, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, CallFunc_Array_Get_Item_1) == 0x00001D, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, CallFunc_Stop_ReturnValue) == 0x000020, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, CallFunc_IsPlaying_ReturnValue_1) == 0x000024, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_PauseSound, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_PauseSound::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_SpeedNum.WBP_Race_HUD_Sub_SpeedNum_C.SetIntNum
// 0x0028 (0x0028 - 0x0000)
struct WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum final
{
public:
	class UImage*                                 Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Num;                                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum");
static_assert(sizeof(WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum) == 0x000028, "Wrong size on WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum, Image) == 0x000000, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum::Image' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum, Num) == 0x000008, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum::Num' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000020, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetIntNum::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Race_HUD_Sub_SpeedNum.WBP_Race_HUD_Sub_SpeedNum_C.SetRingNum
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Sub_SpeedNum_C_SetRingNum final
{
public:
	int32                                         RingNum;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_SpeedNum_C_SetRingNum) == 0x000004, "Wrong alignment on WBP_Race_HUD_Sub_SpeedNum_C_SetRingNum");
static_assert(sizeof(WBP_Race_HUD_Sub_SpeedNum_C_SetRingNum) == 0x000008, "Wrong size on WBP_Race_HUD_Sub_SpeedNum_C_SetRingNum");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetRingNum, RingNum) == 0x000000, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetRingNum::RingNum' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetRingNum, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetRingNum::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_SpeedNum.WBP_Race_HUD_Sub_SpeedNum_C.SetSpeedKMPH
// 0x001C (0x001C - 0x0000)
struct WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH final
{
public:
	int32                                         SpeedKMPH;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_2;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH) == 0x000004, "Wrong alignment on WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH");
static_assert(sizeof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH) == 0x00001C, "Wrong size on WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH, SpeedKMPH) == 0x000000, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH::SpeedKMPH' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH, CallFunc_Percent_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000008, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH, CallFunc_Divide_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH, CallFunc_Divide_IntInt_ReturnValue_1) == 0x000010, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH, CallFunc_Percent_IntInt_ReturnValue_2) == 0x000014, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH, CallFunc_Divide_IntInt_ReturnValue_2) == 0x000018, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedKMPH::CallFunc_Divide_IntInt_ReturnValue_2' has a wrong offset!");

// Function WBP_Race_HUD_Sub_SpeedNum.WBP_Race_HUD_Sub_SpeedNum_C.SetSpeedScale
// 0x0030 (0x0030 - 0x0000)
struct WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale final
{
public:
	int32                                         Speed;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         newParam;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetSelectedMenuSpeedClassId_ReturnValue;  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale");
static_assert(sizeof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale) == 0x000030, "Wrong size on WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale, Speed) == 0x000000, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale::Speed' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale, newParam) == 0x000004, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale::newParam' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale, CallFunc_GetSelectedMenuSpeedClassId_ReturnValue) == 0x000010, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale::CallFunc_GetSelectedMenuSpeedClassId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale, CallFunc_FTrunc_ReturnValue) == 0x000028, "Member 'WBP_Race_HUD_Sub_SpeedNum_C_SetSpeedScale::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

}

