#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_System_Sub_AutoSave

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_System_Sub_AutoSave.WBP_System_Sub_AutoSave_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_System_Sub_AutoSave_C final : public UUserWidget
{
public:
	class UImage*                                 RingBase;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RingEff;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RingEff_Add;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RingEff_Light;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_AutoSave;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_System_Sub_AutoSave_C">();
	}
	static class UWBP_System_Sub_AutoSave_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_System_Sub_AutoSave_C>();
	}
};
static_assert(alignof(UWBP_System_Sub_AutoSave_C) == 0x000008, "Wrong alignment on UWBP_System_Sub_AutoSave_C");
static_assert(sizeof(UWBP_System_Sub_AutoSave_C) == 0x000308, "Wrong size on UWBP_System_Sub_AutoSave_C");
static_assert(offsetof(UWBP_System_Sub_AutoSave_C, RingBase) == 0x0002E0, "Member 'UWBP_System_Sub_AutoSave_C::RingBase' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_AutoSave_C, RingEff) == 0x0002E8, "Member 'UWBP_System_Sub_AutoSave_C::RingEff' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_AutoSave_C, RingEff_Add) == 0x0002F0, "Member 'UWBP_System_Sub_AutoSave_C::RingEff_Add' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_AutoSave_C, RingEff_Light) == 0x0002F8, "Member 'UWBP_System_Sub_AutoSave_C::RingEff_Light' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_AutoSave_C, TXT_AutoSave) == 0x000300, "Member 'UWBP_System_Sub_AutoSave_C::TXT_AutoSave' has a wrong offset!");

}

