#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSelect_Sub_CourseIcon

#include "Basic.hpp"

#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CourseSelect_Sub_CourseIcon.WBP_CourseSelect_Sub_CourseIcon_C.ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_12;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_13;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_14;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bLock;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_DecidableIfLocked;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGrandPrixId                                  K2Node_Event_IconId;                               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGrandPrixId                                  Temp_byte_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_ByteToDouble_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon) == 0x000008, "Wrong alignment on WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon");
static_assert(sizeof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon) == 0x0000F8, "Wrong size on WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, EntryPoint) == 0x000000, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable) == 0x000008, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_1) == 0x000010, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_2) == 0x000018, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_3) == 0x000020, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_4) == 0x000028, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_5) == 0x000030, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_6) == 0x000038, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_7) == 0x000040, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_8) == 0x000048, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_9) == 0x000050, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_10) == 0x000058, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_11) == 0x000060, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_12) == 0x000068, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000070, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000078, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_13) == 0x000080, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_real_Variable_14) == 0x000088, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_real_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, K2Node_Event_bLock) == 0x000090, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::K2Node_Event_bLock' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, K2Node_Event_DecidableIfLocked) == 0x000091, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::K2Node_Event_DecidableIfLocked' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000098, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, K2Node_Event_IconId) == 0x0000A0, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::K2Node_Event_IconId' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x0000A8, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, Temp_byte_Variable) == 0x0000B0, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000B1, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000B4, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0000B8, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000BC, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000BD, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_Conv_ByteToDouble_ReturnValue) == 0x0000C0, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_Conv_ByteToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0000D0, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x0000D4, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, K2Node_Select_Default) == 0x0000E0, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000E8, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0000EC, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0000F0, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x0000F4, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_ExecuteUbergraph_WBP_CourseSelect_Sub_CourseIcon::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");

// Function WBP_CourseSelect_Sub_CourseIcon.WBP_CourseSelect_Sub_CourseIcon_C.SelectMedalView
// 0x0004 (0x0004 - 0x0000)
struct WBP_CourseSelect_Sub_CourseIcon_C_SelectMedalView final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_CourseIcon_C_SelectMedalView) == 0x000004, "Wrong alignment on WBP_CourseSelect_Sub_CourseIcon_C_SelectMedalView");
static_assert(sizeof(WBP_CourseSelect_Sub_CourseIcon_C_SelectMedalView) == 0x000004, "Wrong size on WBP_CourseSelect_Sub_CourseIcon_C_SelectMedalView");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SelectMedalView, InIndex) == 0x000000, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SelectMedalView::InIndex' has a wrong offset!");

// Function WBP_CourseSelect_Sub_CourseIcon.WBP_CourseSelect_Sub_CourseIcon_C.SetGrandprixIconId
// 0x0001 (0x0001 - 0x0000)
struct WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixIconId final
{
public:
	EGrandPrixId                                  IconId;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixIconId) == 0x000001, "Wrong alignment on WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixIconId");
static_assert(sizeof(WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixIconId) == 0x000001, "Wrong size on WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixIconId");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixIconId, IconId) == 0x000000, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixIconId::IconId' has a wrong offset!");

// Function WBP_CourseSelect_Sub_CourseIcon.WBP_CourseSelect_Sub_CourseIcon_C.SetGrandprixId
// 0x0002 (0x0002 - 0x0000)
struct WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixId final
{
public:
	uint8                                         GrandPrixId_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixId) == 0x000001, "Wrong alignment on WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixId");
static_assert(sizeof(WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixId) == 0x000002, "Wrong size on WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixId");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixId, GrandPrixId_0) == 0x000000, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixId::GrandPrixId_0' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixId, CallFunc_GetValidValue_ReturnValue) == 0x000001, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetGrandprixId::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function WBP_CourseSelect_Sub_CourseIcon.WBP_CourseSelect_Sub_CourseIcon_C.SetLock
// 0x0090 (0x0090 - 0x0000)
struct WBP_CourseSelect_Sub_CourseIcon_C_SetLock final
{
public:
	bool                                          bLock;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DecidableIfLocked;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              K2Node_Select_Default;                             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock) == 0x000008, "Wrong alignment on WBP_CourseSelect_Sub_CourseIcon_C_SetLock");
static_assert(sizeof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock) == 0x000090, "Wrong size on WBP_CourseSelect_Sub_CourseIcon_C_SetLock");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, bLock) == 0x000000, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::bLock' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, DecidableIfLocked) == 0x000001, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::DecidableIfLocked' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, Temp_byte_Variable) == 0x000002, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, Temp_bool_Variable) == 0x000005, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, Temp_struct_Variable) == 0x000008, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_MakeLiteralByte_ReturnValue) == 0x000018, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, Temp_struct_Variable_1) == 0x00001C, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00002C, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, Temp_bool_Variable_1) == 0x000030, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, K2Node_Select_Default) == 0x00004A, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_IsAnimationPlaying_ReturnValue) == 0x00004B, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_IsValid_ReturnValue_1) == 0x00004C, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x00004D, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000050, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_Greater_IntInt_ReturnValue) == 0x000054, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000055, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000058, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, K2Node_Select_Default_1) == 0x000060, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_BooleanAND_ReturnValue_1) == 0x000070, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_PlayAnimation_ReturnValue_2) == 0x000078, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, CallFunc_PlayAnimation_ReturnValue_3) == 0x000080, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLock, K2Node_SwitchEnum_CmpSuccess) == 0x000088, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLock::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_CourseSelect_Sub_CourseIcon.WBP_CourseSelect_Sub_CourseIcon_C.SetLockStatus
// 0x0002 (0x0002 - 0x0000)
struct WBP_CourseSelect_Sub_CourseIcon_C_SetLockStatus final
{
public:
	bool                                          bLock;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DecidableIfLocked;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_CourseIcon_C_SetLockStatus) == 0x000001, "Wrong alignment on WBP_CourseSelect_Sub_CourseIcon_C_SetLockStatus");
static_assert(sizeof(WBP_CourseSelect_Sub_CourseIcon_C_SetLockStatus) == 0x000002, "Wrong size on WBP_CourseSelect_Sub_CourseIcon_C_SetLockStatus");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLockStatus, bLock) == 0x000000, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLockStatus::bLock' has a wrong offset!");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetLockStatus, DecidableIfLocked) == 0x000001, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetLockStatus::DecidableIfLocked' has a wrong offset!");

// Function WBP_CourseSelect_Sub_CourseIcon.WBP_CourseSelect_Sub_CourseIcon_C.SetMouseInteractionButtonVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_CourseSelect_Sub_CourseIcon_C_SetMouseInteractionButtonVisible final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_CourseIcon_C_SetMouseInteractionButtonVisible) == 0x000001, "Wrong alignment on WBP_CourseSelect_Sub_CourseIcon_C_SetMouseInteractionButtonVisible");
static_assert(sizeof(WBP_CourseSelect_Sub_CourseIcon_C_SetMouseInteractionButtonVisible) == 0x000001, "Wrong size on WBP_CourseSelect_Sub_CourseIcon_C_SetMouseInteractionButtonVisible");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetMouseInteractionButtonVisible, InVisibility) == 0x000000, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetMouseInteractionButtonVisible::InVisibility' has a wrong offset!");

// Function WBP_CourseSelect_Sub_CourseIcon.WBP_CourseSelect_Sub_CourseIcon_C.SetTimeTrialMedal
// 0x0010 (0x0010 - 0x0000)
struct WBP_CourseSelect_Sub_CourseIcon_C_SetTimeTrialMedal final
{
public:
	TArray<ETimeTrialClearRankId>                 InTimeTrialClearRanks;                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CourseSelect_Sub_CourseIcon_C_SetTimeTrialMedal) == 0x000008, "Wrong alignment on WBP_CourseSelect_Sub_CourseIcon_C_SetTimeTrialMedal");
static_assert(sizeof(WBP_CourseSelect_Sub_CourseIcon_C_SetTimeTrialMedal) == 0x000010, "Wrong size on WBP_CourseSelect_Sub_CourseIcon_C_SetTimeTrialMedal");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetTimeTrialMedal, InTimeTrialClearRanks) == 0x000000, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetTimeTrialMedal::InTimeTrialClearRanks' has a wrong offset!");

// Function WBP_CourseSelect_Sub_CourseIcon.WBP_CourseSelect_Sub_CourseIcon_C.SetWaitAnimationDecide
// 0x0010 (0x0010 - 0x0000)
struct WBP_CourseSelect_Sub_CourseIcon_C_SetWaitAnimationDecide final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CourseSelect_Sub_CourseIcon_C_SetWaitAnimationDecide) == 0x000004, "Wrong alignment on WBP_CourseSelect_Sub_CourseIcon_C_SetWaitAnimationDecide");
static_assert(sizeof(WBP_CourseSelect_Sub_CourseIcon_C_SetWaitAnimationDecide) == 0x000010, "Wrong size on WBP_CourseSelect_Sub_CourseIcon_C_SetWaitAnimationDecide");
static_assert(offsetof(WBP_CourseSelect_Sub_CourseIcon_C_SetWaitAnimationDecide, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_CourseSelect_Sub_CourseIcon_C_SetWaitAnimationDecide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

