#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyRace_Sub_OptionBtn

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyRace_Sub_OptionBtn.WBP_PartyRace_Sub_OptionBtn_C
// 0x0038 (0x04E0 - 0x04A8)
class UWBP_PartyRace_Sub_OptionBtn_C final : public UPartyRaceSubOptionBtn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyRace_Cursor;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_BtmIcon_DELETE;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_BtnColor;                                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_BtnName;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bDecided;                                          // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_PartyRace_Sub_OptionBtn(int32 EntryPoint);
	void OnAcceptKeyPressed();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnBackKeyPressed();
	void OnDownKeyPressed();
	void OnFocusAnimStart();
	void OnFocusImpl();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnLeftKeyPressed();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRightKeyPressed();
	void OnUnFocusAnimStart();
	void OnUpKeyPressed();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyRace_Sub_OptionBtn_C">();
	}
	static class UWBP_PartyRace_Sub_OptionBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyRace_Sub_OptionBtn_C>();
	}
};
static_assert(alignof(UWBP_PartyRace_Sub_OptionBtn_C) == 0x000008, "Wrong alignment on UWBP_PartyRace_Sub_OptionBtn_C");
static_assert(sizeof(UWBP_PartyRace_Sub_OptionBtn_C) == 0x0004E0, "Wrong size on UWBP_PartyRace_Sub_OptionBtn_C");
static_assert(offsetof(UWBP_PartyRace_Sub_OptionBtn_C, UberGraphFrame) == 0x0004A8, "Member 'UWBP_PartyRace_Sub_OptionBtn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_OptionBtn_C, MouseInteraction) == 0x0004B0, "Member 'UWBP_PartyRace_Sub_OptionBtn_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_OptionBtn_C, PartyRace_Cursor) == 0x0004B8, "Member 'UWBP_PartyRace_Sub_OptionBtn_C::PartyRace_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_OptionBtn_C, PAT_BtmIcon_DELETE) == 0x0004C0, "Member 'UWBP_PartyRace_Sub_OptionBtn_C::PAT_BtmIcon_DELETE' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_OptionBtn_C, PAT_BtnColor) == 0x0004C8, "Member 'UWBP_PartyRace_Sub_OptionBtn_C::PAT_BtnColor' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_OptionBtn_C, TXT_BtnName) == 0x0004D0, "Member 'UWBP_PartyRace_Sub_OptionBtn_C::TXT_BtnName' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_OptionBtn_C, bDecided) == 0x0004D8, "Member 'UWBP_PartyRace_Sub_OptionBtn_C::bDecided' has a wrong offset!");

}

