#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_SmallWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Friend_SmallWindow.WBP_Friend_SmallWindow_C
// 0x0060 (0x0438 - 0x03D8)
class UWBP_Friend_SmallWindow_C final : public UUnionUISceneBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Friend_Sub_Line_Btn_C*             DSP_WBP_Friend_Sub_Line_Btn_01;                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Friend_Sub_Line_Btn_C*             DSP_WBP_Friend_Sub_Line_Btn_02;                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Friend_Sub_Line_Btn_C*             DSP_WBP_Friend_Sub_Line_Btn_03;                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Friend_Sub_Line_Btn_C*             DSP_WBP_Friend_Sub_Line_Btn_04;                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Friend_Sub_Line_Btn_C*             DSP_WBP_Friend_Sub_Line_Btn_05;                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SmallWindowBase;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Friend_Sub_Line_Btn_C*>     Buttons;                                           // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         FocusButtonIndex;                                  // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  bInitialButtonSelectable;                          // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Friend_SmallWindow(int32 EntryPoint);
	void InitializeButtons(int32 InButtonNum);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void Set_Button_Navigation();
	void SetButtonSelectable(const TArray<bool>& bInSelectable);
	void SetButtonsPanel();
	void SetButtonText(const TArray<class FText>& InButtonText);
	void SetFocusButtonIndex(int32 InButtonIndex);
	void Setup(const TArray<class FText>& InButtonText, const TArray<bool>& bInButtonSelectable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Friend_SmallWindow_C">();
	}
	static class UWBP_Friend_SmallWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Friend_SmallWindow_C>();
	}
};
static_assert(alignof(UWBP_Friend_SmallWindow_C) == 0x000008, "Wrong alignment on UWBP_Friend_SmallWindow_C");
static_assert(sizeof(UWBP_Friend_SmallWindow_C) == 0x000438, "Wrong size on UWBP_Friend_SmallWindow_C");
static_assert(offsetof(UWBP_Friend_SmallWindow_C, UberGraphFrame) == 0x0003D8, "Member 'UWBP_Friend_SmallWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_SmallWindow_C, DSP_WBP_Friend_Sub_Line_Btn_01) == 0x0003E0, "Member 'UWBP_Friend_SmallWindow_C::DSP_WBP_Friend_Sub_Line_Btn_01' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_SmallWindow_C, DSP_WBP_Friend_Sub_Line_Btn_02) == 0x0003E8, "Member 'UWBP_Friend_SmallWindow_C::DSP_WBP_Friend_Sub_Line_Btn_02' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_SmallWindow_C, DSP_WBP_Friend_Sub_Line_Btn_03) == 0x0003F0, "Member 'UWBP_Friend_SmallWindow_C::DSP_WBP_Friend_Sub_Line_Btn_03' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_SmallWindow_C, DSP_WBP_Friend_Sub_Line_Btn_04) == 0x0003F8, "Member 'UWBP_Friend_SmallWindow_C::DSP_WBP_Friend_Sub_Line_Btn_04' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_SmallWindow_C, DSP_WBP_Friend_Sub_Line_Btn_05) == 0x000400, "Member 'UWBP_Friend_SmallWindow_C::DSP_WBP_Friend_Sub_Line_Btn_05' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_SmallWindow_C, SmallWindowBase) == 0x000408, "Member 'UWBP_Friend_SmallWindow_C::SmallWindowBase' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_SmallWindow_C, Buttons) == 0x000410, "Member 'UWBP_Friend_SmallWindow_C::Buttons' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_SmallWindow_C, FocusButtonIndex) == 0x000420, "Member 'UWBP_Friend_SmallWindow_C::FocusButtonIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_SmallWindow_C, bInitialButtonSelectable) == 0x000428, "Member 'UWBP_Friend_SmallWindow_C::bInitialButtonSelectable' has a wrong offset!");

}

