#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_ItemIconSet_Simple

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Sub_ItemIconSet_Simple.WBP_Race_HUD_Sub_ItemIconSet_Simple_C.ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple
// 0x0198 (0x0198 - 0x0000)
struct WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EItemInfoType                                 K2Node_CustomEvent_ItemInfoType;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_LostItemCount;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_ItemIcon_C*           CallFunc_GetItemIconByItemInfoType_ItemIcon;       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemIcon_Simple_C*    CallFunc_GetItemIconByItemInfoTypeSimple_NewParam; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Temp_object_Variable_3;                            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_ItemIcon_C*           CallFunc_GetItemIconByItemInfoType_ItemIcon_1;     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerIndex_1;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemInfoType                                 K2Node_Event_ItemInfoType_1;                       // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerIndex;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemInfoType                                 K2Node_Event_ItemInfoType;                         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSilent;                            // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemIcon_Simple_C*    CallFunc_GetItemIconByItemInfoTypeSimple_NewParam_1; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemIcon_Simple_C*    CallFunc_GetItemIconByItemInfoTypeSimple_NewParam_2; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemIcon_C*           CallFunc_GetItemIconByItemInfoType_ItemIcon_2;     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_ItemIcon_C*           CallFunc_GetItemIconByItemInfoType_ItemIcon_3;     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_Select_Default;                             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x00D8(0x0004)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue;                  // 0x00E0(0x0004)()
	struct FItemSet                               K2Node_CustomEvent_PrevItemSet;                    // 0x00E4(0x0003)(ConstParm, NoDestructor)
	struct FItemSet                               K2Node_CustomEvent_NewItemSet;                     // 0x00E7(0x0003)(NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ItemId;                         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerIndex;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x010C(0x0004)()
	bool                                          K2Node_Event_bActive;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue_1;                // 0x0114(0x0004)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_InKey;                                // 0x0138(0x0018)(ConstParm, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsKeyboard;                           // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemSet                               CallFunc_GetHoldItemInfo_ReturnValue;              // 0x0151(0x0003)(NoDestructor)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemIcon_C*           CallFunc_GetItemIcon_ItemIcon;                     // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisibility;                          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemIcon_Simple_C*    CallFunc_GetItemIconSimple_NewParam;               // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UOverlay*>                       K2Node_MakeArray_Array_1;                          // 0x0180(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_Race_HUD_Sub_ItemIcon_Simple_C*    CallFunc_GetItemIconSimple_NewParam_1;             // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple) == 0x000198, "Wrong size on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, EntryPoint) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, Temp_object_Variable) == 0x000008, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, Temp_object_Variable_2) == 0x000018, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_CustomEvent_ItemInfoType) == 0x000040, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_CustomEvent_ItemInfoType' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_CustomEvent_LostItemCount) == 0x000044, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_CustomEvent_LostItemCount' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_GetItemIconByItemInfoType_ItemIcon) == 0x000048, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_GetItemIconByItemInfoType_ItemIcon' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_InRange_IntInt_ReturnValue) == 0x000050, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000051, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_GetItemIconByItemInfoTypeSimple_NewParam) == 0x000058, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_GetItemIconByItemInfoTypeSimple_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_SwitchEnum_CmpSuccess) == 0x000060, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, Temp_object_Variable_3) == 0x000068, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_GetItemIconByItemInfoType_ItemIcon_1) == 0x000070, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_GetItemIconByItemInfoType_ItemIcon_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_Event_PlayerIndex_1) == 0x000078, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_Event_PlayerIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_Event_ItemInfoType_1) == 0x00007C, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_Event_ItemInfoType_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_Event_PlayerIndex) == 0x000080, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_Event_PlayerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_Event_ItemInfoType) == 0x000084, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_Event_ItemInfoType' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_Event_bIsSilent) == 0x000085, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_Event_bIsSilent' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_GetItemIconByItemInfoTypeSimple_NewParam_1) == 0x000088, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_GetItemIconByItemInfoTypeSimple_NewParam_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_Not_PreBool_ReturnValue) == 0x000090, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_GetItemIconByItemInfoTypeSimple_NewParam_2) == 0x000098, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_GetItemIconByItemInfoTypeSimple_NewParam_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000A0, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000A1, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_GetItemIconByItemInfoType_ItemIcon_2) == 0x0000A8, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_GetItemIconByItemInfoType_ItemIcon_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_GetItemIconByItemInfoType_ItemIcon_3) == 0x0000B0, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_GetItemIconByItemInfoType_ItemIcon_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, Temp_int_Variable) == 0x0000B8, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000C0, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000C8, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_Select_Default) == 0x0000D0, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_SoundPlay_ReturnValue) == 0x0000D8, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_IsValid_ReturnValue) == 0x0000DC, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_SetPanSplit_ReturnValue) == 0x0000E0, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_SetPanSplit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_CustomEvent_PrevItemSet) == 0x0000E4, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_CustomEvent_PrevItemSet' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_CustomEvent_NewItemSet) == 0x0000E7, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_CustomEvent_NewItemSet' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x0000F0, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x0000F8, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_CustomEvent_ItemId) == 0x000100, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_CustomEvent_ItemId' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_CustomEvent_PlayerIndex) == 0x000104, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_CustomEvent_PlayerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_IsValid_ReturnValue_1) == 0x000108, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_SoundPlay_ReturnValue_1) == 0x00010C, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_Event_bActive) == 0x000110, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_Event_bActive' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_SetPanSplit_ReturnValue_1) == 0x000114, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_SetPanSplit_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_Not_PreBool_ReturnValue_1) == 0x000118, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_PlayAnimation_ReturnValue) == 0x000120, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_PlayAnimation_ReturnValue_1) == 0x000128, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000130, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_Event_InKey) == 0x000138, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_Event_InKey' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_Event_IsKeyboard) == 0x000150, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_Event_IsKeyboard' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_GetHoldItemInfo_ReturnValue) == 0x000151, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_GetHoldItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_GetItemIcon_ItemIcon) == 0x000158, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_GetItemIcon_ItemIcon' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_Event_bVisibility) == 0x000160, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_Event_bVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_GetItemIconSimple_NewParam) == 0x000168, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_GetItemIconSimple_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_MakeArray_Array) == 0x000170, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, K2Node_MakeArray_Array_1) == 0x000180, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple, CallFunc_GetItemIconSimple_NewParam_1) == 0x000190, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_ItemIconSet_Simple::CallFunc_GetItemIconSimple_NewParam_1' has a wrong offset!");

// Function WBP_Race_HUD_Sub_ItemIconSet_Simple.WBP_Race_HUD_Sub_ItemIconSet_Simple_C.GetItemIcon
// 0x0018 (0x0018 - 0x0000)
struct WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIcon final
{
public:
	int32                                         Idx;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemIcon_C*           ItemIcon;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIcon) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIcon");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIcon) == 0x000018, "Wrong size on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIcon");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIcon, Idx) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIcon::Idx' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIcon, ItemIcon) == 0x000008, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIcon::ItemIcon' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIcon, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIcon::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Race_HUD_Sub_ItemIconSet_Simple.WBP_Race_HUD_Sub_ItemIconSet_Simple_C.GetItemIconByItemInfoType
// 0x0018 (0x0018 - 0x0000)
struct WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoType final
{
public:
	EItemInfoType                                 ItemInfoType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemIcon_C*           ItemIcon;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoType) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoType");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoType) == 0x000018, "Wrong size on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoType");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoType, ItemInfoType) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoType::ItemInfoType' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoType, ItemIcon) == 0x000008, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoType::ItemIcon' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoType, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Race_HUD_Sub_ItemIconSet_Simple.WBP_Race_HUD_Sub_ItemIconSet_Simple_C.GetItemIconByItemInfoTypeSimple
// 0x0018 (0x0018 - 0x0000)
struct WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoTypeSimple final
{
public:
	EItemInfoType                                 ItemInfoType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemIcon_Simple_C*    newParam;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoTypeSimple) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoTypeSimple");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoTypeSimple) == 0x000018, "Wrong size on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoTypeSimple");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoTypeSimple, ItemInfoType) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoTypeSimple::ItemInfoType' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoTypeSimple, newParam) == 0x000008, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoTypeSimple::newParam' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoTypeSimple, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconByItemInfoTypeSimple::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Race_HUD_Sub_ItemIconSet_Simple.WBP_Race_HUD_Sub_ItemIconSet_Simple_C.GetItemIconSimple
// 0x0018 (0x0018 - 0x0000)
struct WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconSimple final
{
public:
	int32                                         Idx;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemIcon_Simple_C*    newParam;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconSimple) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconSimple");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconSimple) == 0x000018, "Wrong size on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconSimple");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconSimple, Idx) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconSimple::Idx' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconSimple, newParam) == 0x000008, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconSimple::newParam' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconSimple, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_GetItemIconSimple::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Race_HUD_Sub_ItemIconSet_Simple.WBP_Race_HUD_Sub_ItemIconSet_Simple_C.Initialize
// 0x0028 (0x0028 - 0x0000)
struct WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize final
{
public:
	TArray<class URaceUISubItemSummonButton*>     K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class URaceUISubItemIcon*>             K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize) == 0x000028, "Wrong size on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize, K2Node_MakeArray_Array_1) == 0x000010, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize, CallFunc_Percent_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize, CallFunc_Conv_IntToBool_ReturnValue) == 0x000024, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Initialize::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_ItemIconSet_Simple.WBP_Race_HUD_Sub_ItemIconSet_Simple_C.ItemLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemLost final
{
public:
	EItemInfoType                                 ItemInfoType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LostItemCount;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemLost) == 0x000004, "Wrong alignment on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemLost");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemLost) == 0x000008, "Wrong size on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemLost");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemLost, ItemInfoType) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemLost::ItemInfoType' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemLost, LostItemCount) == 0x000004, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemLost::LostItemCount' has a wrong offset!");

// Function WBP_Race_HUD_Sub_ItemIconSet_Simple.WBP_Race_HUD_Sub_ItemIconSet_Simple_C.ItemStockTrade
// 0x0006 (0x0006 - 0x0000)
struct WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemStockTrade final
{
public:
	struct FItemSet                               PrevItemSet;                                       // 0x0000(0x0003)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FItemSet                               NewItemSet;                                        // 0x0003(0x0003)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemStockTrade) == 0x000001, "Wrong alignment on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemStockTrade");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemStockTrade) == 0x000006, "Wrong size on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemStockTrade");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemStockTrade, PrevItemSet) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemStockTrade::PrevItemSet' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemStockTrade, NewItemSet) == 0x000003, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_ItemStockTrade::NewItemSet' has a wrong offset!");

// Function WBP_Race_HUD_Sub_ItemIconSet_Simple.WBP_Race_HUD_Sub_ItemIconSet_Simple_C.Set Alignment
// 0x0040 (0x0040 - 0x0000)
struct WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment final
{
public:
	bool                                          bRightSide;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_1;                           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_5;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_2;                           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment) == 0x000040, "Wrong size on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, bRightSide) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::bRightSide' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, Temp_byte_Variable) == 0x000001, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, Temp_bool_Variable) == 0x000002, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, K2Node_Select_Default) == 0x000006, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, Temp_bool_Variable_2) == 0x000009, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, K2Node_Select_Default_1) == 0x00000A, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000010, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, Temp_byte_Variable_5) == 0x000019, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, K2Node_Select_Default_2) == 0x00001A, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000020, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, CallFunc_SlotAsOverlaySlot_ReturnValue_2) == 0x000030, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::CallFunc_SlotAsOverlaySlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment, CallFunc_IsValid_ReturnValue_2) == 0x000038, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_Set_Alignment::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_Race_HUD_Sub_ItemIconSet_Simple.WBP_Race_HUD_Sub_ItemIconSet_Simple_C.SetIrregularVisibility
// 0x0020 (0x0020 - 0x0000)
struct WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility final
{
public:
	EItemInfoType                                 ItemInfoType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visibility_0;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemIcon_Simple_C*    CallFunc_GetItemIconByItemInfoTypeSimple_NewParam; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_ItemIcon_C*           CallFunc_GetItemIconByItemInfoType_ItemIcon;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility");
static_assert(sizeof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility) == 0x000020, "Wrong size on WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility, ItemInfoType) == 0x000000, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility::ItemInfoType' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility, Visibility_0) == 0x000001, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility::Visibility_0' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility, Temp_bool_Variable) == 0x000002, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility, CallFunc_GetItemIconByItemInfoTypeSimple_NewParam) == 0x000008, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility::CallFunc_GetItemIconByItemInfoTypeSimple_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility, Temp_byte_Variable) == 0x000011, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility, K2Node_Select_Default) == 0x000013, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility, CallFunc_GetItemIconByItemInfoType_ItemIcon) == 0x000018, "Member 'WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetIrregularVisibility::CallFunc_GetItemIconByItemInfoType_ItemIcon' has a wrong offset!");

// Function WBP_Race_HUD_Sub_ItemIconSet_Simple.WBP_Race_HUD_Sub_ItemIconSet_Simple_C.SetItemId
// 0x0040 (0x0040 - 0x0000)
struct WBP_Race_HUD_Sub_ItemIconSet_Simple_C_SetItemId final
{
public:
	EItemInfoType                                 ItemInfoType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
