#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_Sub_RankNum

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CMN_Sub_RankNum.WBP_CMN_Sub_RankNum_C.ExecuteUbergraph_WBP_CMN_Sub_RankNum
// 0x0090 (0x0090 - 0x0000)
struct WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Num;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_2;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_3;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum) == 0x000008, "Wrong alignment on WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum");
static_assert(sizeof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum) == 0x000090, "Wrong size on WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, EntryPoint) == 0x000000, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, K2Node_CustomEvent_Num) == 0x000004, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::K2Node_CustomEvent_Num' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000010, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000018, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000020, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Less_IntInt_ReturnValue) == 0x000029, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Percent_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Divide_IntInt_ReturnValue) == 0x000030, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000040, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000048, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Divide_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Percent_IntInt_ReturnValue_2) == 0x000054, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Divide_IntInt_ReturnValue_2) == 0x000058, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Divide_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000060, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Percent_IntInt_ReturnValue_3) == 0x000068, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Percent_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000070, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Less_IntInt_ReturnValue_1) == 0x000078, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_Less_IntInt_ReturnValue_2) == 0x000079, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00007C, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000080, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000084, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000088, "Member 'WBP_CMN_Sub_RankNum_C_ExecuteUbergraph_WBP_CMN_Sub_RankNum::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");

// Function WBP_CMN_Sub_RankNum.WBP_CMN_Sub_RankNum_C.SetNum
// 0x0004 (0x0004 - 0x0000)
struct WBP_CMN_Sub_RankNum_C_SetNum final
{
public:
	int32                                         Num_0;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_Sub_RankNum_C_SetNum) == 0x000004, "Wrong alignment on WBP_CMN_Sub_RankNum_C_SetNum");
static_assert(sizeof(WBP_CMN_Sub_RankNum_C_SetNum) == 0x000004, "Wrong size on WBP_CMN_Sub_RankNum_C_SetNum");
static_assert(offsetof(WBP_CMN_Sub_RankNum_C_SetNum, Num_0) == 0x000000, "Member 'WBP_CMN_Sub_RankNum_C_SetNum::Num_0' has a wrong offset!");

}

