#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Online_PlayerName_Btn

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C
// 0x0188 (0x0678 - 0x04F0)
class UWBP_Online_PlayerName_Btn_C final : public UOnlinePlayerNameButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_SelectOther_Loop;                              // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_ActiveOther_Loop;                              // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_SelectOwner_Loop;                              // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_ActiveOwner_Loop;                              // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_Nice;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Waiting_Other;                                // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Waiting_Owner;                                // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_OtherBase_Select;                              // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_OwnerBase;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_AddFriend;                                  // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_PlayerName_Other;                           // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_PlayerName_Owner;                           // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_RivalIcon_Other;                               // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        DSP_WS_Status_Icon_Other;                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        DSP_WS_Status_Icon_Owner;                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Nice;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction_OtherCar;                         // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction_OwnCar;                           // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Nice;                                              // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OK_Other;                                          // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OK_Owner;                                          // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OtherName_Cursor;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OwnerName_Cursor;                                  // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Icon_Block;                                    // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_PlatformIcon_Other;                            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_PlatformIcon_Owner;                            // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PulsMark;                                          // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PulsMark_Line_01;                                  // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PulsMark_Line_02;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PulsMark_Ring;                                     // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Nice_Num;                                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_OtherName;                                     // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_OwnerName;                                     // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_YOU_Only;                                      // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_YOU_Owner;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Waiting_dot_Other;                                 // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Waiting_dot_Owner;                                 // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_OtherBase_Active;                               // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 ButtonIndex)> OnFaceButtonLeftPressedEvent;                  // 0x0638(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(int32 ButtonIndex)> OnFaceButtonTopPressedEvent;                   // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(int32 ButtonIndex)> OnRightStickButtonPressedEvent;                // 0x0658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnLeftStickButtonPressedEvent;                     // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Online_PlayerName_Btn_MouseInteraction_OtherCar_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Online_PlayerName_Btn_MouseInteraction_OtherCar_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Online_PlayerName_Btn_MouseInteraction_OwnCar_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Online_PlayerName_Btn_MouseInteraction_OwnCar_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void ChangeActiveWidget(int32 InActiveWidgetIndex);
	void Construct();
	void ExecuteUbergraph_WBP_Online_PlayerName_Btn(int32 EntryPoint);
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnFaceButtonLeftPressed();
	void OnFaceButtonTopPressed();
	void OnFocusAnimStart();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnFocusLostImpl(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceivedImpl(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInitialize();
	void OnLeftStickButtonPressed();
	void OnRightShoulderPressed();
	void OnRightStickButtonPressed();
	void OnSpecialPressed();
	void OnUnFocusAnimStart();
	void PlayAnimationActive();
	void PlayAnimationSelect();
	void SetBlockState(EBlockPlayerState InBlockType);
	void SetContext(const struct FPlayerNameContext& InContext);
	void SetIsRival(bool bIsRival);
	void SetNiceCount(const int32 InNiceCount);
	void SetPlatformIcon(const int32& InPlatformId);
	void SetText(const class FText& InText);
	void SetVisibilityOwnerIcon(ESlateVisibility InVisibility);
	void SetVisibilityPlatformIcon(ESlateVisibility InVisibility);
	void UnbindAll();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Online_PlayerName_Btn_C">();
	}
	static class UWBP_Online_PlayerName_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Online_PlayerName_Btn_C>();
	}
};
static_assert(alignof(UWBP_Online_PlayerName_Btn_C) == 0x000008, "Wrong alignment on UWBP_Online_PlayerName_Btn_C");
static_assert(sizeof(UWBP_Online_PlayerName_Btn_C) == 0x000678, "Wrong size on UWBP_Online_PlayerName_Btn_C");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, UberGraphFrame) == 0x0004F0, "Member 'UWBP_Online_PlayerName_Btn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Btn_SelectOther_Loop) == 0x0004F8, "Member 'UWBP_Online_PlayerName_Btn_C::Btn_SelectOther_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Btn_ActiveOther_Loop) == 0x000500, "Member 'UWBP_Online_PlayerName_Btn_C::Btn_ActiveOther_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Btn_SelectOwner_Loop) == 0x000508, "Member 'UWBP_Online_PlayerName_Btn_C::Btn_SelectOwner_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Btn_ActiveOwner_Loop) == 0x000510, "Member 'UWBP_Online_PlayerName_Btn_C::Btn_ActiveOwner_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Base_Nice) == 0x000518, "Member 'UWBP_Online_PlayerName_Btn_C::Base_Nice' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Base_Waiting_Other) == 0x000520, "Member 'UWBP_Online_PlayerName_Btn_C::Base_Waiting_Other' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Base_Waiting_Owner) == 0x000528, "Member 'UWBP_Online_PlayerName_Btn_C::Base_Waiting_Owner' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Btn_OtherBase_Select) == 0x000530, "Member 'UWBP_Online_PlayerName_Btn_C::Btn_OtherBase_Select' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Btn_OwnerBase) == 0x000538, "Member 'UWBP_Online_PlayerName_Btn_C::Btn_OwnerBase' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Cursor_AddFriend) == 0x000540, "Member 'UWBP_Online_PlayerName_Btn_C::Cursor_AddFriend' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Cursor_PlayerName_Other) == 0x000548, "Member 'UWBP_Online_PlayerName_Btn_C::Cursor_PlayerName_Other' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Cursor_PlayerName_Owner) == 0x000550, "Member 'UWBP_Online_PlayerName_Btn_C::Cursor_PlayerName_Owner' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, DSP_RivalIcon_Other) == 0x000558, "Member 'UWBP_Online_PlayerName_Btn_C::DSP_RivalIcon_Other' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, DSP_WS_Status_Icon_Other) == 0x000560, "Member 'UWBP_Online_PlayerName_Btn_C::DSP_WS_Status_Icon_Other' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, DSP_WS_Status_Icon_Owner) == 0x000568, "Member 'UWBP_Online_PlayerName_Btn_C::DSP_WS_Status_Icon_Owner' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Icon_Nice) == 0x000570, "Member 'UWBP_Online_PlayerName_Btn_C::Icon_Nice' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, MouseInteraction) == 0x000578, "Member 'UWBP_Online_PlayerName_Btn_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, MouseInteraction_OtherCar) == 0x000580, "Member 'UWBP_Online_PlayerName_Btn_C::MouseInteraction_OtherCar' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, MouseInteraction_OwnCar) == 0x000588, "Member 'UWBP_Online_PlayerName_Btn_C::MouseInteraction_OwnCar' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Nice) == 0x000590, "Member 'UWBP_Online_PlayerName_Btn_C::Nice' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, OK_Other) == 0x000598, "Member 'UWBP_Online_PlayerName_Btn_C::OK_Other' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, OK_Owner) == 0x0005A0, "Member 'UWBP_Online_PlayerName_Btn_C::OK_Owner' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, OtherName_Cursor) == 0x0005A8, "Member 'UWBP_Online_PlayerName_Btn_C::OtherName_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, OwnerName_Cursor) == 0x0005B0, "Member 'UWBP_Online_PlayerName_Btn_C::OwnerName_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, PAT_Icon_Block) == 0x0005B8, "Member 'UWBP_Online_PlayerName_Btn_C::PAT_Icon_Block' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, PAT_PlatformIcon_Other) == 0x0005C0, "Member 'UWBP_Online_PlayerName_Btn_C::PAT_PlatformIcon_Other' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, PAT_PlatformIcon_Owner) == 0x0005C8, "Member 'UWBP_Online_PlayerName_Btn_C::PAT_PlatformIcon_Owner' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, PulsMark) == 0x0005D0, "Member 'UWBP_Online_PlayerName_Btn_C::PulsMark' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, PulsMark_Line_01) == 0x0005D8, "Member 'UWBP_Online_PlayerName_Btn_C::PulsMark_Line_01' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, PulsMark_Line_02) == 0x0005E0, "Member 'UWBP_Online_PlayerName_Btn_C::PulsMark_Line_02' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, PulsMark_Ring) == 0x0005E8, "Member 'UWBP_Online_PlayerName_Btn_C::PulsMark_Ring' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, TXT_Nice_Num) == 0x0005F0, "Member 'UWBP_Online_PlayerName_Btn_C::TXT_Nice_Num' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, TXT_OtherName) == 0x0005F8, "Member 'UWBP_Online_PlayerName_Btn_C::TXT_OtherName' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, TXT_OwnerName) == 0x000600, "Member 'UWBP_Online_PlayerName_Btn_C::TXT_OwnerName' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, TXT_YOU_Only) == 0x000608, "Member 'UWBP_Online_PlayerName_Btn_C::TXT_YOU_Only' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, TXT_YOU_Owner) == 0x000610, "Member 'UWBP_Online_PlayerName_Btn_C::TXT_YOU_Owner' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Waiting_dot_Other) == 0x000618, "Member 'UWBP_Online_PlayerName_Btn_C::Waiting_dot_Other' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, Waiting_dot_Owner) == 0x000620, "Member 'UWBP_Online_PlayerName_Btn_C::Waiting_dot_Owner' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, WidgetSwitcher) == 0x000628, "Member 'UWBP_Online_PlayerName_Btn_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, WS_OtherBase_Active) == 0x000630, "Member 'UWBP_Online_PlayerName_Btn_C::WS_OtherBase_Active' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, OnFaceButtonLeftPressedEvent) == 0x000638, "Member 'UWBP_Online_PlayerName_Btn_C::OnFaceButtonLeftPressedEvent' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, OnFaceButtonTopPressedEvent) == 0x000648, "Member 'UWBP_Online_PlayerName_Btn_C::OnFaceButtonTopPressedEvent' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, OnRightStickButtonPressedEvent) == 0x000658, "Member 'UWBP_Online_PlayerName_Btn_C::OnRightStickButtonPressedEvent' has a wrong offset!");
static_assert(offsetof(UWBP_Online_PlayerName_Btn_C, OnLeftStickButtonPressedEvent) == 0x000668, "Member 'UWBP_Online_PlayerName_Btn_C::OnLeftStickButtonPressedEvent' has a wrong offset!");

}

