#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeaderMenu_Sub_WinInfo

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_HeaderMenu_Sub_WinInfo.WBP_HeaderMenu_Sub_WinInfo_C.ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo
// 0x0018 (0x0018 - 0x0000)
struct WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMilestoneVersion                             CallFunc_GetMileStoneVersion_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo) == 0x000008, "Wrong alignment on WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo");
static_assert(sizeof(WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo) == 0x000018, "Wrong size on WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo");
static_assert(offsetof(WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo, EntryPoint) == 0x000000, "Member 'WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo, CallFunc_GetMileStoneVersion_ReturnValue) == 0x000010, "Member 'WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo::CallFunc_GetMileStoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'WBP_HeaderMenu_Sub_WinInfo_C_ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_HeaderMenu_Sub_WinInfo.WBP_HeaderMenu_Sub_WinInfo_C.SetWinCounts
// 0x0004 (0x0004 - 0x0000)
struct WBP_HeaderMenu_Sub_WinInfo_C_SetWinCounts final
{
public:
	int32                                         InWinCounts;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HeaderMenu_Sub_WinInfo_C_SetWinCounts) == 0x000004, "Wrong alignment on WBP_HeaderMenu_Sub_WinInfo_C_SetWinCounts");
static_assert(sizeof(WBP_HeaderMenu_Sub_WinInfo_C_SetWinCounts) == 0x000004, "Wrong size on WBP_HeaderMenu_Sub_WinInfo_C_SetWinCounts");
static_assert(offsetof(WBP_HeaderMenu_Sub_WinInfo_C_SetWinCounts, InWinCounts) == 0x000000, "Member 'WBP_HeaderMenu_Sub_WinInfo_C_SetWinCounts::InWinCounts' has a wrong offset!");

}

