#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_System_Loading_Simple

#include "Basic.hpp"

#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_System_Loading_Simple.WBP_System_Loading_Simple_C.ExecuteUbergraph_WBP_System_Loading_Simple
// 0x0038 (0x0038 - 0x0000)
struct WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LoadingProgress;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_LoadingPhaseNum;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSetProgress;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_EndLoadingPhase;                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple) == 0x000008, "Wrong alignment on WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple");
static_assert(sizeof(WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple) == 0x000038, "Wrong size on WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple");
static_assert(offsetof(WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple, EntryPoint) == 0x000000, "Member 'WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple, K2Node_Event_LoadingProgress) == 0x000004, "Member 'WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple::K2Node_Event_LoadingProgress' has a wrong offset!");
static_assert(offsetof(WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000018, "Member 'WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple, K2Node_Event_LoadingPhaseNum) == 0x00001C, "Member 'WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple::K2Node_Event_LoadingPhaseNum' has a wrong offset!");
static_assert(offsetof(WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple, K2Node_Event_bSetProgress) == 0x000020, "Member 'WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple::K2Node_Event_bSetProgress' has a wrong offset!");
static_assert(offsetof(WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple, K2Node_Event_EndLoadingPhase) == 0x000034, "Member 'WBP_System_Loading_Simple_C_ExecuteUbergraph_WBP_System_Loading_Simple::K2Node_Event_EndLoadingPhase' has a wrong offset!");

// Function WBP_System_Loading_Simple.WBP_System_Loading_Simple_C.GetLoadingDisplayType
// 0x0001 (0x0001 - 0x0000)
struct WBP_System_Loading_Simple_C_GetLoadingDisplayType final
{
public:
	ELoadingDisplayType                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_System_Loading_Simple_C_GetLoadingDisplayType) == 0x000001, "Wrong alignment on WBP_System_Loading_Simple_C_GetLoadingDisplayType");
static_assert(sizeof(WBP_System_Loading_Simple_C_GetLoadingDisplayType) == 0x000001, "Wrong size on WBP_System_Loading_Simple_C_GetLoadingDisplayType");
static_assert(offsetof(WBP_System_Loading_Simple_C_GetLoadingDisplayType, ReturnValue) == 0x000000, "Member 'WBP_System_Loading_Simple_C_GetLoadingDisplayType::ReturnValue' has a wrong offset!");

// Function WBP_System_Loading_Simple.WBP_System_Loading_Simple_C.SetLoadingGaugeParam
// 0x0008 (0x0008 - 0x0000)
struct WBP_System_Loading_Simple_C_SetLoadingGaugeParam final
{
public:
	int32                                         LoadingPhaseNum;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSetProgress;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_System_Loading_Simple_C_SetLoadingGaugeParam) == 0x000004, "Wrong alignment on WBP_System_Loading_Simple_C_SetLoadingGaugeParam");
static_assert(sizeof(WBP_System_Loading_Simple_C_SetLoadingGaugeParam) == 0x000008, "Wrong size on WBP_System_Loading_Simple_C_SetLoadingGaugeParam");
static_assert(offsetof(WBP_System_Loading_Simple_C_SetLoadingGaugeParam, LoadingPhaseNum) == 0x000000, "Member 'WBP_System_Loading_Simple_C_SetLoadingGaugeParam::LoadingPhaseNum' has a wrong offset!");
static_assert(offsetof(WBP_System_Loading_Simple_C_SetLoadingGaugeParam, bSetProgress) == 0x000004, "Member 'WBP_System_Loading_Simple_C_SetLoadingGaugeParam::bSetProgress' has a wrong offset!");

// Function WBP_System_Loading_Simple.WBP_System_Loading_Simple_C.SetLoadingProgress
// 0x0004 (0x0004 - 0x0000)
struct WBP_System_Loading_Simple_C_SetLoadingProgress final
{
public:
	float                                         LoadingProgress;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_System_Loading_Simple_C_SetLoadingProgress) == 0x000004, "Wrong alignment on WBP_System_Loading_Simple_C_SetLoadingProgress");
static_assert(sizeof(WBP_System_Loading_Simple_C_SetLoadingProgress) == 0x000004, "Wrong size on WBP_System_Loading_Simple_C_SetLoadingProgress");
static_assert(offsetof(WBP_System_Loading_Simple_C_SetLoadingProgress, LoadingProgress) == 0x000000, "Member 'WBP_System_Loading_Simple_C_SetLoadingProgress::LoadingProgress' has a wrong offset!");

// Function WBP_System_Loading_Simple.WBP_System_Loading_Simple_C.UpdateLoadingPhase
// 0x0004 (0x0004 - 0x0000)
struct WBP_System_Loading_Simple_C_UpdateLoadingPhase final
{
public:
	int32                                         EndLoadingPhase;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_System_Loading_Simple_C_UpdateLoadingPhase) == 0x000004, "Wrong alignment on WBP_System_Loading_Simple_C_UpdateLoadingPhase");
static_assert(sizeof(WBP_System_Loading_Simple_C_UpdateLoadingPhase) == 0x000004, "Wrong size on WBP_System_Loading_Simple_C_UpdateLoadingPhase");
static_assert(offsetof(WBP_System_Loading_Simple_C_UpdateLoadingPhase, EndLoadingPhase) == 0x000000, "Member 'WBP_System_Loading_Simple_C_UpdateLoadingPhase::EndLoadingPhase' has a wrong offset!");

}

