#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu_Sub_ModeMenu

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TopMenu_Sub_ModeMenu.WBP_TopMenu_Sub_ModeMenu_C
// 0x0020 (0x0318 - 0x02F8)
class UWBP_TopMenu_Sub_ModeMenu_C final : public UTopMenuGameModeMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_TopMenu_Sub_BtnMode_Offline_C*     WBP_TopMenu_Sub_BtnMode_Offline_01;                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopMenu_Sub_BtnMode_Offline_C*     WBP_TopMenu_Sub_BtnMode_Offline_02;                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopMenu_Sub_BtnMode_Offline_C*     WBP_TopMenu_Sub_BtnMode_Offline_03;                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TopMenu_Sub_ModeMenu(int32 EntryPoint);
	void InitializeGameModeMenu(const TArray<ETopMenuGameMode>& BeltButtonTypeArr, class UCommonMenuSubMenu* SubMenu);
	void SetupGameModeMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TopMenu_Sub_ModeMenu_C">();
	}
	static class UWBP_TopMenu_Sub_ModeMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TopMenu_Sub_ModeMenu_C>();
	}
};
static_assert(alignof(UWBP_TopMenu_Sub_ModeMenu_C) == 0x000008, "Wrong alignment on UWBP_TopMenu_Sub_ModeMenu_C");
static_assert(sizeof(UWBP_TopMenu_Sub_ModeMenu_C) == 0x000318, "Wrong size on UWBP_TopMenu_Sub_ModeMenu_C");
static_assert(offsetof(UWBP_TopMenu_Sub_ModeMenu_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_TopMenu_Sub_ModeMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_ModeMenu_C, WBP_TopMenu_Sub_BtnMode_Offline_01) == 0x000300, "Member 'UWBP_TopMenu_Sub_ModeMenu_C::WBP_TopMenu_Sub_BtnMode_Offline_01' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_ModeMenu_C, WBP_TopMenu_Sub_BtnMode_Offline_02) == 0x000308, "Member 'UWBP_TopMenu_Sub_ModeMenu_C::WBP_TopMenu_Sub_BtnMode_Offline_02' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_ModeMenu_C, WBP_TopMenu_Sub_BtnMode_Offline_03) == 0x000310, "Member 'UWBP_TopMenu_Sub_ModeMenu_C::WBP_TopMenu_Sub_BtnMode_Offline_03' has a wrong offset!");

}

