#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_TextBalloon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UMG_classes.hpp"
#include "UnionRun_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_TextBalloon.WBP_Race_HUD_Sub_TextBalloon_C
// 0x0098 (0x0378 - 0x02E0)
class UWBP_Race_HUD_Sub_TextBalloon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Corner_Rival_Base;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corner_Round;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corner_Spiky_Base;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_CharaIcon;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Crown;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MLC_PlayerNameBase;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_PlatformIcon;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RivalIcon;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RivalIcon_HighLevel;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_PlayerName;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Reaction;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_C*                WBP_CMN_PlayerNumber;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_BalloonBase;                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Player;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Rival;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        SubCharaIdx;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               Corner_Spiky;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PlayerNameBase_Index;                              // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EDriverId                                     SetFaceId;                                         // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_TextBalloon(int32 EntryPoint);
	void Open_Impl(ERacerReactionWindow WindowId, const class FText& Text, int32 DriverId);
	void OpenEx(const struct FRacerReactionVoice& SerifUIData);
	void PreConstruct(bool IsDesignTime);
	void UpdateCrown(EDriverId DriverId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_TextBalloon_C">();
	}
	static class UWBP_Race_HUD_Sub_TextBalloon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_TextBalloon_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_TextBalloon_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_TextBalloon_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_TextBalloon_C) == 0x000378, "Wrong size on UWBP_Race_HUD_Sub_TextBalloon_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, Corner_Rival_Base) == 0x0002E8, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::Corner_Rival_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, Corner_Round) == 0x0002F0, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::Corner_Round' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, Corner_Spiky_Base) == 0x0002F8, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::Corner_Spiky_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, DMY_CharaIcon) == 0x000300, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::DMY_CharaIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, DSP_Crown) == 0x000308, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::DSP_Crown' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, MLC_PlayerNameBase) == 0x000310, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::MLC_PlayerNameBase' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, PAT_PlatformIcon) == 0x000318, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::PAT_PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, RivalIcon) == 0x000320, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::RivalIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, RivalIcon_HighLevel) == 0x000328, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::RivalIcon_HighLevel' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, TXT_PlayerName) == 0x000330, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::TXT_PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, TXT_Reaction) == 0x000338, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::TXT_Reaction' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, WBP_CMN_PlayerNumber) == 0x000340, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::WBP_CMN_PlayerNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, WidgetSwitcher_BalloonBase) == 0x000348, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::WidgetSwitcher_BalloonBase' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, WidgetSwitcher_Player) == 0x000350, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::WidgetSwitcher_Player' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, WidgetSwitcher_Rival) == 0x000358, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::WidgetSwitcher_Rival' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, SubCharaIdx) == 0x000360, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::SubCharaIdx' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, Corner_Spiky) == 0x000368, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::Corner_Spiky' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, PlayerNameBase_Index) == 0x000370, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::PlayerNameBase_Index' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_TextBalloon_C, SetFaceId) == 0x000374, "Member 'UWBP_Race_HUD_Sub_TextBalloon_C::SetFaceId' has a wrong offset!");

}

