#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack.WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C.ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack
// 0x0058 (0x0058 - 0x0000)
struct WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	int32                                         CallFunc_GetTotalTimeTrialMedalMax_ReturnValue;    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalTimeTrialMedalCount_ReturnValue;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0010)()
};
static_assert(alignof(WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack) == 0x000008, "Wrong alignment on WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack");
static_assert(sizeof(WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack) == 0x000058, "Wrong size on WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack, EntryPoint) == 0x000000, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack, CallFunc_GetTotalTimeTrialMedalMax_ReturnValue) == 0x000018, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack::CallFunc_GetTotalTimeTrialMedalMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack, CallFunc_GetTotalTimeTrialMedalCount_ReturnValue) == 0x000030, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack::CallFunc_GetTotalTimeTrialMedalCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack_C_ExecuteUbergraph_WBP_TopMenu_Btnmode_Sub_Offine_TimeAttack::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

