#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FullScreenClickButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FullScreenClickButton.WBP_FullScreenClickButton_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_FullScreenClickButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsDragging;                                        // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DragMouseLocation;                                 // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDragValue;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinDragValue;                                      // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WhenPressedWidget;                                 // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_FullScreenClickButton_MouseInteraction_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_FullScreenClickButton(int32 EntryPoint);
	void ReleaseMouseDrag();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FullScreenClickButton_C">();
	}
	static class UWBP_FullScreenClickButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FullScreenClickButton_C>();
	}
};
static_assert(alignof(UWBP_FullScreenClickButton_C) == 0x000008, "Wrong alignment on UWBP_FullScreenClickButton_C");
static_assert(sizeof(UWBP_FullScreenClickButton_C) == 0x000320, "Wrong size on UWBP_FullScreenClickButton_C");
static_assert(offsetof(UWBP_FullScreenClickButton_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_FullScreenClickButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenClickButton_C, MouseInteraction) == 0x0002E8, "Member 'UWBP_FullScreenClickButton_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenClickButton_C, IsDragging) == 0x0002F0, "Member 'UWBP_FullScreenClickButton_C::IsDragging' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenClickButton_C, DragMouseLocation) == 0x0002F8, "Member 'UWBP_FullScreenClickButton_C::DragMouseLocation' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenClickButton_C, MaxDragValue) == 0x000308, "Member 'UWBP_FullScreenClickButton_C::MaxDragValue' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenClickButton_C, MinDragValue) == 0x000310, "Member 'UWBP_FullScreenClickButton_C::MinDragValue' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenClickButton_C, WhenPressedWidget) == 0x000318, "Member 'UWBP_FullScreenClickButton_C::WhenPressedWidget' has a wrong offset!");

}

