#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GrandPrixTips_Monitor_GadgetPlate

#include "Basic.hpp"

#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function WBP_GrandPrixTips_Monitor_GadgetPlate.WBP_GrandPrixTips_Monitor_GadgetPlate_C.ExecuteUbergraph_WBP_GrandPrixTips_Monitor_GadgetPlate
// 0x0004 (0x0004 - 0x0000)
struct WBP_GrandPrixTips_Monitor_GadgetPlate_C_ExecuteUbergraph_WBP_GrandPrixTips_Monitor_GadgetPlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GrandPrixTips_Monitor_GadgetPlate_C_ExecuteUbergraph_WBP_GrandPrixTips_Monitor_GadgetPlate) == 0x000004, "Wrong alignment on WBP_GrandPrixTips_Monitor_GadgetPlate_C_ExecuteUbergraph_WBP_GrandPrixTips_Monitor_GadgetPlate");
static_assert(sizeof(WBP_GrandPrixTips_Monitor_GadgetPlate_C_ExecuteUbergraph_WBP_GrandPrixTips_Monitor_GadgetPlate) == 0x000004, "Wrong size on WBP_GrandPrixTips_Monitor_GadgetPlate_C_ExecuteUbergraph_WBP_GrandPrixTips_Monitor_GadgetPlate");
static_assert(offsetof(WBP_GrandPrixTips_Monitor_GadgetPlate_C_ExecuteUbergraph_WBP_GrandPrixTips_Monitor_GadgetPlate, EntryPoint) == 0x000000, "Member 'WBP_GrandPrixTips_Monitor_GadgetPlate_C_ExecuteUbergraph_WBP_GrandPrixTips_Monitor_GadgetPlate::EntryPoint' has a wrong offset!");

// Function WBP_GrandPrixTips_Monitor_GadgetPlate.WBP_GrandPrixTips_Monitor_GadgetPlate_C.Setup Gadget
// 0x0028 (0x0028 - 0x0000)
struct WBP_GrandPrixTips_Monitor_GadgetPlate_C_Setup_Gadget final
{
public:
	struct FGadgetPlateUIData                     K2Node_MakeStruct_GadgetPlateUIData;               // 0x0000(0x0028)()
};
static_assert(alignof(WBP_GrandPrixTips_Monitor_GadgetPlate_C_Setup_Gadget) == 0x000008, "Wrong alignment on WBP_GrandPrixTips_Monitor_GadgetPlate_C_Setup_Gadget");
static_assert(sizeof(WBP_GrandPrixTips_Monitor_GadgetPlate_C_Setup_Gadget) == 0x000028, "Wrong size on WBP_GrandPrixTips_Monitor_GadgetPlate_C_Setup_Gadget");
static_assert(offsetof(WBP_GrandPrixTips_Monitor_GadgetPlate_C_Setup_Gadget, K2Node_MakeStruct_GadgetPlateUIData) == 0x000000, "Member 'WBP_GrandPrixTips_Monitor_GadgetPlate_C_Setup_Gadget::K2Node_MakeStruct_GadgetPlateUIData' has a wrong offset!");

}

