#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_PlayerDetail

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C
// 0x0128 (0x0510 - 0x03E8)
class UWBP_CMN_PlayerDetail_C final : public UPlayerDetail
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Base_Next;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Nice;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Normal;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Rival;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseWindow;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_Block;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_Nice;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_RivalIcon;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Nice;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ItemBox;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_59;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Icon_Block;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_PlatformIcon;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_ScrollSnapPoint_01;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_ScrollSnapPoint_02;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_ScrollSnapPoint_03;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Block;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Name;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Next_Page;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Nice_Num;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn;                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerDetail_Sub_Info_Gadget_C* WBP_CMN_PlayerDetail_Sub_Info_Gadget;             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerDetail_Sub_Info_Machine_C* WBP_CMN_PlayerDetail_Sub_Info_Machine;           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerDetail_Sub_Info_Number_C* WBP_CMN_PlayerDetail_Sub_Info_Number;             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HonorTitle_Plate_C*                WBP_HonorTitle_Plate;                              // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ResultRate_Sub_RankIcon_C*         WBP_ResultRate_Sub_RankIcon;                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Info;                               // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_BaseName;                                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PagePoint_One;                                     // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PagePointTwo;                                      // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PlatformIcon;                                      // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BlockIcon;                                         // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerDetailPage;                                  // 0x0508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OpenFromFriendList;                                // 0x050C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeTab();
	void CheckMachineType(EMachineId MachineId, ECarStatusType* Car_Status_Type);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_CMN_PlayerDetail(int32 EntryPoint);
	void GetSoftObjectCharaIconTextures(TArray<struct FUsageCountChara>& InUsedCharas, TArray<TSoftObjectPtr<class UTexture2D>>* OutSoftObjectTextures);
	void Left_Click_Event();
	void OnAcceptKeyPressed();
	void OnAcceptKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnAcceptKeyReleased();
	void OnAcceptKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnBackKeyPressed();
	void OnBackKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnBackKeyReleased();
	void OnBackKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnDownKeyPressed();
	void OnDownKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnDownKeyReleased();
	void OnDownKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnFaceButtonLeftPressed();
	void OnFaceButtonLeftPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnFaceButtonLeftReleased();
	void OnFaceButtonLeftReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnFaceButtonTopPressed();
	void OnFaceButtonTopPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnFaceButtonTopReleased();
	void OnFaceButtonTopReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftKeyPressed();
	void OnLeftKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftKeyReleased();
	void OnLeftKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftShoulderPressed();
	void OnLeftShoulderPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftShoulderReleased();
	void OnLeftShoulderReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftStickAxis(const struct FVector2D& Value);
	void OnLeftStickAxisWithPlayerId(const struct FVector2D& Value, const int32& PlayerControllerIndex);
	void OnLeftStickButtonPressed();
	void OnLeftStickButtonPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftStickButtonReleased();
	void OnLeftStickButtonReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightKeyPressed();
	void OnRightKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightKeyReleased();
	void OnRightKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightShoulderPressed();
	void OnRightShoulderPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightShoulderReleased();
	void OnRightShoulderReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightStickAxis(const struct FVector2D& Value);
	void OnRightStickAxisWithPlayerId(const struct FVector2D& Value, const int32& PlayerControllerIndex);
	void OnRightStickButtonPressed();
	void OnRightStickButtonPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightStickButtonReleased();
	void OnRightStickButtonReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnSpecialPressed();
	void OnSpecialPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnSpecialReleased();
	void OnSpecialReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnUpKeyPressed();
	void OnUpKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnUpKeyReleased();
	void OnUpKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void SetDisableGadgetList(const TArray<EGadgetId>& InDisableGadgetList);
	void SetNiceCounts(int32 Counts);
	void SetPageIcon(int32 InPageIndex);
	void Setup(const struct FLobbyPlayerData& InRacerData, bool bIsOwn, EBlockPlayerState BlockType, bool bIsCom, bool bIsOpenFriendList);
	void SetUpData(const struct FLobbyPlayerData& InRacerData, bool bIsOwn, EBlockPlayerState InBlockType);
	void SilentFocusReady(bool bOnce);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_PlayerDetail_C">();
	}
	static class UWBP_CMN_PlayerDetail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_PlayerDetail_C>();
	}
};
static_assert(alignof(UWBP_CMN_PlayerDetail_C) == 0x000008, "Wrong alignment on UWBP_CMN_PlayerDetail_C");
static_assert(sizeof(UWBP_CMN_PlayerDetail_C) == 0x000510, "Wrong size on UWBP_CMN_PlayerDetail_C");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, UberGraphFrame) == 0x0003E8, "Member 'UWBP_CMN_PlayerDetail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, Base_Next) == 0x0003F0, "Member 'UWBP_CMN_PlayerDetail_C::Base_Next' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, Base_Nice) == 0x0003F8, "Member 'UWBP_CMN_PlayerDetail_C::Base_Nice' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, Base_Normal) == 0x000400, "Member 'UWBP_CMN_PlayerDetail_C::Base_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, Base_Rival) == 0x000408, "Member 'UWBP_CMN_PlayerDetail_C::Base_Rival' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, BaseWindow) == 0x000410, "Member 'UWBP_CMN_PlayerDetail_C::BaseWindow' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, DSP_Block) == 0x000418, "Member 'UWBP_CMN_PlayerDetail_C::DSP_Block' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, DSP_Nice) == 0x000420, "Member 'UWBP_CMN_PlayerDetail_C::DSP_Nice' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, DSP_RivalIcon) == 0x000428, "Member 'UWBP_CMN_PlayerDetail_C::DSP_RivalIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, Icon_Nice) == 0x000430, "Member 'UWBP_CMN_PlayerDetail_C::Icon_Nice' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, ItemBox) == 0x000438, "Member 'UWBP_CMN_PlayerDetail_C::ItemBox' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, Line) == 0x000440, "Member 'UWBP_CMN_PlayerDetail_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, MouseInteraction) == 0x000448, "Member 'UWBP_CMN_PlayerDetail_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, OutOfContentButton) == 0x000450, "Member 'UWBP_CMN_PlayerDetail_C::OutOfContentButton' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, Overlay_59) == 0x000458, "Member 'UWBP_CMN_PlayerDetail_C::Overlay_59' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, PAT_Icon_Block) == 0x000460, "Member 'UWBP_CMN_PlayerDetail_C::PAT_Icon_Block' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, PAT_PlatformIcon) == 0x000468, "Member 'UWBP_CMN_PlayerDetail_C::PAT_PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, PAT_ScrollSnapPoint_01) == 0x000470, "Member 'UWBP_CMN_PlayerDetail_C::PAT_ScrollSnapPoint_01' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, PAT_ScrollSnapPoint_02) == 0x000478, "Member 'UWBP_CMN_PlayerDetail_C::PAT_ScrollSnapPoint_02' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, PAT_ScrollSnapPoint_03) == 0x000480, "Member 'UWBP_CMN_PlayerDetail_C::PAT_ScrollSnapPoint_03' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, TXT_Block) == 0x000488, "Member 'UWBP_CMN_PlayerDetail_C::TXT_Block' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, TXT_Name) == 0x000490, "Member 'UWBP_CMN_PlayerDetail_C::TXT_Name' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, TXT_Next_Page) == 0x000498, "Member 'UWBP_CMN_PlayerDetail_C::TXT_Next_Page' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, TXT_Nice_Num) == 0x0004A0, "Member 'UWBP_CMN_PlayerDetail_C::TXT_Nice_Num' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, WBP_CMN_ControllerBtn) == 0x0004A8, "Member 'UWBP_CMN_PlayerDetail_C::WBP_CMN_ControllerBtn' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, WBP_CMN_PlayerDetail_Sub_Info_Gadget) == 0x0004B0, "Member 'UWBP_CMN_PlayerDetail_C::WBP_CMN_PlayerDetail_Sub_Info_Gadget' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, WBP_CMN_PlayerDetail_Sub_Info_Machine) == 0x0004B8, "Member 'UWBP_CMN_PlayerDetail_C::WBP_CMN_PlayerDetail_Sub_Info_Machine' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, WBP_CMN_PlayerDetail_Sub_Info_Number) == 0x0004C0, "Member 'UWBP_CMN_PlayerDetail_C::WBP_CMN_PlayerDetail_Sub_Info_Number' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, WBP_HonorTitle_Plate) == 0x0004C8, "Member 'UWBP_CMN_PlayerDetail_C::WBP_HonorTitle_Plate' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, WBP_ResultRate_Sub_RankIcon) == 0x0004D0, "Member 'UWBP_CMN_PlayerDetail_C::WBP_ResultRate_Sub_RankIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, WidgetSwitcher_Info) == 0x0004D8, "Member 'UWBP_CMN_PlayerDetail_C::WidgetSwitcher_Info' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, WS_BaseName) == 0x0004E0, "Member 'UWBP_CMN_PlayerDetail_C::WS_BaseName' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, PagePoint_One) == 0x0004E8, "Member 'UWBP_CMN_PlayerDetail_C::PagePoint_One' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, PagePointTwo) == 0x0004F0, "Member 'UWBP_CMN_PlayerDetail_C::PagePointTwo' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, PlatformIcon) == 0x0004F8, "Member 'UWBP_CMN_PlayerDetail_C::PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, BlockIcon) == 0x000500, "Member 'UWBP_CMN_PlayerDetail_C::BlockIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, PlayerDetailPage) == 0x000508, "Member 'UWBP_CMN_PlayerDetail_C::PlayerDetailPage' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_PlayerDetail_C, OpenFromFriendList) == 0x00050C, "Member 'UWBP_CMN_PlayerDetail_C::OpenFromFriendList' has a wrong offset!");

}

