#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupResult_Sub_Table_Line

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionRun_structs.hpp"


namespace SDK::Params
{

// Function WBP_GroupResult_Sub_Table_Line.WBP_GroupResult_Sub_Table_Line_C.ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Result_Sub_RankingTable_GP_02_C*   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Result_Sub_RankingTable_GP_02_C*> K2Node_MakeArray_Array;                      // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	ERaceSettingGrouping                          CallFunc_GetRaceSettingGrouping_ReturnValue;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RacerIndex;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFestaRacerResultInfo>          K2Node_CustomEvent_RacerList;                      // 0x0078(0x0010)(ConstParm, ReferenceParm)
	class UWBP_Result_Sub_RankingTable_GP_02_C*   CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFestaRacerResultInfo                  CallFunc_Array_Get_Item_2;                         // 0x0090(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Result_Sub_RankingTable_GP_02_C*   CallFunc_Array_Get_Item_3;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line) == 0x000008, "Wrong alignment on WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line");
static_assert(sizeof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line) == 0x0000C8, "Wrong size on WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, EntryPoint) == 0x000000, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, Temp_int_Loop_Counter_Variable_2) == 0x000020, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, Temp_int_Loop_Counter_Variable_3) == 0x00002C, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Add_IntInt_ReturnValue_3) == 0x000034, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, Temp_int_Array_Index_Variable_3) == 0x000038, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000048, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_GetRaceSettingGrouping_ReturnValue) == 0x000068, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_GetRaceSettingGrouping_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, K2Node_CustomEvent_RacerIndex) == 0x00006C, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::K2Node_CustomEvent_RacerIndex' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, K2Node_CustomEvent_RacerList) == 0x000078, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::K2Node_CustomEvent_RacerList' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Array_Get_Item_2) == 0x000090, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A4, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A5, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Array_Length_ReturnValue_2) == 0x0000A8, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000AC, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Array_Get_Item_3) == 0x0000B0, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000B8, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Array_Length_ReturnValue_3) == 0x0000BC, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000C0, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Array_RemoveItem_ReturnValue) == 0x0000C1, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x0000C2, "Member 'WBP_GroupResult_Sub_Table_Line_C_ExecuteUbergraph_WBP_GroupResult_Sub_Table_Line::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");

// Function WBP_GroupResult_Sub_Table_Line.WBP_GroupResult_Sub_Table_Line_C.OpenImpl
// 0x0008 (0x0008 - 0x0000)
struct WBP_GroupResult_Sub_Table_Line_C_OpenImpl final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_Table_Line_C_OpenImpl) == 0x000008, "Wrong alignment on WBP_GroupResult_Sub_Table_Line_C_OpenImpl");
static_assert(sizeof(WBP_GroupResult_Sub_Table_Line_C_OpenImpl) == 0x000008, "Wrong size on WBP_GroupResult_Sub_Table_Line_C_OpenImpl");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_OpenImpl, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_GroupResult_Sub_Table_Line_C_OpenImpl::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_GroupResult_Sub_Table_Line.WBP_GroupResult_Sub_Table_Line_C.Set Racer Data Impl
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl final
{
public:
	struct FPartyResultRacer                      RacerData;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Index_0;                                           // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTimeMode;                                       // 0x0044(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Time1st;                                           // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLoading;                                        // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Result_Sub_RankingTable_GP_02_C*   CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetLapTimeBase_Time_ImplicitCast;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetLapTimeBase_Time_ImplicitCast_1;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl) == 0x000008, "Wrong alignment on WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl");
static_assert(sizeof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl) == 0x0000A0, "Wrong size on WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, RacerData) == 0x000000, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::RacerData' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, Index_0) == 0x000040, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, bIsTimeMode) == 0x000044, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::bIsTimeMode' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, Time1st) == 0x000048, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::Time1st' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, bIsLoading) == 0x000050, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::bIsLoading' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, CallFunc_Less_IntInt_ReturnValue_1) == 0x000078, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000079, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, CallFunc_SelectInt_ReturnValue) == 0x00007C, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000080, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, CallFunc_SetLapTimeBase_Time_ImplicitCast) == 0x000088, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::CallFunc_SetLapTimeBase_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, CallFunc_SetLapTimeBase_Time_ImplicitCast_1) == 0x000090, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::CallFunc_SetLapTimeBase_Time_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'WBP_GroupResult_Sub_Table_Line_C_Set_Racer_Data_Impl::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_GroupResult_Sub_Table_Line.WBP_GroupResult_Sub_Table_Line_C.SetFestaBonusPoint
// 0x0010 (0x0010 - 0x0000)
struct WBP_GroupResult_Sub_Table_Line_C_SetFestaBonusPoint final
{
public:
	TArray<struct FFestaRacerResultInfo>          RacerList;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_GroupResult_Sub_Table_Line_C_SetFestaBonusPoint) == 0x000008, "Wrong alignment on WBP_GroupResult_Sub_Table_Line_C_SetFestaBonusPoint");
static_assert(sizeof(WBP_GroupResult_Sub_Table_Line_C_SetFestaBonusPoint) == 0x000010, "Wrong size on WBP_GroupResult_Sub_Table_Line_C_SetFestaBonusPoint");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_SetFestaBonusPoint, RacerList) == 0x000000, "Member 'WBP_GroupResult_Sub_Table_Line_C_SetFestaBonusPoint::RacerList' has a wrong offset!");

// Function WBP_GroupResult_Sub_Table_Line.WBP_GroupResult_Sub_Table_Line_C.SetMVPAnim
// 0x0004 (0x0004 - 0x0000)
struct WBP_GroupResult_Sub_Table_Line_C_SetMVPAnim final
{
public:
	int32                                         RacerIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupResult_Sub_Table_Line_C_SetMVPAnim) == 0x000004, "Wrong alignment on WBP_GroupResult_Sub_Table_Line_C_SetMVPAnim");
static_assert(sizeof(WBP_GroupResult_Sub_Table_Line_C_SetMVPAnim) == 0x000004, "Wrong size on WBP_GroupResult_Sub_Table_Line_C_SetMVPAnim");
static_assert(offsetof(WBP_GroupResult_Sub_Table_Line_C_SetMVPAnim, RacerIndex) == 0x000000, "Member 'WBP_GroupResult_Sub_Table_Line_C_SetMVPAnim::RacerIndex' has a wrong offset!");

}

