#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClassSelect_TimeTrial

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_ClassSelect_TimeTrial.WBP_ClassSelect_TimeTrial_C.ExecuteUbergraph_WBP_ClassSelect_TimeTrial
// 0x0370 (0x0370 - 0x0000)
struct WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalcTotalClassTimeTrialMedalMax_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcTotalTimeTrialMedalMax_ReturnValue;   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0010)()
	bool                                          CallFunc_IsDisableTimeTrialMilestoneVersion_ReturnValue; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             Temp_byte_Variable_1;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableTimeTrialMilestoneVersion_ReturnValue_1; // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalcTotalTimeTrialMedalCount_ReturnValue; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0080(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0090(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00A0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x00B0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x00C0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x00D0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x00E0(0x0010)()
	bool                                          CallFunc_IsOpenSuperSonicSpeed_ReturnValue;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x00F8(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x0108(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0118(0x0010)(ConstParm)
	bool                                          CallFunc_IsOpenMirror_ReturnValue;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_8;            // 0x0130(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_9;            // 0x0140(0x0010)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0150(0x0010)(ConstParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_10;           // 0x0160(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_11;           // 0x0170(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_12;           // 0x0180(0x0010)()
	bool                                          CallFunc_IsOpenSuperSonicSpeed_ReturnValue_1;      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_13;           // 0x0198(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_14;           // 0x01A8(0x0010)()
	bool                                          CallFunc_IsOpenMirror_ReturnValue_1;               // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClassSelectButtonBase*>         K2Node_MakeArray_Array;                            // 0x01C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenSuperSonicSpeed_ReturnValue_2;      // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D6[0x2];                                      // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_SpawnObject_ReturnValue;                  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item;                           // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetLastFocusedMenuSpeedClassId_ReturnValue; // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F6[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_ClassSelect_Sub_Btn_Class_C*> K2Node_MakeArray_Array_1;                        // 0x0200(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_ClassSelect_Sub_Btn_Class_C*       CallFunc_Array_Get_Item_1;                         // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTimeTrialMedalAcquisitionPerClass_ReturnValue; // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcTotalTimeTrialMedalAcquisitionPerClass_ReturnValue; // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             K2Node_CustomEvent_FirstSelectedClass_1;           // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0230(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             K2Node_CustomEvent_FirstSelectedClass;             // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_2;                         // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_3;                         // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x0288(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bImmediate;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_4;                         // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_5;                         // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_6;                         // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ClassSelect_Sub_Btn_Class_C*       K2Node_DynamicCast_AsWBP_Class_Select_Sub_Btn_Class; // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B[0x5];                                      // 0x030B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0310(0x0010)(ConstParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0328(0x0010)(ConstParm)
	bool                                          Temp_bool_Variable_3;                              // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_4;                           // 0x0340(0x0010)(ConstParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_5;                           // 0x0358(0x0010)(ConstParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial) == 0x000008, "Wrong alignment on WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial");
static_assert(sizeof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial) == 0x000370, "Wrong size on WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, EntryPoint) == 0x000000, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_byte_Variable) == 0x000004, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_bool_Variable) == 0x000018, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_CalcTotalClassTimeTrialMedalMax_ReturnValue) == 0x00001C, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_CalcTotalClassTimeTrialMedalMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_int_Array_Index_Variable_3) == 0x00002C, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_int_Loop_Counter_Variable_2) == 0x000030, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Add_IntInt_ReturnValue_2) == 0x000034, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_int_Array_Index_Variable_4) == 0x000038, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_CalcTotalTimeTrialMedalMax_ReturnValue) == 0x00003C, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_CalcTotalTimeTrialMedalMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_bool_Variable_1) == 0x000060, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_IsDisableTimeTrialMilestoneVersion_ReturnValue) == 0x000078, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_IsDisableTimeTrialMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_byte_Variable_1) == 0x000079, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_IsDisableTimeTrialMilestoneVersion_ReturnValue_1) == 0x00007A, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_IsDisableTimeTrialMilestoneVersion_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_CalcTotalTimeTrialMedalCount_ReturnValue) == 0x00007C, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_CalcTotalTimeTrialMedalCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Conv_IntToText_ReturnValue) == 0x000080, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue) == 0x000090, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000A0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_2) == 0x0000B0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_3) == 0x0000C0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_4) == 0x0000D0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_5) == 0x0000E0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_IsOpenSuperSonicSpeed_ReturnValue) == 0x0000F0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_IsOpenSuperSonicSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_6) == 0x0000F8, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_7) == 0x000108, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_Select_Default) == 0x000118, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_IsOpenMirror_ReturnValue) == 0x000128, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_IsOpenMirror_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_8) == 0x000130, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_9) == 0x000140, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_Select_Default_1) == 0x000150, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_10) == 0x000160, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_11) == 0x000170, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_12) == 0x000180, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_IsOpenSuperSonicSpeed_ReturnValue_1) == 0x000190, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_IsOpenSuperSonicSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_13) == 0x000198, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_MakeLiteralText_ReturnValue_14) == 0x0001A8, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_MakeLiteralText_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_IsOpenMirror_ReturnValue_1) == 0x0001B8, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_IsOpenMirror_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_MakeArray_Array) == 0x0001C0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Length_ReturnValue) == 0x0001D0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_IsOpenSuperSonicSpeed_ReturnValue_2) == 0x0001D4, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_IsOpenSuperSonicSpeed_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Not_PreBool_ReturnValue) == 0x0001D5, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_GetPlayerController_ReturnValue) == 0x0001D8, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_SpawnObject_ReturnValue) == 0x0001E0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Get_Item) == 0x0001E8, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Length_ReturnValue_1) == 0x0001F0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_GetLastFocusedMenuSpeedClassId_ReturnValue) == 0x0001F4, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_GetLastFocusedMenuSpeedClassId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001F5, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_SelectInt_ReturnValue) == 0x0001F8, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_MakeArray_Array_1) == 0x000200, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Get_Item_1) == 0x000210, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_GetTimeTrialMedalAcquisitionPerClass_ReturnValue) == 0x000218, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_GetTimeTrialMedalAcquisitionPerClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_CalcTotalTimeTrialMedalAcquisitionPerClass_ReturnValue) == 0x00021C, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_CalcTotalTimeTrialMedalAcquisitionPerClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Length_ReturnValue_2) == 0x000220, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_CustomEvent_FirstSelectedClass_1) == 0x000224, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_CustomEvent_FirstSelectedClass_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_PlayAnimation_ReturnValue) == 0x000228, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_CreateDelegate_OutputDelegate) == 0x000230, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_CustomEvent_FirstSelectedClass) == 0x000240, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_CustomEvent_FirstSelectedClass' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000241, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Get_Item_2) == 0x000248, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_SelectInt_ReturnValue_1) == 0x000250, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Get_Item_3) == 0x000258, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Length_ReturnValue_3) == 0x000260, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Less_IntInt_ReturnValue) == 0x000264, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_int_Loop_Counter_Variable_3) == 0x000268, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_int_Loop_Counter_Variable_4) == 0x00026C, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Less_IntInt_ReturnValue_1) == 0x000270, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Add_IntInt_ReturnValue_3) == 0x000274, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Less_IntInt_ReturnValue_2) == 0x000278, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Add_IntInt_ReturnValue_4) == 0x00027C, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_PlayAnimation_ReturnValue_1) == 0x000280, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_CreateDelegate_OutputDelegate_1) == 0x000288, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_CustomEvent_bImmediate) == 0x000298, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_CustomEvent_bImmediate' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_PlayAnimation_ReturnValue_2) == 0x0002A0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002A8, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Get_Item_4) == 0x0002B8, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Length_ReturnValue_4) == 0x0002C0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Less_IntInt_ReturnValue_3) == 0x0002C4, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_GetAppPlayerController_ReturnValue) == 0x0002C8, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_int_Array_Index_Variable_5) == 0x0002D0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Get_Item_5) == 0x0002D8, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Get_Item_6) == 0x0002E0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Array_Length_ReturnValue_5) == 0x0002E8, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Less_IntInt_ReturnValue_4) == 0x0002EC, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_CustomEvent_Button) == 0x0002F0, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002F8, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_DynamicCast_AsWBP_Class_Select_Sub_Btn_Class) == 0x000300, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_DynamicCast_AsWBP_Class_Select_Sub_Btn_Class' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_DynamicCast_bSuccess) == 0x000308, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_bool_Variable_2) == 0x000309, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00030A, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_Select_Default_2) == 0x000310, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_BooleanAND_ReturnValue) == 0x000320, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_Select_Default_3) == 0x000328, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_bool_Variable_3) == 0x000338, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, Temp_int_Loop_Counter_Variable_5) == 0x00033C, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_Select_Default_4) == 0x000340, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Less_IntInt_ReturnValue_5) == 0x000350, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, K2Node_Select_Default_5) == 0x000358, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial, CallFunc_Add_IntInt_ReturnValue_5) == 0x000368, "Member 'WBP_ClassSelect_TimeTrial_C_ExecuteUbergraph_WBP_ClassSelect_TimeTrial::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");

// Function WBP_ClassSelect_TimeTrial.WBP_ClassSelect_TimeTrial_C.Focus
// 0x0001 (0x0001 - 0x0000)
struct WBP_ClassSelect_TimeTrial_C_Focus final
{
public:
	EMenuSpeedClassId                             FirstSelectedClass;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_TimeTrial_C_Focus) == 0x000001, "Wrong alignment on WBP_ClassSelect_TimeTrial_C_Focus");
static_assert(sizeof(WBP_ClassSelect_TimeTrial_C_Focus) == 0x000001, "Wrong size on WBP_ClassSelect_TimeTrial_C_Focus");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_Focus, FirstSelectedClass) == 0x000000, "Member 'WBP_ClassSelect_TimeTrial_C_Focus::FirstSelectedClass' has a wrong offset!");

// Function WBP_ClassSelect_TimeTrial.WBP_ClassSelect_TimeTrial_C.InClassSelect
// 0x0001 (0x0001 - 0x0000)
struct WBP_ClassSelect_TimeTrial_C_InClassSelect final
{
public:
	EMenuSpeedClassId                             FirstSelectedClass;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_TimeTrial_C_InClassSelect) == 0x000001, "Wrong alignment on WBP_ClassSelect_TimeTrial_C_InClassSelect");
static_assert(sizeof(WBP_ClassSelect_TimeTrial_C_InClassSelect) == 0x000001, "Wrong size on WBP_ClassSelect_TimeTrial_C_InClassSelect");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_InClassSelect, FirstSelectedClass) == 0x000000, "Member 'WBP_ClassSelect_TimeTrial_C_InClassSelect::FirstSelectedClass' has a wrong offset!");

// Function WBP_ClassSelect_TimeTrial.WBP_ClassSelect_TimeTrial_C.OnFocusEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_ClassSelect_TimeTrial_C_OnFocusEvent final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_TimeTrial_C_OnFocusEvent) == 0x000008, "Wrong alignment on WBP_ClassSelect_TimeTrial_C_OnFocusEvent");
static_assert(sizeof(WBP_ClassSelect_TimeTrial_C_OnFocusEvent) == 0x000008, "Wrong size on WBP_ClassSelect_TimeTrial_C_OnFocusEvent");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_OnFocusEvent, Button) == 0x000000, "Member 'WBP_ClassSelect_TimeTrial_C_OnFocusEvent::Button' has a wrong offset!");

// Function WBP_ClassSelect_TimeTrial.WBP_ClassSelect_TimeTrial_C.OutClassSelect
// 0x0001 (0x0001 - 0x0000)
struct WBP_ClassSelect_TimeTrial_C_OutClassSelect final
{
public:
	bool                                          bImmediate;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_TimeTrial_C_OutClassSelect) == 0x000001, "Wrong alignment on WBP_ClassSelect_TimeTrial_C_OutClassSelect");
static_assert(sizeof(WBP_ClassSelect_TimeTrial_C_OutClassSelect) == 0x000001, "Wrong size on WBP_ClassSelect_TimeTrial_C_OutClassSelect");
static_assert(offsetof(WBP_ClassSelect_TimeTrial_C_OutClassSelect, bImmediate) == 0x000000, "Member 'WBP_ClassSelect_TimeTrial_C_OutClassSelect::bImmediate' has a wrong offset!");

}

