#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_Sub_SpeedClassInfo

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_Sub_SpeedClassInfo.WBP_CMN_Sub_SpeedClassInfo_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_CMN_Sub_SpeedClassInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon_Active_01;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Active_02;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Active_03;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Active_04;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Active_05;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Class;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_Icon_Active;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bBeforeSlateInvalidation;                          // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CMN_Sub_SpeedClassInfo(int32 EntryPoint);
	void SetMenuSpeedClassId(EMenuSpeedClassId SpeedClassId);
	void SetPartyRaceGroupSpeedClass();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_Sub_SpeedClassInfo_C">();
	}
	static class UWBP_CMN_Sub_SpeedClassInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_Sub_SpeedClassInfo_C>();
	}
};
static_assert(alignof(UWBP_CMN_Sub_SpeedClassInfo_C) == 0x000008, "Wrong alignment on UWBP_CMN_Sub_SpeedClassInfo_C");
static_assert(sizeof(UWBP_CMN_Sub_SpeedClassInfo_C) == 0x000328, "Wrong size on UWBP_CMN_Sub_SpeedClassInfo_C");
static_assert(offsetof(UWBP_CMN_Sub_SpeedClassInfo_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_CMN_Sub_SpeedClassInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_SpeedClassInfo_C, Icon_Active_01) == 0x0002E8, "Member 'UWBP_CMN_Sub_SpeedClassInfo_C::Icon_Active_01' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_SpeedClassInfo_C, Icon_Active_02) == 0x0002F0, "Member 'UWBP_CMN_Sub_SpeedClassInfo_C::Icon_Active_02' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_SpeedClassInfo_C, Icon_Active_03) == 0x0002F8, "Member 'UWBP_CMN_Sub_SpeedClassInfo_C::Icon_Active_03' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_SpeedClassInfo_C, Icon_Active_04) == 0x000300, "Member 'UWBP_CMN_Sub_SpeedClassInfo_C::Icon_Active_04' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_SpeedClassInfo_C, Icon_Active_05) == 0x000308, "Member 'UWBP_CMN_Sub_SpeedClassInfo_C::Icon_Active_05' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_SpeedClassInfo_C, TXT_Class) == 0x000310, "Member 'UWBP_CMN_Sub_SpeedClassInfo_C::TXT_Class' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_SpeedClassInfo_C, WS_Icon_Active) == 0x000318, "Member 'UWBP_CMN_Sub_SpeedClassInfo_C::WS_Icon_Active' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_SpeedClassInfo_C, bBeforeSlateInvalidation) == 0x000320, "Member 'UWBP_CMN_Sub_SpeedClassInfo_C::bBeforeSlateInvalidation' has a wrong offset!");

}

