#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_CustomSticker

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_MachineCustom_CustomSticker.WBP_MachineCustom_CustomSticker_C.GetVisibility_ColorPicker
// 0x0002 (0x0002 - 0x0000)
struct WBP_MachineCustom_CustomSticker_C_GetVisibility_ColorPicker final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_CustomSticker_C_GetVisibility_ColorPicker) == 0x000001, "Wrong alignment on WBP_MachineCustom_CustomSticker_C_GetVisibility_ColorPicker");
static_assert(sizeof(WBP_MachineCustom_CustomSticker_C_GetVisibility_ColorPicker) == 0x000002, "Wrong size on WBP_MachineCustom_CustomSticker_C_GetVisibility_ColorPicker");
static_assert(offsetof(WBP_MachineCustom_CustomSticker_C_GetVisibility_ColorPicker, Visibility_0) == 0x000000, "Member 'WBP_MachineCustom_CustomSticker_C_GetVisibility_ColorPicker::Visibility_0' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_CustomSticker_C_GetVisibility_ColorPicker, CallFunc_GetVisibility_ReturnValue) == 0x000001, "Member 'WBP_MachineCustom_CustomSticker_C_GetVisibility_ColorPicker::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_CustomSticker.WBP_MachineCustom_CustomSticker_C.GetVisibility_OperationGuide
// 0x0002 (0x0002 - 0x0000)
struct WBP_MachineCustom_CustomSticker_C_GetVisibility_OperationGuide final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_CustomSticker_C_GetVisibility_OperationGuide) == 0x000001, "Wrong alignment on WBP_MachineCustom_CustomSticker_C_GetVisibility_OperationGuide");
static_assert(sizeof(WBP_MachineCustom_CustomSticker_C_GetVisibility_OperationGuide) == 0x000002, "Wrong size on WBP_MachineCustom_CustomSticker_C_GetVisibility_OperationGuide");
static_assert(offsetof(WBP_MachineCustom_CustomSticker_C_GetVisibility_OperationGuide, Visibility_0) == 0x000000, "Member 'WBP_MachineCustom_CustomSticker_C_GetVisibility_OperationGuide::Visibility_0' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_CustomSticker_C_GetVisibility_OperationGuide, CallFunc_GetVisibility_ReturnValue) == 0x000001, "Member 'WBP_MachineCustom_CustomSticker_C_GetVisibility_OperationGuide::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_CustomSticker.WBP_MachineCustom_CustomSticker_C.PlayColorPickerIn
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_CustomSticker_C_PlayColorPickerIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_CustomSticker_C_PlayColorPickerIn) == 0x000008, "Wrong alignment on WBP_MachineCustom_CustomSticker_C_PlayColorPickerIn");
static_assert(sizeof(WBP_MachineCustom_CustomSticker_C_PlayColorPickerIn) == 0x000008, "Wrong size on WBP_MachineCustom_CustomSticker_C_PlayColorPickerIn");
static_assert(offsetof(WBP_MachineCustom_CustomSticker_C_PlayColorPickerIn, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_CustomSticker_C_PlayColorPickerIn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_CustomSticker.WBP_MachineCustom_CustomSticker_C.PlayColorPickerOut
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_CustomSticker_C_PlayColorPickerOut final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_CustomSticker_C_PlayColorPickerOut) == 0x000008, "Wrong alignment on WBP_MachineCustom_CustomSticker_C_PlayColorPickerOut");
static_assert(sizeof(WBP_MachineCustom_CustomSticker_C_PlayColorPickerOut) == 0x000008, "Wrong size on WBP_MachineCustom_CustomSticker_C_PlayColorPickerOut");
static_assert(offsetof(WBP_MachineCustom_CustomSticker_C_PlayColorPickerOut, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_CustomSticker_C_PlayColorPickerOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_CustomSticker.WBP_MachineCustom_CustomSticker_C.SetVisibility_ColorPicker
// 0x0001 (0x0001 - 0x0000)
struct WBP_MachineCustom_CustomSticker_C_SetVisibility_ColorPicker final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_CustomSticker_C_SetVisibility_ColorPicker) == 0x000001, "Wrong alignment on WBP_MachineCustom_CustomSticker_C_SetVisibility_ColorPicker");
static_assert(sizeof(WBP_MachineCustom_CustomSticker_C_SetVisibility_ColorPicker) == 0x000001, "Wrong size on WBP_MachineCustom_CustomSticker_C_SetVisibility_ColorPicker");
static_assert(offsetof(WBP_MachineCustom_CustomSticker_C_SetVisibility_ColorPicker, Visibility_0) == 0x000000, "Member 'WBP_MachineCustom_CustomSticker_C_SetVisibility_ColorPicker::Visibility_0' has a wrong offset!");

// Function WBP_MachineCustom_CustomSticker.WBP_MachineCustom_CustomSticker_C.SetVisibility_OperationGuide
// 0x0001 (0x0001 - 0x0000)
struct WBP_MachineCustom_CustomSticker_C_SetVisibility_OperationGuide final
{
public:
	ESlateVisibility                              Visibility_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_CustomSticker_C_SetVisibility_OperationGuide) == 0x000001, "Wrong alignment on WBP_MachineCustom_CustomSticker_C_SetVisibility_OperationGuide");
static_assert(sizeof(WBP_MachineCustom_CustomSticker_C_SetVisibility_OperationGuide) == 0x000001, "Wrong size on WBP_MachineCustom_CustomSticker_C_SetVisibility_OperationGuide");
static_assert(offsetof(WBP_MachineCustom_CustomSticker_C_SetVisibility_OperationGuide, Visibility_0) == 0x000000, "Member 'WBP_MachineCustom_CustomSticker_C_SetVisibility_OperationGuide::Visibility_0' has a wrong offset!");

}

