#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_PlayerIcon

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Friend_PlayerIcon.WBP_Friend_PlayerIcon_C
// 0x0038 (0x04B8 - 0x0480)
class UWBP_Friend_PlayerIcon_C final : public UUnionUIButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DSP_Cursor_Texture;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_DMY_PlayerIconInfo;                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_NowPlayingIcon;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MLC_PlayerIconBase;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseInteraction;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bMouseDown;                                        // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Check_Release_Response_InputType(bool* bOutReleaseResponseInput);
	void ExecuteUbergraph_WBP_Friend_PlayerIcon(int32 EntryPoint);
	void ForceFocusGateOpen();
	void ForceUnfocusGateOpen();
	void OnAcceptKeyPressed();
	void OnAcceptKeyPressedImpl();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnBackKeyPressed();
	void OnFocusAnimStart();
	void OnFocusImpl(class UUnionUIButtonBase* Button);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInitialized();
	void OnLoaded_8D4F99AE4CC9B40CFE879E8D838B5BEB(class UObject* Loaded);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnUnFocusAnimStart();
	void SetButtonFocusType(EButtonFocusType InFocusType);
	void SetCursorVisible(bool bInVisible);
	void SetIconVisible(bool bInVisible);
	void SetMouseInteractionEnable(bool bInEnable);
	void SetNowPlayingIconVisible(bool bInVisible);
	void SetPlayerIcon(TSoftObjectPtr<class UTexture2D> InIconTexture, const struct FLinearColor& InIconBgColor);
	void SetWidgetFocus(bool bInPlayFocusSound);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Friend_PlayerIcon_C">();
	}
	static class UWBP_Friend_PlayerIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Friend_PlayerIcon_C>();
	}
};
static_assert(alignof(UWBP_Friend_PlayerIcon_C) == 0x000008, "Wrong alignment on UWBP_Friend_PlayerIcon_C");
static_assert(sizeof(UWBP_Friend_PlayerIcon_C) == 0x0004B8, "Wrong size on UWBP_Friend_PlayerIcon_C");
static_assert(offsetof(UWBP_Friend_PlayerIcon_C, UberGraphFrame) == 0x000480, "Member 'UWBP_Friend_PlayerIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_PlayerIcon_C, DSP_Cursor_Texture) == 0x000488, "Member 'UWBP_Friend_PlayerIcon_C::DSP_Cursor_Texture' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_PlayerIcon_C, DSP_DMY_PlayerIconInfo) == 0x000490, "Member 'UWBP_Friend_PlayerIcon_C::DSP_DMY_PlayerIconInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_PlayerIcon_C, DSP_NowPlayingIcon) == 0x000498, "Member 'UWBP_Friend_PlayerIcon_C::DSP_NowPlayingIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_PlayerIcon_C, MLC_PlayerIconBase) == 0x0004A0, "Member 'UWBP_Friend_PlayerIcon_C::MLC_PlayerIconBase' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_PlayerIcon_C, MouseInteraction) == 0x0004A8, "Member 'UWBP_Friend_PlayerIcon_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_PlayerIcon_C, bMouseDown) == 0x0004B0, "Member 'UWBP_Friend_PlayerIcon_C::bMouseDown' has a wrong offset!");

}

