#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_CustomPaint_Liquid

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_CustomPaint_Liquid.WBP_MachineCustom_Sub_CustomPaint_Liquid_C
// 0x0050 (0x0330 - 0x02E0)
class UWBP_MachineCustom_Sub_CustomPaint_Liquid_C final : public UUserWidget
{
public:
	class UCanvasPanel*                           Displayable_Detail;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Category;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Category;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Undisplayable_Detail;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBLiquidLine;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Category;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UUnionUIButtonBase* InButton)> OnFocus;                      // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UUnionUIButtonBase* InButton)> OnDecision;                   // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Decision(class UUnionUIButtonBase* InButton);
	void Focus(class UUnionUIButtonBase* InButton);
	void SetCursorVisible(bool bInIsVisible);
	void Setup(class APlayerController* InPlayerController, const struct FMachineColorAreaUIDataGroup& InUIDataGroup);

	void GetEnabledItems(TArray<class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C*>* OutItems) const;
	void GetItems(TArray<class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C*>* OutItems) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_CustomPaint_Liquid_C">();
	}
	static class UWBP_MachineCustom_Sub_CustomPaint_Liquid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_CustomPaint_Liquid_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_CustomPaint_Liquid_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_CustomPaint_Liquid_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_CustomPaint_Liquid_C) == 0x000330, "Wrong size on UWBP_MachineCustom_Sub_CustomPaint_Liquid_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Liquid_C, Displayable_Detail) == 0x0002E0, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Liquid_C::Displayable_Detail' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Liquid_C, PAT_Category) == 0x0002E8, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Liquid_C::PAT_Category' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Liquid_C, TXT_Category) == 0x0002F0, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Liquid_C::TXT_Category' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Liquid_C, Undisplayable_Detail) == 0x0002F8, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Liquid_C::Undisplayable_Detail' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Liquid_C, VBLiquidLine) == 0x000300, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Liquid_C::VBLiquidLine' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Liquid_C, WidgetSwitcher_Category) == 0x000308, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Liquid_C::WidgetSwitcher_Category' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Liquid_C, OnFocus) == 0x000310, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Liquid_C::OnFocus' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_CustomPaint_Liquid_C, OnDecision) == 0x000320, "Member 'UWBP_MachineCustom_Sub_CustomPaint_Liquid_C::OnDecision' has a wrong offset!");

}

