#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemSwitch_Sub_Detail

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemSwitch_Sub_Detail.WBP_ItemSwitch_Sub_Detail_C.ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FItemDataAssetTableRow                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0098)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemId                                       K2Node_Event_InItem;                               // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail) == 0x000008, "Wrong alignment on WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail");
static_assert(sizeof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail) == 0x0000E0, "Wrong size on WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail, EntryPoint) == 0x000000, "Member 'WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail, CallFunc_GetEnumeratorName_ReturnValue) == 0x000010, "Member 'WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail, Temp_object_Variable) == 0x000018, "Member 'WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B8, "Member 'WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail, K2Node_DynamicCast_As_____2D) == 0x0000C0, "Member 'WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail, K2Node_Event_IsDesignTime) == 0x0000C9, "Member 'WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail, K2Node_Event_InItem) == 0x0000CA, "Member 'WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail::K2Node_Event_InItem' has a wrong offset!");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail, K2Node_CreateDelegate_OutputDelegate) == 0x0000CC, "Member 'WBP_ItemSwitch_Sub_Detail_C_ExecuteUbergraph_WBP_ItemSwitch_Sub_Detail::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_ItemSwitch_Sub_Detail.WBP_ItemSwitch_Sub_Detail_C.OnLoaded_CFE0274244ED98A836395491DD52B753
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemSwitch_Sub_Detail_C_OnLoaded_CFE0274244ED98A836395491DD52B753 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSwitch_Sub_Detail_C_OnLoaded_CFE0274244ED98A836395491DD52B753) == 0x000008, "Wrong alignment on WBP_ItemSwitch_Sub_Detail_C_OnLoaded_CFE0274244ED98A836395491DD52B753");
static_assert(sizeof(WBP_ItemSwitch_Sub_Detail_C_OnLoaded_CFE0274244ED98A836395491DD52B753) == 0x000008, "Wrong size on WBP_ItemSwitch_Sub_Detail_C_OnLoaded_CFE0274244ED98A836395491DD52B753");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_OnLoaded_CFE0274244ED98A836395491DD52B753, Loaded) == 0x000000, "Member 'WBP_ItemSwitch_Sub_Detail_C_OnLoaded_CFE0274244ED98A836395491DD52B753::Loaded' has a wrong offset!");

// Function WBP_ItemSwitch_Sub_Detail.WBP_ItemSwitch_Sub_Detail_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemSwitch_Sub_Detail_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSwitch_Sub_Detail_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ItemSwitch_Sub_Detail_C_PreConstruct");
static_assert(sizeof(WBP_ItemSwitch_Sub_Detail_C_PreConstruct) == 0x000001, "Wrong size on WBP_ItemSwitch_Sub_Detail_C_PreConstruct");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ItemSwitch_Sub_Detail_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ItemSwitch_Sub_Detail.WBP_ItemSwitch_Sub_Detail_C.UpdateItem
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemSwitch_Sub_Detail_C_UpdateItem final
{
public:
	EItemId                                       InItem;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSwitch_Sub_Detail_C_UpdateItem) == 0x000001, "Wrong alignment on WBP_ItemSwitch_Sub_Detail_C_UpdateItem");
static_assert(sizeof(WBP_ItemSwitch_Sub_Detail_C_UpdateItem) == 0x000001, "Wrong size on WBP_ItemSwitch_Sub_Detail_C_UpdateItem");
static_assert(offsetof(WBP_ItemSwitch_Sub_Detail_C_UpdateItem, InItem) == 0x000000, "Member 'WBP_ItemSwitch_Sub_Detail_C_UpdateItem::InItem' has a wrong offset!");

}

