#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachinrCustom_Sub_Paint_PresetWindow

#include "Basic.hpp"

#include "UnionUI_structs.hpp"
#include "ST_ColorPresetSelectPageItemData_structs.hpp"


namespace SDK::Params
{

// Function WBP_MachinrCustom_Sub_Paint_PresetWindow.WBP_MachinrCustom_Sub_Paint_PresetWindow_C.BuildNavigation
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation final
{
public:
	bool                                          bInWrapLeftRight;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSimpleCustom;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemNumInRow_OutItemNumInRow;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachinrCustom_Sub_Paint_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ColorPresetSelectPageItemData      CallFunc_GetItemData_OutItemData;                  // 0x0050(0x0058)(HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUnionUIControlDir InDirection, class UUnionUIButtonBase* InButton, int32 InRowIndex, int32 InColumnIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUnionUIControlDir InDirection, class UUnionUIButtonBase* InButton, int32 InRowIndex, int32 InColumnIndex)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation) == 0x000008, "Wrong alignment on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation");
static_assert(sizeof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation) == 0x0000E0, "Wrong size on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, bInWrapLeftRight) == 0x000000, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::bInWrapLeftRight' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, IsSimpleCustom) == 0x000001, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::IsSimpleCustom' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_GetItemNumInRow_OutItemNumInRow) == 0x000010, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_GetItemNumInRow_OutItemNumInRow' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_Divide_IntInt_ReturnValue) == 0x000028, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon) == 0x000040, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_GetItemData_OutItemData) == 0x000050, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_GetItemData_OutItemData' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_Percent_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000AC, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000C0, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000C4, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C8, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D8, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_BuildNavigation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_MachinrCustom_Sub_Paint_PresetWindow.WBP_MachinrCustom_Sub_Paint_PresetWindow_C.Decision
// 0x0050 (0x0050 - 0x0000)
struct WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     Button;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachinrCustom_Sub_Paint_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision) == 0x000008, "Wrong alignment on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision");
static_assert(sizeof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision) == 0x000050, "Wrong size on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, InButton) == 0x000000, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::InButton' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, Button) == 0x000008, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::Button' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon) == 0x000040, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00004A, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision, CallFunc_GetChildIndex_ReturnValue) == 0x00004C, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Decision::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");

// Function WBP_MachinrCustom_Sub_Paint_PresetWindow.WBP_MachinrCustom_Sub_Paint_PresetWindow_C.Event_OnFocused
// 0x0018 (0x0018 - 0x0000)
struct WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnFocused final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachinrCustom_Sub_Paint_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnFocused) == 0x000008, "Wrong alignment on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnFocused");
static_assert(sizeof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnFocused) == 0x000018, "Wrong size on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnFocused");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnFocused, Button) == 0x000000, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnFocused::Button' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnFocused, K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon) == 0x000008, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnFocused::K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnFocused, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnFocused::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_MachinrCustom_Sub_Paint_PresetWindow.WBP_MachinrCustom_Sub_Paint_PresetWindow_C.Event_OnSideNavigationCustom
// 0x0018 (0x0018 - 0x0000)
struct WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom final
{
public:
	EUnionUIControlDir                            InDirection;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     InButton;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         InRowIndex;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InColumnIndex;                                     // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom) == 0x000008, "Wrong alignment on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom");
static_assert(sizeof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom) == 0x000018, "Wrong size on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom, InDirection) == 0x000000, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom::InDirection' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom, InButton) == 0x000008, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom::InButton' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom, InRowIndex) == 0x000010, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom::InRowIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom, InColumnIndex) == 0x000014, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_Event_OnSideNavigationCustom::InColumnIndex' has a wrong offset!");

// Function WBP_MachinrCustom_Sub_Paint_PresetWindow.WBP_MachinrCustom_Sub_Paint_PresetWindow_C.ExecuteUbergraph_WBP_MachinrCustom_Sub_Paint_PresetWindow
// 0x0010 (0x0010 - 0x0000)
struct WBP_MachinrCustom_Sub_Paint_PresetWindow_C_ExecuteUbergraph_WBP_MachinrCustom_Sub_Paint_PresetWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIGridNavigationBuilder*          CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_ExecuteUbergraph_WBP_MachinrCustom_Sub_Paint_PresetWindow) == 0x000008, "Wrong alignment on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_ExecuteUbergraph_WBP_MachinrCustom_Sub_Paint_PresetWindow");
static_assert(sizeof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_ExecuteUbergraph_WBP_MachinrCustom_Sub_Paint_PresetWindow) == 0x000010, "Wrong size on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_ExecuteUbergraph_WBP_MachinrCustom_Sub_Paint_PresetWindow");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_ExecuteUbergraph_WBP_MachinrCustom_Sub_Paint_PresetWindow, EntryPoint) == 0x000000, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_ExecuteUbergraph_WBP_MachinrCustom_Sub_Paint_PresetWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_ExecuteUbergraph_WBP_MachinrCustom_Sub_Paint_PresetWindow, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_ExecuteUbergraph_WBP_MachinrCustom_Sub_Paint_PresetWindow::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_MachinrCustom_Sub_Paint_PresetWindow.WBP_MachinrCustom_Sub_Paint_PresetWindow_C.HideCursor
// 0x0048 (0x0048 - 0x0000)
struct WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachinrCustom_Sub_Paint_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor) == 0x000008, "Wrong alignment on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor");
static_assert(sizeof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor) == 0x000048, "Wrong size on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor, K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon) == 0x000038, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor::K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideCursor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_MachinrCustom_Sub_Paint_PresetWindow.WBP_MachinrCustom_Sub_Paint_PresetWindow_C.HideTextBalloon
// 0x0048 (0x0048 - 0x0000)
struct WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachinrCustom_Sub_Paint_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon) == 0x000008, "Wrong alignment on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon");
static_assert(sizeof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon) == 0x000048, "Wrong size on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon, K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon) == 0x000038, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon::K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_HideTextBalloon::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_MachinrCustom_Sub_Paint_PresetWindow.WBP_MachinrCustom_Sub_Paint_PresetWindow_C.SetButtonsPanel
// 0x0048 (0x0048 - 0x0000)
struct WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel final
{
public:
	class UUnionUIButtonsPanel*                   InButtonsPanel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachinrCustom_Sub_Paint_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel) == 0x000008, "Wrong alignment on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel");
static_assert(sizeof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel) == 0x000048, "Wrong size on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel, InButtonsPanel) == 0x000000, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel::InButtonsPanel' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel, K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon) == 0x000030, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel::K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetButtonsPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MachinrCustom_Sub_Paint_PresetWindow.WBP_MachinrCustom_Sub_Paint_PresetWindow_C.SetItems
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems final
{
public:
	TArray<struct FST_ColorPresetSelectPageItemData> InItemDataList;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ColorPresetSelectPageItemData      CallFunc_Array_Get_Item;                           // 0x0028(0x0058)(HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachinrCustom_Sub_Paint_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachinrCustom_Sub_Paint_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon_1; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems) == 0x000008, "Wrong alignment on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems");
static_assert(sizeof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems) == 0x0000E0, "Wrong size on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, InItemDataList) == 0x000000, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::InItemDataList' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, CallFunc_GetAllChildren_ReturnValue) == 0x000080, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, CallFunc_GetAllChildren_ReturnValue_1) == 0x000090, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, CallFunc_Array_Get_Item_2) == 0x0000A8, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon) == 0x0000B0, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon_1) == 0x0000C0, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon_1' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, CallFunc_Array_Length_ReturnValue_1) == 0x0000CC, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, Temp_int_Loop_Counter_Variable_1) == 0x0000D0, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D5, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D8, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItems::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_MachinrCustom_Sub_Paint_PresetWindow.WBP_MachinrCustom_Sub_Paint_PresetWindow_C.SetItemsPlayerIndex
// 0x0048 (0x0048 - 0x0000)
struct WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex final
{
public:
	int32                                         InPlayerIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachinrCustom_Sub_Paint_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex) == 0x000008, "Wrong alignment on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex");
static_assert(sizeof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex) == 0x000048, "Wrong size on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex, InPlayerIndex) == 0x000000, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex::InPlayerIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex, K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon) == 0x000038, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex::K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetItemsPlayerIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_MachinrCustom_Sub_Paint_PresetWindow.WBP_MachinrCustom_Sub_Paint_PresetWindow_C.SetupItems
// 0x0060 (0x0060 - 0x0000)
struct WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems final
{
public:
	class UWBP_MachinrCustom_Sub_Paint_PresetIcon_C* Icon;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;          // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachinrCustom_Sub_Paint_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machinr_Custom_Sub_Paint_Preset_Icon; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems) == 0x000008, "Wrong alignment on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems");
static_assert(sizeof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems) == 0x000060, "Wrong size on WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems, Icon) == 0x000000, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems::Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_MachinrCustom_Sub_Paint_PresetWindow_C_SetupItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
