#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClassSelect_Sub_Complete

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ClassSelect_Sub_Complete.WBP_ClassSelect_Sub_Complete_C.SetCompleteCount
// 0x0018 (0x0018 - 0x0000)
struct WBP_ClassSelect_Sub_Complete_C_SetCompleteCount final
{
public:
	int32                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
static_assert(alignof(WBP_ClassSelect_Sub_Complete_C_SetCompleteCount) == 0x000008, "Wrong alignment on WBP_ClassSelect_Sub_Complete_C_SetCompleteCount");
static_assert(sizeof(WBP_ClassSelect_Sub_Complete_C_SetCompleteCount) == 0x000018, "Wrong size on WBP_ClassSelect_Sub_Complete_C_SetCompleteCount");
static_assert(offsetof(WBP_ClassSelect_Sub_Complete_C_SetCompleteCount, Current) == 0x000000, "Member 'WBP_ClassSelect_Sub_Complete_C_SetCompleteCount::Current' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Complete_C_SetCompleteCount, Max) == 0x000004, "Member 'WBP_ClassSelect_Sub_Complete_C_SetCompleteCount::Max' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_Sub_Complete_C_SetCompleteCount, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_ClassSelect_Sub_Complete_C_SetCompleteCount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

