#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusInfo_Sub_Ranking_Friend

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatusInfo_Sub_Ranking_Friend.WBP_StatusInfo_Sub_Ranking_Friend_C
// 0x00F8 (0x04B8 - 0x03C0)
class UWBP_StatusInfo_Sub_Ranking_Friend_C final : public UEventInfoRanking
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 base_1;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 base_2;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_UV_01;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_UV_02;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_UV_Arc;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnBase;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Left;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Right;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_ErrorText;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Platform;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_RankingName;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_RankingTable_C*     WBP_StatusInfo_Sub_RankingTable_10;                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_RankingTable_C*     WBP_StatusInfo_Sub_RankingTable_11;                // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_RankingTable_C*     WBP_StatusInfo_Sub_RankingTable_12;                // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_RankingTable_C*     WBP_StatusInfo_Sub_RankingTable_01;                // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_RankingTable_C*     WBP_StatusInfo_Sub_RankingTable_02;                // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_RankingTable_C*     WBP_StatusInfo_Sub_RankingTable_03;                // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_RankingTable_C*     WBP_StatusInfo_Sub_RankingTable_04;                // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_RankingTable_C*     WBP_StatusInfo_Sub_RankingTable_05;                // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_RankingTable_C*     WBP_StatusInfo_Sub_RankingTable_06;                // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_RankingTable_C*     WBP_StatusInfo_Sub_RankingTable_07;                // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_RankingTable_C*     WBP_StatusInfo_Sub_RankingTable_08;                // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_RankingTable_C*     WBP_StatusInfo_Sub_RankingTable_09;                // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_System_Sub_LoadingSonic_C*         WBP_System_Sub_LoadingSonic;                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              FriendRankClickDispatcher;                         // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void DisplayCrossplayOffMessage();
	void DisplayErrorMessage();
	void DisplayLoading();
	void DisplayNoRankingMessage();
	void DisplayRanking();
	void DisplayRankingCalcMessage();
	void DisplayRankingPrivilegeError();
	void ExecuteUbergraph_WBP_StatusInfo_Sub_Ranking_Friend(int32 EntryPoint);
	void MouseClickEvent();
	void SetPlatformButtonVisible(bool IsVisible_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatusInfo_Sub_Ranking_Friend_C">();
	}
	static class UWBP_StatusInfo_Sub_Ranking_Friend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatusInfo_Sub_Ranking_Friend_C>();
	}
};
static_assert(alignof(UWBP_StatusInfo_Sub_Ranking_Friend_C) == 0x000008, "Wrong alignment on UWBP_StatusInfo_Sub_Ranking_Friend_C");
static_assert(sizeof(UWBP_StatusInfo_Sub_Ranking_Friend_C) == 0x0004B8, "Wrong size on UWBP_StatusInfo_Sub_Ranking_Friend_C");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, UberGraphFrame) == 0x0003C0, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, base) == 0x0003C8, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, base_1) == 0x0003D0, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::base_1' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, base_2) == 0x0003D8, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::base_2' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, BG_UV_01) == 0x0003E0, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::BG_UV_01' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, BG_UV_02) == 0x0003E8, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::BG_UV_02' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, BG_UV_Arc) == 0x0003F0, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::BG_UV_Arc' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, BtnBase) == 0x0003F8, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::BtnBase' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, MouseInteraction) == 0x000400, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, Overlay_0) == 0x000408, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, RaceFlag_Left) == 0x000410, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::RaceFlag_Left' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, RaceFlag_Right) == 0x000418, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::RaceFlag_Right' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, TXT_ErrorText) == 0x000420, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::TXT_ErrorText' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, TXT_Platform) == 0x000428, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::TXT_Platform' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, TXT_RankingName) == 0x000430, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::TXT_RankingName' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_CMN_ControllerBtn) == 0x000438, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_CMN_ControllerBtn' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_StatusInfo_Sub_RankingTable_10) == 0x000440, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_StatusInfo_Sub_RankingTable_10' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_StatusInfo_Sub_RankingTable_11) == 0x000448, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_StatusInfo_Sub_RankingTable_11' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_StatusInfo_Sub_RankingTable_12) == 0x000450, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_StatusInfo_Sub_RankingTable_12' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_StatusInfo_Sub_RankingTable_01) == 0x000458, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_StatusInfo_Sub_RankingTable_01' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_StatusInfo_Sub_RankingTable_02) == 0x000460, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_StatusInfo_Sub_RankingTable_02' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_StatusInfo_Sub_RankingTable_03) == 0x000468, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_StatusInfo_Sub_RankingTable_03' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_StatusInfo_Sub_RankingTable_04) == 0x000470, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_StatusInfo_Sub_RankingTable_04' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_StatusInfo_Sub_RankingTable_05) == 0x000478, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_StatusInfo_Sub_RankingTable_05' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_StatusInfo_Sub_RankingTable_06) == 0x000480, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_StatusInfo_Sub_RankingTable_06' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_StatusInfo_Sub_RankingTable_07) == 0x000488, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_StatusInfo_Sub_RankingTable_07' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_StatusInfo_Sub_RankingTable_08) == 0x000490, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_StatusInfo_Sub_RankingTable_08' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_StatusInfo_Sub_RankingTable_09) == 0x000498, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_StatusInfo_Sub_RankingTable_09' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, WBP_System_Sub_LoadingSonic) == 0x0004A0, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::WBP_System_Sub_LoadingSonic' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_Ranking_Friend_C, FriendRankClickDispatcher) == 0x0004A8, "Member 'UWBP_StatusInfo_Sub_Ranking_Friend_C::FriendRankClickDispatcher' has a wrong offset!");

}

