#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_Sub_RankingTable

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TimeTrial_Sub_RankingTable.WBP_TimeTrial_Sub_RankingTable_C
// 0x0020 (0x0560 - 0x0540)
class UWBP_TimeTrial_Sub_RankingTable_C final : public URankingLine
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Cursor;                                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_TimeTrial_Sub_RankingTable(int32 EntryPoint);
	class UButton* GetMouseButton();
	void UpdateByRankingModeType();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TimeTrial_Sub_RankingTable_C">();
	}
	static class UWBP_TimeTrial_Sub_RankingTable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TimeTrial_Sub_RankingTable_C>();
	}
};
static_assert(alignof(UWBP_TimeTrial_Sub_RankingTable_C) == 0x000008, "Wrong alignment on UWBP_TimeTrial_Sub_RankingTable_C");
static_assert(sizeof(UWBP_TimeTrial_Sub_RankingTable_C) == 0x000560, "Wrong size on UWBP_TimeTrial_Sub_RankingTable_C");
static_assert(offsetof(UWBP_TimeTrial_Sub_RankingTable_C, UberGraphFrame) == 0x000540, "Member 'UWBP_TimeTrial_Sub_RankingTable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_RankingTable_C, base) == 0x000548, "Member 'UWBP_TimeTrial_Sub_RankingTable_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_RankingTable_C, Base_Cursor) == 0x000550, "Member 'UWBP_TimeTrial_Sub_RankingTable_C::Base_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_RankingTable_C, MouseInteraction) == 0x000558, "Member 'UWBP_TimeTrial_Sub_RankingTable_C::MouseInteraction' has a wrong offset!");

}

