#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PrivateMatch_Popup

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PrivateMatch_Popup.WBP_PrivateMatch_Popup_C.ExecuteUbergraph_WBP_PrivateMatch_Popup
// 0x0340 (0x0340 - 0x0000)
struct WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_27;             // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_26;             // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_25;             // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_24;             // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_23;             // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_22;             // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_21;             // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_20;             // 0x0034(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_19;             // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_18;             // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_17;             // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_16;             // 0x0044(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_15;             // 0x0048(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_14;             // 0x004C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Value_3;                              // 0x0050(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Value_2;                              // 0x0060(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_13;             // 0x0070(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_12;             // 0x0074(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_11;             // 0x0078(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_10;             // 0x007C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_9;              // 0x0080(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_8;              // 0x0084(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_7;              // 0x0088(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_Value_1;                              // 0x0090(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Value;                                // 0x00A0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_6;              // 0x00B0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_5;              // 0x00B4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_4;              // 0x00B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_3;              // 0x00BC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_2;              // 0x00C0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_1;              // 0x00C4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex;                // 0x00C8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOnce;                                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SwitcherIndex_2;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInAnim_1;                            // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bGetOutAnimCallback_1;                // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInAnim;                              // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7[0x1];                                       // 0x00D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SwitcherIndex_1;                      // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ButtonIndex;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SwitcherIndex;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_GetButton_Button;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetButton_Button_1;                       // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUnionUIButtonBase*>             K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   CallFunc_SetupButtonsPanel_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetButton_Button_2;                       // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetButton_Button_3;                       // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue_1;            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUnionUIButtonBase*>             K2Node_MakeArray_Array_1;                          // 0x0140(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   CallFunc_SetupButtonsPanel_ReturnValue_1;          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bGetOutAnimCallback;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_1;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0198(0x0004)()
	bool                                          K2Node_Event_bJoin_1;                              // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bJoin;                                // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19E[0x2];                                      // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_1;       // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUnionUIButtonsPanel*>           K2Node_MakeArray_Array_2;                          // 0x01C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              K2Node_CustomEvent_ButtonFocusType;                // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUnionUIButtonBase*>             CallFunc_GetActiveWidgetButtons_Buttons;           // 0x01D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item;                           // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x020C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   CallFunc_Array_Get_Item_1;                         // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue;           // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_GetButton_ReturnValue;                    // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetButton_ReturnValue_1;                  // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0284(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0298(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x02A0(0x0004)()
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUnionUIButtonBase*>             CallFunc_GetActiveWidgetButtons_Buttons_1;         // 0x02A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_5; // 0x02B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_Array_Get_Item_2;                         // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_6; // 0x02D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   K2Node_Select_Default;                             // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   K2Node_CustomEvent_ButtonsPanel;                   // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_7; // 0x02F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   K2Node_Select_Default_1;                           // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_8; // 0x0310(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   K2Node_Select_Default_2;                           // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup) == 0x000008, "Wrong alignment on WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup");
static_assert(sizeof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup) == 0x000340, "Wrong size on WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, EntryPoint) == 0x000000, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_27) == 0x000018, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_27' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_26) == 0x00001C, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_26' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_25) == 0x000020, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_25' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_24) == 0x000024, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_24' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_23) == 0x000028, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_23' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_22) == 0x00002C, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_22' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_21) == 0x000030, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_21' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_20) == 0x000034, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_20' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_19) == 0x000038, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_19' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_18) == 0x00003C, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_18' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_17) == 0x000040, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_17' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_16) == 0x000044, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_16' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_15) == 0x000048, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_15' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_14) == 0x00004C, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_14' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_Value_3) == 0x000050, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_Value_2) == 0x000060, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_13) == 0x000070, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_13' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_12) == 0x000074, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_12' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_11) == 0x000078, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_11' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_10) == 0x00007C, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_10' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_9) == 0x000080, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_9' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_8) == 0x000084, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_8' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_7) == 0x000088, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_7' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_Value_1) == 0x000090, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_Value) == 0x0000A0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_6) == 0x0000B0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_6' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_5) == 0x0000B4, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_5' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_4) == 0x0000B8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_4' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_3) == 0x0000BC, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_3' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_2) == 0x0000C0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex_1) == 0x0000C4, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_PlayerControllerIndex) == 0x0000C8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_bOnce) == 0x0000CC, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_bOnce' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_SwitcherIndex_2) == 0x0000D0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_SwitcherIndex_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_bInAnim_1) == 0x0000D4, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_bInAnim_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_bGetOutAnimCallback_1) == 0x0000D5, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_bGetOutAnimCallback_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_bInAnim) == 0x0000D6, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_bInAnim' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_SwitcherIndex_1) == 0x0000D8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_SwitcherIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_ButtonIndex) == 0x0000DC, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_SwitcherIndex) == 0x0000E0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_SwitcherIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Less_IntInt_ReturnValue) == 0x0000E4, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_GetButton_Button) == 0x0000E8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_GetButton_Button' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_GetButton_Button_1) == 0x0000F0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_GetButton_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_MakeArray_Array) == 0x0000F8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_MakeLiteralInt_ReturnValue) == 0x000108, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_MakeLiteralBool_ReturnValue) == 0x00010C, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, Temp_int_Loop_Counter_Variable) == 0x000110, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_SetupButtonsPanel_ReturnValue) == 0x000118, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_SetupButtonsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Add_IntInt_ReturnValue) == 0x000120, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000124, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_GetButton_Button_2) == 0x000128, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_GetButton_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_GetButton_Button_3) == 0x000130, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_GetButton_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_MakeLiteralBool_ReturnValue_1) == 0x000138, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_MakeLiteralBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_MakeArray_Array_1) == 0x000140, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, Temp_int_Array_Index_Variable_1) == 0x000150, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_SetupButtonsPanel_ReturnValue_1) == 0x000158, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_SetupButtonsPanel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, Temp_int_Variable) == 0x000160, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_bGetOutAnimCallback) == 0x000164, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_bGetOutAnimCallback' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_PlayAnimation_ReturnValue) == 0x000168, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, Temp_int_Variable_1) == 0x000170, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_PlayAnimation_ReturnValue_1) == 0x000178, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_PlayAnimation_ReturnValue_2) == 0x000180, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CustomEvent_Button_1) == 0x000188, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CustomEvent_ButtonIndex_1) == 0x000190, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CustomEvent_ButtonIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000194, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_SoundPlay_ReturnValue) == 0x000198, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_bJoin_1) == 0x00019C, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_bJoin_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Event_bJoin) == 0x00019D, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Event_bJoin' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, Temp_int_Loop_Counter_Variable_1) == 0x0001A0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001A4, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CustomEvent_Button) == 0x0001A8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CustomEvent_ButtonIndex) == 0x0001B0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, Temp_int_Variable_2) == 0x0001B4, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_GetActiveWidgetIndex_ReturnValue_1) == 0x0001B8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_GetActiveWidgetIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_MakeArray_Array_2) == 0x0001C0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Array_Length_ReturnValue) == 0x0001D0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CustomEvent_ButtonFocusType) == 0x0001D4, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CustomEvent_ButtonFocusType' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_GetActiveWidgetButtons_Buttons) == 0x0001D8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_GetActiveWidgetButtons_Buttons' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001E8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Array_Get_Item) == 0x0001F8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Array_Length_ReturnValue_1) == 0x000200, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Less_IntInt_ReturnValue_1) == 0x000204, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, Temp_int_Array_Index_Variable_2) == 0x000208, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CreateDelegate_OutputDelegate_2) == 0x00020C, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Array_Get_Item_1) == 0x000220, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000228, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_GetPlayerController_ReturnValue) == 0x000230, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_GetPlayerController_ReturnValue_1) == 0x000238, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000240, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_DynamicCast_bSuccess) == 0x000248, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x000250, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_DynamicCast_bSuccess_1) == 0x000258, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_UnregisterMainMenu_ReturnValue) == 0x000259, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_UnregisterMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_GetButton_ReturnValue) == 0x000260, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_GetButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_GetButton_ReturnValue_1) == 0x000268, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_GetButton_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CreateDelegate_OutputDelegate_3) == 0x000270, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000280, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CreateDelegate_OutputDelegate_4) == 0x000284, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000298, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_SoundPlay_ReturnValue_1) == 0x0002A0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_GetActiveWidgetButtons_Buttons_1) == 0x0002A8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_GetActiveWidgetButtons_Buttons_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002B8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Array_Get_Item_2) == 0x0002C8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Array_Length_ReturnValue_2) == 0x0002D0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002D4, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CreateDelegate_OutputDelegate_6) == 0x0002D8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Select_Default) == 0x0002E8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CustomEvent_ButtonsPanel) == 0x0002F0, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CustomEvent_ButtonsPanel' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CreateDelegate_OutputDelegate_7) == 0x0002F8, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Select_Default_1) == 0x000308, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_CreateDelegate_OutputDelegate_8) == 0x000310, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, Temp_int_Loop_Counter_Variable_2) == 0x000320, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Less_IntInt_ReturnValue_3) == 0x000324, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_Add_IntInt_ReturnValue_2) == 0x000328, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, K2Node_Select_Default_2) == 0x000330, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000338, "Member 'WBP_PrivateMatch_Popup_C_ExecuteUbergraph_WBP_PrivateMatch_Popup::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_PrivateMatch_Popup.WBP_PrivateMatch_Popup_C.GetActiveWidgetButton
// 0x0018 (0x0018 - 0x0000)
struct WBP_PrivateMatch_Popup_C_GetActiveWidgetButton final
{
public:
	int32                                         ButtonIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     CallFunc_GetActiveWidgetButton_Button;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PrivateMatch_Popup_C_GetActiveWidgetButton) == 0x000008, "Wrong alignment on WBP_PrivateMatch_Popup_C_GetActiveWidgetButton");
static_assert(sizeof(WBP_PrivateMatch_Popup_C_GetActiveWidgetButton) == 0x000018, "Wrong size on WBP_PrivateMatch_Popup_C_GetActiveWidgetButton");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_GetActiveWidgetButton, ButtonIndex) == 0x000000, "Member 'WBP_PrivateMatch_Popup_C_GetActiveWidgetButton::ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PrivateMatch_Popup_C_GetActiveWidgetButton, ReturnValue) == 0x000008, "Member 'WBP_PrivateMatch_Popup_C_GetActiveWidgetButton::ReturnValue' has a wrong offset!");
