#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClassSelect_Sub_TimeTrial_Medal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ClassSelect_Sub_TimeTrial_Medal.WBP_ClassSelect_Sub_TimeTrial_Medal_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_ClassSelect_Sub_TimeTrial_Medal_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                PAT_Achievement_TimeAttack;                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Eff_Achievement_TimeAttack;                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Get_Num_Normal;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Total_Num_Normal;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ClassSelect_Sub_TimeTrial_Medal(int32 EntryPoint);
	void SetTimeTrialDLCMedalCount(int32 DLCMedalCount, int32 DLCMedalMax);
	void SetTimeTrialMedalCount(int32 NormalMedalCount, int32 NormalMedalMax);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ClassSelect_Sub_TimeTrial_Medal_C">();
	}
	static class UWBP_ClassSelect_Sub_TimeTrial_Medal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ClassSelect_Sub_TimeTrial_Medal_C>();
	}
};
static_assert(alignof(UWBP_ClassSelect_Sub_TimeTrial_Medal_C) == 0x000008, "Wrong alignment on UWBP_ClassSelect_Sub_TimeTrial_Medal_C");
static_assert(sizeof(UWBP_ClassSelect_Sub_TimeTrial_Medal_C) == 0x000310, "Wrong size on UWBP_ClassSelect_Sub_TimeTrial_Medal_C");
static_assert(offsetof(UWBP_ClassSelect_Sub_TimeTrial_Medal_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ClassSelect_Sub_TimeTrial_Medal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_Sub_TimeTrial_Medal_C, PAT_Achievement_TimeAttack) == 0x0002E8, "Member 'UWBP_ClassSelect_Sub_TimeTrial_Medal_C::PAT_Achievement_TimeAttack' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_Sub_TimeTrial_Medal_C, PAT_Eff_Achievement_TimeAttack) == 0x0002F0, "Member 'UWBP_ClassSelect_Sub_TimeTrial_Medal_C::PAT_Eff_Achievement_TimeAttack' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_Sub_TimeTrial_Medal_C, Plate) == 0x0002F8, "Member 'UWBP_ClassSelect_Sub_TimeTrial_Medal_C::Plate' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_Sub_TimeTrial_Medal_C, TXT_Get_Num_Normal) == 0x000300, "Member 'UWBP_ClassSelect_Sub_TimeTrial_Medal_C::TXT_Get_Num_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSelect_Sub_TimeTrial_Medal_C, TXT_Total_Num_Normal) == 0x000308, "Member 'UWBP_ClassSelect_Sub_TimeTrial_Medal_C::TXT_Total_Num_Normal' has a wrong offset!");

}

