#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ResultRate_Sub_Rate_Window

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ResultRate_Sub_Rate_Window.WBP_ResultRate_Sub_Rate_Window_C.AddBonusImpl
// 0x0010 (0x0010 - 0x0000)
struct WBP_ResultRate_Sub_Rate_Window_C_AddBonusImpl final
{
public:
	struct FRateRankBonusList                     BonusList;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ResultRate_Sub_Rate_Window_C_AddBonusImpl) == 0x000008, "Wrong alignment on WBP_ResultRate_Sub_Rate_Window_C_AddBonusImpl");
static_assert(sizeof(WBP_ResultRate_Sub_Rate_Window_C_AddBonusImpl) == 0x000010, "Wrong size on WBP_ResultRate_Sub_Rate_Window_C_AddBonusImpl");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_AddBonusImpl, BonusList) == 0x000000, "Member 'WBP_ResultRate_Sub_Rate_Window_C_AddBonusImpl::BonusList' has a wrong offset!");

// Function WBP_ResultRate_Sub_Rate_Window.WBP_ResultRate_Sub_Rate_Window_C.AddGaugeImpl
// 0x0020 (0x0020 - 0x0000)
struct WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl final
{
public:
	double                                        AddGauge_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRankUpGaugeSpeed_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl) == 0x000008, "Wrong alignment on WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl");
static_assert(sizeof(WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl) == 0x000020, "Wrong size on WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl, AddGauge_0) == 0x000000, "Member 'WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl::AddGauge_0' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl, CallFunc_GetRankUpGaugeSpeed_ReturnValue) == 0x000008, "Member 'WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl::CallFunc_GetRankUpGaugeSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00000C, "Member 'WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'WBP_ResultRate_Sub_Rate_Window_C_AddGaugeImpl::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_ResultRate_Sub_Rate_Window.WBP_ResultRate_Sub_Rate_Window_C.ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0008(0x0004)()
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_NowRate;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERateRank                                     K2Node_CustomEvent_DrawRank;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERateRank                                     K2Node_CustomEvent_RateRank;                       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsGetReward;                   // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRewardGetWindowParam>          CallFunc_GetRateRewardParamList_ReturnValue;       // 0x0068(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERateRank                                     CallFunc_GetRateRankBack_ReturnValue;              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGaugePointResult                      CallFunc_GetGaugePointUpOrDown_ReturnValue;        // 0x0084(0x000C)(NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0098(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00A8(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x00C0(0x0004)()
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x00C8(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_3;                  // 0x00CC(0x0004)()
	struct FSoundHandle                           CallFunc_Stop_ReturnValue;                         // 0x00D0(0x0004)()
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_FFloor64_ReturnValue;                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRankUp;                        // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ResultRate_Sub_RankUp_Window_C*    CallFunc_Create_ReturnValue;                       // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select_Default;                             // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x1];                                       // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bRankUp)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRateRankBonus                         CallFunc_GetRatePromotionBonus_ReturnValue;        // 0x0108(0x0018)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERateRank                                     CallFunc_GetRateToRank_ReturnValue;                // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRateRankBonus>                 K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm)
	struct FRateRankBonusList                     K2Node_MakeStruct_RateRankBonusList;               // 0x0140(0x0010)()
	class UWBP_ItemGet_Display_C*                 CallFunc_Create_ReturnValue_1;                     // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_4;                  // 0x0158(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_5;                  // 0x015C(0x0004)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERateRank                                     CallFunc_GetRateToRank_ReturnValue_1;              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGaugePointUpOrDown_Now_ImplicitCast;   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugePointUpOrDown_RemainAdd_ImplicitCast; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugePointUpOrDown_High_ImplicitCast;  // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugePointUpOrDown_Low_ImplicitCast;   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGaugePointUpOrDown_Speed_ImplicitCast; // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_NowRate_ImplicitCast;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateRate_NowRate_ImplicitCast;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateRate_NowRate_ImplicitCast_1;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_AddGauge_ImplicitCast;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window) == 0x000008, "Wrong alignment on WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window");
static_assert(sizeof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window) == 0x0001B0, "Wrong size on WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, EntryPoint) == 0x000000, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000004, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_SoundPlay_ReturnValue) == 0x000008, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_CustomEvent_NowRate) == 0x000010, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_CustomEvent_NowRate' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_CustomEvent_DrawRank) == 0x000018, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_CustomEvent_DrawRank' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_Event_MyGeometry) == 0x000028, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_Event_InDeltaTime) == 0x000060, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_CustomEvent_RateRank) == 0x000064, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_CustomEvent_RateRank' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_CustomEvent_bIsGetReward) == 0x000065, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_CustomEvent_bIsGetReward' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetRateRewardParamList_ReturnValue) == 0x000068, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetRateRewardParamList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_Greater_IntInt_ReturnValue) == 0x000080, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000081, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetRateRankBack_ReturnValue) == 0x000082, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetRateRankBack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetGaugePointUpOrDown_ReturnValue) == 0x000084, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetGaugePointUpOrDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_SwitchInteger_CmpSuccess) == 0x000090, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_MakeLiteralText_ReturnValue) == 0x000098, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000A8, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetPlayerController_ReturnValue) == 0x0000B8, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_SoundPlay_ReturnValue_1) == 0x0000C0, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000C4, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_SoundPlay_ReturnValue_2) == 0x0000C8, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_SoundPlay_ReturnValue_3) == 0x0000CC, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_SoundPlay_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_Stop_ReturnValue) == 0x0000D0, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_FFloor64_ReturnValue) == 0x0000D8, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_FFloor64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x0000E0, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000E1, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_CustomEvent_bRankUp) == 0x0000E2, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_CustomEvent_bRankUp' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_Create_ReturnValue) == 0x0000E8, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, Temp_bool_Variable) == 0x0000F0, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_Select_Default) == 0x0000F1, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetValidValue_ReturnValue) == 0x0000F2, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_CreateDelegate_OutputDelegate) == 0x0000F4, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetRatePromotionBonus_ReturnValue) == 0x000108, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetRatePromotionBonus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_FTrunc_ReturnValue) == 0x000120, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000124, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetRateToRank_ReturnValue) == 0x000125, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetRateToRank_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000128, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_MakeArray_Array) == 0x000130, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_MakeStruct_RateRankBonusList) == 0x000140, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_MakeStruct_RateRankBonusList' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_Create_ReturnValue_1) == 0x000150, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_SoundPlay_ReturnValue_4) == 0x000158, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_SoundPlay_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_SoundPlay_ReturnValue_5) == 0x00015C, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_SoundPlay_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_CreateDelegate_OutputDelegate_1) == 0x000160, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000170, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x000171, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_FTrunc_ReturnValue_1) == 0x000174, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetRateToRank_ReturnValue_1) == 0x000178, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetRateToRank_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000179, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetGaugePointUpOrDown_Now_ImplicitCast) == 0x00017C, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetGaugePointUpOrDown_Now_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetGaugePointUpOrDown_RemainAdd_ImplicitCast) == 0x000180, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetGaugePointUpOrDown_RemainAdd_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetGaugePointUpOrDown_High_ImplicitCast) == 0x000184, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetGaugePointUpOrDown_High_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetGaugePointUpOrDown_Low_ImplicitCast) == 0x000188, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetGaugePointUpOrDown_Low_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_GetGaugePointUpOrDown_Speed_ImplicitCast) == 0x00018C, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_GetGaugePointUpOrDown_Speed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_VariableSet_NowRate_ImplicitCast) == 0x000190, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_VariableSet_NowRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_UpdateRate_NowRate_ImplicitCast) == 0x000198, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_UpdateRate_NowRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, CallFunc_UpdateRate_NowRate_ImplicitCast_1) == 0x0001A0, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::CallFunc_UpdateRate_NowRate_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window, K2Node_VariableSet_AddGauge_ImplicitCast) == 0x0001A8, "Member 'WBP_ResultRate_Sub_Rate_Window_C_ExecuteUbergraph_WBP_ResultRate_Sub_Rate_Window::K2Node_VariableSet_AddGauge_ImplicitCast' has a wrong offset!");

// Function WBP_ResultRate_Sub_Rate_Window.WBP_ResultRate_Sub_Rate_Window_C.IsBonusDispEndImpl
// 0x0001 (0x0001 - 0x0000)
struct WBP_ResultRate_Sub_Rate_Window_C_IsBonusDispEndImpl final
{
public:
	bool                                          bIsEnd;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_Rate_Window_C_IsBonusDispEndImpl) == 0x000001, "Wrong alignment on WBP_ResultRate_Sub_Rate_Window_C_IsBonusDispEndImpl");
static_assert(sizeof(WBP_ResultRate_Sub_Rate_Window_C_IsBonusDispEndImpl) == 0x000001, "Wrong size on WBP_ResultRate_Sub_Rate_Window_C_IsBonusDispEndImpl");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_IsBonusDispEndImpl, bIsEnd) == 0x000000, "Member 'WBP_ResultRate_Sub_Rate_Window_C_IsBonusDispEndImpl::bIsEnd' has a wrong offset!");

// Function WBP_ResultRate_Sub_Rate_Window.WBP_ResultRate_Sub_Rate_Window_C.RankUpOrDownEvent_Event
// 0x0001 (0x0001 - 0x0000)
struct WBP_ResultRate_Sub_Rate_Window_C_RankUpOrDownEvent_Event final
{
public:
	bool                                          bRankUp;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_Rate_Window_C_RankUpOrDownEvent_Event) == 0x000001, "Wrong alignment on WBP_ResultRate_Sub_Rate_Window_C_RankUpOrDownEvent_Event");
static_assert(sizeof(WBP_ResultRate_Sub_Rate_Window_C_RankUpOrDownEvent_Event) == 0x000001, "Wrong size on WBP_ResultRate_Sub_Rate_Window_C_RankUpOrDownEvent_Event");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_RankUpOrDownEvent_Event, bRankUp) == 0x000000, "Member 'WBP_ResultRate_Sub_Rate_Window_C_RankUpOrDownEvent_Event::bRankUp' has a wrong offset!");

// Function WBP_ResultRate_Sub_Rate_Window.WBP_ResultRate_Sub_Rate_Window_C.Set Rate Base Impl
// 0x0060 (0x0060 - 0x0000)
struct WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl final
{
public:
	ERateRank                                     RateRank;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NowRate_0;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRewardGetWindowParam>          CallFunc_GetRateRewardParamList_ReturnValue;       // 0x0010(0x0010)(ReferenceParm)
	struct FRateRankUIData                        CallFunc_GetRateRankUIData_ReturnValue;            // 0x0020(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_RateUp_ImplicitCast;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetRateBaseImpl_RateUp_ImplicitCast;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetRateBaseImpl_RateDown_ImplicitCast;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_RateDown_ImplicitCast;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl) == 0x000008, "Wrong alignment on WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl");
static_assert(sizeof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl) == 0x000060, "Wrong size on WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, RateRank) == 0x000000, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::RateRank' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, NowRate_0) == 0x000008, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::NowRate_0' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, CallFunc_GetRateRewardParamList_ReturnValue) == 0x000010, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::CallFunc_GetRateRewardParamList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, CallFunc_GetRateRankUIData_ReturnValue) == 0x000020, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::CallFunc_GetRateRankUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000031, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000032, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000033, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, K2Node_VariableSet_RateUp_ImplicitCast) == 0x000038, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::K2Node_VariableSet_RateUp_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, CallFunc_SetRateBaseImpl_RateUp_ImplicitCast) == 0x000040, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::CallFunc_SetRateBaseImpl_RateUp_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, CallFunc_SetRateBaseImpl_RateDown_ImplicitCast) == 0x000050, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::CallFunc_SetRateBaseImpl_RateDown_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl, K2Node_VariableSet_RateDown_ImplicitCast) == 0x000058, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Set_Rate_Base_Impl::K2Node_VariableSet_RateDown_ImplicitCast' has a wrong offset!");

// Function WBP_ResultRate_Sub_Rate_Window.WBP_ResultRate_Sub_Rate_Window_C.SetNowRateTextImpl
// 0x0008 (0x0008 - 0x0000)
struct WBP_ResultRate_Sub_Rate_Window_C_SetNowRateTextImpl final
{
public:
	double                                        NewLocalVar;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_Rate_Window_C_SetNowRateTextImpl) == 0x000008, "Wrong alignment on WBP_ResultRate_Sub_Rate_Window_C_SetNowRateTextImpl");
static_assert(sizeof(WBP_ResultRate_Sub_Rate_Window_C_SetNowRateTextImpl) == 0x000008, "Wrong size on WBP_ResultRate_Sub_Rate_Window_C_SetNowRateTextImpl");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_SetNowRateTextImpl, NewLocalVar) == 0x000000, "Member 'WBP_ResultRate_Sub_Rate_Window_C_SetNowRateTextImpl::NewLocalVar' has a wrong offset!");

// Function WBP_ResultRate_Sub_Rate_Window.WBP_ResultRate_Sub_Rate_Window_C.SetRankBandRank
// 0x0002 (0x0002 - 0x0000)
struct WBP_ResultRate_Sub_Rate_Window_C_SetRankBandRank final
{
public:
	uint8                                         NowRank;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_Rate_Window_C_SetRankBandRank) == 0x000001, "Wrong alignment on WBP_ResultRate_Sub_Rate_Window_C_SetRankBandRank");
static_assert(sizeof(WBP_ResultRate_Sub_Rate_Window_C_SetRankBandRank) == 0x000002, "Wrong size on WBP_ResultRate_Sub_Rate_Window_C_SetRankBandRank");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_SetRankBandRank, NowRank) == 0x000000, "Member 'WBP_ResultRate_Sub_Rate_Window_C_SetRankBandRank::NowRank' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_SetRankBandRank, CallFunc_GetValidValue_ReturnValue) == 0x000001, "Member 'WBP_ResultRate_Sub_Rate_Window_C_SetRankBandRank::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function WBP_ResultRate_Sub_Rate_Window.WBP_ResultRate_Sub_Rate_Window_C.SetRankUpRewardGetWindow
// 0x0002 (0x0002 - 0x0000)
struct WBP_ResultRate_Sub_Rate_Window_C_SetRankUpRewardGetWindow final
{
public:
	ERateRank                                     RateRank;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsGetReward;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_Rate_Window_C_SetRankUpRewardGetWindow) == 0x000001, "Wrong alignment on WBP_ResultRate_Sub_Rate_Window_C_SetRankUpRewardGetWindow");
static_assert(sizeof(WBP_ResultRate_Sub_Rate_Window_C_SetRankUpRewardGetWindow) == 0x000002, "Wrong size on WBP_ResultRate_Sub_Rate_Window_C_SetRankUpRewardGetWindow");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_SetRankUpRewardGetWindow, RateRank) == 0x000000, "Member 'WBP_ResultRate_Sub_Rate_Window_C_SetRankUpRewardGetWindow::RateRank' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_SetRankUpRewardGetWindow, bIsGetReward) == 0x000001, "Member 'WBP_ResultRate_Sub_Rate_Window_C_SetRankUpRewardGetWindow::bIsGetReward' has a wrong offset!");

// Function WBP_ResultRate_Sub_Rate_Window.WBP_ResultRate_Sub_Rate_Window_C.StartRankBand
// 0x0003 (0x0003 - 0x0000)
struct WBP_ResultRate_Sub_Rate_Window_C_StartRankBand final
{
public:
	uint8                                         NextRank;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRankUp;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_Rate_Window_C_StartRankBand) == 0x000001, "Wrong alignment on WBP_ResultRate_Sub_Rate_Window_C_StartRankBand");
static_assert(sizeof(WBP_ResultRate_Sub_Rate_Window_C_StartRankBand) == 0x000003, "Wrong size on WBP_ResultRate_Sub_Rate_Window_C_StartRankBand");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_StartRankBand, NextRank) == 0x000000, "Member 'WBP_ResultRate_Sub_Rate_Window_C_StartRankBand::NextRank' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_StartRankBand, bRankUp) == 0x000001, "Member 'WBP_ResultRate_Sub_Rate_Window_C_StartRankBand::bRankUp' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_StartRankBand, CallFunc_GetValidValue_ReturnValue) == 0x000002, "Member 'WBP_ResultRate_Sub_Rate_Window_C_StartRankBand::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function WBP_ResultRate_Sub_Rate_Window.WBP_ResultRate_Sub_Rate_Window_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_ResultRate_Sub_Rate_Window_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_Rate_Window_C_Tick) == 0x000004, "Wrong alignment on WBP_ResultRate_Sub_Rate_Window_C_Tick");
static_assert(sizeof(WBP_ResultRate_Sub_Rate_Window_C_Tick) == 0x00003C, "Wrong size on WBP_ResultRate_Sub_Rate_Window_C_Tick");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_ResultRate_Sub_Rate_Window_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_ResultRate_Sub_Rate_Window.WBP_ResultRate_Sub_Rate_Window_C.UpdateRate
// 0x0010 (0x0010 - 0x0000)
struct WBP_ResultRate_Sub_Rate_Window_C_UpdateRate final
{
public:
	double                                        NowRate_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERateRank                                     DrawRank;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ResultRate_Sub_Rate_Window_C_UpdateRate) == 0x000008, "Wrong alignment on WBP_ResultRate_Sub_Rate_Window_C_UpdateRate");
static_assert(sizeof(WBP_ResultRate_Sub_Rate_Window_C_UpdateRate) == 0x000010, "Wrong size on WBP_ResultRate_Sub_Rate_Window_C_UpdateRate");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_UpdateRate, NowRate_0) == 0x000000, "Member 'WBP_ResultRate_Sub_Rate_Window_C_UpdateRate::NowRate_0' has a wrong offset!");
static_assert(offsetof(WBP_ResultRate_Sub_Rate_Window_C_UpdateRate, DrawRank) == 0x000008, "Member 'WBP_ResultRate_Sub_Rate_Window_C_UpdateRate::DrawRank' has a wrong offset!");

}

