#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSelect_Sub_RivalChoice_Btn_Left

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CourseSelect_Sub_RivalChoice_Btn_Left.WBP_CourseSelect_Sub_RivalChoice_Btn_Left_C
// 0x0118 (0x05C8 - 0x04B0)
class UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C final : public UCourseSelectRivalChoiceButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Active_to_Select;                              // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_to_Active;                              // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_Out;                                    // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_Loop;                                   // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_In;                                     // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_Out;                                    // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_Loop;                                   // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_In;                                     // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Active_Cover;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Text_Chara;                                   // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ChoiceButton;                                      // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire_Back;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FireSpark_Bottom;                                  // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FireSpark_Left;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FireSpark_Right;                                   // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow;                                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow_Back;                                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow_In_Inside;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_Grow_01;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_Grow_02;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_Grow_03;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_Grow_04;                                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_Main_01;                                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_Main_02;                                      // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_CharaCut;                                      // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Bonus;                                         // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Chara;                                         // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ItemIcon_C*                    WBP_CMN_ItemIcon;                                  // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_RivalLevel_C*                  WBP_CMN_RivalLevel;                                // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RivalSelect_Sub_Effects_Fire_C*    WBP_RivalSelect_Sub_Effects_Fire;                  // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RivalSelect_Sub_Effects_Fire_HighLevel_C* WBP_RivalSelect_Sub_Effects_Fire_HighLevel; // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCourseSelectRivalChoiceButton*         RivalChooseButton;                                 // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CancelIn();
	void Construct();
	void DecisionIn();
	void ExecuteUbergraph_WBP_CourseSelect_Sub_RivalChoice_Btn_Left(int32 EntryPoint);
	void FocusIn();
	void FocusOut();
	void FocusThis();
	void OnAcceptKeyPressed();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	class UWidget* OnNavigationRight(EUINavigation Navigation_0);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PlayLV();
	void SetupLV(int32 InMaxRivalLevel, int32 InRivalLevel, int32 InBlankIconHideCount, bool bIsRivalPowerFlag);
	void StartInAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CourseSelect_Sub_RivalChoice_Btn_Left_C">();
	}
	static class UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C>();
	}
};
static_assert(alignof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C) == 0x000008, "Wrong alignment on UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C");
static_assert(sizeof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C) == 0x0005C8, "Wrong size on UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, UberGraphFrame) == 0x0004B0, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Btn_Active_to_Select) == 0x0004B8, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Btn_Active_to_Select' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Btn_Select_to_Active) == 0x0004C0, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Btn_Select_to_Active' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Btn_Active_Out) == 0x0004C8, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Btn_Active_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Btn_Active_Loop) == 0x0004D0, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Btn_Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Btn_Active_In) == 0x0004D8, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Btn_Active_In' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Btn_Select_Out) == 0x0004E0, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Btn_Select_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Btn_Select_Loop) == 0x0004E8, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Btn_Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Btn_Select_In) == 0x0004F0, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Btn_Select_In' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Active_Cover) == 0x0004F8, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Active_Cover' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Arrow) == 0x000500, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Base_Text_Chara) == 0x000508, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Base_Text_Chara' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, BG) == 0x000510, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, ChoiceButton) == 0x000518, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::ChoiceButton' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Fire_Back) == 0x000520, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Fire_Back' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, FireSpark_Bottom) == 0x000528, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::FireSpark_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, FireSpark_Left) == 0x000530, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::FireSpark_Left' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, FireSpark_Right) == 0x000538, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::FireSpark_Right' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Grow) == 0x000540, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Grow' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Grow_Back) == 0x000548, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Grow_Back' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Grow_In_Inside) == 0x000550, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Grow_In_Inside' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Line_Grow_01) == 0x000558, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Line_Grow_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Line_Grow_02) == 0x000560, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Line_Grow_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Line_Grow_03) == 0x000568, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Line_Grow_03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Line_Grow_04) == 0x000570, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Line_Grow_04' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Line_Main_01) == 0x000578, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Line_Main_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, Line_Main_02) == 0x000580, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::Line_Main_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, PAT_CharaCut) == 0x000588, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::PAT_CharaCut' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, TXT_Bonus) == 0x000590, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::TXT_Bonus' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, TXT_Chara) == 0x000598, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::TXT_Chara' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, WBP_CMN_ItemIcon) == 0x0005A0, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::WBP_CMN_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, WBP_CMN_RivalLevel) == 0x0005A8, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::WBP_CMN_RivalLevel' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, WBP_RivalSelect_Sub_Effects_Fire) == 0x0005B0, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::WBP_RivalSelect_Sub_Effects_Fire' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, WBP_RivalSelect_Sub_Effects_Fire_HighLevel) == 0x0005B8, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::WBP_RivalSelect_Sub_Effects_Fire_HighLevel' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C, RivalChooseButton) == 0x0005C0, "Member 'UWBP_CourseSelect_Sub_RivalChoice_Btn_Left_C::RivalChooseButton' has a wrong offset!");

}

