#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_Sub_BtnPlay_Online

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TimeTrial_Sub_BtnPlay_Online.WBP_TimeTrial_Sub_BtnPlay_Online_C
// 0x0048 (0x0530 - 0x04E8)
class UWBP_TimeTrial_Sub_BtnPlay_Online_C final : public UTopMenuPlayModeButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Active_Out;                                    // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_NonActive_Loop;                                // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_Left_02;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Right_02;                                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corsor;                                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlagWave;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_BtnTitle;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TimeTrial_Sub_BtnPlay_Online(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnFocusLostImpl(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInitialize();
	void OnLeftKeyPressed();
	void SetLock(bool Locking);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TimeTrial_Sub_BtnPlay_Online_C">();
	}
	static class UWBP_TimeTrial_Sub_BtnPlay_Online_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TimeTrial_Sub_BtnPlay_Online_C>();
	}
};
static_assert(alignof(UWBP_TimeTrial_Sub_BtnPlay_Online_C) == 0x000008, "Wrong alignment on UWBP_TimeTrial_Sub_BtnPlay_Online_C");
static_assert(sizeof(UWBP_TimeTrial_Sub_BtnPlay_Online_C) == 0x000530, "Wrong size on UWBP_TimeTrial_Sub_BtnPlay_Online_C");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Online_C, UberGraphFrame) == 0x0004E8, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Online_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Online_C, Btn_Active_Out) == 0x0004F0, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Online_C::Btn_Active_Out' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Online_C, Btn_NonActive_Loop) == 0x0004F8, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Online_C::Btn_NonActive_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Online_C, Arrow_Left_02) == 0x000500, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Online_C::Arrow_Left_02' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Online_C, Arrow_Right_02) == 0x000508, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Online_C::Arrow_Right_02' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Online_C, Corsor) == 0x000510, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Online_C::Corsor' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Online_C, MouseInteraction) == 0x000518, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Online_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Online_C, RaceFlagWave) == 0x000520, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Online_C::RaceFlagWave' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_Sub_BtnPlay_Online_C, TXT_BtnTitle) == 0x000528, "Member 'UWBP_TimeTrial_Sub_BtnPlay_Online_C::TXT_BtnTitle' has a wrong offset!");

}

