#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01.WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C.Fixed Display
// 0x0001 (0x0001 - 0x0000)
struct WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_Fixed_Display final
{
public:
	bool                                          Fixed;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_Fixed_Display) == 0x000001, "Wrong alignment on WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_Fixed_Display");
static_assert(sizeof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_Fixed_Display) == 0x000001, "Wrong size on WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_Fixed_Display");
static_assert(offsetof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_Fixed_Display, Fixed) == 0x000000, "Member 'WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_Fixed_Display::Fixed' has a wrong offset!");

// Function WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01.WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C.StartAnimation
// 0x0018 (0x0018 - 0x0000)
struct WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation final
{
public:
	bool                                          Normal;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Sp;                                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation) == 0x000008, "Wrong alignment on WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation");
static_assert(sizeof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation) == 0x000018, "Wrong size on WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation");
static_assert(offsetof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation, Normal) == 0x000000, "Member 'WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation::Normal' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation, Sp) == 0x000001, "Member 'WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation::Sp' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_HeaderMenu_Sub_Rule_TimeTable_Plan_01_C_StartAnimation::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

