#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyRace_Sub_MenuBtn

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyRace_Sub_MenuBtn.WBP_PartyRace_Sub_MenuBtn_C
// 0x0070 (0x0548 - 0x04D8)
class UWBP_PartyRace_Sub_MenuBtn_C final : public UPartyRaceSubMenuBtn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Btn_Arrow_Left;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_Arrow_Right;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_GrayTop;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseFocusButton;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyRace_Cursor;                                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_BtnPict;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        AnimationTime;                                     // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDecided;                                          // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPresetInfoButtonPressed;                         // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnStartCustomButtonPressed;                        // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_PartyRace_Sub_MenuBtn(int32 EntryPoint);
	void FocusOpen();
	void OnAcceptKeyPressed();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnBackKeyPressed();
	void OnDecideMode();
	void OnFaceButtonLeftPressed();
	void OnFaceButtonTopPressed();
	void OnFocusAnimFinished();
	void OnFocusAnimStart();
	void OnFocusImpl();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnLeftKeyPressed();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRightKeyPressed();
	void OnUnFocusAnimFinished();
	void OnUnFocusAnimStart();
	void PreConstruct(bool IsDesignTime);
	void ReturnAnim();
	void SetButtonArrowVisible(bool bVisible);
	void WidgetAnimationEvt_Btn_Active_Loop_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_Btn_Active_to_select_K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_Btn_Select_Loop_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_Btn_Select_to_Active_K2Node_WidgetAnimationEvent_3();
	void WidgetAnimationEvt_Btn_Select_to_Active_K2Node_WidgetAnimationEvent_4();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyRace_Sub_MenuBtn_C">();
	}
	static class UWBP_PartyRace_Sub_MenuBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyRace_Sub_MenuBtn_C>();
	}
};
static_assert(alignof(UWBP_PartyRace_Sub_MenuBtn_C) == 0x000008, "Wrong alignment on UWBP_PartyRace_Sub_MenuBtn_C");
static_assert(sizeof(UWBP_PartyRace_Sub_MenuBtn_C) == 0x000548, "Wrong size on UWBP_PartyRace_Sub_MenuBtn_C");
static_assert(offsetof(UWBP_PartyRace_Sub_MenuBtn_C, UberGraphFrame) == 0x0004D8, "Member 'UWBP_PartyRace_Sub_MenuBtn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_MenuBtn_C, Btn_Arrow_Left) == 0x0004E0, "Member 'UWBP_PartyRace_Sub_MenuBtn_C::Btn_Arrow_Left' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_MenuBtn_C, Btn_Arrow_Right) == 0x0004E8, "Member 'UWBP_PartyRace_Sub_MenuBtn_C::Btn_Arrow_Right' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_MenuBtn_C, Image_GrayTop) == 0x0004F0, "Member 'UWBP_PartyRace_Sub_MenuBtn_C::Image_GrayTop' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_MenuBtn_C, MouseFocusButton) == 0x0004F8, "Member 'UWBP_PartyRace_Sub_MenuBtn_C::MouseFocusButton' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_MenuBtn_C, Overlay_1) == 0x000500, "Member 'UWBP_PartyRace_Sub_MenuBtn_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_MenuBtn_C, PartyRace_Cursor) == 0x000508, "Member 'UWBP_PartyRace_Sub_MenuBtn_C::PartyRace_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_MenuBtn_C, PAT_BtnPict) == 0x000510, "Member 'UWBP_PartyRace_Sub_MenuBtn_C::PAT_BtnPict' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_MenuBtn_C, AnimationTime) == 0x000518, "Member 'UWBP_PartyRace_Sub_MenuBtn_C::AnimationTime' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_MenuBtn_C, bDecided) == 0x000520, "Member 'UWBP_PartyRace_Sub_MenuBtn_C::bDecided' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_MenuBtn_C, OnPresetInfoButtonPressed) == 0x000528, "Member 'UWBP_PartyRace_Sub_MenuBtn_C::OnPresetInfoButtonPressed' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_Sub_MenuBtn_C, OnStartCustomButtonPressed) == 0x000538, "Member 'UWBP_PartyRace_Sub_MenuBtn_C::OnStartCustomButtonPressed' has a wrong offset!");

}

