#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_Sub_DonpaTicket_Details

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result_Sub_DonpaTicket_Details.WBP_Result_Sub_DonpaTicket_Details_C
// 0x0178 (0x0458 - 0x02E0)
class UWBP_Result_Sub_DonpaTicket_Details_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ticket_InLoop;                                     // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InLoop;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Grow;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_4;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DonpaTicket;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DonpaTicket_Effect;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_Honer_Effect;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_HonerBase;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_01;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_01_2;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_01B_2;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_01C_2;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_01D_2;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_02;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_02_2;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_02B;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_02B_2;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_03;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_03_2;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_03B;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_03B_2;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_03C_2;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_03ｃ;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_04;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_04_2;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_04B;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Effect_04B_2;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_01;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_02;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_03;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TicketBase;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_1st;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_2nd;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_3rd;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_DonpaTicket;                               // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Num_th;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FontScroll_C*                      WBP_FontScroll_Reward_Name;                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RSR_5rings_C*           WBP_Result_Sub_RSR_5rings;                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_BonusText;                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsAnmSkip;                                         // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              TicketInLoopAnimFinishEvent;                       // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FText>                           RankTextList;                                      // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Result_Sub_DonpaTicket_Details(int32 EntryPoint);
	void Finished_C97A90134C1BA541CDC1A689E8DB338E();
	void PlayRSRAnimation();
	void PreConstruct(bool IsDesignTime);
	void SetDonpaTicketNum(int32 Num);
	void SetHonor(ECommendationCategory Star, const class FText& Text);
	void SetOtherRSR(int32 Index_0);
	void SetRank(int32 Rank);
	void SetRSR();
	void SkipAnimationSub(int32 Index_0);
	void カスタムイベント();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Result_Sub_DonpaTicket_Details_C">();
	}
	static class UWBP_Result_Sub_DonpaTicket_Details_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_Sub_DonpaTicket_Details_C>();
	}
};
static_assert(alignof(UWBP_Result_Sub_DonpaTicket_Details_C) == 0x000008, "Wrong alignment on UWBP_Result_Sub_DonpaTicket_Details_C");
static_assert(sizeof(UWBP_Result_Sub_DonpaTicket_Details_C) == 0x000458, "Wrong size on UWBP_Result_Sub_DonpaTicket_Details_C");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, Ticket_InLoop) == 0x0002E8, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::Ticket_InLoop' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, InLoop) == 0x0002F0, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::InLoop' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, base) == 0x0002F8, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, Base_Grow) == 0x000300, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::Base_Grow' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, CanvasPanel_4) == 0x000308, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::CanvasPanel_4' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, DonpaTicket) == 0x000310, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::DonpaTicket' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, DonpaTicket_Effect) == 0x000318, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::DonpaTicket_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, DSP_Honer_Effect) == 0x000320, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::DSP_Honer_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, PAT_HonerBase) == 0x000328, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::PAT_HonerBase' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect) == 0x000330, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_01) == 0x000338, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_01' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_01_2) == 0x000340, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_01_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_01B_2) == 0x000348, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_01B_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_01C_2) == 0x000350, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_01C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_01D_2) == 0x000358, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_01D_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_02) == 0x000360, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_02' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_02_2) == 0x000368, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_02_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_02B) == 0x000370, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_02B' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_02B_2) == 0x000378, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_02B_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_03) == 0x000380, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_03' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_03_2) == 0x000388, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_03_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_03B) == 0x000390, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_03B' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_03B_2) == 0x000398, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_03B_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_03C_2) == 0x0003A0, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_03C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_03ｃ) == 0x0003A8, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_03ｃ' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_04) == 0x0003B0, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_04' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_04_2) == 0x0003B8, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_04_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_04B) == 0x0003C0, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_04B' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RSR_Effect_04B_2) == 0x0003C8, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RSR_Effect_04B_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, Star_01) == 0x0003D0, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::Star_01' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, Star_02) == 0x0003D8, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::Star_02' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, Star_03) == 0x0003E0, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::Star_03' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, TicketBase) == 0x0003E8, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::TicketBase' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, TXT_1st) == 0x0003F0, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::TXT_1st' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, TXT_2nd) == 0x0003F8, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::TXT_2nd' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, TXT_3rd) == 0x000400, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::TXT_3rd' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, TXT_Num_DonpaTicket) == 0x000408, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::TXT_Num_DonpaTicket' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, TXT_Num_th) == 0x000410, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::TXT_Num_th' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, WBP_FontScroll_Reward_Name) == 0x000418, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::WBP_FontScroll_Reward_Name' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, WBP_Result_Sub_RSR_5rings) == 0x000420, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::WBP_Result_Sub_RSR_5rings' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, WidgetSwitcher_BonusText) == 0x000428, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::WidgetSwitcher_BonusText' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, IsAnmSkip) == 0x000430, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::IsAnmSkip' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, TicketInLoopAnimFinishEvent) == 0x000438, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::TicketInLoopAnimFinishEvent' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_DonpaTicket_Details_C, RankTextList) == 0x000448, "Member 'UWBP_Result_Sub_DonpaTicket_Details_C::RankTextList' has a wrong offset!");

}

