#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetCustom_ScrollSnapPoint

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GadgetCustom_ScrollSnapPoint.WBP_GadgetCustom_ScrollSnapPoint_C
// 0x0068 (0x0370 - 0x0308)
class UWBP_GadgetCustom_ScrollSnapPoint_C final : public UCommonScrollPointBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_SnapPoint_C*          WBP_GadgetCustom_SnapPoint;                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_SnapPoint_C*          WBP_GadgetCustom_SnapPoint_1;                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_SnapPoint_C*          WBP_GadgetCustom_SnapPoint_2;                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_SnapPoint_C*          WBP_GadgetCustom_SnapPoint_3;                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_SnapPoint_C*          WBP_GadgetCustom_SnapPoint_4;                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_SnapPoint_C*          WBP_GadgetCustom_SnapPoint_5;                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_SnapPoint_C*          WBP_GadgetCustom_SnapPoint_6;                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_SnapPoint_C*          WBP_GadgetCustom_SnapPoint_7;                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_SnapPoint_C*          WBP_GadgetCustom_SnapPoint_8;                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_SnapPoint_C*          WBP_GadgetCustom_SnapPoint_9;                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_SnapPoint_C*          WBP_GadgetCustom_SnapPoint_10;                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GadgetCustom_ScrollSnapPoint(int32 EntryPoint);
	void OnInitialized();
	void Resize(const int32 InNewSize);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GadgetCustom_ScrollSnapPoint_C">();
	}
	static class UWBP_GadgetCustom_ScrollSnapPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GadgetCustom_ScrollSnapPoint_C>();
	}
};
static_assert(alignof(UWBP_GadgetCustom_ScrollSnapPoint_C) == 0x000008, "Wrong alignment on UWBP_GadgetCustom_ScrollSnapPoint_C");
static_assert(sizeof(UWBP_GadgetCustom_ScrollSnapPoint_C) == 0x000370, "Wrong size on UWBP_GadgetCustom_ScrollSnapPoint_C");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, UberGraphFrame) == 0x000308, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, HorizontalBox) == 0x000310, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, WBP_GadgetCustom_SnapPoint) == 0x000318, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::WBP_GadgetCustom_SnapPoint' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, WBP_GadgetCustom_SnapPoint_1) == 0x000320, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::WBP_GadgetCustom_SnapPoint_1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, WBP_GadgetCustom_SnapPoint_2) == 0x000328, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::WBP_GadgetCustom_SnapPoint_2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, WBP_GadgetCustom_SnapPoint_3) == 0x000330, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::WBP_GadgetCustom_SnapPoint_3' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, WBP_GadgetCustom_SnapPoint_4) == 0x000338, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::WBP_GadgetCustom_SnapPoint_4' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, WBP_GadgetCustom_SnapPoint_5) == 0x000340, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::WBP_GadgetCustom_SnapPoint_5' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, WBP_GadgetCustom_SnapPoint_6) == 0x000348, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::WBP_GadgetCustom_SnapPoint_6' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, WBP_GadgetCustom_SnapPoint_7) == 0x000350, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::WBP_GadgetCustom_SnapPoint_7' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, WBP_GadgetCustom_SnapPoint_8) == 0x000358, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::WBP_GadgetCustom_SnapPoint_8' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, WBP_GadgetCustom_SnapPoint_9) == 0x000360, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::WBP_GadgetCustom_SnapPoint_9' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_ScrollSnapPoint_C, WBP_GadgetCustom_SnapPoint_10) == 0x000368, "Member 'UWBP_GadgetCustom_ScrollSnapPoint_C::WBP_GadgetCustom_SnapPoint_10' has a wrong offset!");

}

