#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSelect_Sub_TimeTrialIcon

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CourseSelect_Sub_TimeTrialIcon.WBP_CourseSelect_Sub_TimeTrialIcon_C
// 0x0080 (0x06D8 - 0x0658)
class UWBP_CourseSelect_Sub_TimeTrialIcon_C final : public UCourseSelectTimeTrialIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0658(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Arrow;                                             // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Black_LockCover;                                   // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Coursor_Icon_Eff;                                  // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Coursor_Icon_Eff2;                                 // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Coursor_Icon_Eff_Core;                             // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Coursor_Icon_Eff_Core2;                            // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Coursor_Icon_LightGlare;                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_CourseSelect;                               // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_LockCover;                                     // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lock;                                              // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseInteraction;                                  // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Eff_Set;                                   // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PopText_base;                                      // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimeTrialIcon;                                     // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_InfoText;                                      // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CourseSelect_Sub_TimeTrialIcon(int32 EntryPoint);
	void OnBackKeyPressed();
	void OnLeftShoulderPressed();
	void OnRightShoulderPressed();
	void SetLockButton(bool Lock_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CourseSelect_Sub_TimeTrialIcon_C">();
	}
	static class UWBP_CourseSelect_Sub_TimeTrialIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CourseSelect_Sub_TimeTrialIcon_C>();
	}
};
static_assert(alignof(UWBP_CourseSelect_Sub_TimeTrialIcon_C) == 0x000008, "Wrong alignment on UWBP_CourseSelect_Sub_TimeTrialIcon_C");
static_assert(sizeof(UWBP_CourseSelect_Sub_TimeTrialIcon_C) == 0x0006D8, "Wrong size on UWBP_CourseSelect_Sub_TimeTrialIcon_C");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, UberGraphFrame) == 0x000658, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, Arrow) == 0x000660, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, Black_LockCover) == 0x000668, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::Black_LockCover' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, Coursor_Icon_Eff) == 0x000670, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::Coursor_Icon_Eff' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, Coursor_Icon_Eff2) == 0x000678, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::Coursor_Icon_Eff2' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, Coursor_Icon_Eff_Core) == 0x000680, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::Coursor_Icon_Eff_Core' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, Coursor_Icon_Eff_Core2) == 0x000688, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::Coursor_Icon_Eff_Core2' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, Coursor_Icon_LightGlare) == 0x000690, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::Coursor_Icon_LightGlare' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, Cursor_CourseSelect) == 0x000698, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::Cursor_CourseSelect' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, DSP_LockCover) == 0x0006A0, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::DSP_LockCover' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, Lock) == 0x0006A8, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::Lock' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, MouseInteraction) == 0x0006B0, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, Overlay_Eff_Set) == 0x0006B8, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::Overlay_Eff_Set' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, PopText_base) == 0x0006C0, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::PopText_base' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, TimeTrialIcon) == 0x0006C8, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::TimeTrialIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_TimeTrialIcon_C, TXT_InfoText) == 0x0006D0, "Member 'UWBP_CourseSelect_Sub_TimeTrialIcon_C::TXT_InfoText' has a wrong offset!");

}

