#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusInfo_Sub_MainTabBtn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatusInfo_Sub_MainTabBtn.WBP_StatusInfo_Sub_MainTabBtn_C
// 0x0078 (0x0358 - 0x02E0)
class UWBP_StatusInfo_Sub_MainTabBtn_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Tab_Select_Loop;                                   // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tab_Active_Loop;                                   // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Active;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_New_Pict;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_TabPict;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_TabPict_Ranking;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_CategoryName;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         UnionUIButton;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_TabBase;                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MainIconMaterialInstance;                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RankingMaterialInstance;                           // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_StatusInfo_Sub_MainTabBtn_UnionUIButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_StatusInfo_Sub_MainTabBtn(int32 EntryPoint);
	void SetMainImageIndex(double ImageIndex);
	void SetNewIcon(bool IsNew);
	void SetRankingImageIndex(double ImageIndex);
	void SetRankingImageVisibility(ESlateVisibility Visibility_0);
	void SetSelected(bool Select_0);
	void SetTabText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatusInfo_Sub_MainTabBtn_C">();
	}
	static class UWBP_StatusInfo_Sub_MainTabBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatusInfo_Sub_MainTabBtn_C>();
	}
};
static_assert(alignof(UWBP_StatusInfo_Sub_MainTabBtn_C) == 0x000008, "Wrong alignment on UWBP_StatusInfo_Sub_MainTabBtn_C");
static_assert(sizeof(UWBP_StatusInfo_Sub_MainTabBtn_C) == 0x000358, "Wrong size on UWBP_StatusInfo_Sub_MainTabBtn_C");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, Tab_Select_Loop) == 0x0002E8, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::Tab_Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, Tab_Active_Loop) == 0x0002F0, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::Tab_Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, Active) == 0x0002F8, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::Active' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, DSP_New_Pict) == 0x000300, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::DSP_New_Pict' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, PAT_TabPict) == 0x000308, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::PAT_TabPict' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, PAT_TabPict_Ranking) == 0x000310, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::PAT_TabPict_Ranking' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, Select) == 0x000318, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::Select' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, TXT_CategoryName) == 0x000320, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::TXT_CategoryName' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, UnionUIButton) == 0x000328, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::UnionUIButton' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, WidgetSwitcher_TabBase) == 0x000330, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::WidgetSwitcher_TabBase' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, MainIconMaterialInstance) == 0x000338, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::MainIconMaterialInstance' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, RankingMaterialInstance) == 0x000340, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::RankingMaterialInstance' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_MainTabBtn_C, OnPressed) == 0x000348, "Member 'UWBP_StatusInfo_Sub_MainTabBtn_C::OnPressed' has a wrong offset!");

}

