#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_Sub_LobbyInvitation

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.IsOnlyJoinPublicLobby
// 0x0028 (0x0028 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby final
{
public:
	bool                                          bOutOnlyJoin;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRetIsOnlyJoin;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJoining_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMemberCount_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby) == 0x000028, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby, bOutOnlyJoin) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby::bOutOnlyJoin' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby, bRetIsOnlyJoin) == 0x000001, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby::bRetIsOnlyJoin' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby, CallFunc_GetPublicLobbyContext_ReturnValue) == 0x000010, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby::CallFunc_GetPublicLobbyContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby, CallFunc_IsJoining_ReturnValue) == 0x000018, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby::CallFunc_IsJoining_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby, CallFunc_GetMemberCount_ReturnValue) == 0x00001C, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby::CallFunc_GetMemberCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPublicLobby::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.IsOnlyJoinPrivateLobby
// 0x0028 (0x0028 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby final
{
public:
	bool                                          bOutOnlyJoin;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRetIsOnlyJoin;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPrivateLobbyContext_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJoining_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMemberCount_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby) == 0x000028, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby, bOutOnlyJoin) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby::bOutOnlyJoin' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby, bRetIsOnlyJoin) == 0x000001, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby::bRetIsOnlyJoin' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby, CallFunc_GetPrivateLobbyContext_ReturnValue) == 0x000010, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby::CallFunc_GetPrivateLobbyContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby, CallFunc_IsJoining_ReturnValue) == 0x000018, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby::CallFunc_IsJoining_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby, CallFunc_GetMemberCount_ReturnValue) == 0x00001C, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby::CallFunc_GetMemberCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_Friend_Sub_LobbyInvitation_C_IsOnlyJoinPrivateLobby::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.GetNumberInputWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_GetNumberInputWidget final
{
public:
	class UFriendListNumberInputWidget*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_GetNumberInputWidget) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_GetNumberInputWidget");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_GetNumberInputWidget) == 0x000008, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_GetNumberInputWidget");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_GetNumberInputWidget, ReturnValue) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_GetNumberInputWidget::ReturnValue' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.Check Lobby Join Attention
// 0x0004 (0x0004 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention final
{
public:
	bool                                          bOutAttention;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnlyJoinPrivateLobby_bOutOnlyJoin;      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnlyJoinPublicLobby_bOutOnlyJoin;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention) == 0x000001, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention) == 0x000004, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention, bOutAttention) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention::bOutAttention' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention, CallFunc_IsOnlyJoinPrivateLobby_bOutOnlyJoin) == 0x000001, "Member 'WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention::CallFunc_IsOnlyJoinPrivateLobby_bOutOnlyJoin' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention, CallFunc_IsOnlyJoinPublicLobby_bOutOnlyJoin) == 0x000002, "Member 'WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention::CallFunc_IsOnlyJoinPublicLobby_bOutOnlyJoin' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'WBP_Friend_Sub_LobbyInvitation_C_Check_Lobby_Join_Attention::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
	int32                                         CallFunc_GetUserIndexByFocusEvent_ReturnValue;     // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived) == 0x0001C0, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived, CallFunc_GetUserIndexByFocusEvent_ReturnValue) == 0x0001B0, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived::CallFunc_GetUserIndexByFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived, CallFunc_GetPlayerController_ReturnValue) == 0x0001B8, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnFocusReceived::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.GetScrollBoxWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_GetScrollBoxWidget final
{
public:
	class UScrollBox*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_GetScrollBoxWidget) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_GetScrollBoxWidget");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_GetScrollBoxWidget) == 0x000008, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_GetScrollBoxWidget");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_GetScrollBoxWidget, ReturnValue) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_GetScrollBoxWidget::ReturnValue' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.OnListItemDecisionDown
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_OnListItemDecisionDown final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_OnListItemDecisionDown) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_OnListItemDecisionDown");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_OnListItemDecisionDown) == 0x000008, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_OnListItemDecisionDown");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnListItemDecisionDown, Button) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnListItemDecisionDown::Button' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.SetupListItemWidgetSingle
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_SetupListItemWidgetSingle final
{
public:
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    InItemListWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFriendListPlayerInfo                  InListPlayerInfo;                                  // 0x0008(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         InButtonIndex;                                     // 0x00F0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_SetupListItemWidgetSingle) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_SetupListItemWidgetSingle");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_SetupListItemWidgetSingle) == 0x0000F8, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_SetupListItemWidgetSingle");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetupListItemWidgetSingle, InItemListWidget) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetupListItemWidgetSingle::InItemListWidget' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetupListItemWidgetSingle, InListPlayerInfo) == 0x000008, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetupListItemWidgetSingle::InListPlayerInfo' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetupListItemWidgetSingle, InButtonIndex) == 0x0000F0, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetupListItemWidgetSingle::InButtonIndex' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.OnListItemCancelDown
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_OnListItemCancelDown final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_OnListItemCancelDown) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_OnListItemCancelDown");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_OnListItemCancelDown) == 0x000008, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_OnListItemCancelDown");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnListItemCancelDown, Button) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnListItemCancelDown::Button' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.FocusListItemWidget
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_FocusListItemWidget final
{
public:
	bool                                          bInPlayFocusSound;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_FocusListItemWidget) == 0x000001, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_FocusListItemWidget");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_FocusListItemWidget) == 0x000001, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_FocusListItemWidget");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_FocusListItemWidget, bInPlayFocusSound) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_FocusListItemWidget::bInPlayFocusSound' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.OnNumberInputWidgetDecision
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_OnNumberInputWidgetDecision final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_OnNumberInputWidgetDecision) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_OnNumberInputWidgetDecision");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_OnNumberInputWidgetDecision) == 0x000010, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_OnNumberInputWidgetDecision");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnNumberInputWidgetDecision, Button) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnNumberInputWidgetDecision::Button' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnNumberInputWidgetDecision, PanelIndex) == 0x000008, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnNumberInputWidgetDecision::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnNumberInputWidgetDecision, ButtonIndex) == 0x00000C, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnNumberInputWidgetDecision::ButtonIndex' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.OnUserSearchSuccess
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_OnUserSearchSuccess final
{
public:
	TArray<struct FCommon_UserSearchData>         InUserSearchData;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_OnUserSearchSuccess) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_OnUserSearchSuccess");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_OnUserSearchSuccess) == 0x000010, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_OnUserSearchSuccess");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnUserSearchSuccess, InUserSearchData) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnUserSearchSuccess::InUserSearchData' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.ExecuteAfterConfirmWidget
// 0x000C (0x000C - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_ExecuteAfterConfirmWidget final
{
public:
	EFriendListCommandType                        CommandType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InButtonIndex;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInCanceled;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_ExecuteAfterConfirmWidget) == 0x000004, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_ExecuteAfterConfirmWidget");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_ExecuteAfterConfirmWidget) == 0x00000C, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_ExecuteAfterConfirmWidget");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_ExecuteAfterConfirmWidget, CommandType) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_ExecuteAfterConfirmWidget::CommandType' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_ExecuteAfterConfirmWidget, InButtonIndex) == 0x000004, "Member 'WBP_Friend_Sub_LobbyInvitation_C_ExecuteAfterConfirmWidget::InButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_ExecuteAfterConfirmWidget, bInCanceled) == 0x000008, "Member 'WBP_Friend_Sub_LobbyInvitation_C_ExecuteAfterConfirmWidget::bInCanceled' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.OnButtonDecisionEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_OnButtonDecisionEvent final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_OnButtonDecisionEvent) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_OnButtonDecisionEvent");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_OnButtonDecisionEvent) == 0x000008, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_OnButtonDecisionEvent");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnButtonDecisionEvent, Button) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnButtonDecisionEvent::Button' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.OnLobbyIdButtonDecisionEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdButtonDecisionEvent final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdButtonDecisionEvent) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdButtonDecisionEvent");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdButtonDecisionEvent) == 0x000008, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdButtonDecisionEvent");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdButtonDecisionEvent, Button) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdButtonDecisionEvent::Button' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.SetOwnLobbyIdText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_SetOwnLobbyIdText final
{
public:
	class FString                                 InLobbyId;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bInWaitDisplay;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_SetOwnLobbyIdText) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_SetOwnLobbyIdText");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_SetOwnLobbyIdText) == 0x000018, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_SetOwnLobbyIdText");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetOwnLobbyIdText, InLobbyId) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetOwnLobbyIdText::InLobbyId' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetOwnLobbyIdText, bInWaitDisplay) == 0x000010, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetOwnLobbyIdText::bInWaitDisplay' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.AddListItemWidgetByListItemIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_AddListItemWidgetByListItemIndex final
{
public:
	int32                                         InListItemIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_AddListItemWidgetByListItemIndex) == 0x000004, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_AddListItemWidgetByListItemIndex");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_AddListItemWidgetByListItemIndex) == 0x000004, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_AddListItemWidgetByListItemIndex");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_AddListItemWidgetByListItemIndex, InListItemIndex) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_AddListItemWidgetByListItemIndex::InListItemIndex' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.SetButtonControlEnable
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnable final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnable) == 0x000001, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnable");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnable) == 0x000001, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnable");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnable, bInEnable) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnable::bInEnable' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.UpdateLobbyId
// 0x0018 (0x0018 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_UpdateLobbyId final
{
public:
	class FString                                 InShortLobbyId;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          InRequestSuccess;                                  // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_UpdateLobbyId) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_UpdateLobbyId");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_UpdateLobbyId) == 0x000018, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_UpdateLobbyId");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_UpdateLobbyId, InShortLobbyId) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_UpdateLobbyId::InShortLobbyId' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_UpdateLobbyId, InRequestSuccess) == 0x000010, "Member 'WBP_Friend_Sub_LobbyInvitation_C_UpdateLobbyId::InRequestSuccess' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.SetListItemWidgetInteractableState
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetInteractableState final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetInteractableState) == 0x000001, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetInteractableState");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetInteractableState) == 0x000001, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetInteractableState");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetInteractableState, bInEnable) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetInteractableState::bInEnable' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.SetListItemWidgetButtonChangeableState
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetButtonChangeableState final
{
public:
	int32                                         InListItemIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetButtonChangeableState) == 0x000004, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetButtonChangeableState");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetButtonChangeableState) == 0x000008, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetButtonChangeableState");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetButtonChangeableState, InListItemIndex) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetButtonChangeableState::InListItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetButtonChangeableState, bEnable) == 0x000004, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetListItemWidgetButtonChangeableState::bEnable' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.SetWidgetFocus
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_SetWidgetFocus final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bInPlayFocusSound;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_SetWidgetFocus) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_SetWidgetFocus");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_SetWidgetFocus) == 0x000010, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_SetWidgetFocus");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetWidgetFocus, PlayerController) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetWidgetFocus::PlayerController' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetWidgetFocus, bInPlayFocusSound) == 0x000008, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetWidgetFocus::bInPlayFocusSound' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.OnAttentionPopupWindowDecision
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_OnAttentionPopupWindowDecision final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_OnAttentionPopupWindowDecision) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_OnAttentionPopupWindowDecision");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_OnAttentionPopupWindowDecision) == 0x000010, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_OnAttentionPopupWindowDecision");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnAttentionPopupWindowDecision, Button) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnAttentionPopupWindowDecision::Button' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnAttentionPopupWindowDecision, PanelIndex) == 0x000008, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnAttentionPopupWindowDecision::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnAttentionPopupWindowDecision, ButtonIndex) == 0x00000C, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnAttentionPopupWindowDecision::ButtonIndex' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.SetupAttentionPopupWindow
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_SetupAttentionPopupWindow final
{
public:
	EFriendListCommandType                        InCommandType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_SetupAttentionPopupWindow) == 0x000001, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_SetupAttentionPopupWindow");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_SetupAttentionPopupWindow) == 0x000001, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_SetupAttentionPopupWindow");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetupAttentionPopupWindow, InCommandType) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetupAttentionPopupWindow::InCommandType' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.OnLobbyIdSearchSuccess
// 0x0028 (0x0028 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdSearchSuccess final
{
public:
	TArray<struct FCommon_UserSearchData>         InUserSearchData;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FLobbyId>                       InLobbyIdData;                                     // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ELobbyType                                    InLobbyType;                                       // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdSearchSuccess) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdSearchSuccess");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdSearchSuccess) == 0x000028, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdSearchSuccess");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdSearchSuccess, InUserSearchData) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdSearchSuccess::InUserSearchData' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdSearchSuccess, InLobbyIdData) == 0x000010, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdSearchSuccess::InLobbyIdData' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdSearchSuccess, InLobbyType) == 0x000020, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnLobbyIdSearchSuccess::InLobbyType' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.SetContentsControlEnable
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_SetContentsControlEnable final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_SetContentsControlEnable) == 0x000001, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_SetContentsControlEnable");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_SetContentsControlEnable) == 0x000001, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_SetContentsControlEnable");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetContentsControlEnable, bInEnable) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetContentsControlEnable::bInEnable' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.SetButtonControlEnableSingle
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnableSingle final
{
public:
	class UWBP_Friend_SubMenu_Btn_C*              InSubMenuButton;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bInEnable;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnableSingle) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnableSingle");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnableSingle) == 0x000010, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnableSingle");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnableSingle, InSubMenuButton) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnableSingle::InSubMenuButton' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnableSingle, bInEnable) == 0x000008, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetButtonControlEnableSingle::bInEnable' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.OnDirectionChange
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_OnDirectionChange final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EUnionUIControlDir                            Dir;                                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_OnDirectionChange) == 0x000008, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_OnDirectionChange");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_OnDirectionChange) == 0x000010, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_OnDirectionChange");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnDirectionChange, Button) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnDirectionChange::Button' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_OnDirectionChange, Dir) == 0x000008, "Member 'WBP_Friend_Sub_LobbyInvitation_C_OnDirectionChange::Dir' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.SetScrollBoxVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_SetScrollBoxVisibility final
{
public:
	ESlateVisibility                              Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_LobbyInvitation_C_SetScrollBoxVisibility) == 0x000001, "Wrong alignment on WBP_Friend_Sub_LobbyInvitation_C_SetScrollBoxVisibility");
static_assert(sizeof(WBP_Friend_Sub_LobbyInvitation_C_SetScrollBoxVisibility) == 0x000001, "Wrong size on WBP_Friend_Sub_LobbyInvitation_C_SetScrollBoxVisibility");
static_assert(offsetof(WBP_Friend_Sub_LobbyInvitation_C_SetScrollBoxVisibility, Param) == 0x000000, "Member 'WBP_Friend_Sub_LobbyInvitation_C_SetScrollBoxVisibility::Param' has a wrong offset!");

// Function WBP_Friend_Sub_LobbyInvitation.WBP_Friend_Sub_LobbyInvitation_C.ExecuteUbergraph_WBP_Friend_Sub_LobbyInvitation
// 0x0988 (0x0988 - 0x0000)
struct WBP_Friend_Sub_LobbyInvitation_C_ExecuteUbergraph_WBP_Friend_Sub_LobbyInvitation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_4;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0038(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0048(0x0010)()
	class FText                                   CallFunc_GetInputText_OutInputText;                // 0x0058(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UFriendListMainWidget*            CallFunc_GetMainWidget_ReturnValue;                // 0x0090(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCommon_UserSearchData>         K2Node_Event_InUserSearchData_1;                   // 0x0098(0x0010)(ConstParm, ReferenceParm)
	EFriendListCommandType                        K2Node_Event_CommandType;                          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InButtonIndex;                        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInCanceled;                          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckLobbyInvitationReject_ReturnValue;   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckShowPfProfile_ReturnValue;           // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFriendListPlayerInfo                  CallFunc_GetSearchPlayerInfo_OutSearchPlayerInfo;  // 0x00B8(0x00E8)()
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    CallFunc_Array_Get_Item;                           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_Sub_PlayerPlate_C*          CallFunc_GetMainWidget_OutMainWidget;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_NumberInput_Window_C*       CallFunc_Create_ReturnValue;                       // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInPlayFocusSound_1;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    CallFunc_Array_Get_Item_1;                         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x01E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFriendListPlayerInfo                  CallFunc_Array_Get_Item_2;                         // 0x01F8(0x00E8)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_3;                       // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_InLobbyId;                      // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInWaitDisplay;                 // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0310(0x0010)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_322[0x2];                                      // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InListItemIndex_1;                    // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInEnable_1;                          // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_5;                       // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    K2Node_CustomEvent_InItemListWidget;               // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFriendListPlayerInfo                  K2Node_CustomEvent_InListPlayerInfo;               // 0x0340(0x00E8)()
	int32                                         K2Node_CustomEvent_InButtonIndex;                  // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_Sub_PlayerPlate_C*          CallFunc_GetMainWidget_OutMainWidget_1;            // 0x0430(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_6;                       // 0x0438(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UFriendListMainWidget*            CallFunc_GetMainWidget_ReturnValue_1;              // 0x0440(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckRequestLobbyId_ReturnValue;          // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckGetCurrentLobbyId_ReturnValue;       // 0x044B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_InShortLobbyId;                 // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InRequestSuccess;               // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
