#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ResultRate_Sub_RateGauge

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ResultRate_Sub_RateGauge.WBP_ResultRate_Sub_RateGauge_C
// 0x0100 (0x03E0 - 0x02E0)
class UWBP_ResultRate_Sub_RateGauge_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Rate_Lowerlimit_Loop;                              // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Rate_Upperlimit_Loop;                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PRM_Cursor;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btm_Base;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DELETE_MLC_Rate_Gauge_Base_DOWN;                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DELETE_MLC_Rate_Gauge_Base_UP;                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ResultRate_Sub_RankIcon_C*         DELETE_WBP_Result_Sub_Rate_RankIcon_DOWN;          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ResultRate_Sub_RankIcon_C*         DELETE_WBP_Result_Sub_Rate_RankIcon_UP;            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_GaugeLine_Eff;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_outline;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GaugeLine;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GaugeLine_Black;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Reward;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rate_Gauge_Base;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rate_Gauge_Base_Eff;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rate_Gauge_Base_Outline;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top_Base;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_GaugeRate_DOWN;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_GaugeRate_NOW;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_GaugeRate_UP;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ItemIcon_C*                    WBP_CMN_ItemIcon;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_Sub_RankNum_C*                 WBP_CMN_Sub_RankNum;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_Sub_RankNum_C*                 WBP_CMN_Sub_RankNum_1;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_Sub_RankNum_C*                 WBP_CMN_Sub_RankNum_181;                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ResultRate_Sub_RankIcon_C*         WBP_Result_Sub_Rate_RankIcon_NOW;                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        RateUp;                                            // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RateDown;                                          // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 MLC_Rate_Gauge_Base_UP;                            // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         MTC_RateRankBase_Index;                            // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FloatNum;                                          // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ResultRate_Sub_RateGauge(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Now_Rate_Impl(double newParam);
	void SetBonusIconHide(bool bIsHide);
	void SetRank(ERateRank Rank);
	void SetRateBaseImpl(double RateUp_0, double RateDown_0, ERateRank RateRankUp, ERateRank RateRankDown);
	void SetRewardHide(bool bIsHide);
	void SetRewardIcon(ERewardType rewardType, int32 ID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ResultRate_Sub_RateGauge_C">();
	}
	static class UWBP_ResultRate_Sub_RateGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ResultRate_Sub_RateGauge_C>();
	}
};
static_assert(alignof(UWBP_ResultRate_Sub_RateGauge_C) == 0x000008, "Wrong alignment on UWBP_ResultRate_Sub_RateGauge_C");
static_assert(sizeof(UWBP_ResultRate_Sub_RateGauge_C) == 0x0003E0, "Wrong size on UWBP_ResultRate_Sub_RateGauge_C");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ResultRate_Sub_RateGauge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, Rate_Lowerlimit_Loop) == 0x0002E8, "Member 'UWBP_ResultRate_Sub_RateGauge_C::Rate_Lowerlimit_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, Rate_Upperlimit_Loop) == 0x0002F0, "Member 'UWBP_ResultRate_Sub_RateGauge_C::Rate_Upperlimit_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, PRM_Cursor) == 0x0002F8, "Member 'UWBP_ResultRate_Sub_RateGauge_C::PRM_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, base) == 0x000300, "Member 'UWBP_ResultRate_Sub_RateGauge_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, Btm_Base) == 0x000308, "Member 'UWBP_ResultRate_Sub_RateGauge_C::Btm_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, DELETE_MLC_Rate_Gauge_Base_DOWN) == 0x000310, "Member 'UWBP_ResultRate_Sub_RateGauge_C::DELETE_MLC_Rate_Gauge_Base_DOWN' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, DELETE_MLC_Rate_Gauge_Base_UP) == 0x000318, "Member 'UWBP_ResultRate_Sub_RateGauge_C::DELETE_MLC_Rate_Gauge_Base_UP' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, DELETE_WBP_Result_Sub_Rate_RankIcon_DOWN) == 0x000320, "Member 'UWBP_ResultRate_Sub_RateGauge_C::DELETE_WBP_Result_Sub_Rate_RankIcon_DOWN' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, DELETE_WBP_Result_Sub_Rate_RankIcon_UP) == 0x000328, "Member 'UWBP_ResultRate_Sub_RateGauge_C::DELETE_WBP_Result_Sub_Rate_RankIcon_UP' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, DSP_GaugeLine_Eff) == 0x000330, "Member 'UWBP_ResultRate_Sub_RateGauge_C::DSP_GaugeLine_Eff' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, Eff_outline) == 0x000338, "Member 'UWBP_ResultRate_Sub_RateGauge_C::Eff_outline' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, GaugeLine) == 0x000340, "Member 'UWBP_ResultRate_Sub_RateGauge_C::GaugeLine' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, GaugeLine_Black) == 0x000348, "Member 'UWBP_ResultRate_Sub_RateGauge_C::GaugeLine_Black' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, Overlay_Reward) == 0x000350, "Member 'UWBP_ResultRate_Sub_RateGauge_C::Overlay_Reward' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, Rate_Gauge_Base) == 0x000358, "Member 'UWBP_ResultRate_Sub_RateGauge_C::Rate_Gauge_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, Rate_Gauge_Base_Eff) == 0x000360, "Member 'UWBP_ResultRate_Sub_RateGauge_C::Rate_Gauge_Base_Eff' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, Rate_Gauge_Base_Outline) == 0x000368, "Member 'UWBP_ResultRate_Sub_RateGauge_C::Rate_Gauge_Base_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, Top_Base) == 0x000370, "Member 'UWBP_ResultRate_Sub_RateGauge_C::Top_Base' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, TXT_Num_GaugeRate_DOWN) == 0x000378, "Member 'UWBP_ResultRate_Sub_RateGauge_C::TXT_Num_GaugeRate_DOWN' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, TXT_Num_GaugeRate_NOW) == 0x000380, "Member 'UWBP_ResultRate_Sub_RateGauge_C::TXT_Num_GaugeRate_NOW' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, TXT_Num_GaugeRate_UP) == 0x000388, "Member 'UWBP_ResultRate_Sub_RateGauge_C::TXT_Num_GaugeRate_UP' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, WBP_CMN_ItemIcon) == 0x000390, "Member 'UWBP_ResultRate_Sub_RateGauge_C::WBP_CMN_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, WBP_CMN_Sub_RankNum) == 0x000398, "Member 'UWBP_ResultRate_Sub_RateGauge_C::WBP_CMN_Sub_RankNum' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, WBP_CMN_Sub_RankNum_1) == 0x0003A0, "Member 'UWBP_ResultRate_Sub_RateGauge_C::WBP_CMN_Sub_RankNum_1' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, WBP_CMN_Sub_RankNum_181) == 0x0003A8, "Member 'UWBP_ResultRate_Sub_RateGauge_C::WBP_CMN_Sub_RankNum_181' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, WBP_Result_Sub_Rate_RankIcon_NOW) == 0x0003B0, "Member 'UWBP_ResultRate_Sub_RateGauge_C::WBP_Result_Sub_Rate_RankIcon_NOW' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, RateUp) == 0x0003B8, "Member 'UWBP_ResultRate_Sub_RateGauge_C::RateUp' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, RateDown) == 0x0003C0, "Member 'UWBP_ResultRate_Sub_RateGauge_C::RateDown' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, MLC_Rate_Gauge_Base_UP) == 0x0003C8, "Member 'UWBP_ResultRate_Sub_RateGauge_C::MLC_Rate_Gauge_Base_UP' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, MTC_RateRankBase_Index) == 0x0003D0, "Member 'UWBP_ResultRate_Sub_RateGauge_C::MTC_RateRankBase_Index' has a wrong offset!");
static_assert(offsetof(UWBP_ResultRate_Sub_RateGauge_C, FloatNum) == 0x0003D8, "Member 'UWBP_ResultRate_Sub_RateGauge_C::FloatNum' has a wrong offset!");

}

