#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_ItemSummonButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_ItemSummonButton.WBP_Race_HUD_Sub_ItemSummonButton_C
// 0x0048 (0x0338 - 0x02F0)
class UWBP_Race_HUD_Sub_ItemSummonButton_C final : public URaceUISubItemSummonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Color;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PAT_AttributeColorBase;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_ItemPict;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root;                                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Key_C*                WBP_Race_StartDash_Sub_Btn;                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_Cross_C*              WBP_Race_StartDash_Sub_Btn_Cross;                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Race_Sub_Btn_LR_C*                 WBP_Race_StartDash_Sub_Btn_LR;                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Btn;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_ItemSummonButton(int32 EntryPoint);
	void SetSummonInputKey(const struct FKey& Key, bool IsKeyboard, int32 PlayerControllerIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_ItemSummonButton_C">();
	}
	static class UWBP_Race_HUD_Sub_ItemSummonButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_ItemSummonButton_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_ItemSummonButton_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_ItemSummonButton_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_ItemSummonButton_C) == 0x000338, "Wrong size on UWBP_Race_HUD_Sub_ItemSummonButton_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemSummonButton_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Race_HUD_Sub_ItemSummonButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemSummonButton_C, Border_Color) == 0x0002F8, "Member 'UWBP_Race_HUD_Sub_ItemSummonButton_C::Border_Color' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemSummonButton_C, PAT_AttributeColorBase) == 0x000300, "Member 'UWBP_Race_HUD_Sub_ItemSummonButton_C::PAT_AttributeColorBase' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemSummonButton_C, PAT_ItemPict) == 0x000308, "Member 'UWBP_Race_HUD_Sub_ItemSummonButton_C::PAT_ItemPict' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemSummonButton_C, Root) == 0x000310, "Member 'UWBP_Race_HUD_Sub_ItemSummonButton_C::Root' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemSummonButton_C, WBP_Race_StartDash_Sub_Btn) == 0x000318, "Member 'UWBP_Race_HUD_Sub_ItemSummonButton_C::WBP_Race_StartDash_Sub_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemSummonButton_C, WBP_Race_StartDash_Sub_Btn_Cross) == 0x000320, "Member 'UWBP_Race_HUD_Sub_ItemSummonButton_C::WBP_Race_StartDash_Sub_Btn_Cross' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemSummonButton_C, WBP_Race_StartDash_Sub_Btn_LR) == 0x000328, "Member 'UWBP_Race_HUD_Sub_ItemSummonButton_C::WBP_Race_StartDash_Sub_Btn_LR' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemSummonButton_C, WidgetSwitcher_Btn) == 0x000330, "Member 'UWBP_Race_HUD_Sub_ItemSummonButton_C::WidgetSwitcher_Btn' has a wrong offset!");

}

