#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_ItemWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionRun_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_ItemWarning.WBP_Race_HUD_Sub_ItemWarning_C
// 0x0040 (0x0460 - 0x0420)
class UWBP_Race_HUD_Sub_ItemWarning_C final : public URaceUISubApproachWarning
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_ItemIcon;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_ItemIcon_Shadow;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WarningBlink_Circle;                               // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bBeep;                                             // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpeedRate;                                         // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPauseFlag;                                        // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_ItemWarning(int32 EntryPoint);
	void FireInCommingAnim();
	void OnFinishedFirstJumpIn();
	void SetAttackTypeAndId_BP(EUnionAttackItemInfoType AttackType, uint8 ID);
	void SetItemId_BP(int32 ItemIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_ItemWarning_C">();
	}
	static class UWBP_Race_HUD_Sub_ItemWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_ItemWarning_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_ItemWarning_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_ItemWarning_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_ItemWarning_C) == 0x000460, "Wrong size on UWBP_Race_HUD_Sub_ItemWarning_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemWarning_C, UberGraphFrame) == 0x000420, "Member 'UWBP_Race_HUD_Sub_ItemWarning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemWarning_C, base) == 0x000428, "Member 'UWBP_Race_HUD_Sub_ItemWarning_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemWarning_C, DMY_ItemIcon) == 0x000430, "Member 'UWBP_Race_HUD_Sub_ItemWarning_C::DMY_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemWarning_C, DMY_ItemIcon_Shadow) == 0x000438, "Member 'UWBP_Race_HUD_Sub_ItemWarning_C::DMY_ItemIcon_Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemWarning_C, WarningBlink_Circle) == 0x000440, "Member 'UWBP_Race_HUD_Sub_ItemWarning_C::WarningBlink_Circle' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemWarning_C, bBeep) == 0x000448, "Member 'UWBP_Race_HUD_Sub_ItemWarning_C::bBeep' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemWarning_C, SpeedRate) == 0x000450, "Member 'UWBP_Race_HUD_Sub_ItemWarning_C::SpeedRate' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_ItemWarning_C, bPauseFlag) == 0x000458, "Member 'UWBP_Race_HUD_Sub_ItemWarning_C::bPauseFlag' has a wrong offset!");

}

