#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Festa_TeamHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Sub_Festa_TeamHUD.WBP_Race_HUD_Sub_Festa_TeamHUD_C.ExecChangeRank
// 0x0058 (0x0058 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank final
{
public:
	int32                                         PanelIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     DriverId;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDispPlayer;                                      // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Rank;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_Festa_TeamGroup_C*    TmpGroupHUD0;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsCharacterReleased_ReturnValue;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_Festa_TeamGroup_C*    CallFunc_GetSingle_GroupPanelHUD;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Map_Find_Value;                           // 0x0028(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank) == 0x000058, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, PanelIndex) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, DriverId) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::DriverId' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, IsDispPlayer) == 0x000005, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::IsDispPlayer' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, Rank) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::Rank' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, ReturnValue) == 0x00000C, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, TmpGroupHUD0) == 0x000010, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::TmpGroupHUD0' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, Temp_byte_Variable) == 0x000018, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, CallFunc_GetIsCharacterReleased_ReturnValue) == 0x000019, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::CallFunc_GetIsCharacterReleased_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, Temp_byte_Variable_1) == 0x00001A, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, Temp_bool_Variable) == 0x00001B, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, K2Node_Select_Default) == 0x00001C, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, CallFunc_GetSingle_GroupPanelHUD) == 0x000020, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::CallFunc_GetSingle_GroupPanelHUD' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, CallFunc_Map_Find_Value) == 0x000028, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank, CallFunc_Map_Find_ReturnValue) == 0x000050, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecChangeRank::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamHUD.WBP_Race_HUD_Sub_Festa_TeamHUD_C.ExecPlayChangeRank
// 0x0050 (0x0050 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank final
{
public:
	int32                                         PanelIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     DriverId;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDispPlayer;                                      // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Rank;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsCharacterReleased_ReturnValue;       // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     Temp_byte_Variable;                                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Map_Find_Value;                           // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_Festa_TeamGroup_C*    CallFunc_GetSingle_GroupPanelHUD;                  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank) == 0x000050, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank, PanelIndex) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank, DriverId) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank::DriverId' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank, IsDispPlayer) == 0x000005, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank::IsDispPlayer' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank, Rank) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank::Rank' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank, ReturnValue) == 0x00000C, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank, Temp_bool_Variable) == 0x00000D, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank, CallFunc_GetIsCharacterReleased_ReturnValue) == 0x00000E, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank::CallFunc_GetIsCharacterReleased_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank, Temp_byte_Variable) == 0x00000F, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank, K2Node_Select_Default) == 0x000010, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank, CallFunc_Map_Find_Value) == 0x000018, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank, CallFunc_GetSingle_GroupPanelHUD) == 0x000048, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecPlayChangeRank::CallFunc_GetSingle_GroupPanelHUD' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamHUD.WBP_Race_HUD_Sub_Festa_TeamHUD_C.ExecSetRankOnly
// 0x0018 (0x0018 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly final
{
public:
	int32                                         PanelIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Rank;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_Festa_TeamGroup_C*    CallFunc_GetSingle_GroupPanelHUD;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly) == 0x000018, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly, PanelIndex) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly, Rank) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly::Rank' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly, ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly, CallFunc_GetSingle_GroupPanelHUD) == 0x000010, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecSetRankOnly::CallFunc_GetSingle_GroupPanelHUD' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamHUD.WBP_Race_HUD_Sub_Festa_TeamHUD_C.ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD
// 0x0048 (0x0048 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_Festa_TeamGroup_C*    K2Node_CustomEvent_RanelHHUD;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Rank;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         K2Node_Event_TeamRank;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD) == 0x000048, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD, EntryPoint) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD, K2Node_CustomEvent_RanelHHUD) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD::K2Node_CustomEvent_RanelHHUD' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD, K2Node_CustomEvent_Rank) == 0x000010, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD::K2Node_CustomEvent_Rank' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD, K2Node_Event_TeamRank) == 0x000028, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD::K2Node_Event_TeamRank' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Festa_TeamHUD::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamHUD.WBP_Race_HUD_Sub_Festa_TeamHUD_C.Get Normal Gauge Percent
// 0x0010 (0x0010 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_C_Get_Normal_Gauge_Percent final
{
public:
	double                                        GaugePercent;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetNormalGaugePercent_GaugePercent;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_Get_Normal_Gauge_Percent) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_C_Get_Normal_Gauge_Percent");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_Get_Normal_Gauge_Percent) == 0x000010, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_C_Get_Normal_Gauge_Percent");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_Get_Normal_Gauge_Percent, GaugePercent) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_Get_Normal_Gauge_Percent::GaugePercent' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_Get_Normal_Gauge_Percent, CallFunc_GetNormalGaugePercent_GaugePercent) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_Get_Normal_Gauge_Percent::CallFunc_GetNormalGaugePercent_GaugePercent' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamHUD.WBP_Race_HUD_Sub_Festa_TeamHUD_C.GetCrownIndex
// 0x0038 (0x0038 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex final
{
public:
	int32                                         Input;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Output;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 TmpArray;                                          // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex) == 0x000038, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex, Input) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex::Input' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex, Output) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex::Output' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex, TmpArray) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex::TmpArray' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex, Temp_int_Variable) == 0x000018, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex, CallFunc_Array_Find_ReturnValue) == 0x00001C, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex, CallFunc_Percent_IntInt_ReturnValue) == 0x000024, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetCrownIndex::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamHUD.WBP_Race_HUD_Sub_Festa_TeamHUD_C.GetTeamRank
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank final
{
public:
	int32                                         NextTeamRank;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 TmpPointList;                                      // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         TeamPoint;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastIndex;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 SortPointList;                                     // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 PointList;                                         // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPartyResultTeamInfo                   CallFunc_GetPartyResultRacerAll_TeamInfo;          // 0x0060(0x0048)()
	TArray<struct FPartyResultRacer>              CallFunc_GetPartyResultRacerAll_ReturnValue;       // 0x00A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_MinOfIntArray_IndexOfMinValue;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MinOfIntArray_MinValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank) == 0x0000E0, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, NextTeamRank) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::NextTeamRank' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, TmpPointList) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::TmpPointList' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, TeamPoint) == 0x000018, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::TeamPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, LastIndex) == 0x00001C, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::LastIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, SortPointList) == 0x000020, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::SortPointList' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, PointList) == 0x000030, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::PointList' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, Temp_int_Array_Index_Variable) == 0x000040, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_Array_Get_Item) == 0x000044, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, Temp_int_Variable) == 0x000050, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000054, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_GetPartyResultRacerAll_TeamInfo) == 0x000060, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_GetPartyResultRacerAll_TeamInfo' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_GetPartyResultRacerAll_ReturnValue) == 0x0000A8, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_GetPartyResultRacerAll_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_MinOfIntArray_IndexOfMinValue) == 0x0000B8, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_MinOfIntArray_IndexOfMinValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_MinOfIntArray_MinValue) == 0x0000BC, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_MinOfIntArray_MinValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000C4, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_Array_Add_ReturnValue) == 0x0000C8, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_Array_Find_ReturnValue) == 0x0000CC, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, Temp_int_Loop_Counter_Variable) == 0x0000D4, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000DC, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_GetTeamRank::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamHUD.WBP_Race_HUD_Sub_Festa_TeamHUD_C.InitializeRingGauge
// 0x0005 (0x0005 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge final
{
public:
	ERaceBonus                                    CallFunc_GetRaceBonusSetting_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRacePreset                              CallFunc_GetSelectedRaceParkPresetId_ReturnValue;  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge) == 0x000001, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge) == 0x000005, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge, CallFunc_GetRaceBonusSetting_ReturnValue) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge::CallFunc_GetRaceBonusSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge, CallFunc_GetSelectedRaceParkPresetId_ReturnValue) == 0x000001, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge::CallFunc_GetSelectedRaceParkPresetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_InitializeRingGauge::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamHUD.WBP_Race_HUD_Sub_Festa_TeamHUD_C.PlayChrageEffect
// 0x0018 (0x0018 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect final
{
public:
	int32                                         RacerIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isSingle;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ChargePer;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect) == 0x000018, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect, RacerIndex) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect::RacerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect, isSingle) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect::isSingle' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect, ChargePer) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect::ChargePer' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect, CallFunc_Map_Find_Value) == 0x000010, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect, CallFunc_Map_Find_ReturnValue) == 0x000014, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect, CallFunc_IsValid_ReturnValue) == 0x000015, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_PlayChrageEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamHUD.WBP_Race_HUD_Sub_Festa_TeamHUD_C.SetBaseColor
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor final
{
public:
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGroupColorId                                 CallFunc_GetGroupColorId_ReturnValue;              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_2;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIColorInfo                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_3;          // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIColorInfo                           CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0078(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor) == 0x0000B0, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, Temp_int_Variable) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_GetEnumeratorName_ReturnValue) == 0x00000C, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_IsValid_ReturnValue_1) == 0x000014, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000015, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_GetGroupColorId_ReturnValue) == 0x000016, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_GetGroupColorId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_GetEnumeratorName_ReturnValue_1) == 0x000018, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_GetEnumeratorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_GetEnumeratorName_ReturnValue_2) == 0x000020, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_GetEnumeratorName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000028, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000050, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_GetEnumeratorName_ReturnValue_3) == 0x000054, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_GetEnumeratorName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, K2Node_Select_Default) == 0x00005C, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000064, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000078, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000098, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x00009C, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBaseColor::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamHUD.WBP_Race_HUD_Sub_Festa_TeamHUD_C.SetBoostGaugePercent
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBoostGaugePercent final
{
public:
	double                                        Percent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBoostGaugePercent) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBoostGaugePercent");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBoostGaugePercent) == 0x000008, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBoostGaugePercent");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBoostGaugePercent, Percent) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetBoostGaugePercent::Percent' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamHUD.WBP_Race_HUD_Sub_Festa_TeamHUD_C.SetCrown
// 0x0120 (0x0120 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_C_SetCrown final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OutTopGroupList;                                   // 0x0008(0x0010)(Parm, OutParm)
	TArray<int32>                                 TopGroupList;                                      // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         MaxPoint;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPartyResultRacer>              ResultRacer;                                       // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 NowPointList;                                      // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 NextPointList;                                     // 0x0050(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0064(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0068(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCrownIndex_OutPut;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPartyResultTeamInfo                   CallFunc_GetPartyResultRacerAll_TeamInfo;          // 0x0080(0x0048)()
	TArray<struct FPartyResultRacer>              CallFunc_GetPartyResultRacerAll_ReturnValue;       // 0x00C8(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable_4;                               // 0x00D8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_5;                               // 0x00F0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x00FC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
