#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetCustom_Sub_SkillPlate

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_GadgetCustom_Sub_SkillPlate.WBP_GadgetCustom_Sub_SkillPlate_C.ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_3;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<TSubclassOf<class URichTextBlockDecorator>> K2Node_MakeArray_Array;                       // 0x0028(0x0010)(ConstParm, ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRaceButtonText_ReturnValue;            // 0x0050(0x0010)()
	struct FGadgetDetailWindowData                K2Node_Event_InWindowData;                         // 0x0060(0x0038)(ConstParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppControllerInputType                       CallFunc_GetCurrentInputType_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate");
static_assert(sizeof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate) == 0x0000B8, "Wrong size on WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, EntryPoint) == 0x000000, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, Temp_class_Variable) == 0x000008, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, Temp_class_Variable_1) == 0x000010, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, Temp_class_Variable_2) == 0x000018, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, Temp_class_Variable_3) == 0x000020, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, K2Node_MakeArray_Array) == 0x000028, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, CallFunc_MakeLiteralByte_ReturnValue) == 0x000038, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000039, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, Temp_int_Variable) == 0x00003C, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, K2Node_Select_Default) == 0x000040, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, K2Node_Event_IsDesignTime) == 0x000048, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, Temp_byte_Variable) == 0x000049, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, CallFunc_GetRaceButtonText_ReturnValue) == 0x000050, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::CallFunc_GetRaceButtonText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, K2Node_Event_InWindowData) == 0x000060, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::K2Node_Event_InWindowData' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, CallFunc_GetPlayerController_ReturnValue) == 0x000098, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, K2Node_DynamicCast_AsApp_Player_Controller) == 0x0000A8, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000B1, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, Temp_byte_Variable_1) == 0x0000B2, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, Temp_bool_Variable) == 0x0000B3, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate, K2Node_Select_Default_1) == 0x0000B4, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_ExecuteUbergraph_WBP_GadgetCustom_Sub_SkillPlate::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_SkillPlate.WBP_GadgetCustom_Sub_SkillPlate_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GadgetCustom_Sub_SkillPlate_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GadgetCustom_Sub_SkillPlate_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GadgetCustom_Sub_SkillPlate_C_PreConstruct");
static_assert(sizeof(WBP_GadgetCustom_Sub_SkillPlate_C_PreConstruct) == 0x000001, "Wrong size on WBP_GadgetCustom_Sub_SkillPlate_C_PreConstruct");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GadgetCustom_Sub_SkillPlate.WBP_GadgetCustom_Sub_SkillPlate_C.Setup
// 0x0038 (0x0038 - 0x0000)
struct WBP_GadgetCustom_Sub_SkillPlate_C_Setup final
{
public:
	struct FGadgetDetailWindowData                InWindowData;                                      // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_GadgetCustom_Sub_SkillPlate_C_Setup) == 0x000008, "Wrong alignment on WBP_GadgetCustom_Sub_SkillPlate_C_Setup");
static_assert(sizeof(WBP_GadgetCustom_Sub_SkillPlate_C_Setup) == 0x000038, "Wrong size on WBP_GadgetCustom_Sub_SkillPlate_C_Setup");
static_assert(offsetof(WBP_GadgetCustom_Sub_SkillPlate_C_Setup, InWindowData) == 0x000000, "Member 'WBP_GadgetCustom_Sub_SkillPlate_C_Setup::InWindowData' has a wrong offset!");

}

