#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FooterMenu_Sub_Key

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FooterMenu_Sub_Key.WBP_FooterMenu_Sub_Key_C
// 0x0018 (0x0320 - 0x0308)
class UWBP_FooterMenu_Sub_Key_C final : public UCommonMenuControllerKeyboard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 PAT_Mouse;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_PC;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_FooterMenu_Sub_Key(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FooterMenu_Sub_Key_C">();
	}
	static class UWBP_FooterMenu_Sub_Key_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FooterMenu_Sub_Key_C>();
	}
};
static_assert(alignof(UWBP_FooterMenu_Sub_Key_C) == 0x000008, "Wrong alignment on UWBP_FooterMenu_Sub_Key_C");
static_assert(sizeof(UWBP_FooterMenu_Sub_Key_C) == 0x000320, "Wrong size on UWBP_FooterMenu_Sub_Key_C");
static_assert(offsetof(UWBP_FooterMenu_Sub_Key_C, UberGraphFrame) == 0x000308, "Member 'UWBP_FooterMenu_Sub_Key_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_Sub_Key_C, PAT_Mouse) == 0x000310, "Member 'UWBP_FooterMenu_Sub_Key_C::PAT_Mouse' has a wrong offset!");
static_assert(offsetof(UWBP_FooterMenu_Sub_Key_C, WidgetSwitcher_PC) == 0x000318, "Member 'UWBP_FooterMenu_Sub_Key_C::WidgetSwitcher_PC' has a wrong offset!");

}

