#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSelect_Sub_StageBox_3piece

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CourseSelect_Sub_StageBox_3piece.WBP_CourseSelect_Sub_StageBox_3piece_C
// 0x0168 (0x0540 - 0x03D8)
class UWBP_CourseSelect_Sub_StageBox_3piece_C final : public UUnionUISceneBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CourseSelect_Sub_Thumbnail_C*      WBP_CourseSelect_Sub_Thumbnail_01;                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_Thumbnail_C*      WBP_CourseSelect_Sub_Thumbnail_02;                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_Thumbnail_C*      WBP_CourseSelect_Sub_Thumbnail_03;                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_CourseSelect_Sub_Thumbnail_C*> ThumbnailButtonArr;                             // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUnionUIButtonsPanel*                   ButtonsPanel;                                      // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<EStageId, class FText>                   ValidStageId;                                      // 0x0410(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(EStageId StageCourseId, int32 ButtonIndex)> OnFocusThumbnail;      // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<EStageId>                              DevRomStageId;                                     // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bCompleteOnly;                                     // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EStageId, double>                        CourseCompleteRate;                                // 0x0488(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EStageId, TSoftObjectPtr<class UTexture2D>> Stage_Id_Tmb;                                   // 0x04D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bFocusSoundEnable;                                 // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EStageId StageId)> OnStoreShortcutClickedDelegate;                 // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CourseSelect_Sub_StageBox_3piece(int32 EntryPoint);
	void GetCourseIds(EStageId* StageCourseId, EStageId* StageCourseId1, EStageId* StageCourseId2);
	void IsEnableCourseIndex(int32 Index_0, bool* bEnableCourse);
	void OnCancelEvent_Event(class UUnionUIButtonBase* Button);
	void OnFocusEvent_Event_0(class UUnionUIButtonBase* Button);
	void OnSelectedEvent_Event(class UUnionUIButtonBaseCore* Button);
	void OnStoreShortcutClicked(EStageId StageId);
	void SetCourseId(int32 InIndex, EStageId InStageId, double OpenThreshold);
	void SetGameModeId(EGameModeId InGameModeId);
	void SetLastFocusedId(int32 InButtonIndex);
	void SetThumbnailInteractableState(bool Interactable);
	void SetTimeTrialData(TArray<ETimeTrialClearRankId>& InTimeTrialClearRanks);
	void SetupTmb(const TMap<EStageId, TSoftObjectPtr<class UTexture2D>>& StageId_Tmb);
	void StartFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CourseSelect_Sub_StageBox_3piece_C">();
	}
	static class UWBP_CourseSelect_Sub_StageBox_3piece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CourseSelect_Sub_StageBox_3piece_C>();
	}
};
static_assert(alignof(UWBP_CourseSelect_Sub_StageBox_3piece_C) == 0x000008, "Wrong alignment on UWBP_CourseSelect_Sub_StageBox_3piece_C");
static_assert(sizeof(UWBP_CourseSelect_Sub_StageBox_3piece_C) == 0x000540, "Wrong size on UWBP_CourseSelect_Sub_StageBox_3piece_C");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, UberGraphFrame) == 0x0003D8, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, WBP_CourseSelect_Sub_Thumbnail_01) == 0x0003E0, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::WBP_CourseSelect_Sub_Thumbnail_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, WBP_CourseSelect_Sub_Thumbnail_02) == 0x0003E8, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::WBP_CourseSelect_Sub_Thumbnail_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, WBP_CourseSelect_Sub_Thumbnail_03) == 0x0003F0, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::WBP_CourseSelect_Sub_Thumbnail_03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, ThumbnailButtonArr) == 0x0003F8, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::ThumbnailButtonArr' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, ButtonsPanel) == 0x000408, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::ButtonsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, ValidStageId) == 0x000410, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::ValidStageId' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, OnFocusThumbnail) == 0x000460, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::OnFocusThumbnail' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, DevRomStageId) == 0x000470, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::DevRomStageId' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, bCompleteOnly) == 0x000480, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::bCompleteOnly' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, CourseCompleteRate) == 0x000488, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::CourseCompleteRate' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, Stage_Id_Tmb) == 0x0004D8, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::Stage_Id_Tmb' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, bFocusSoundEnable) == 0x000528, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::bFocusSoundEnable' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_StageBox_3piece_C, OnStoreShortcutClickedDelegate) == 0x000530, "Member 'UWBP_CourseSelect_Sub_StageBox_3piece_C::OnStoreShortcutClickedDelegate' has a wrong offset!");

}

