#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupResult

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GroupResult.WBP_GroupResult_C
// 0x01A0 (0x04C0 - 0x0320)
class UWBP_GroupResult_C final : public UUnionRaceUIGroupResultScene
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GroupResult_Out;                                   // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GroupResult_Loop;                                  // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GroupResult_In;                                    // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_front;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_230;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Base;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Base_WIN_01;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Base_WIN_02;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Base_WIN_03;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_BonusInfo_C*       WBP_GroupResult_Sub_BonusInfo;                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_Table_Line_C*      WBP_GroupResult_Sub_Table_Line_01;                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_Table_Line_C*      WBP_GroupResult_Sub_Table_Line_02;                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_Table_Line_C*      WBP_GroupResult_Sub_Table_Line_03;                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_TeamTable_C*       WBP_GroupResult_Sub_TeamTable_Blue;                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_TeamTable_C*       WBP_GroupResult_Sub_TeamTable_Red;                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GroupResult_Sub_TeamTable_C*       WBP_GroupResult_Sub_TeamTable_Yellow;              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsPress;                                          // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsStart;                                          // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnd;                                            // 0x03BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB[0x5];                                      // 0x03BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GroupResult_C*                     GroupResult;                                       // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPartyResultRacer>              RacerList;                                         // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWBP_GroupResult_Sub_Table_Line_C*> SubTableLineList;                               // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<double>                                NextTotalTime;                                     // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 NextTotalPoint;                                    // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsTimeMode;                                       // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPartyResultTeamInfo                   TeamInfo;                                          // 0x0410(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                NowTimeList;                                       // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 NowPointList;                                      // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsLoadingMode;                                    // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x3];                                      // 0x0479(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Num;                                               // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLastAnimOk;                                     // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              PanelDebugTexture;                                 // 0x0488(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	EGameModeId                                   GameModeID;                                        // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WaitCount;                                         // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuInputRecieveObject*                MenuInputReceiveObject;                            // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GroupResult_Button_front_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_GroupResult_Button_front_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void CloseAnim();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_GroupResult(int32 EntryPoint);
	void FestaResult();
	void Is_Count_Anim_End(bool* bIsEnd_0);
	void LastTeamAnimSet_Party();
	void OnAccept();
	void OnAcceptButton(class UObject* Object);
	void PreConstruct(bool IsDesignTime);
	void RemoveInputRevieveObj();
	void Set_Group_Result_Impl(class UWBP_GroupResult_C* GroupResult_0);
	void SetLoadingMode();
	void SetTeamColor();
	void SetupWidget();
	void StartAnim();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update();
	void UpdateUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GroupResult_C">();
	}
	static class UWBP_GroupResult_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GroupResult_C>();
	}
};
static_assert(alignof(UWBP_GroupResult_C) == 0x000008, "Wrong alignment on UWBP_GroupResult_C");
static_assert(sizeof(UWBP_GroupResult_C) == 0x0004C0, "Wrong size on UWBP_GroupResult_C");
static_assert(offsetof(UWBP_GroupResult_C, UberGraphFrame) == 0x000320, "Member 'UWBP_GroupResult_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, GroupResult_Out) == 0x000328, "Member 'UWBP_GroupResult_C::GroupResult_Out' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, GroupResult_Loop) == 0x000330, "Member 'UWBP_GroupResult_C::GroupResult_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, GroupResult_In) == 0x000338, "Member 'UWBP_GroupResult_C::GroupResult_In' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, Button_front) == 0x000340, "Member 'UWBP_GroupResult_C::Button_front' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, CanvasPanel_230) == 0x000348, "Member 'UWBP_GroupResult_C::CanvasPanel_230' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, DSP_Base) == 0x000350, "Member 'UWBP_GroupResult_C::DSP_Base' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, DSP_Base_WIN_01) == 0x000358, "Member 'UWBP_GroupResult_C::DSP_Base_WIN_01' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, DSP_Base_WIN_02) == 0x000360, "Member 'UWBP_GroupResult_C::DSP_Base_WIN_02' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, DSP_Base_WIN_03) == 0x000368, "Member 'UWBP_GroupResult_C::DSP_Base_WIN_03' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, Panel) == 0x000370, "Member 'UWBP_GroupResult_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, SafeZone) == 0x000378, "Member 'UWBP_GroupResult_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, WBP_GroupResult_Sub_BonusInfo) == 0x000380, "Member 'UWBP_GroupResult_C::WBP_GroupResult_Sub_BonusInfo' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, WBP_GroupResult_Sub_Table_Line_01) == 0x000388, "Member 'UWBP_GroupResult_C::WBP_GroupResult_Sub_Table_Line_01' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, WBP_GroupResult_Sub_Table_Line_02) == 0x000390, "Member 'UWBP_GroupResult_C::WBP_GroupResult_Sub_Table_Line_02' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, WBP_GroupResult_Sub_Table_Line_03) == 0x000398, "Member 'UWBP_GroupResult_C::WBP_GroupResult_Sub_Table_Line_03' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, WBP_GroupResult_Sub_TeamTable_Blue) == 0x0003A0, "Member 'UWBP_GroupResult_C::WBP_GroupResult_Sub_TeamTable_Blue' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, WBP_GroupResult_Sub_TeamTable_Red) == 0x0003A8, "Member 'UWBP_GroupResult_C::WBP_GroupResult_Sub_TeamTable_Red' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, WBP_GroupResult_Sub_TeamTable_Yellow) == 0x0003B0, "Member 'UWBP_GroupResult_C::WBP_GroupResult_Sub_TeamTable_Yellow' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, bIsPress) == 0x0003B8, "Member 'UWBP_GroupResult_C::bIsPress' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, bIsStart) == 0x0003B9, "Member 'UWBP_GroupResult_C::bIsStart' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, bIsEnd) == 0x0003BA, "Member 'UWBP_GroupResult_C::bIsEnd' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, GroupResult) == 0x0003C0, "Member 'UWBP_GroupResult_C::GroupResult' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, RacerList) == 0x0003C8, "Member 'UWBP_GroupResult_C::RacerList' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, SubTableLineList) == 0x0003D8, "Member 'UWBP_GroupResult_C::SubTableLineList' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, NextTotalTime) == 0x0003E8, "Member 'UWBP_GroupResult_C::NextTotalTime' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, NextTotalPoint) == 0x0003F8, "Member 'UWBP_GroupResult_C::NextTotalPoint' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, bIsTimeMode) == 0x000408, "Member 'UWBP_GroupResult_C::bIsTimeMode' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, TeamInfo) == 0x000410, "Member 'UWBP_GroupResult_C::TeamInfo' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, NowTimeList) == 0x000458, "Member 'UWBP_GroupResult_C::NowTimeList' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, NowPointList) == 0x000468, "Member 'UWBP_GroupResult_C::NowPointList' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, bIsLoadingMode) == 0x000478, "Member 'UWBP_GroupResult_C::bIsLoadingMode' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, Num) == 0x00047C, "Member 'UWBP_GroupResult_C::Num' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, bIsLastAnimOk) == 0x000480, "Member 'UWBP_GroupResult_C::bIsLastAnimOk' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, PanelDebugTexture) == 0x000488, "Member 'UWBP_GroupResult_C::PanelDebugTexture' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, GameModeID) == 0x0004B0, "Member 'UWBP_GroupResult_C::GameModeID' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, WaitCount) == 0x0004B4, "Member 'UWBP_GroupResult_C::WaitCount' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_C, MenuInputReceiveObject) == 0x0004B8, "Member 'UWBP_GroupResult_C::MenuInputReceiveObject' has a wrong offset!");

}

