#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineSelect_Sub_TypeBox

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionRun_structs.hpp"
#include "EMachineSelectMode_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineSelect_Sub_TypeBox.WBP_MachineSelect_Sub_TypeBox_C
// 0x00A0 (0x0610 - 0x0570)
class UWBP_MachineSelect_Sub_TypeBox_C final : public UUnionUIAnimScrollControl
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ScrollAnim;                                        // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TypeBox_Right_to_Left;                             // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TypeBox_Left_to_Right;                             // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TypeBox_Loop;                                      // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 MLC_CursorBG;                                      // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MLC_TypeColor;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUILoopScrollBox*                  UnionScroll;                                       // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_MachineBtn_C*    WBP_MachineSelect_Sub_MachineBtn_01;               // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_MachineBtn_C*    WBP_MachineSelect_Sub_MachineBtn_02;               // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_MachineBtn_C*    WBP_MachineSelect_Sub_MachineBtn_03;               // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_MachineBtn_C*    WBP_MachineSelect_Sub_MachineBtn_04;               // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_MachineBtn_C*    WBP_MachineSelect_Sub_MachineBtn_05;               // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_MachineBtn_C*    WBP_MachineSelect_Sub_MachineBtn_06;               // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MachineSelect_Sub_MachineBtn_C*    WBP_MachineSelect_Sub_MachineBtn_07;               // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PlayerNumberIndex;                                 // 0x05E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ECarStatusType                                machineType;                                       // 0x05EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5ED[0x3];                                      // 0x05ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EMachineId>                            MachineIds;                                        // 0x05F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EMachineSelectMode::EMachineSelectMode        Mode;                                              // 0x0600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuResourcePreloader*                 ResourcePreloader;                                 // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MachineSelect_Sub_TypeBox_UnionScroll_K2Node_ComponentBoundEvent_0_ScrollAnimationEvent__DelegateSignature(class UUnionUILoopScrollBox* FinishedWidget);
	void CancelBack();
	void Close();
	void Construct();
	void ExecuteUbergraph_WBP_MachineSelect_Sub_TypeBox(int32 EntryPoint);
	void OnFinishedScrollAnimationBP();
	void OnScrollAnimFinishedEvent(class UUnionUILoopScrollBox* FinishedWidget);
	void PlayScroll(bool bDownRight, bool bInImmediateReflection);
	void PreConstruct(bool IsDesignTime);
	void SetCursorVisible(bool NewVisible);
	void SetElementTexture(const int32& InIndex, class UTexture2D* InTexture);
	void SetFocusIndex(int32 InSelectMachineIndex);
	void SetIconScale(int32 Index_0, double Scale, double Ytransrate);
	void SetMachineID(int32 Index_0, EMachineId MachineId);
	void SetMachineType(ECarStatusType machineType_0);
	void SetMachineTypeColorWidth(int32 Width);
	void SetMode(EMachineSelectMode::EMachineSelectMode InMode);
	void SetPlayerControllerIndex(int32 Index_0);
	void Setup();
	void SetupButton(class UWBP_MachineSelect_Sub_MachineBtn_C* InButton, int32 InIndex, EMachineId InMachineID);
	void StopScroll();
	void UpdateIconScale();
	void UpdateIconSizeAndYTransrate(class UDataTable* DataTable, int32 Index_0, bool bYTransrateAdjust);
	void UpdateIconTextures();
	void UpdateMachineIds();

	void CalcTmpElementMax(int32 InCount, int32 InAlreadyCount, int32* OutTmpElementMax) const;
	void GetCenter(class UObject** Output, int32* Index_0, EMachineId* MachineId) const;
	void GetCurrentItemDisplayIndex(int32* OutDisplayIndex) const;
	void GetIconTexture(EMachineId InMachineID, class UTexture2D** OutIconTexture, bool* bOutIsFound) const;
	void GetMachineId(int32 InMachineIndex, EMachineId* OutMachineId) const;
	void GetMachineIdCurrent(EMachineId* MachineId) const;
	void GetMachineIdNext(bool isNext, EMachineId* MachineId) const;
	void GetMachineIds(TArray<EMachineId>* MachineIds_0) const;
	void GetMachineNum(int32* OutMachineNum) const;
	void GetMachineType(ECarStatusType* Machine_Type) const;
	void GetMode(EMachineSelectMode::EMachineSelectMode* OutMode) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineSelect_Sub_TypeBox_C">();
	}
	static class UWBP_MachineSelect_Sub_TypeBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineSelect_Sub_TypeBox_C>();
	}
};
static_assert(alignof(UWBP_MachineSelect_Sub_TypeBox_C) == 0x000008, "Wrong alignment on UWBP_MachineSelect_Sub_TypeBox_C");
static_assert(sizeof(UWBP_MachineSelect_Sub_TypeBox_C) == 0x000610, "Wrong size on UWBP_MachineSelect_Sub_TypeBox_C");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, UberGraphFrame) == 0x000570, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, ScrollAnim) == 0x000578, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::ScrollAnim' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, TypeBox_Right_to_Left) == 0x000580, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::TypeBox_Right_to_Left' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, TypeBox_Left_to_Right) == 0x000588, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::TypeBox_Left_to_Right' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, TypeBox_Loop) == 0x000590, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::TypeBox_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, MLC_CursorBG) == 0x000598, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::MLC_CursorBG' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, MLC_TypeColor) == 0x0005A0, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::MLC_TypeColor' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, UnionScroll) == 0x0005A8, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::UnionScroll' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, WBP_MachineSelect_Sub_MachineBtn_01) == 0x0005B0, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::WBP_MachineSelect_Sub_MachineBtn_01' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, WBP_MachineSelect_Sub_MachineBtn_02) == 0x0005B8, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::WBP_MachineSelect_Sub_MachineBtn_02' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, WBP_MachineSelect_Sub_MachineBtn_03) == 0x0005C0, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::WBP_MachineSelect_Sub_MachineBtn_03' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, WBP_MachineSelect_Sub_MachineBtn_04) == 0x0005C8, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::WBP_MachineSelect_Sub_MachineBtn_04' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, WBP_MachineSelect_Sub_MachineBtn_05) == 0x0005D0, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::WBP_MachineSelect_Sub_MachineBtn_05' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, WBP_MachineSelect_Sub_MachineBtn_06) == 0x0005D8, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::WBP_MachineSelect_Sub_MachineBtn_06' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, WBP_MachineSelect_Sub_MachineBtn_07) == 0x0005E0, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::WBP_MachineSelect_Sub_MachineBtn_07' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, PlayerNumberIndex) == 0x0005E8, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::PlayerNumberIndex' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, machineType) == 0x0005EC, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::machineType' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, MachineIds) == 0x0005F0, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::MachineIds' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, Mode) == 0x000600, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::Mode' has a wrong offset!");
static_assert(offsetof(UWBP_MachineSelect_Sub_TypeBox_C, ResourcePreloader) == 0x000608, "Member 'UWBP_MachineSelect_Sub_TypeBox_C::ResourcePreloader' has a wrong offset!");

}

