#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineSelect_Sub_PartsScrollBox_FR

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_MachineSelect_Sub_PartsScrollBox_FR.WBP_MachineSelect_Sub_PartsScrollBox_FR_C.PlaySoundImpossible
// 0x0004 (0x0004 - 0x0000)
struct WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundImpossible final
{
public:
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0000(0x0004)()
};
static_assert(alignof(WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundImpossible) == 0x000004, "Wrong alignment on WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundImpossible");
static_assert(sizeof(WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundImpossible) == 0x000004, "Wrong size on WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundImpossible");
static_assert(offsetof(WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundImpossible, CallFunc_SoundPlay_ReturnValue) == 0x000000, "Member 'WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundImpossible::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");

// Function WBP_MachineSelect_Sub_PartsScrollBox_FR.WBP_MachineSelect_Sub_PartsScrollBox_FR_C.PlaySoundPossible
// 0x0004 (0x0004 - 0x0000)
struct WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundPossible final
{
public:
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0000(0x0004)()
};
static_assert(alignof(WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundPossible) == 0x000004, "Wrong alignment on WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundPossible");
static_assert(sizeof(WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundPossible) == 0x000004, "Wrong size on WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundPossible");
static_assert(offsetof(WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundPossible, CallFunc_SoundPlay_ReturnValue) == 0x000000, "Member 'WBP_MachineSelect_Sub_PartsScrollBox_FR_C_PlaySoundPossible::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");

}

