#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCharaSelect_M1

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCharaSelect_M1.WBP_MachineCharaSelect_M1_C
// 0x0028 (0x0398 - 0x0370)
class UWBP_MachineCharaSelect_M1_C final : public UCharaMachineSelectsBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       M1_Out;                                            // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       M1_Loop;                                           // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       M1_In;                                             // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCharaSelect_M1_P1_C*        WBP_MachineCharaSelect_M1_P1;                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MachineCharaSelect_M1(int32 EntryPoint);
	void OnInit();
	void OnPlayAnimationIn();
	void OnPlayAnimationNormal();
	void OnPlayAnimationOut();
	void PlaySoundError();
	void WidgetAnimationEvt_M1_In_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCharaSelect_M1_C">();
	}
	static class UWBP_MachineCharaSelect_M1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCharaSelect_M1_C>();
	}
};
static_assert(alignof(UWBP_MachineCharaSelect_M1_C) == 0x000008, "Wrong alignment on UWBP_MachineCharaSelect_M1_C");
static_assert(sizeof(UWBP_MachineCharaSelect_M1_C) == 0x000398, "Wrong size on UWBP_MachineCharaSelect_M1_C");
static_assert(offsetof(UWBP_MachineCharaSelect_M1_C, UberGraphFrame) == 0x000370, "Member 'UWBP_MachineCharaSelect_M1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCharaSelect_M1_C, M1_Out) == 0x000378, "Member 'UWBP_MachineCharaSelect_M1_C::M1_Out' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCharaSelect_M1_C, M1_Loop) == 0x000380, "Member 'UWBP_MachineCharaSelect_M1_C::M1_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCharaSelect_M1_C, M1_In) == 0x000388, "Member 'UWBP_MachineCharaSelect_M1_C::M1_In' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCharaSelect_M1_C, WBP_MachineCharaSelect_M1_P1) == 0x000390, "Member 'UWBP_MachineCharaSelect_M1_C::WBP_MachineCharaSelect_M1_P1' has a wrong offset!");

}

