#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyRace_02

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_PartyRace_02.WBP_PartyRace_02_C.BindPresetButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_02_C_BindPresetButton final
{
public:
	class UPartyRaceSubPresetBtn*                 InPresetButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_02_C_BindPresetButton) == 0x000008, "Wrong alignment on WBP_PartyRace_02_C_BindPresetButton");
static_assert(sizeof(WBP_PartyRace_02_C_BindPresetButton) == 0x000008, "Wrong size on WBP_PartyRace_02_C_BindPresetButton");
static_assert(offsetof(WBP_PartyRace_02_C_BindPresetButton, InPresetButton) == 0x000000, "Member 'WBP_PartyRace_02_C_BindPresetButton::InPresetButton' has a wrong offset!");

// Function WBP_PartyRace_02.WBP_PartyRace_02_C.DeselectOtherButtons
// 0x0028 (0x0028 - 0x0000)
struct WBP_PartyRace_02_C_DeselectOtherButtons final
{
public:
	int32                                         SelectedButtonIndex;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPartyRaceSubPresetBtn*                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_02_C_DeselectOtherButtons) == 0x000008, "Wrong alignment on WBP_PartyRace_02_C_DeselectOtherButtons");
static_assert(sizeof(WBP_PartyRace_02_C_DeselectOtherButtons) == 0x000028, "Wrong size on WBP_PartyRace_02_C_DeselectOtherButtons");
static_assert(offsetof(WBP_PartyRace_02_C_DeselectOtherButtons, SelectedButtonIndex) == 0x000000, "Member 'WBP_PartyRace_02_C_DeselectOtherButtons::SelectedButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_DeselectOtherButtons, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_PartyRace_02_C_DeselectOtherButtons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_DeselectOtherButtons, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_PartyRace_02_C_DeselectOtherButtons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_DeselectOtherButtons, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_PartyRace_02_C_DeselectOtherButtons::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_DeselectOtherButtons, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'WBP_PartyRace_02_C_DeselectOtherButtons::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_DeselectOtherButtons, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_PartyRace_02_C_DeselectOtherButtons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_DeselectOtherButtons, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_PartyRace_02_C_DeselectOtherButtons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_DeselectOtherButtons, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_PartyRace_02_C_DeselectOtherButtons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_DeselectOtherButtons, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WBP_PartyRace_02_C_DeselectOtherButtons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_PartyRace_02.WBP_PartyRace_02_C.ExecuteUbergraph_WBP_PartyRace_02
// 0x0388 (0x0388 - 0x0000)
struct WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0004(0x0004)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableRaceParkRivalOnOffMilestoneVersion_ReturnValue; // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableDecisionInRaceParkMilestoneVersion_ReturnValue; // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableDecisionInRaceParkMilestoneVersion_ReturnValue_1; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPartyRaceSubPresetBtn*                 K2Node_CustomEvent_InPresetButton_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPartyRaceSubPresetBtn*                 K2Node_CustomEvent_InPresetButton;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_SpawnObject_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBaseCore*                 K2Node_CustomEvent_Button_3;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_DynamicCast_AsUnion_UIButton_Base;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRacePreset                              Temp_byte_Variable;                                // 0x0069(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPartyRaceSubPresetBtn*                 CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPartyRacePreset                              CallFunc_GetPreset_ReturnValue;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBaseCore* Button)> K2Node_CreateDelegate_OutputDelegate;      // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBaseCore* Button)> K2Node_CreateDelegate_OutputDelegate_1;    // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPartyRaceSubPresetBtn*                 CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPartyRacePreset                              CallFunc_GetPreset_ReturnValue_1;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPartyRaceSubPresetBtn*                 CallFunc_Array_Get_Item_2;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPartyRaceSubPresetBtn*                 CallFunc_Array_Get_Item_3;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_PresetBtn_C*         K2Node_DynamicCast_AsWBP_Party_Race_Sub_Preset_Btn; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPartyRaceSubPresetBtn*                 CallFunc_Array_Get_Item_4;                         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBaseCore*                 K2Node_CustomEvent_Button_1;                       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBaseCore*                 K2Node_CustomEvent_Button;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPartyRacePresetSetting                CallFunc_GetRaceParkCustomRaceSetting_OutSetting;  // 0x0170(0x00B8)()
	int32                                         Temp_int_Variable;                                 // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_233[0x1];                                      // 0x0233(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_4; // 0x023C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24E[0x2];                                      // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBaseCore* Button)> K2Node_CreateDelegate_OutputDelegate_5;    // 0x0258(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPartyRacePresetSetting                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0268(0x00B8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBaseCore* Button)> K2Node_CreateDelegate_OutputDelegate_6;    // 0x0324(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPartyRaceSubPresetBtn*>         K2Node_MakeArray_Array;                            // 0x0338(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_bIsONOFF;                       // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsCustom;                      // 0x0349(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x2];                                      // 0x034A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetLastFocusedButton_ReturnValue;         // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPartyRaceSubPresetBtn*                 CallFunc_Array_Get_Item_5;                         // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonStandard*                 K2Node_DynamicCast_AsUnion_UIButton_Standard;      // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PartyRace_Sub_PresetBtn_C*         K2Node_DynamicCast_AsWBP_Party_Race_Sub_Preset_Btn_1; // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyRaceCustomRivalExists_ReturnValue; // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0383(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02) == 0x000008, "Wrong alignment on WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02");
static_assert(sizeof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02) == 0x000388, "Wrong size on WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, EntryPoint) == 0x000000, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_SoundPlay_ReturnValue) == 0x000004, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, Temp_int_Array_Index_Variable_2) == 0x000018, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_IsDisableRaceParkRivalOnOffMilestoneVersion_ReturnValue) == 0x00001C, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_IsDisableRaceParkRivalOnOffMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_IsDisableDecisionInRaceParkMilestoneVersion_ReturnValue) == 0x00001D, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_IsDisableDecisionInRaceParkMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, Temp_int_Loop_Counter_Variable_2) == 0x00002C, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Add_IntInt_ReturnValue_2) == 0x000034, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_IsDisableDecisionInRaceParkMilestoneVersion_ReturnValue_1) == 0x000038, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_IsDisableDecisionInRaceParkMilestoneVersion_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CustomEvent_InPresetButton_1) == 0x000040, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CustomEvent_InPresetButton_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CustomEvent_InPresetButton) == 0x000048, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CustomEvent_InPresetButton' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_SpawnObject_ReturnValue) == 0x000050, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CustomEvent_Button_3) == 0x000058, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CustomEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_DynamicCast_AsUnion_UIButton_Base) == 0x000060, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_DynamicCast_AsUnion_UIButton_Base' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, Temp_byte_Variable) == 0x000069, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_GetPreset_ReturnValue) == 0x000078, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_GetPreset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000079, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CreateDelegate_OutputDelegate_1) == 0x00008C, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00009C, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00009D, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_BooleanAND_ReturnValue) == 0x00009E, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_GetPreset_ReturnValue_1) == 0x0000A8, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_GetPreset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000A9, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_BooleanAND_ReturnValue_1) == 0x0000BC, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Array_Get_Item_2) == 0x0000C0, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000CC, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, Temp_int_Loop_Counter_Variable_3) == 0x0000DC, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Array_Get_Item_3) == 0x0000E0, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_DynamicCast_AsWBP_Party_Race_Sub_Preset_Btn) == 0x0000E8, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_DynamicCast_AsWBP_Party_Race_Sub_Preset_Btn' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F1, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000F4, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Array_Length_ReturnValue_2) == 0x0000F8, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000FC, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CustomEvent_Button_2) == 0x000100, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CustomEvent_PanelIndex) == 0x000108, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CustomEvent_PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CustomEvent_ButtonIndex) == 0x00010C, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Array_Get_Item_4) == 0x000110, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Array_Length_ReturnValue_3) == 0x000118, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Less_IntInt_ReturnValue_3) == 0x00011C, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CustomEvent_Button_1) == 0x000120, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CustomEvent_Button) == 0x000128, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000130, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000138, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_PlayAnimation_ReturnValue) == 0x000148, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_MakeLiteralInt_ReturnValue) == 0x000150, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000158, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000160, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_IsValid_ReturnValue_1) == 0x000168, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_GetRaceParkCustomRaceSetting_OutSetting) == 0x000170, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_GetRaceParkCustomRaceSetting_OutSetting' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, Temp_int_Variable) == 0x000228, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Add_IntInt_ReturnValue_4) == 0x00022C, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Conv_IntToByte_ReturnValue) == 0x000230, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000231, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Less_IntInt_ReturnValue_4) == 0x000232, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000234, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, Temp_int_Variable_1) == 0x000238, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CreateDelegate_OutputDelegate_4) == 0x00023C, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00024C, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_GetValidValue_ReturnValue) == 0x00024D, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_GetEnumeratorName_ReturnValue) == 0x000250, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CreateDelegate_OutputDelegate_5) == 0x000258, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_GetDataTableRowFromName_OutRow) == 0x000268, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000320, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CreateDelegate_OutputDelegate_6) == 0x000324, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_MakeArray_Array) == 0x000338, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CustomEvent_bIsONOFF) == 0x000348, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CustomEvent_bIsONOFF' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_CustomEvent_bIsCustom) == 0x000349, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_CustomEvent_bIsCustom' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, Temp_int_Array_Index_Variable_3) == 0x00034C, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex) == 0x000350, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_GetLastFocusedButton_ReturnValue) == 0x000358, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_GetLastFocusedButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_Array_Get_Item_5) == 0x000360, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_DynamicCast_AsUnion_UIButton_Standard) == 0x000368, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_DynamicCast_AsUnion_UIButton_Standard' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_DynamicCast_bSuccess_2) == 0x000370, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_DynamicCast_AsWBP_Party_Race_Sub_Preset_Btn_1) == 0x000378, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_DynamicCast_AsWBP_Party_Race_Sub_Preset_Btn_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, K2Node_DynamicCast_bSuccess_3) == 0x000380, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_IsValid_ReturnValue_2) == 0x000381, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_IsPartyRaceCustomRivalExists_ReturnValue) == 0x000382, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_IsPartyRaceCustomRivalExists_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000383, "Member 'WBP_PartyRace_02_C_ExecuteUbergraph_WBP_PartyRace_02::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_PartyRace_02.WBP_PartyRace_02_C.FocusStart
// 0x0050 (0x0050 - 0x0000)
struct WBP_PartyRace_02_C_FocusStart final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetLastFocusedButton_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonStandard*                 K2Node_DynamicCast_AsUnion_UIButton_Standard;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPartyRaceSubPresetBtn*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_02_C_FocusStart) == 0x000008, "Wrong alignment on WBP_PartyRace_02_C_FocusStart");
static_assert(sizeof(WBP_PartyRace_02_C_FocusStart) == 0x000050, "Wrong size on WBP_PartyRace_02_C_FocusStart");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_PartyRace_02_C_FocusStart::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_PartyRace_02_C_FocusStart::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex) == 0x000008, "Member 'WBP_PartyRace_02_C_FocusStart::CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, CallFunc_GetLastFocusedButton_ReturnValue) == 0x000010, "Member 'WBP_PartyRace_02_C_FocusStart::CallFunc_GetLastFocusedButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, K2Node_DynamicCast_AsUnion_UIButton_Standard) == 0x000018, "Member 'WBP_PartyRace_02_C_FocusStart::K2Node_DynamicCast_AsUnion_UIButton_Standard' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_PartyRace_02_C_FocusStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_PartyRace_02_C_FocusStart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, CallFunc_HasAnyUserFocus_ReturnValue) == 0x000022, "Member 'WBP_PartyRace_02_C_FocusStart::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, CallFunc_Not_PreBool_ReturnValue) == 0x000023, "Member 'WBP_PartyRace_02_C_FocusStart::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_PartyRace_02_C_FocusStart::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_PartyRace_02_C_FocusStart::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_PartyRace_02_C_FocusStart::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'WBP_PartyRace_02_C_FocusStart::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_PartyRace_02_C_FocusStart::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_02_C_FocusStart, CallFunc_GetPlayerController_ReturnValue_1) == 0x000048, "Member 'WBP_PartyRace_02_C_FocusStart::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");

// Function WBP_PartyRace_02.WBP_PartyRace_02_C.InSubButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_PartyRace_02_C_InSubButton final
{
public:
	bool                                          CallFunc_IsDisableDecisionInRaceParkMilestoneVersion_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_02_C_InSubButton) == 0x000001, "Wrong alignment on WBP_PartyRace_02_C_InSubButton");
static_assert(sizeof(WBP_PartyRace_02_C_InSubButton) == 0x000001, "Wrong size on WBP_PartyRace_02_C_InSubButton");
static_assert(offsetof(WBP_PartyRace_02_C_InSubButton, CallFunc_IsDisableDecisionInRaceParkMilestoneVersion_ReturnValue) == 0x000000, "Member 'WBP_PartyRace_02_C_InSubButton::CallFunc_IsDisableDecisionInRaceParkMilestoneVersion_ReturnValue' has a wrong offset!");

// Function WBP_PartyRace_02.WBP_PartyRace_02_C.OnGadgetCustomClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_02_C_OnGadgetCustomClicked final
{
public:
	class UUnionUIButtonBaseCore*                 Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_02_C_OnGadgetCustomClicked) == 0x000008, "Wrong alignment on WBP_PartyRace_02_C_OnGadgetCustomClicked");
static_assert(sizeof(WBP_PartyRace_02_C_OnGadgetCustomClicked) == 0x000008, "Wrong size on WBP_PartyRace_02_C_OnGadgetCustomClicked");
static_assert(offsetof(WBP_PartyRace_02_C_OnGadgetCustomClicked, Button) == 0x000000, "Member 'WBP_PartyRace_02_C_OnGadgetCustomClicked::Button' has a wrong offset!");

// Function WBP_PartyRace_02.WBP_PartyRace_02_C.OnRivalSelectClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_02_C_OnRivalSelectClicked final
{
public:
	class UUnionUIButtonBaseCore*                 Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_02_C_OnRivalSelectClicked) == 0x000008, "Wrong alignment on WBP_PartyRace_02_C_OnRivalSelectClicked");
static_assert(sizeof(WBP_PartyRace_02_C_OnRivalSelectClicked) == 0x000008, "Wrong size on WBP_PartyRace_02_C_OnRivalSelectClicked");
static_assert(offsetof(WBP_PartyRace_02_C_OnRivalSelectClicked, Button) == 0x000000, "Member 'WBP_PartyRace_02_C_OnRivalSelectClicked::Button' has a wrong offset!");

// Function WBP_PartyRace_02.WBP_PartyRace_02_C.OnSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_02_C_OnSelected final
{
public:
	class UUnionUIButtonBaseCore*                 Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_02_C_OnSelected) == 0x000008, "Wrong alignment on WBP_PartyRace_02_C_OnSelected");
static_assert(sizeof(WBP_PartyRace_02_C_OnSelected) == 0x000008, "Wrong size on WBP_PartyRace_02_C_OnSelected");
static_assert(offsetof(WBP_PartyRace_02_C_OnSelected, Button) == 0x000000, "Member 'WBP_PartyRace_02_C_OnSelected::Button' has a wrong offset!");

// Function WBP_PartyRace_02.WBP_PartyRace_02_C.OnUISceneDecisionEvent_Event
// 0x0010 (0x0010 - 0x0000)
struct WBP_PartyRace_02_C_OnUISceneDecisionEvent_Event final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
