#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AddCharacterInfo

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AddCharacterInfo.WBP_AddCharacterInfo_C
// 0x01D0 (0x04D0 - 0x0300)
class UWBP_AddCharacterInfo_C final : public UAddCharacterInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AddChara_In;                                       // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_BG;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Black;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Black_Cover;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Center;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Grad_Y_B;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Grad_Y_T;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Turbulent_C;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Turbulent_M;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Turbulent_Y;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Black_Cover;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cloud_Left;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cloud_Left_02;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cloud_Right;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cloud_Right_02;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DMY_CharaSet;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_10;                                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_11;                                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_00;                                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_01;                                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_02;                                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_03;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_04;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_05;                                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_06;                                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_07;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_08;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_09;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_Core_Add_01;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_Core_Add_02;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_Light;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Light;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Light_Center;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Light_Center_1;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Light_Center_Eff;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameBase;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameLine_B;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameLine_T;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Left_1;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Right_1;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_CharaName_01;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Title_Bottom;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Title_Top;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AddCharacterInfo_Sub_Ring_C*       WBP_AddCharacterInfo_Sub_Ring_01;                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AddCharacterInfo_Sub_Ring_C*       WBP_AddCharacterInfo_Sub_Ring_02;                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AddCharacterInfo_Sub_Ring_C*       WBP_AddCharacterInfo_Sub_Ring_03;                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AddCharacterInfo_Sub_Ring_C*       WBP_AddCharacterInfo_Sub_Ring_04;                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AddCharacterInfo_Sub_Ring_C*       WBP_AddCharacterInfo_Sub_Ring_05;                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 White;                                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Left;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Left_1;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Left_2;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Right;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Right_1;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowLine_Right_2;                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnEndAnim;                                         // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EditOpen(EDriverId characterId);
	void ExecuteUbergraph_WBP_AddCharacterInfo(int32 EntryPoint);
	void GetCharacterInfos(TArray<class UWBP_AddCharacterInfo_Sub_Ring_C*>* Infos);
	void OnInitialized();
	void OnOpenAnimEnd();
	void Open(EDriverId characterId);
	void SetLastCutTexture(class UTexture2D* Texture);
	void SetSubWidgetTexture(class UUserWidget* SubWidget, class UTexture2D* Texture);
	void SetText(const class FText& TopText, const class FText& BottomText, const class FText& NameText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AddCharacterInfo_C">();
	}
	static class UWBP_AddCharacterInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AddCharacterInfo_C>();
	}
};
static_assert(alignof(UWBP_AddCharacterInfo_C) == 0x000008, "Wrong alignment on UWBP_AddCharacterInfo_C");
static_assert(sizeof(UWBP_AddCharacterInfo_C) == 0x0004D0, "Wrong size on UWBP_AddCharacterInfo_C");
static_assert(offsetof(UWBP_AddCharacterInfo_C, UberGraphFrame) == 0x000300, "Member 'UWBP_AddCharacterInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, AddChara_In) == 0x000308, "Member 'UWBP_AddCharacterInfo_C::AddChara_In' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Base_BG) == 0x000310, "Member 'UWBP_AddCharacterInfo_C::Base_BG' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, BG_Black) == 0x000318, "Member 'UWBP_AddCharacterInfo_C::BG_Black' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, BG_Black_Cover) == 0x000320, "Member 'UWBP_AddCharacterInfo_C::BG_Black_Cover' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, BG_Center) == 0x000328, "Member 'UWBP_AddCharacterInfo_C::BG_Center' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, BG_Grad_Y_B) == 0x000330, "Member 'UWBP_AddCharacterInfo_C::BG_Grad_Y_B' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, BG_Grad_Y_T) == 0x000338, "Member 'UWBP_AddCharacterInfo_C::BG_Grad_Y_T' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, BG_Turbulent_C) == 0x000340, "Member 'UWBP_AddCharacterInfo_C::BG_Turbulent_C' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, BG_Turbulent_M) == 0x000348, "Member 'UWBP_AddCharacterInfo_C::BG_Turbulent_M' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, BG_Turbulent_Y) == 0x000350, "Member 'UWBP_AddCharacterInfo_C::BG_Turbulent_Y' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Black_Cover) == 0x000358, "Member 'UWBP_AddCharacterInfo_C::Black_Cover' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Cloud_Left) == 0x000360, "Member 'UWBP_AddCharacterInfo_C::Cloud_Left' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Cloud_Left_02) == 0x000368, "Member 'UWBP_AddCharacterInfo_C::Cloud_Left_02' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Cloud_Right) == 0x000370, "Member 'UWBP_AddCharacterInfo_C::Cloud_Right' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Cloud_Right_02) == 0x000378, "Member 'UWBP_AddCharacterInfo_C::Cloud_Right_02' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, DMY_CharaSet) == 0x000380, "Member 'UWBP_AddCharacterInfo_C::DMY_CharaSet' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_10) == 0x000388, "Member 'UWBP_AddCharacterInfo_C::Eff_10' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_11) == 0x000390, "Member 'UWBP_AddCharacterInfo_C::Eff_11' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_00) == 0x000398, "Member 'UWBP_AddCharacterInfo_C::Eff_00' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_01) == 0x0003A0, "Member 'UWBP_AddCharacterInfo_C::Eff_01' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_02) == 0x0003A8, "Member 'UWBP_AddCharacterInfo_C::Eff_02' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_03) == 0x0003B0, "Member 'UWBP_AddCharacterInfo_C::Eff_03' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_04) == 0x0003B8, "Member 'UWBP_AddCharacterInfo_C::Eff_04' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_05) == 0x0003C0, "Member 'UWBP_AddCharacterInfo_C::Eff_05' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_06) == 0x0003C8, "Member 'UWBP_AddCharacterInfo_C::Eff_06' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_07) == 0x0003D0, "Member 'UWBP_AddCharacterInfo_C::Eff_07' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_08) == 0x0003D8, "Member 'UWBP_AddCharacterInfo_C::Eff_08' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_09) == 0x0003E0, "Member 'UWBP_AddCharacterInfo_C::Eff_09' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_Core_Add_01) == 0x0003E8, "Member 'UWBP_AddCharacterInfo_C::Eff_Core_Add_01' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_Core_Add_02) == 0x0003F0, "Member 'UWBP_AddCharacterInfo_C::Eff_Core_Add_02' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Eff_Light) == 0x0003F8, "Member 'UWBP_AddCharacterInfo_C::Eff_Light' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Light) == 0x000400, "Member 'UWBP_AddCharacterInfo_C::Light' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Light_Center) == 0x000408, "Member 'UWBP_AddCharacterInfo_C::Light_Center' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Light_Center_1) == 0x000410, "Member 'UWBP_AddCharacterInfo_C::Light_Center_1' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, Light_Center_Eff) == 0x000418, "Member 'UWBP_AddCharacterInfo_C::Light_Center_Eff' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, NameBase) == 0x000420, "Member 'UWBP_AddCharacterInfo_C::NameBase' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, NameLine_B) == 0x000428, "Member 'UWBP_AddCharacterInfo_C::NameLine_B' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, NameLine_T) == 0x000430, "Member 'UWBP_AddCharacterInfo_C::NameLine_T' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, RaceFlag_Left_1) == 0x000438, "Member 'UWBP_AddCharacterInfo_C::RaceFlag_Left_1' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, RaceFlag_Right_1) == 0x000440, "Member 'UWBP_AddCharacterInfo_C::RaceFlag_Right_1' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, TXT_CharaName_01) == 0x000448, "Member 'UWBP_AddCharacterInfo_C::TXT_CharaName_01' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, TXT_Title_Bottom) == 0x000450, "Member 'UWBP_AddCharacterInfo_C::TXT_Title_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, TXT_Title_Top) == 0x000458, "Member 'UWBP_AddCharacterInfo_C::TXT_Title_Top' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, WBP_AddCharacterInfo_Sub_Ring_01) == 0x000460, "Member 'UWBP_AddCharacterInfo_C::WBP_AddCharacterInfo_Sub_Ring_01' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, WBP_AddCharacterInfo_Sub_Ring_02) == 0x000468, "Member 'UWBP_AddCharacterInfo_C::WBP_AddCharacterInfo_Sub_Ring_02' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, WBP_AddCharacterInfo_Sub_Ring_03) == 0x000470, "Member 'UWBP_AddCharacterInfo_C::WBP_AddCharacterInfo_Sub_Ring_03' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, WBP_AddCharacterInfo_Sub_Ring_04) == 0x000478, "Member 'UWBP_AddCharacterInfo_C::WBP_AddCharacterInfo_Sub_Ring_04' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, WBP_AddCharacterInfo_Sub_Ring_05) == 0x000480, "Member 'UWBP_AddCharacterInfo_C::WBP_AddCharacterInfo_Sub_Ring_05' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, White) == 0x000488, "Member 'UWBP_AddCharacterInfo_C::White' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, YellowLine_Left) == 0x000490, "Member 'UWBP_AddCharacterInfo_C::YellowLine_Left' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, YellowLine_Left_1) == 0x000498, "Member 'UWBP_AddCharacterInfo_C::YellowLine_Left_1' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, YellowLine_Left_2) == 0x0004A0, "Member 'UWBP_AddCharacterInfo_C::YellowLine_Left_2' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, YellowLine_Right) == 0x0004A8, "Member 'UWBP_AddCharacterInfo_C::YellowLine_Right' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, YellowLine_Right_1) == 0x0004B0, "Member 'UWBP_AddCharacterInfo_C::YellowLine_Right_1' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, YellowLine_Right_2) == 0x0004B8, "Member 'UWBP_AddCharacterInfo_C::YellowLine_Right_2' has a wrong offset!");
static_assert(offsetof(UWBP_AddCharacterInfo_C, OnEndAnim) == 0x0004C0, "Member 'UWBP_AddCharacterInfo_C::OnEndAnim' has a wrong offset!");

}

