#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_MatchingInfo_Small

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Friend_MatchingInfo_Small.WBP_Friend_MatchingInfo_Small_C
// 0x0040 (0x0340 - 0x0300)
class UWBP_Friend_MatchingInfo_Small_C final : public UCommonLineMessageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MatchingInfo_Small_Out;                            // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MatchingInfo_Small_Loop;                           // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MatchingInfo_Small_In;                             // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_Finish;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseShadow_Finish;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_All;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Info;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Friend_MatchingInfo_Small(int32 EntryPoint);
	void OnAnimationInFinished();
	void OnAnimationOutFinished();
	void PlayAnimationIn();
	void PlayAnimationOut();
	void SetMessageText(const class FText& InMessageText);
	void SetupAnimationEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Friend_MatchingInfo_Small_C">();
	}
	static class UWBP_Friend_MatchingInfo_Small_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Friend_MatchingInfo_Small_C>();
	}
};
static_assert(alignof(UWBP_Friend_MatchingInfo_Small_C) == 0x000008, "Wrong alignment on UWBP_Friend_MatchingInfo_Small_C");
static_assert(sizeof(UWBP_Friend_MatchingInfo_Small_C) == 0x000340, "Wrong size on UWBP_Friend_MatchingInfo_Small_C");
static_assert(offsetof(UWBP_Friend_MatchingInfo_Small_C, UberGraphFrame) == 0x000300, "Member 'UWBP_Friend_MatchingInfo_Small_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_MatchingInfo_Small_C, MatchingInfo_Small_Out) == 0x000308, "Member 'UWBP_Friend_MatchingInfo_Small_C::MatchingInfo_Small_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_MatchingInfo_Small_C, MatchingInfo_Small_Loop) == 0x000310, "Member 'UWBP_Friend_MatchingInfo_Small_C::MatchingInfo_Small_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_MatchingInfo_Small_C, MatchingInfo_Small_In) == 0x000318, "Member 'UWBP_Friend_MatchingInfo_Small_C::MatchingInfo_Small_In' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_MatchingInfo_Small_C, Base_Finish) == 0x000320, "Member 'UWBP_Friend_MatchingInfo_Small_C::Base_Finish' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_MatchingInfo_Small_C, BaseShadow_Finish) == 0x000328, "Member 'UWBP_Friend_MatchingInfo_Small_C::BaseShadow_Finish' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_MatchingInfo_Small_C, Overlay_All) == 0x000330, "Member 'UWBP_Friend_MatchingInfo_Small_C::Overlay_All' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_MatchingInfo_Small_C, TXT_Info) == 0x000338, "Member 'UWBP_Friend_MatchingInfo_Small_C::TXT_Info' has a wrong offset!");

}

