#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_Random

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_Random.WBP_MachineCustom_Sub_Random_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_MachineCustom_Sub_Random_C final : public UUserWidget
{
public:
	class UWBP_CustomRandom_Sub_MenuBtn_C*        WBP_CustomRandom_Sub_MenuBtn_01;                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CustomRandom_Sub_MenuBtn_C*        WBP_CustomRandom_Sub_MenuBtn_02;                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CustomRandom_Sub_MenuBtn_C*        WBP_CustomRandom_Sub_MenuBtn_03;                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CustomRandom_Sub_MenuBtn_C*        WBP_CustomRandom_Sub_MenuBtn_04;                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_Random_C">();
	}
	static class UWBP_MachineCustom_Sub_Random_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_Random_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_Random_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_Random_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_Random_C) == 0x000300, "Wrong size on UWBP_MachineCustom_Sub_Random_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_Random_C, WBP_CustomRandom_Sub_MenuBtn_01) == 0x0002E0, "Member 'UWBP_MachineCustom_Sub_Random_C::WBP_CustomRandom_Sub_MenuBtn_01' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Random_C, WBP_CustomRandom_Sub_MenuBtn_02) == 0x0002E8, "Member 'UWBP_MachineCustom_Sub_Random_C::WBP_CustomRandom_Sub_MenuBtn_02' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Random_C, WBP_CustomRandom_Sub_MenuBtn_03) == 0x0002F0, "Member 'UWBP_MachineCustom_Sub_Random_C::WBP_CustomRandom_Sub_MenuBtn_03' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_Random_C, WBP_CustomRandom_Sub_MenuBtn_04) == 0x0002F8, "Member 'UWBP_MachineCustom_Sub_Random_C::WBP_CustomRandom_Sub_MenuBtn_04' has a wrong offset!");

}

