#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_HitInfo_Character

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Sub_HitInfo_Character.WBP_Race_HUD_Sub_HitInfo_Character_C.ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character
// 0x08D8 (0x08D8 - 0x0000)
struct WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsRivalSkinExistsGameMode_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_9;                            // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_10;                           // 0x00AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_11;                           // 0x00BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_12;                           // 0x00CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_13;                           // 0x00DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_14;                           // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_15;                           // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_16;                           // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_17;                           // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_18;                           // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_19;                           // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_20;                           // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_21;                           // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x01A0(0x0010)(ReferenceParm)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x01C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_2;          // 0x01CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x01D4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     Temp_byte_Variable;                                // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DB[0x5];                                      // 0x01DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_2;                              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index_1;                              // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsRival_1;                            // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGroupColorId                                 CallFunc_GetGroupColorId_ReturnValue;              // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_2;                           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_3;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIColorInfo                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0218(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIColorInfo                           CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0240(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsRival;                              // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsPowerRival;                         // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsCharacterReleased_ReturnValue;       // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     K2Node_Select_Default_3;                           // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26E[0x2];                                      // 0x026E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_4;          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDriverData                            CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0280(0x0390)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611[0x3];                                      // 0x0611(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0618(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0620(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0628(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0638(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x0640(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_1;                    // 0x0648(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651[0x7];                                      // 0x0651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_2;                    // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x3];                                      // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_22;                           // 0x0664(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetFontMaterialsFromDefaultTextStyleOverride_FontBodyMaterial; // 0x0678(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetFontMaterialsFromDefaultTextStyleOverride_OutlineMaterial; // 0x0680(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_As_____________;                // 0x0688(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_DynamicCast_As______________1;              // 0x0698(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x06B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECrossplayPlatform                            K2Node_Event_Platform;                             // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x06C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCrossplayPlatformIconIndex_ReturnValue; // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemId                                       K2Node_CustomEvent_LostItemId;                     // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x06E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_23;                           // 0x06E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x06FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD[0x3];                                      // 0x06FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemDataAssetTableRow                 CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0710(0x0098)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x07B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_3;                    // 0x07B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C1[0x3];                                      // 0x07C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_24;                           // 0x07C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_25;                           // 0x07D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_26;                           // 0x07E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_5;         // 0x07F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_6;         // 0x0800(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0808(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80C[0x4];                                      // 0x080C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_7;         // 0x0810(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x0818(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_27;                           // 0x0828(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_28;                           // 0x083C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x084C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84D[0x3];                                      // 0x084D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIColorInfo                           CallFunc_Map_Find_Value;                           // 0x0850(0x0020)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0871(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_872[0x2];                                      // 0x0872(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_29;                           // 0x0874(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0884(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_30;                           // 0x0894(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_31;                           // 0x08A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_32;                           // 0x08B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_5;                           // 0x08C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x08D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character");
static_assert(sizeof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character) == 0x0008D8, "Wrong size on WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, EntryPoint) == 0x000000, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetIsRivalSkinExistsGameMode_ReturnValue) == 0x000004, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetIsRivalSkinExistsGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable) == 0x000008, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_2) == 0x000028, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_3) == 0x000038, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_4) == 0x000048, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_int_Variable) == 0x000058, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_5) == 0x00005C, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_6) == 0x00006C, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_7) == 0x00007C, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_8) == 0x00008C, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_9) == 0x00009C, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_10) == 0x0000AC, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_11) == 0x0000BC, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_12) == 0x0000CC, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_13) == 0x0000DC, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_int_Variable_1) == 0x0000EC, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_Select_Default) == 0x0000F0, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_14) == 0x000100, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_15) == 0x000110, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_16) == 0x000120, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_17) == 0x000130, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_18) == 0x000140, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_18' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_19) == 0x000150, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_19' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_20) == 0x000160, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_20' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_21) == 0x000170, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_21' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000180, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_Select_Default_1) == 0x000188, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_MakeLiteralByte_ReturnValue) == 0x000198, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0001A0, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetEnumeratorName_ReturnValue) == 0x0001B0, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_Array_Length_ReturnValue) == 0x0001B8, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_int_Variable_2) == 0x0001BC, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0001C0, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0001C1, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetEnumeratorName_ReturnValue_1) == 0x0001C4, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetEnumeratorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetEnumeratorName_ReturnValue_2) == 0x0001CC, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetEnumeratorName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_int_Variable_3) == 0x0001D4, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_bool_Variable) == 0x0001D8, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_byte_Variable) == 0x0001D9, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_Event_IsDesignTime) == 0x0001DA, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0001E0, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_Event_Index_2) == 0x0001E8, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_Event_Index_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0001F0, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_Event_Index_1) == 0x0001F8, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_Event_Index_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_Event_IsRival_1) == 0x0001FC, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_Event_IsRival_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_int_Variable_4) == 0x000200, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetGroupColorId_ReturnValue) == 0x000204, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetGroupColorId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_Select_Default_2) == 0x000208, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetEnumeratorName_ReturnValue_3) == 0x000210, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetEnumeratorName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDataTableRowFromName_OutRow) == 0x000218, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000238, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000240, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000260, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000261, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_Add_IntInt_ReturnValue) == 0x000264, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_Conv_IntToByte_ReturnValue) == 0x000268, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_Event_IsRival) == 0x000269, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_Event_IsRival' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_Event_IsPowerRival) == 0x00026A, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_Event_IsPowerRival' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetValidValue_ReturnValue) == 0x00026B, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetIsCharacterReleased_ReturnValue) == 0x00026C, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetIsCharacterReleased_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_Select_Default_3) == 0x00026D, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetEnumeratorName_ReturnValue_4) == 0x000270, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetEnumeratorName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_Event_Index) == 0x000278, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000280, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000610, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_Add_IntInt_ReturnValue_1) == 0x000614, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000618, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000620, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_DynamicCast_As_____2D) == 0x000628, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_DynamicCast_bSuccess) == 0x000630, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000638, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x000640, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_DynamicCast_As_____2D_1) == 0x000648, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_DynamicCast_As_____2D_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_DynamicCast_bSuccess_1) == 0x000650, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_DynamicCast_As_____2D_2) == 0x000658, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_DynamicCast_As_____2D_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_DynamicCast_bSuccess_2) == 0x000660, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_22) == 0x000664, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_22' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetFontMaterialsFromDefaultTextStyleOverride_FontBodyMaterial) == 0x000678, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetFontMaterialsFromDefaultTextStyleOverride_FontBodyMaterial' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetFontMaterialsFromDefaultTextStyleOverride_OutlineMaterial) == 0x000680, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetFontMaterialsFromDefaultTextStyleOverride_OutlineMaterial' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_DynamicCast_As_____________) == 0x000688, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_DynamicCast_As_____________' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_DynamicCast_bSuccess_3) == 0x000690, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_DynamicCast_As______________1) == 0x000698, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_DynamicCast_As______________1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_DynamicCast_bSuccess_4) == 0x0006A0, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0006A8, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0006B0, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_Event_Platform) == 0x0006B8, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_Event_Platform' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x0006C0, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetCrossplayPlatformIconIndex_ReturnValue) == 0x0006C8, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetCrossplayPlatformIconIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0006D0, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, K2Node_CustomEvent_LostItemId) == 0x0006D8, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::K2Node_CustomEvent_LostItemId' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x0006E0, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_struct_Variable_23) == 0x0006E8, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_struct_Variable_23' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_int_Loop_Counter_Variable) == 0x0006F8, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_Less_IntInt_ReturnValue) == 0x0006FC, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_Add_IntInt_ReturnValue_2) == 0x000700, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, Temp_int_Array_Index_Variable) == 0x000704, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_Array_Get_Item) == 0x000708, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x000710, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character, CallFunc_GetDataTableRowFromName_ReturnValue_3) == 0x0007A8, "Member 'WBP_Race_HUD_Sub_HitInfo_Character_C_ExecuteUbergraph_WBP_Race_HUD_Sub_HitInfo_Character::CallFunc_GetDataTableRowFromName_ReturnValue_3' has a wrong offset!");
