#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetCutom_M4_Div

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GadgetCutom_M4_Div.WBP_GadgetCutom_M4_Div_C
// 0x0128 (0x0410 - 0x02E8)
class UWBP_GadgetCutom_M4_Div_C final : public UGadgetCustomizeWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       M4_Out;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       M4_Loop;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       M4_In;                                             // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Name_Line;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Name_Line_1;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Name_Line_P1;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Name_Line_P3;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_CharaName_P4;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_P4;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_CharaName;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_CharaName_P2;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_CharaName_P3;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_CharaName_P4;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_GadgetCount_C*                 WBP_CMN_GadgetCount;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_C*                WBP_CMN_PlayerNumber_P1;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_C*                WBP_CMN_PlayerNumber_P2;                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_C*                WBP_CMN_PlayerNumber_P3;                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_C*                WBP_CMN_PlayerNumber_P4;                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_GadgetPlate_C*    WBP_GadgetCustom_Sub_GadgetPlate_P1;               // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_GadgetPlate_C*    WBP_GadgetCustom_Sub_GadgetPlate_P2;               // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_GadgetPlate_C*    WBP_GadgetCustom_Sub_GadgetPlate_P3;               // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_GadgetPlate_C*    WBP_GadgetCustom_Sub_GadgetPlate_P4;               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_SkillPlate_C*     WBP_GadgetCustom_Sub_SkillPlate_P1;                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_SkillPlate_C*     WBP_GadgetCustom_Sub_SkillPlate_P2;                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_SkillPlate_C*     WBP_GadgetCustom_Sub_SkillPlate_P3;                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_SkillPlate_C*     WBP_GadgetCustom_Sub_SkillPlate_P4;                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Window_C*             WBP_GadgetCustom_Window_P1;                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Window_C*             WBP_GadgetCustom_Window_P2;                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Window_C*             WBP_GadgetCustom_Window_P3;                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Window_C*             WBP_GadgetCustom_Window_P4;                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectBG_M4_C*                     WBP_SelectBG_M4;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_MachineParameter_C*         WBP_Window_MachineParameter_P1;                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_MachineParameter_C*         WBP_Window_MachineParameter_P2;                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_MachineParameter_C*         WBP_Window_MachineParameter_P3;                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_MachineParameter_C*         WBP_Window_MachineParameter_P4;                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GadgetCutom_M4_Div(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetPlateWindowZorderHigherThanSelectWindow(int32 InPlayerControllerIndex, bool bPlateWindowHigher);
	void Setup(const struct FGadgetCustomizeWindowData& InWindowData, const bool bInFestaSpecialRule);

	void GetCharaNameBoxes(TArray<class UUnionRichTextBlock*>* OutCharaNameBoxes) const;
	void GetDetailWindows(TArray<class UGadgetDetailWindow*>* OutDetailWindows) const;
	void GetGadgetCustomWindows(TArray<class UGadgetCustomWindow*>* OutGadgetCustomWindows) const;
	void GetmachineParameterWindows(TArray<class UCharaMachineParamWindow*>* OutMachineParameterWindows) const;
	void GetPlateWindows(TArray<class UGadgetPlateWindow*>* OutPlateWindows) const;
	class UCommonCountNumberWidget* GetTicketBox() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GadgetCutom_M4_Div_C">();
	}
	static class UWBP_GadgetCutom_M4_Div_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GadgetCutom_M4_Div_C>();
	}
};
static_assert(alignof(UWBP_GadgetCutom_M4_Div_C) == 0x000008, "Wrong alignment on UWBP_GadgetCutom_M4_Div_C");
static_assert(sizeof(UWBP_GadgetCutom_M4_Div_C) == 0x000410, "Wrong size on UWBP_GadgetCutom_M4_Div_C");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_GadgetCutom_M4_Div_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, M4_Out) == 0x0002F0, "Member 'UWBP_GadgetCutom_M4_Div_C::M4_Out' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, M4_Loop) == 0x0002F8, "Member 'UWBP_GadgetCutom_M4_Div_C::M4_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, M4_In) == 0x000300, "Member 'UWBP_GadgetCutom_M4_Div_C::M4_In' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, Name_Line) == 0x000308, "Member 'UWBP_GadgetCutom_M4_Div_C::Name_Line' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, Name_Line_1) == 0x000310, "Member 'UWBP_GadgetCutom_M4_Div_C::Name_Line_1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, Name_Line_P1) == 0x000318, "Member 'UWBP_GadgetCutom_M4_Div_C::Name_Line_P1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, Name_Line_P3) == 0x000320, "Member 'UWBP_GadgetCutom_M4_Div_C::Name_Line_P3' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, Overlay_CharaName_P4) == 0x000328, "Member 'UWBP_GadgetCutom_M4_Div_C::Overlay_CharaName_P4' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, Overlay_P4) == 0x000330, "Member 'UWBP_GadgetCutom_M4_Div_C::Overlay_P4' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, SafeZone) == 0x000338, "Member 'UWBP_GadgetCutom_M4_Div_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, TXT_CharaName) == 0x000340, "Member 'UWBP_GadgetCutom_M4_Div_C::TXT_CharaName' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, TXT_CharaName_P2) == 0x000348, "Member 'UWBP_GadgetCutom_M4_Div_C::TXT_CharaName_P2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, TXT_CharaName_P3) == 0x000350, "Member 'UWBP_GadgetCutom_M4_Div_C::TXT_CharaName_P3' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, TXT_CharaName_P4) == 0x000358, "Member 'UWBP_GadgetCutom_M4_Div_C::TXT_CharaName_P4' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_CMN_GadgetCount) == 0x000360, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_CMN_GadgetCount' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_CMN_PlayerNumber_P1) == 0x000368, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_CMN_PlayerNumber_P1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_CMN_PlayerNumber_P2) == 0x000370, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_CMN_PlayerNumber_P2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_CMN_PlayerNumber_P3) == 0x000378, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_CMN_PlayerNumber_P3' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_CMN_PlayerNumber_P4) == 0x000380, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_CMN_PlayerNumber_P4' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_GadgetCustom_Sub_GadgetPlate_P1) == 0x000388, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_GadgetCustom_Sub_GadgetPlate_P1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_GadgetCustom_Sub_GadgetPlate_P2) == 0x000390, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_GadgetCustom_Sub_GadgetPlate_P2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_GadgetCustom_Sub_GadgetPlate_P3) == 0x000398, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_GadgetCustom_Sub_GadgetPlate_P3' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_GadgetCustom_Sub_GadgetPlate_P4) == 0x0003A0, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_GadgetCustom_Sub_GadgetPlate_P4' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_GadgetCustom_Sub_SkillPlate_P1) == 0x0003A8, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_GadgetCustom_Sub_SkillPlate_P1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_GadgetCustom_Sub_SkillPlate_P2) == 0x0003B0, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_GadgetCustom_Sub_SkillPlate_P2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_GadgetCustom_Sub_SkillPlate_P3) == 0x0003B8, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_GadgetCustom_Sub_SkillPlate_P3' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_GadgetCustom_Sub_SkillPlate_P4) == 0x0003C0, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_GadgetCustom_Sub_SkillPlate_P4' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_GadgetCustom_Window_P1) == 0x0003C8, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_GadgetCustom_Window_P1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_GadgetCustom_Window_P2) == 0x0003D0, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_GadgetCustom_Window_P2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_GadgetCustom_Window_P3) == 0x0003D8, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_GadgetCustom_Window_P3' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_GadgetCustom_Window_P4) == 0x0003E0, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_GadgetCustom_Window_P4' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_SelectBG_M4) == 0x0003E8, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_SelectBG_M4' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_Window_MachineParameter_P1) == 0x0003F0, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_Window_MachineParameter_P1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_Window_MachineParameter_P2) == 0x0003F8, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_Window_MachineParameter_P2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_Window_MachineParameter_P3) == 0x000400, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_Window_MachineParameter_P3' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M4_Div_C, WBP_Window_MachineParameter_P4) == 0x000408, "Member 'UWBP_GadgetCutom_M4_Div_C::WBP_Window_MachineParameter_P4' has a wrong offset!");

}

