#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_Sub_BonusCountIcon

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_Result_Sub_BonusCountIcon.WBP_Result_Sub_BonusCountIcon_C.ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Point;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIs1st;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	struct FMenuGroupRaceBonusData                CallFunc_GetMenuGroupBonusData_ReturnValue;        // 0x0028(0x0070)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon) == 0x000008, "Wrong alignment on WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon");
static_assert(sizeof(WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon) == 0x0000A0, "Wrong size on WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon");
static_assert(offsetof(WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon, EntryPoint) == 0x000000, "Member 'WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon, K2Node_CustomEvent_Point) == 0x000010, "Member 'WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon::K2Node_CustomEvent_Point' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon, K2Node_CustomEvent_bIs1st) == 0x000014, "Member 'WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon::K2Node_CustomEvent_bIs1st' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon, CallFunc_GetMenuGroupBonusData_ReturnValue) == 0x000028, "Member 'WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon::CallFunc_GetMenuGroupBonusData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000098, "Member 'WBP_Result_Sub_BonusCountIcon_C_ExecuteUbergraph_WBP_Result_Sub_BonusCountIcon::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");

// Function WBP_Result_Sub_BonusCountIcon.WBP_Result_Sub_BonusCountIcon_C.SetNum
// 0x0008 (0x0008 - 0x0000)
struct WBP_Result_Sub_BonusCountIcon_C_SetNum final
{
public:
	int32                                         Point;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIs1st;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_Sub_BonusCountIcon_C_SetNum) == 0x000004, "Wrong alignment on WBP_Result_Sub_BonusCountIcon_C_SetNum");
static_assert(sizeof(WBP_Result_Sub_BonusCountIcon_C_SetNum) == 0x000008, "Wrong size on WBP_Result_Sub_BonusCountIcon_C_SetNum");
static_assert(offsetof(WBP_Result_Sub_BonusCountIcon_C_SetNum, Point) == 0x000000, "Member 'WBP_Result_Sub_BonusCountIcon_C_SetNum::Point' has a wrong offset!");
static_assert(offsetof(WBP_Result_Sub_BonusCountIcon_C_SetNum, bIs1st) == 0x000004, "Member 'WBP_Result_Sub_BonusCountIcon_C_SetNum::bIs1st' has a wrong offset!");

}

