#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FooterMenu_Sub_ControllerBtn

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_FooterMenu_Sub_ControllerBtn.WBP_FooterMenu_Sub_ControllerBtn_C.ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn
// 0x0020 (0x0020 - 0x0000)
struct WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppPlayerControllerSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_CalcCurrentDeviceButtonTexture_OutTexure; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAppControllerInputType                       CallFunc_CalcCurrentDeviceButtonTexture_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn) == 0x000008, "Wrong alignment on WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn");
static_assert(sizeof(WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn) == 0x000020, "Wrong size on WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn");
static_assert(offsetof(WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn, EntryPoint) == 0x000000, "Member 'WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn, CallFunc_CalcCurrentDeviceButtonTexture_OutTexure) == 0x000010, "Member 'WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn::CallFunc_CalcCurrentDeviceButtonTexture_OutTexure' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn, CallFunc_CalcCurrentDeviceButtonTexture_ReturnValue) == 0x000018, "Member 'WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn::CallFunc_CalcCurrentDeviceButtonTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_FooterMenu_Sub_ControllerBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_ControllerBtn::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_FooterMenu_Sub_ControllerBtn.WBP_FooterMenu_Sub_ControllerBtn_C.OnMouseButtonDown
// 0x0220 (0x0220 - 0x0000)
struct WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0168(0x00B8)()
};
static_assert(alignof(WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown");
static_assert(sizeof(WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown) == 0x000220, "Wrong size on WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown");
static_assert(offsetof(WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown, K2Node_MakeStruct_EventReply) == 0x000168, "Member 'WBP_FooterMenu_Sub_ControllerBtn_C_OnMouseButtonDown::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function WBP_FooterMenu_Sub_ControllerBtn.WBP_FooterMenu_Sub_ControllerBtn_C.SetButtonImageIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_FooterMenu_Sub_ControllerBtn_C_SetButtonImageIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FooterMenu_Sub_ControllerBtn_C_SetButtonImageIndex) == 0x000004, "Wrong alignment on WBP_FooterMenu_Sub_ControllerBtn_C_SetButtonImageIndex");
static_assert(sizeof(WBP_FooterMenu_Sub_ControllerBtn_C_SetButtonImageIndex) == 0x000004, "Wrong size on WBP_FooterMenu_Sub_ControllerBtn_C_SetButtonImageIndex");
static_assert(offsetof(WBP_FooterMenu_Sub_ControllerBtn_C_SetButtonImageIndex, Index_0) == 0x000000, "Member 'WBP_FooterMenu_Sub_ControllerBtn_C_SetButtonImageIndex::Index_0' has a wrong offset!");

}

