#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_Sub_ModeSelect

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_TimeTrial_Sub_ModeSelect.WBP_TimeTrial_Sub_ModeSelect_C.ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExclusionGhostUpDownloadEventMilestoneVersion_ReturnValue; // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUnionUIButtonBase*>             K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUnionUIButtonsPanel*                   CallFunc_SetupButtonsPanel_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     CallFunc_GetLastFocusedButton_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      K2Node_Event_InStageId;                            // 0x0099(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsEnable;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUserHasNetworkRankingPrivilege_ReturnValue; // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableTimeTrialMilestoneVersion_ReturnValue; // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00B8(0x0010)()
	class UCommonMenuFooterButton*                CallFunc_GetButton_ReturnValue;                    // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect) == 0x000008, "Wrong alignment on WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect");
static_assert(sizeof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect) == 0x0000D0, "Wrong size on WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, EntryPoint) == 0x000000, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, Temp_bool_Variable) == 0x000014, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, Temp_byte_Variable) == 0x000015, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, Temp_byte_Variable_1) == 0x000016, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_IsExclusionGhostUpDownloadEventMilestoneVersion_ReturnValue) == 0x000017, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_IsExclusionGhostUpDownloadEventMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000020, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000028, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_MakeLiteralInt_ReturnValue) == 0x00003C, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000040, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000048, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_MakeLiteralBool_ReturnValue) == 0x000050, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_SetupButtonsPanel_ReturnValue) == 0x000070, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_SetupButtonsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex) == 0x000078, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_GetLastFocusedButton_OutLastFocusedButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_GetLastFocusedButton_ReturnValue) == 0x000080, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_GetLastFocusedButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_PlayAnimation_ReturnValue_1) == 0x000088, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_PlayAnimation_ReturnValue_2) == 0x000090, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, K2Node_Select_Default) == 0x000098, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, K2Node_Event_InStageId) == 0x000099, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::K2Node_Event_InStageId' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, K2Node_CustomEvent_bIsEnable) == 0x0000AC, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::K2Node_CustomEvent_bIsEnable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_IsUserHasNetworkRankingPrivilege_ReturnValue) == 0x0000AD, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_IsUserHasNetworkRankingPrivilege_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000AE, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_IsDisableTimeTrialMilestoneVersion_ReturnValue) == 0x0000AF, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_IsDisableTimeTrialMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_BooleanAND_ReturnValue) == 0x0000B0, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_MakeLiteralText_ReturnValue) == 0x0000B8, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect, CallFunc_GetButton_ReturnValue) == 0x0000C8, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_ExecuteUbergraph_WBP_TimeTrial_Sub_ModeSelect::CallFunc_GetButton_ReturnValue' has a wrong offset!");

// Function WBP_TimeTrial_Sub_ModeSelect.WBP_TimeTrial_Sub_ModeSelect_C.SetFooterVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_TimeTrial_Sub_ModeSelect_C_SetFooterVisible final
{
public:
	bool                                          bIsEnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_Sub_ModeSelect_C_SetFooterVisible) == 0x000001, "Wrong alignment on WBP_TimeTrial_Sub_ModeSelect_C_SetFooterVisible");
static_assert(sizeof(WBP_TimeTrial_Sub_ModeSelect_C_SetFooterVisible) == 0x000001, "Wrong size on WBP_TimeTrial_Sub_ModeSelect_C_SetFooterVisible");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_SetFooterVisible, bIsEnable) == 0x000000, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_SetFooterVisible::bIsEnable' has a wrong offset!");

// Function WBP_TimeTrial_Sub_ModeSelect.WBP_TimeTrial_Sub_ModeSelect_C.SubModeSetup
// 0x0001 (0x0001 - 0x0000)
struct WBP_TimeTrial_Sub_ModeSelect_C_SubModeSetup final
{
public:
	EStageId                                      InStageId;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_Sub_ModeSelect_C_SubModeSetup) == 0x000001, "Wrong alignment on WBP_TimeTrial_Sub_ModeSelect_C_SubModeSetup");
static_assert(sizeof(WBP_TimeTrial_Sub_ModeSelect_C_SubModeSetup) == 0x000001, "Wrong size on WBP_TimeTrial_Sub_ModeSelect_C_SubModeSetup");
static_assert(offsetof(WBP_TimeTrial_Sub_ModeSelect_C_SubModeSetup, InStageId) == 0x000000, "Member 'WBP_TimeTrial_Sub_ModeSelect_C_SubModeSetup::InStageId' has a wrong offset!");

}

