#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Time

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_Time.WBP_Race_HUD_Sub_Time_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_Race_HUD_Sub_Time_C final : public UUserWidget
{
public:
	class UImage*                                 LAP_Base;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      Num_Time;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        LocalClampedTime;                                  // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetLapTimeInfo(int32 Minutes, int32 Seconds, int32 MilliSec);
	void SetSecondsTime(double Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_Time_C">();
	}
	static class UWBP_Race_HUD_Sub_Time_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_Time_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_Time_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_Time_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_Time_C) == 0x0002F8, "Wrong size on UWBP_Race_HUD_Sub_Time_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_Time_C, LAP_Base) == 0x0002E0, "Member 'UWBP_Race_HUD_Sub_Time_C::LAP_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Time_C, Num_Time) == 0x0002E8, "Member 'UWBP_Race_HUD_Sub_Time_C::Num_Time' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Time_C, LocalClampedTime) == 0x0002F0, "Member 'UWBP_Race_HUD_Sub_Time_C::LocalClampedTime' has a wrong offset!");

}

