#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_RivalLevel

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_RivalLevel.WBP_CMN_RivalLevel_C
// 0x0058 (0x0350 - 0x02F8)
class UWBP_CMN_RivalLevel_C final : public UCommonRivalLevelWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RivalLevel_Out;                                    // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RivalLevel_Loop;                                   // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RivalLevel_In;                                     // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_Normal;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              PanelDebugTexture;                                 // 0x0328(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CMN_RivalLevel(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PlayAnimationIn();
	void PlayAnimationLoop();
	void PlayAnimationOut();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_RivalLevel_C">();
	}
	static class UWBP_CMN_RivalLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_RivalLevel_C>();
	}
};
static_assert(alignof(UWBP_CMN_RivalLevel_C) == 0x000008, "Wrong alignment on UWBP_CMN_RivalLevel_C");
static_assert(sizeof(UWBP_CMN_RivalLevel_C) == 0x000350, "Wrong size on UWBP_CMN_RivalLevel_C");
static_assert(offsetof(UWBP_CMN_RivalLevel_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_CMN_RivalLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RivalLevel_C, RivalLevel_Out) == 0x000300, "Member 'UWBP_CMN_RivalLevel_C::RivalLevel_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RivalLevel_C, RivalLevel_Loop) == 0x000308, "Member 'UWBP_CMN_RivalLevel_C::RivalLevel_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RivalLevel_C, RivalLevel_In) == 0x000310, "Member 'UWBP_CMN_RivalLevel_C::RivalLevel_In' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RivalLevel_C, Base_Normal) == 0x000318, "Member 'UWBP_CMN_RivalLevel_C::Base_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RivalLevel_C, Panel) == 0x000320, "Member 'UWBP_CMN_RivalLevel_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_RivalLevel_C, PanelDebugTexture) == 0x000328, "Member 'UWBP_CMN_RivalLevel_C::PanelDebugTexture' has a wrong offset!");

}

