#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Chara_ShopLabel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Chara_ShopLabel.WBP_Chara_ShopLabel_C.OnSetPrice
// 0x0018 (0x0018 - 0x0000)
struct WBP_Chara_ShopLabel_C_OnSetPrice final
{
public:
	int32                                         InPrice;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
static_assert(alignof(WBP_Chara_ShopLabel_C_OnSetPrice) == 0x000008, "Wrong alignment on WBP_Chara_ShopLabel_C_OnSetPrice");
static_assert(sizeof(WBP_Chara_ShopLabel_C_OnSetPrice) == 0x000018, "Wrong size on WBP_Chara_ShopLabel_C_OnSetPrice");
static_assert(offsetof(WBP_Chara_ShopLabel_C_OnSetPrice, InPrice) == 0x000000, "Member 'WBP_Chara_ShopLabel_C_OnSetPrice::InPrice' has a wrong offset!");
static_assert(offsetof(WBP_Chara_ShopLabel_C_OnSetPrice, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_Chara_ShopLabel_C_OnSetPrice::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_Chara_ShopLabel.WBP_Chara_ShopLabel_C.OnSetPriceColor
// 0x0014 (0x0014 - 0x0000)
struct WBP_Chara_ShopLabel_C_OnSetPriceColor final
{
public:
	struct FSlateColor                            InColor;                                           // 0x0000(0x0014)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Chara_ShopLabel_C_OnSetPriceColor) == 0x000004, "Wrong alignment on WBP_Chara_ShopLabel_C_OnSetPriceColor");
static_assert(sizeof(WBP_Chara_ShopLabel_C_OnSetPriceColor) == 0x000014, "Wrong size on WBP_Chara_ShopLabel_C_OnSetPriceColor");
static_assert(offsetof(WBP_Chara_ShopLabel_C_OnSetPriceColor, InColor) == 0x000000, "Member 'WBP_Chara_ShopLabel_C_OnSetPriceColor::InColor' has a wrong offset!");

}

