#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeaderMenu_Sub_NewsBtn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HeaderMenu_Sub_NewsBtn.WBP_HeaderMenu_Sub_NewsBtn_C
// 0x0078 (0x04F8 - 0x0480)
class UWBP_HeaderMenu_Sub_NewsBtn_C final : public UUnionUIButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BtnBase;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Icon_New;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteractionBtn;                               // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_25;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_News;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn;                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_ControllerBtn_C*    WBP_FooterMenu_Sub_ControllerBtn;                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_ControllerCross_C*  WBP_FooterMenu_Sub_ControllerCross;                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_Key_C*              WBP_FooterMenu_Sub_Key;                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_KeyCross_C*         WBP_FooterMenu_Sub_KeyCross;                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Pict;                               // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsTitleMenu;                                       // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnMouseClick;                                      // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_HeaderMenu_Sub_NewsBtn(int32 EntryPoint);
	void OnMouseClickEvent();
	void PressButtonAnimation();
	void Set_Icon_Visibility(ESlateVisibility Visibility_0);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HeaderMenu_Sub_NewsBtn_C">();
	}
	static class UWBP_HeaderMenu_Sub_NewsBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HeaderMenu_Sub_NewsBtn_C>();
	}
};
static_assert(alignof(UWBP_HeaderMenu_Sub_NewsBtn_C) == 0x000008, "Wrong alignment on UWBP_HeaderMenu_Sub_NewsBtn_C");
static_assert(sizeof(UWBP_HeaderMenu_Sub_NewsBtn_C) == 0x0004F8, "Wrong size on UWBP_HeaderMenu_Sub_NewsBtn_C");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, UberGraphFrame) == 0x000480, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, BtnBase) == 0x000488, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::BtnBase' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, DSP_Icon_New) == 0x000490, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::DSP_Icon_New' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, MouseInteractionBtn) == 0x000498, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::MouseInteractionBtn' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, SizeBox_25) == 0x0004A0, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::SizeBox_25' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, TXT_News) == 0x0004A8, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::TXT_News' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, WBP_CMN_ControllerBtn) == 0x0004B0, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::WBP_CMN_ControllerBtn' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, WBP_FooterMenu_Sub_ControllerBtn) == 0x0004B8, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::WBP_FooterMenu_Sub_ControllerBtn' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, WBP_FooterMenu_Sub_ControllerCross) == 0x0004C0, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::WBP_FooterMenu_Sub_ControllerCross' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, WBP_FooterMenu_Sub_Key) == 0x0004C8, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::WBP_FooterMenu_Sub_Key' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, WBP_FooterMenu_Sub_KeyCross) == 0x0004D0, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::WBP_FooterMenu_Sub_KeyCross' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, WidgetSwitcher_Pict) == 0x0004D8, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::WidgetSwitcher_Pict' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, IsTitleMenu) == 0x0004E0, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::IsTitleMenu' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_NewsBtn_C, OnMouseClick) == 0x0004E8, "Member 'UWBP_HeaderMenu_Sub_NewsBtn_C::OnMouseClick' has a wrong offset!");

}

