#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_MedalIcon_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TimeTrial_MedalIcon_02.WBP_TimeTrial_MedalIcon_02_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_TimeTrial_MedalIcon_02_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DSP_BlinkIcon;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               DSP_MedalIcon;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PAT_Achievement_TimeAttack;                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_Eff_Achievement_TimeAttack;                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ETimeTrialClearRankId                         TimeTrialClearRankId;                              // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MedalIconMipLevel;                                 // 0x0310(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActiveMedal();
	void ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02(int32 EntryPoint);
	void SelectMedal();
	void SetupRankMedal(ETimeTrialClearRankId InTimeTrialClearRankId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TimeTrial_MedalIcon_02_C">();
	}
	static class UWBP_TimeTrial_MedalIcon_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TimeTrial_MedalIcon_02_C>();
	}
};
static_assert(alignof(UWBP_TimeTrial_MedalIcon_02_C) == 0x000008, "Wrong alignment on UWBP_TimeTrial_MedalIcon_02_C");
static_assert(sizeof(UWBP_TimeTrial_MedalIcon_02_C) == 0x000318, "Wrong size on UWBP_TimeTrial_MedalIcon_02_C");
static_assert(offsetof(UWBP_TimeTrial_MedalIcon_02_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_TimeTrial_MedalIcon_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_MedalIcon_02_C, DSP_BlinkIcon) == 0x0002E8, "Member 'UWBP_TimeTrial_MedalIcon_02_C::DSP_BlinkIcon' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_MedalIcon_02_C, DSP_MedalIcon) == 0x0002F0, "Member 'UWBP_TimeTrial_MedalIcon_02_C::DSP_MedalIcon' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_MedalIcon_02_C, PAT_Achievement_TimeAttack) == 0x0002F8, "Member 'UWBP_TimeTrial_MedalIcon_02_C::PAT_Achievement_TimeAttack' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_MedalIcon_02_C, PAT_Eff_Achievement_TimeAttack) == 0x000300, "Member 'UWBP_TimeTrial_MedalIcon_02_C::PAT_Eff_Achievement_TimeAttack' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_MedalIcon_02_C, TimeTrialClearRankId) == 0x000308, "Member 'UWBP_TimeTrial_MedalIcon_02_C::TimeTrialClearRankId' has a wrong offset!");
static_assert(offsetof(UWBP_TimeTrial_MedalIcon_02_C, MedalIconMipLevel) == 0x000310, "Member 'UWBP_TimeTrial_MedalIcon_02_C::MedalIconMipLevel' has a wrong offset!");

}

