#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetInfo

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GadgetInfo.WBP_GadgetInfo_C
// 0x0090 (0x0370 - 0x02E0)
class UWBP_GadgetInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Aten;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Blink;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlueBase;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Footer;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 gadget;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Footer;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_GadgetDetail;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Title;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UVScroll_01;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UVScroll_02;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UVScroll_03;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UVScroll_04;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetInfo_Sub_Category_C*         WBP_GadgetInfo_Sub_Category_Festa;                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetInfo_Sub_Category_C*         WBP_GadgetInfo_Sub_Category_LegendCompe;           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetInfo_Sub_Category_C*         WBP_GadgetInfo_Sub_Category_RankMatch;             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WhiteBase;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GadgetInfo(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetDetailText(int32 TextIndex);
	void SetGudgetInfo(EEventInfomationType EventInfomation, const TArray<int32>& GadgetIds);
	void UpdateFooter();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GadgetInfo_C">();
	}
	static class UWBP_GadgetInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GadgetInfo_C>();
	}
};
static_assert(alignof(UWBP_GadgetInfo_C) == 0x000008, "Wrong alignment on UWBP_GadgetInfo_C");
static_assert(sizeof(UWBP_GadgetInfo_C) == 0x000370, "Wrong size on UWBP_GadgetInfo_C");
static_assert(offsetof(UWBP_GadgetInfo_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_GadgetInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, Aten) == 0x0002E8, "Member 'UWBP_GadgetInfo_C::Aten' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, BG) == 0x0002F0, "Member 'UWBP_GadgetInfo_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, Blink) == 0x0002F8, "Member 'UWBP_GadgetInfo_C::Blink' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, BlueBase) == 0x000300, "Member 'UWBP_GadgetInfo_C::BlueBase' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, Border_Footer) == 0x000308, "Member 'UWBP_GadgetInfo_C::Border_Footer' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, gadget) == 0x000310, "Member 'UWBP_GadgetInfo_C::gadget' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, TXT_Footer) == 0x000318, "Member 'UWBP_GadgetInfo_C::TXT_Footer' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, TXT_GadgetDetail) == 0x000320, "Member 'UWBP_GadgetInfo_C::TXT_GadgetDetail' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, TXT_Title) == 0x000328, "Member 'UWBP_GadgetInfo_C::TXT_Title' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, UVScroll_01) == 0x000330, "Member 'UWBP_GadgetInfo_C::UVScroll_01' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, UVScroll_02) == 0x000338, "Member 'UWBP_GadgetInfo_C::UVScroll_02' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, UVScroll_03) == 0x000340, "Member 'UWBP_GadgetInfo_C::UVScroll_03' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, UVScroll_04) == 0x000348, "Member 'UWBP_GadgetInfo_C::UVScroll_04' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, WBP_GadgetInfo_Sub_Category_Festa) == 0x000350, "Member 'UWBP_GadgetInfo_C::WBP_GadgetInfo_Sub_Category_Festa' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, WBP_GadgetInfo_Sub_Category_LegendCompe) == 0x000358, "Member 'UWBP_GadgetInfo_C::WBP_GadgetInfo_Sub_Category_LegendCompe' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, WBP_GadgetInfo_Sub_Category_RankMatch) == 0x000360, "Member 'UWBP_GadgetInfo_C::WBP_GadgetInfo_Sub_Category_RankMatch' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetInfo_C, WhiteBase) == 0x000368, "Member 'UWBP_GadgetInfo_C::WhiteBase' has a wrong offset!");

}

