#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_RSR_5rings_Simple

#include "Basic.hpp"

#include "UnionRun_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Sub_RSR_5rings_Simple.WBP_Race_HUD_Sub_RSR_5rings_Simple_C.ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple
// 0x0018 (0x0018 - 0x0000)
struct WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ERedStarRingAcquisitionType>           CallFunc_GetOtherResultRedStarRingAcquisitionType_ReturnValue; // 0x0008(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple");
static_assert(sizeof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple) == 0x000018, "Wrong size on WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple");
static_assert(offsetof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple, EntryPoint) == 0x000000, "Member 'WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple, K2Node_CustomEvent_Index) == 0x000004, "Member 'WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple, CallFunc_GetOtherResultRedStarRingAcquisitionType_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ExecuteUbergraph_WBP_Race_HUD_Sub_RSR_5rings_Simple::CallFunc_GetOtherResultRedStarRingAcquisitionType_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_RSR_5rings_Simple.WBP_Race_HUD_Sub_RSR_5rings_Simple_C.PickupRedStarRing
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Sub_RSR_5rings_Simple_C_PickupRedStarRing final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_PickupRedStarRing) == 0x000004, "Wrong alignment on WBP_Race_HUD_Sub_RSR_5rings_Simple_C_PickupRedStarRing");
static_assert(sizeof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_PickupRedStarRing) == 0x000008, "Wrong size on WBP_Race_HUD_Sub_RSR_5rings_Simple_C_PickupRedStarRing");
static_assert(offsetof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_PickupRedStarRing, Index_0) == 0x000000, "Member 'WBP_Race_HUD_Sub_RSR_5rings_Simple_C_PickupRedStarRing::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_PickupRedStarRing, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WBP_Race_HUD_Sub_RSR_5rings_Simple_C_PickupRedStarRing::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Race_HUD_Sub_RSR_5rings_Simple.WBP_Race_HUD_Sub_RSR_5rings_Simple_C.ResetRedStarRing
// 0x0028 (0x0028 - 0x0000)
struct WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing");
static_assert(sizeof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing) == 0x000028, "Wrong size on WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing");
static_assert(offsetof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000008, "Member 'WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000010, "Member 'WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000018, "Member 'WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x000020, "Member 'WBP_Race_HUD_Sub_RSR_5rings_Simple_C_ResetRedStarRing::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");

// Function WBP_Race_HUD_Sub_RSR_5rings_Simple.WBP_Race_HUD_Sub_RSR_5rings_Simple_C.SetOtherRSRBAnimation
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Sub_RSR_5rings_Simple_C_SetOtherRSRBAnimation final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_SetOtherRSRBAnimation) == 0x000004, "Wrong alignment on WBP_Race_HUD_Sub_RSR_5rings_Simple_C_SetOtherRSRBAnimation");
static_assert(sizeof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_SetOtherRSRBAnimation) == 0x000004, "Wrong size on WBP_Race_HUD_Sub_RSR_5rings_Simple_C_SetOtherRSRBAnimation");
static_assert(offsetof(WBP_Race_HUD_Sub_RSR_5rings_Simple_C_SetOtherRSRBAnimation, Index_0) == 0x000000, "Member 'WBP_Race_HUD_Sub_RSR_5rings_Simple_C_SetOtherRSRBAnimation::Index_0' has a wrong offset!");

}

