#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TimeTrial_MedalIcon_02

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_TimeTrial_MedalIcon_02.WBP_TimeTrial_MedalIcon_02_C.ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02
// 0x0060 (0x0060 - 0x0000)
struct WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeTrialClearRankId                         Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_4;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_8;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeTrialClearRankId                         K2Node_CustomEvent_InTimeTrialClearRankId;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_9;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeTrialClearRankId                         Temp_byte_Variable_1;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02) == 0x000008, "Wrong alignment on WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02");
static_assert(sizeof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02) == 0x000060, "Wrong size on WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, EntryPoint) == 0x000000, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, Temp_real_Variable) == 0x000004, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, Temp_real_Variable_1) == 0x000008, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, Temp_real_Variable_2) == 0x00000C, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, Temp_real_Variable_3) == 0x000010, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, Temp_byte_Variable) == 0x000014, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, Temp_real_Variable_4) == 0x000018, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, Temp_real_Variable_5) == 0x00001C, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, Temp_real_Variable_6) == 0x000020, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, Temp_real_Variable_7) == 0x000024, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, Temp_real_Variable_8) == 0x000028, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, K2Node_CustomEvent_InTimeTrialClearRankId) == 0x00002C, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::K2Node_CustomEvent_InTimeTrialClearRankId' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, Temp_real_Variable_9) == 0x000030, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000034, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000040, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, K2Node_Select_Default) == 0x000048, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, Temp_byte_Variable_1) == 0x00004C, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, K2Node_Select_Default_1) == 0x000050, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000054, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000058, "Member 'WBP_TimeTrial_MedalIcon_02_C_ExecuteUbergraph_WBP_TimeTrial_MedalIcon_02::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_TimeTrial_MedalIcon_02.WBP_TimeTrial_MedalIcon_02_C.SetupRankMedal
// 0x0001 (0x0001 - 0x0000)
struct WBP_TimeTrial_MedalIcon_02_C_SetupRankMedal final
{
public:
	ETimeTrialClearRankId                         InTimeTrialClearRankId;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TimeTrial_MedalIcon_02_C_SetupRankMedal) == 0x000001, "Wrong alignment on WBP_TimeTrial_MedalIcon_02_C_SetupRankMedal");
static_assert(sizeof(WBP_TimeTrial_MedalIcon_02_C_SetupRankMedal) == 0x000001, "Wrong size on WBP_TimeTrial_MedalIcon_02_C_SetupRankMedal");
static_assert(offsetof(WBP_TimeTrial_MedalIcon_02_C_SetupRankMedal, InTimeTrialClearRankId) == 0x000000, "Member 'WBP_TimeTrial_MedalIcon_02_C_SetupRankMedal::InTimeTrialClearRankId' has a wrong offset!");

}

