#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_StickerTop

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MachineCustom_Sub_StickerTop.WBP_MachineCustom_Sub_StickerTop_C
// 0x0078 (0x04F8 - 0x0480)
class UWBP_MachineCustom_Sub_StickerTop_C final : public UMachineStickerSlotSelectWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 NameLine_01;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameLine_02;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_FRONTIcon;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_REARIcon;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_FRONT;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_REAR;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UMachineStickerSlotIcon*>        FrontIcons;                                        // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UMachineStickerSlotIcon*>        RearIcons;                                         // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UMachineStickerSlotIcon*>        AllIcons;                                          // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUnionUIGridNavigationBuilder*          GridNavigationBuilder;                             // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemNumInRow;                                      // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_MachineCustom_Sub_StickerTop(int32 EntryPoint);
	void OnCancelEvent(class UUnionUIButtonBase* Button);
	void OnDecisionEvent(class UUnionUIButtonBase* Button);
	void OnDirectionEvent(class UUnionUIButtonBase* Button, EUnionUIControlDir Dir);
	void OnFaceButtonTopEvent(class UUnionUIButtonBase* Button);
	void OnFocusedEvent(class UUnionUIButtonBase* Button);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetButtonsPanel(class UUnionUIButtonsPanel* InButtonsPanel);
	void SetStickerImages(TArray<class AUnionStickerBase*>& Stickers);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MachineCustom_Sub_StickerTop_C">();
	}
	static class UWBP_MachineCustom_Sub_StickerTop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MachineCustom_Sub_StickerTop_C>();
	}
};
static_assert(alignof(UWBP_MachineCustom_Sub_StickerTop_C) == 0x000008, "Wrong alignment on UWBP_MachineCustom_Sub_StickerTop_C");
static_assert(sizeof(UWBP_MachineCustom_Sub_StickerTop_C) == 0x0004F8, "Wrong size on UWBP_MachineCustom_Sub_StickerTop_C");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerTop_C, UberGraphFrame) == 0x000480, "Member 'UWBP_MachineCustom_Sub_StickerTop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerTop_C, NameLine_01) == 0x000488, "Member 'UWBP_MachineCustom_Sub_StickerTop_C::NameLine_01' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerTop_C, NameLine_02) == 0x000490, "Member 'UWBP_MachineCustom_Sub_StickerTop_C::NameLine_02' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerTop_C, PAT_FRONTIcon) == 0x000498, "Member 'UWBP_MachineCustom_Sub_StickerTop_C::PAT_FRONTIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerTop_C, PAT_REARIcon) == 0x0004A0, "Member 'UWBP_MachineCustom_Sub_StickerTop_C::PAT_REARIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerTop_C, TXT_FRONT) == 0x0004A8, "Member 'UWBP_MachineCustom_Sub_StickerTop_C::TXT_FRONT' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerTop_C, TXT_REAR) == 0x0004B0, "Member 'UWBP_MachineCustom_Sub_StickerTop_C::TXT_REAR' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerTop_C, FrontIcons) == 0x0004B8, "Member 'UWBP_MachineCustom_Sub_StickerTop_C::FrontIcons' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerTop_C, RearIcons) == 0x0004C8, "Member 'UWBP_MachineCustom_Sub_StickerTop_C::RearIcons' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerTop_C, AllIcons) == 0x0004D8, "Member 'UWBP_MachineCustom_Sub_StickerTop_C::AllIcons' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerTop_C, GridNavigationBuilder) == 0x0004E8, "Member 'UWBP_MachineCustom_Sub_StickerTop_C::GridNavigationBuilder' has a wrong offset!");
static_assert(offsetof(UWBP_MachineCustom_Sub_StickerTop_C, ItemNumInRow) == 0x0004F0, "Member 'UWBP_MachineCustom_Sub_StickerTop_C::ItemNumInRow' has a wrong offset!");

}

