#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_CustomPaint

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_4_OnUnionButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_4_OnUnionButtonEvent__DelegateSignature final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_4_OnUnionButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_4_OnUnionButtonEvent__DelegateSignature");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_4_OnUnionButtonEvent__DelegateSignature) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_4_OnUnionButtonEvent__DelegateSignature");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_4_OnUnionButtonEvent__DelegateSignature, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_4_OnUnionButtonEvent__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_9_OnUnionButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_9_OnUnionButtonEvent__DelegateSignature final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_9_OnUnionButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_9_OnUnionButtonEvent__DelegateSignature");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_9_OnUnionButtonEvent__DelegateSignature) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_9_OnUnionButtonEvent__DelegateSignature");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_9_OnUnionButtonEvent__DelegateSignature, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_CMN_SubMenu_Btn_K2Node_ComponentBoundEvent_9_OnUnionButtonEvent__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_0_OnUnionButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_0_OnUnionButtonEvent__DelegateSignature final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_0_OnUnionButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_0_OnUnionButtonEvent__DelegateSignature");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_0_OnUnionButtonEvent__DelegateSignature) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_0_OnUnionButtonEvent__DelegateSignature");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_0_OnUnionButtonEvent__DelegateSignature, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_0_OnUnionButtonEvent__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_3_OnUnionButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_3_OnUnionButtonEvent__DelegateSignature final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_3_OnUnionButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_3_OnUnionButtonEvent__DelegateSignature");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_3_OnUnionButtonEvent__DelegateSignature) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_3_OnUnionButtonEvent__DelegateSignature");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_3_OnUnionButtonEvent__DelegateSignature, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Glow_K2Node_ComponentBoundEvent_3_OnUnionButtonEvent__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_1_OnFocus__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_1_OnFocus__DelegateSignature final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_1_OnFocus__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_1_OnFocus__DelegateSignature");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_1_OnFocus__DelegateSignature) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_1_OnFocus__DelegateSignature");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_1_OnFocus__DelegateSignature, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_1_OnFocus__DelegateSignature::InButton' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_5_OnDecision__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_5_OnDecision__DelegateSignature final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_5_OnDecision__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_5_OnDecision__DelegateSignature");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_5_OnDecision__DelegateSignature) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_5_OnDecision__DelegateSignature");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_5_OnDecision__DelegateSignature, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Body_K2Node_ComponentBoundEvent_5_OnDecision__DelegateSignature::InButton' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_7_OnDecision__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_7_OnDecision__DelegateSignature final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_7_OnDecision__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_7_OnDecision__DelegateSignature");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_7_OnDecision__DelegateSignature) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_7_OnDecision__DelegateSignature");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_7_OnDecision__DelegateSignature, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_7_OnDecision__DelegateSignature::InButton' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_8_OnFocus__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_8_OnFocus__DelegateSignature final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_8_OnFocus__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_8_OnFocus__DelegateSignature");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_8_OnFocus__DelegateSignature) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_8_OnFocus__DelegateSignature");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_8_OnFocus__DelegateSignature, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Cockpit_K2Node_ComponentBoundEvent_8_OnFocus__DelegateSignature::InButton' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_2_OnFocus__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_2_OnFocus__DelegateSignature final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_2_OnFocus__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_2_OnFocus__DelegateSignature");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_2_OnFocus__DelegateSignature) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_2_OnFocus__DelegateSignature");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_2_OnFocus__DelegateSignature, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_2_OnFocus__DelegateSignature::InButton' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_6_OnDecision__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_6_OnDecision__DelegateSignature final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_6_OnDecision__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_6_OnDecision__DelegateSignature");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_6_OnDecision__DelegateSignature) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_6_OnDecision__DelegateSignature");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_6_OnDecision__DelegateSignature, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_BndEvt__WBP_MachineCustom_Sub_CustomPaint_WBP_MachineCustom_Sub_CustomPaint_Liquid_Wheel_K2Node_ComponentBoundEvent_6_OnDecision__DelegateSignature::InButton' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.Cancel
// 0x0010 (0x0010 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_Cancel final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_Cancel) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_Cancel");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_Cancel) == 0x000010, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_Cancel");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Cancel, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Cancel::Button' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Cancel, PanelIndex) == 0x000008, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Cancel::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Cancel, ButtonIndex) == 0x00000C, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Cancel::ButtonIndex' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.Decision
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_Decision final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_Glow_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Glow; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Liquid_Line; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachineColorAreaUIData                CallFunc_GetItemData_OutUIData;                    // 0x0028(0x0040)()
	struct FMachineColorAreaUIData                CallFunc_GetItemData_UIData;                       // 0x0068(0x0040)()
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_Decision) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_Decision");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_Decision) == 0x0000A8, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_Decision");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Decision, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Decision::Button' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Decision, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Glow) == 0x000008, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Decision::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Glow' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Decision, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Decision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Decision, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Liquid_Line) == 0x000018, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Decision::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Liquid_Line' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Decision, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Decision::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Decision, CallFunc_GetItemData_OutUIData) == 0x000028, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Decision::CallFunc_GetItemData_OutUIData' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Decision, CallFunc_GetItemData_UIData) == 0x000068, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Decision::CallFunc_GetItemData_UIData' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint
// 0x0090 (0x0090 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_ComponentBoundEvent_Button_2;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_ComponentBoundEvent_InButton_5;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_ComponentBoundEvent_InButton_4;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_ComponentBoundEvent_InButton_3;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_ComponentBoundEvent_Button_1;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_ComponentBoundEvent_InButton_2;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_ComponentBoundEvent_InButton_1;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_ComponentBoundEvent_InButton;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_ComponentBoundEvent_Button;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_CreateButtonsPanel_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIGridNavigationBuilder*          CallFunc_SpawnObject_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   CallFunc_CreateButtonsPanel_ReturnValue_1;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue_1;            // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_ComponentBoundEvent_Button_3;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint) == 0x000090, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, EntryPoint) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, K2Node_ComponentBoundEvent_Button_2) == 0x000018, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, K2Node_ComponentBoundEvent_InButton_5) == 0x000020, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::K2Node_ComponentBoundEvent_InButton_5' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, K2Node_ComponentBoundEvent_InButton_4) == 0x000028, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::K2Node_ComponentBoundEvent_InButton_4' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, K2Node_ComponentBoundEvent_InButton_3) == 0x000030, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::K2Node_ComponentBoundEvent_InButton_3' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, K2Node_ComponentBoundEvent_Button_1) == 0x000038, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, K2Node_ComponentBoundEvent_InButton_2) == 0x000040, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::K2Node_ComponentBoundEvent_InButton_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, K2Node_ComponentBoundEvent_InButton_1) == 0x000048, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::K2Node_ComponentBoundEvent_InButton_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, K2Node_ComponentBoundEvent_InButton) == 0x000050, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::K2Node_ComponentBoundEvent_InButton' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, K2Node_ComponentBoundEvent_Button) == 0x000058, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, CallFunc_CreateButtonsPanel_ReturnValue) == 0x000060, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::CallFunc_CreateButtonsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, CallFunc_SpawnObject_ReturnValue) == 0x000068, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, CallFunc_MakeLiteralInt_ReturnValue) == 0x000070, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, CallFunc_MakeLiteralBool_ReturnValue) == 0x000074, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, CallFunc_CreateButtonsPanel_ReturnValue_1) == 0x000078, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::CallFunc_CreateButtonsPanel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000080, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, CallFunc_MakeLiteralBool_ReturnValue_1) == 0x000084, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::CallFunc_MakeLiteralBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint, K2Node_ComponentBoundEvent_Button_3) == 0x000088, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.Focus
// 0x0098 (0x0098 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_Focus final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Liquid_Line; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CMN_SubMenu_Btn_C*                 K2Node_DynamicCast_AsWBP_CMN_Sub_Menu_Btn;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_CustomPaint_Glow_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Glow; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CMN_SubMenu_Btn_C*                 K2Node_DynamicCast_AsWBP_CMN_Sub_Menu_Btn_1;       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_CustomPaint_Glow_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Glow_1; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_CustomPaint_Liquid_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Liquid; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_Focus) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_Focus");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_Focus) == 0x000098, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_Focus");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::InButton' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Liquid_Line) == 0x000008, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Liquid_Line' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, K2Node_DynamicCast_AsWBP_CMN_Sub_Menu_Btn) == 0x000018, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::K2Node_DynamicCast_AsWBP_CMN_Sub_Menu_Btn' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Glow) == 0x000028, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Glow' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, CallFunc_GetAllChildren_ReturnValue) == 0x000040, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, K2Node_DynamicCast_AsWBP_CMN_Sub_Menu_Btn_1) == 0x000068, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::K2Node_DynamicCast_AsWBP_CMN_Sub_Menu_Btn_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, K2Node_DynamicCast_bSuccess_3) == 0x000070, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Glow_1) == 0x000078, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Glow_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, K2Node_DynamicCast_bSuccess_4) == 0x000080, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Liquid) == 0x000088, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Custom_Paint_Liquid' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_Focus, K2Node_DynamicCast_bSuccess_5) == 0x000090, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_Focus::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.PlaySECancel
// 0x0004 (0x0004 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_PlaySECancel final
{
public:
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0000(0x0004)()
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_PlaySECancel) == 0x000004, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_PlaySECancel");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_PlaySECancel) == 0x000004, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_PlaySECancel");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_PlaySECancel, CallFunc_SoundPlay_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_PlaySECancel::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.PlaySEDecision
// 0x0004 (0x0004 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_PlaySEDecision final
{
public:
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0000(0x0004)()
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_PlaySEDecision) == 0x000004, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_PlaySEDecision");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_PlaySEDecision) == 0x000004, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_PlaySEDecision");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_PlaySEDecision, CallFunc_SoundPlay_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_PlaySEDecision::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.PlaySEFocus
// 0x0004 (0x0004 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_PlaySEFocus final
{
public:
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0000(0x0004)()
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_PlaySEFocus) == 0x000004, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_PlaySEFocus");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_PlaySEFocus) == 0x000004, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_PlaySEFocus");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_PlaySEFocus, CallFunc_SoundPlay_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_PlaySEFocus::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.SetInitialFocus
// 0x0090 (0x0090 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMachineColorAreaUIId                         InColorAreaId;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInDefault;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C*> CallFunc_GetItems_OutItems;       // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C* CallFunc_Array_Get_Item;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C* CallFunc_Array_Get_Item_1;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C* CallFunc_Array_Get_Item_2;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C*> CallFunc_GetItems_OutItems_1;     // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C* CallFunc_Array_Get_Item_3;                // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C* CallFunc_Array_Get_Item_4;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C* CallFunc_Array_Get_Item_5;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C*> CallFunc_GetItems_OutItems_2;     // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C* CallFunc_Array_Get_Item_6;                // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C* CallFunc_Array_Get_Item_7;                // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C* CallFunc_Array_Get_Item_8;                // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus) == 0x000090, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, InPlayerController) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::InPlayerController' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, InColorAreaId) == 0x000008, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::InColorAreaId' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, bInDefault) == 0x000009, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::bInDefault' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, CallFunc_GetItems_OutItems) == 0x000010, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::CallFunc_GetItems_OutItems' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, CallFunc_Array_Get_Item_2) == 0x000030, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, CallFunc_GetItems_OutItems_1) == 0x000038, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::CallFunc_GetItems_OutItems_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, CallFunc_Array_Get_Item_3) == 0x000048, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, CallFunc_Array_Get_Item_4) == 0x000050, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, CallFunc_Array_Get_Item_5) == 0x000058, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, CallFunc_GetItems_OutItems_2) == 0x000060, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::CallFunc_GetItems_OutItems_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, CallFunc_Array_Get_Item_6) == 0x000078, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, CallFunc_Array_Get_Item_7) == 0x000080, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus, CallFunc_Array_Get_Item_8) == 0x000088, "Member 'WBP_MachineCustom_Sub_CustomPaint_C_SetInitialFocus::CallFunc_Array_Get_Item_8' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint.WBP_MachineCustom_Sub_CustomPaint_C.Setup
// 0x0658 (0x0658 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_C_Setup final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMachineColorAreaSettingUIData         InUIData;                                          // 0x0008(0x02C8)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<class UWBP_MachineCustom_Sub_CustomPaint_Liquid_C*> Boxes;                                // 0x02D0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FMachineColorAreaSettingUIData         UIData;                                            // 0x02E0(0x02C8)(Edit, BlueprintVisible)
	class APlayerController*                      PlayerController;                                  // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_CustomPaint_Liquid_C* CallFunc_Array_Get_Item;                      // 0x05C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_MachineCustom_Sub_CustomPaint_LiquidLine_C*> CallFunc_GetEnabledItems_OutItems; // 0x05D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MachineCustom_Sub_CustomPaint_Liquid_C*> K2Node_MakeArray_Array;               // 0x05E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FMachineColorAreaUIData                CallFunc_GetItemData_OutUIData;                    // 0x05F8(0x0040)()
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
