#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Window_CharaChange

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_Window_CharaChange.WBP_Window_CharaChange_C.ExecuteUbergraph_WBP_Window_CharaChange
// 0x0004 (0x0004 - 0x0000)
struct WBP_Window_CharaChange_C_ExecuteUbergraph_WBP_Window_CharaChange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Window_CharaChange_C_ExecuteUbergraph_WBP_Window_CharaChange) == 0x000004, "Wrong alignment on WBP_Window_CharaChange_C_ExecuteUbergraph_WBP_Window_CharaChange");
static_assert(sizeof(WBP_Window_CharaChange_C_ExecuteUbergraph_WBP_Window_CharaChange) == 0x000004, "Wrong size on WBP_Window_CharaChange_C_ExecuteUbergraph_WBP_Window_CharaChange");
static_assert(offsetof(WBP_Window_CharaChange_C_ExecuteUbergraph_WBP_Window_CharaChange, EntryPoint) == 0x000000, "Member 'WBP_Window_CharaChange_C_ExecuteUbergraph_WBP_Window_CharaChange::EntryPoint' has a wrong offset!");

// Function WBP_Window_CharaChange.WBP_Window_CharaChange_C.PlayAnimationIn
// 0x0008 (0x0008 - 0x0000)
struct WBP_Window_CharaChange_C_PlayAnimationIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Window_CharaChange_C_PlayAnimationIn) == 0x000008, "Wrong alignment on WBP_Window_CharaChange_C_PlayAnimationIn");
static_assert(sizeof(WBP_Window_CharaChange_C_PlayAnimationIn) == 0x000008, "Wrong size on WBP_Window_CharaChange_C_PlayAnimationIn");
static_assert(offsetof(WBP_Window_CharaChange_C_PlayAnimationIn, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_Window_CharaChange_C_PlayAnimationIn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Window_CharaChange.WBP_Window_CharaChange_C.PlayAnimationLoop
// 0x0008 (0x0008 - 0x0000)
struct WBP_Window_CharaChange_C_PlayAnimationLoop final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Window_CharaChange_C_PlayAnimationLoop) == 0x000008, "Wrong alignment on WBP_Window_CharaChange_C_PlayAnimationLoop");
static_assert(sizeof(WBP_Window_CharaChange_C_PlayAnimationLoop) == 0x000008, "Wrong size on WBP_Window_CharaChange_C_PlayAnimationLoop");
static_assert(offsetof(WBP_Window_CharaChange_C_PlayAnimationLoop, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_Window_CharaChange_C_PlayAnimationLoop::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Window_CharaChange.WBP_Window_CharaChange_C.PlayAnimationOut
// 0x0008 (0x0008 - 0x0000)
struct WBP_Window_CharaChange_C_PlayAnimationOut final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Window_CharaChange_C_PlayAnimationOut) == 0x000008, "Wrong alignment on WBP_Window_CharaChange_C_PlayAnimationOut");
static_assert(sizeof(WBP_Window_CharaChange_C_PlayAnimationOut) == 0x000008, "Wrong size on WBP_Window_CharaChange_C_PlayAnimationOut");
static_assert(offsetof(WBP_Window_CharaChange_C_PlayAnimationOut, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_Window_CharaChange_C_PlayAnimationOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Window_CharaChange.WBP_Window_CharaChange_C.PlaySEOpen
// 0x0004 (0x0004 - 0x0000)
struct WBP_Window_CharaChange_C_PlaySEOpen final
{
public:
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0000(0x0004)()
};
static_assert(alignof(WBP_Window_CharaChange_C_PlaySEOpen) == 0x000004, "Wrong alignment on WBP_Window_CharaChange_C_PlaySEOpen");
static_assert(sizeof(WBP_Window_CharaChange_C_PlaySEOpen) == 0x000004, "Wrong size on WBP_Window_CharaChange_C_PlaySEOpen");
static_assert(offsetof(WBP_Window_CharaChange_C_PlaySEOpen, CallFunc_SoundPlay_ReturnValue) == 0x000000, "Member 'WBP_Window_CharaChange_C_PlaySEOpen::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");

// Function WBP_Window_CharaChange.WBP_Window_CharaChange_C.IsOpen
// 0x0018 (0x0018 - 0x0000)
struct WBP_Window_CharaChange_C_IsOpen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Window_CharaChange_C_IsOpen) == 0x000008, "Wrong alignment on WBP_Window_CharaChange_C_IsOpen");
static_assert(sizeof(WBP_Window_CharaChange_C_IsOpen) == 0x000018, "Wrong size on WBP_Window_CharaChange_C_IsOpen");
static_assert(offsetof(WBP_Window_CharaChange_C_IsOpen, ReturnValue) == 0x000000, "Member 'WBP_Window_CharaChange_C_IsOpen::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Window_CharaChange_C_IsOpen, CallFunc_GetRenderOpacity_ReturnValue) == 0x000004, "Member 'WBP_Window_CharaChange_C_IsOpen::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Window_CharaChange_C_IsOpen, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_Window_CharaChange_C_IsOpen::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Window_CharaChange_C_IsOpen, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000010, "Member 'WBP_Window_CharaChange_C_IsOpen::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");

}

