#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyRace

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"
#include "UnionUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyRace.WBP_PartyRace_C
// 0x00A0 (0x0598 - 0x04F8)
class UWBP_PartyRace_C final : public UPartyRaceSelectPresetScene
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 FooterBtnCover;                                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton_187;                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Option;                                    // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_PartyRace;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_MenuBtn_C*           WBP_PartyRace_Sub_Btn_01;                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_MenuBtn_C*           WBP_PartyRace_Sub_Btn_02;                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_MenuBtn_C*           WBP_PartyRace_Sub_Btn_03;                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_MenuBtn_C*           WBP_PartyRace_Sub_Btn_04;                          // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_MenuBtn_C*           WBP_PartyRace_Sub_Btn_05;                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_MenuBtn_C*           WBP_PartyRace_Sub_Btn_06;                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_Option_Btn_Window_C* WBP_PartyRace_Sub_Option_Btn_Window;               // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_Option_Finalconfirm_C* WBP_PartyRace_Sub_Option_Finalconfirm;           // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_Window_C*            WBP_PartyRace_Sub_Window;                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPartyRaceSelectPresetState                   CurrentState;                                      // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bExchangeWindow;                                   // 0x0569(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRaceSelectPresetState                   ReserveState;                                      // 0x056A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUISceneAnimation                        Scene_Anim;                                        // 0x056B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBackedSequence;                                   // 0x056C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyRacePreset                              LastSelectedPreset;                                // 0x056D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56E[0x2];                                      // 0x056E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EPartyRacePreset FocusedPreset)> OnStartCustomButtonPressed;       // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EPartyRacePreset                              LastFocusedPreset;                                 // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinishedOptionOut;                               // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ChangeViewState(EPartyRaceSelectPresetState InState);
	void Construct();
	void ExchangeWindow(EPartyRaceSelectPresetState ToState);
	void ExecuteUbergraph_WBP_PartyRace(int32 EntryPoint);
	void OnConfirmWindowCancel(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void OnDetailWindowCancel(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnPresetInfoButtonPressed_Event();
	void OnStartCustomButtonPressed_Event();
	void OnUISceneDecisionEvent_Event(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex);
	void SetConfirmed(bool bBackedSequence_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void WidgetAnimationEvt_PartyRace_In_K2Node_WidgetAnimationEvent_3();
	void WidgetAnimationEvt_PartyRace_Option_In_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_PartyRace_Option_Out_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_PartyRace_Option_Out_K2Node_WidgetAnimationEvent_2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyRace_C">();
	}
	static class UWBP_PartyRace_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyRace_C>();
	}
};
static_assert(alignof(UWBP_PartyRace_C) == 0x000008, "Wrong alignment on UWBP_PartyRace_C");
static_assert(sizeof(UWBP_PartyRace_C) == 0x000598, "Wrong size on UWBP_PartyRace_C");
static_assert(offsetof(UWBP_PartyRace_C, UberGraphFrame) == 0x0004F8, "Member 'UWBP_PartyRace_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, FooterBtnCover) == 0x000500, "Member 'UWBP_PartyRace_C::FooterBtnCover' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, OutOfContentButton_187) == 0x000508, "Member 'UWBP_PartyRace_C::OutOfContentButton_187' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, Overlay_Option) == 0x000510, "Member 'UWBP_PartyRace_C::Overlay_Option' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, SafeZone_PartyRace) == 0x000518, "Member 'UWBP_PartyRace_C::SafeZone_PartyRace' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, WBP_PartyRace_Sub_Btn_01) == 0x000520, "Member 'UWBP_PartyRace_C::WBP_PartyRace_Sub_Btn_01' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, WBP_PartyRace_Sub_Btn_02) == 0x000528, "Member 'UWBP_PartyRace_C::WBP_PartyRace_Sub_Btn_02' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, WBP_PartyRace_Sub_Btn_03) == 0x000530, "Member 'UWBP_PartyRace_C::WBP_PartyRace_Sub_Btn_03' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, WBP_PartyRace_Sub_Btn_04) == 0x000538, "Member 'UWBP_PartyRace_C::WBP_PartyRace_Sub_Btn_04' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, WBP_PartyRace_Sub_Btn_05) == 0x000540, "Member 'UWBP_PartyRace_C::WBP_PartyRace_Sub_Btn_05' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, WBP_PartyRace_Sub_Btn_06) == 0x000548, "Member 'UWBP_PartyRace_C::WBP_PartyRace_Sub_Btn_06' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, WBP_PartyRace_Sub_Option_Btn_Window) == 0x000550, "Member 'UWBP_PartyRace_C::WBP_PartyRace_Sub_Option_Btn_Window' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, WBP_PartyRace_Sub_Option_Finalconfirm) == 0x000558, "Member 'UWBP_PartyRace_C::WBP_PartyRace_Sub_Option_Finalconfirm' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, WBP_PartyRace_Sub_Window) == 0x000560, "Member 'UWBP_PartyRace_C::WBP_PartyRace_Sub_Window' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, CurrentState) == 0x000568, "Member 'UWBP_PartyRace_C::CurrentState' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, bExchangeWindow) == 0x000569, "Member 'UWBP_PartyRace_C::bExchangeWindow' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, ReserveState) == 0x00056A, "Member 'UWBP_PartyRace_C::ReserveState' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, Scene_Anim) == 0x00056B, "Member 'UWBP_PartyRace_C::Scene_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, bBackedSequence) == 0x00056C, "Member 'UWBP_PartyRace_C::bBackedSequence' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, LastSelectedPreset) == 0x00056D, "Member 'UWBP_PartyRace_C::LastSelectedPreset' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, OnStartCustomButtonPressed) == 0x000570, "Member 'UWBP_PartyRace_C::OnStartCustomButtonPressed' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, LastFocusedPreset) == 0x000580, "Member 'UWBP_PartyRace_C::LastFocusedPreset' has a wrong offset!");
static_assert(offsetof(UWBP_PartyRace_C, OnFinishedOptionOut) == 0x000588, "Member 'UWBP_PartyRace_C::OnFinishedOptionOut' has a wrong offset!");

}

