#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_Sub_GadgetCustom

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_Sub_GadgetCustom.WBP_CMN_Sub_GadgetCustom_C
// 0x0038 (0x06A8 - 0x0670)
class UWBP_CMN_Sub_GadgetCustom_C final : public UCommonGadgetCustomButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon_01;                                           // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate;                                             // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Gadget_Custom;                                 // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn;                             // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               NewVar;                                            // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CMN_Sub_GadgetCustom(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateClass();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_Sub_GadgetCustom_C">();
	}
	static class UWBP_CMN_Sub_GadgetCustom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_Sub_GadgetCustom_C>();
	}
};
static_assert(alignof(UWBP_CMN_Sub_GadgetCustom_C) == 0x000008, "Wrong alignment on UWBP_CMN_Sub_GadgetCustom_C");
static_assert(sizeof(UWBP_CMN_Sub_GadgetCustom_C) == 0x0006A8, "Wrong size on UWBP_CMN_Sub_GadgetCustom_C");
static_assert(offsetof(UWBP_CMN_Sub_GadgetCustom_C, UberGraphFrame) == 0x000670, "Member 'UWBP_CMN_Sub_GadgetCustom_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_GadgetCustom_C, Icon_01) == 0x000678, "Member 'UWBP_CMN_Sub_GadgetCustom_C::Icon_01' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_GadgetCustom_C, Panel) == 0x000680, "Member 'UWBP_CMN_Sub_GadgetCustom_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_GadgetCustom_C, Plate) == 0x000688, "Member 'UWBP_CMN_Sub_GadgetCustom_C::Plate' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_GadgetCustom_C, TXT_Gadget_Custom) == 0x000690, "Member 'UWBP_CMN_Sub_GadgetCustom_C::TXT_Gadget_Custom' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_GadgetCustom_C, WBP_CMN_ControllerBtn) == 0x000698, "Member 'UWBP_CMN_Sub_GadgetCustom_C::WBP_CMN_ControllerBtn' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_GadgetCustom_C, NewVar) == 0x0006A0, "Member 'UWBP_CMN_Sub_GadgetCustom_C::NewVar' has a wrong offset!");

}

