#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TitleMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UNION_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_TitleMenu.WBP_TitleMenu_C.ExecuteUbergraph_WBP_TitleMenu
// 0x0108 (0x0108 - 0x0000)
struct WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableTitleDemoMilestoneVersion_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWindows_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerControllerIndex_27;             // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_26;             // 0x000C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_25;             // 0x0010(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_24;             // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_23;             // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_22;             // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_21;             // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_20;             // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_19;             // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_18;             // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_17;             // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_16;             // 0x0034(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_15;             // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_14;             // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Value_3;                              // 0x0040(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Value_2;                              // 0x0050(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_13;             // 0x0060(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_12;             // 0x0064(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_11;             // 0x0068(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_10;             // 0x006C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_9;              // 0x0070(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_8;              // 0x0074(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_7;              // 0x0078(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_Value_1;                              // 0x0080(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Value;                                // 0x0090(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_6;              // 0x00A0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_5;              // 0x00A4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_4;              // 0x00A8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_3;              // 0x00AC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_2;              // 0x00B0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_1;              // 0x00B4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex;                // 0x00B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOnce;                                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHiddenRomVerMilestoneVersion_ReturnValue; // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableTitleStoreMilestoneVersion_ReturnValue; // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetGamerTag_ReturnValue;                  // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D0(0x0010)()
	class FString                                 CallFunc_GetVersion_ReturnValue;                   // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXbox_ReturnValue;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00F8(0x0010)()
};
static_assert(alignof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu) == 0x000008, "Wrong alignment on WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu");
static_assert(sizeof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu) == 0x000108, "Wrong size on WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, EntryPoint) == 0x000000, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, CallFunc_IsEnableTitleDemoMilestoneVersion_ReturnValue) == 0x000004, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::CallFunc_IsEnableTitleDemoMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, CallFunc_IsWindows_ReturnValue) == 0x000005, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::CallFunc_IsWindows_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_27) == 0x000008, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_27' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_26) == 0x00000C, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_26' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_25) == 0x000010, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_25' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_24) == 0x000014, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_24' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_23) == 0x000018, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_23' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_22) == 0x00001C, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_22' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_21) == 0x000020, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_21' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_20) == 0x000024, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_20' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_19) == 0x000028, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_19' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_18) == 0x00002C, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_18' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_17) == 0x000030, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_17' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_16) == 0x000034, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_16' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_15) == 0x000038, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_15' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_14) == 0x00003C, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_14' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_Value_3) == 0x000040, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_Value_2) == 0x000050, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_13) == 0x000060, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_13' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_12) == 0x000064, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_12' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_11) == 0x000068, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_11' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_10) == 0x00006C, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_10' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_9) == 0x000070, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_9' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_8) == 0x000074, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_8' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_7) == 0x000078, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_7' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_Value_1) == 0x000080, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_Value) == 0x000090, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_6) == 0x0000A0, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_6' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_5) == 0x0000A4, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_5' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_4) == 0x0000A8, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_4' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_3) == 0x0000AC, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_3' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_2) == 0x0000B0, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_2' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex_1) == 0x0000B4, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_PlayerControllerIndex) == 0x0000B8, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_bOnce) == 0x0000BC, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_bOnce' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, K2Node_Event_IsDesignTime) == 0x0000BD, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, CallFunc_IsHiddenRomVerMilestoneVersion_ReturnValue) == 0x0000BE, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::CallFunc_IsHiddenRomVerMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, CallFunc_IsEnableTitleStoreMilestoneVersion_ReturnValue) == 0x0000BF, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::CallFunc_IsEnableTitleStoreMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, CallFunc_GetGamerTag_ReturnValue) == 0x0000C0, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::CallFunc_GetGamerTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D0, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, CallFunc_GetVersion_ReturnValue) == 0x0000E0, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::CallFunc_GetVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, CallFunc_IsXbox_ReturnValue) == 0x0000F0, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::CallFunc_IsXbox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000F8, "Member 'WBP_TitleMenu_C_ExecuteUbergraph_WBP_TitleMenu::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.InitVisualSelect
// 0x0010 (0x0010 - 0x0000)
struct WBP_TitleMenu_C_InitVisualSelect final
{
public:
	bool                                          L_Is2ndVisual;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETitleVisualId                                CallFunc_GetTitleVisualId_ReturnValue;             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_TitleMenu_Sub_Btn_C*               K2Node_Select_Default_1;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_InitVisualSelect) == 0x000008, "Wrong alignment on WBP_TitleMenu_C_InitVisualSelect");
static_assert(sizeof(WBP_TitleMenu_C_InitVisualSelect) == 0x000010, "Wrong size on WBP_TitleMenu_C_InitVisualSelect");
static_assert(offsetof(WBP_TitleMenu_C_InitVisualSelect, L_Is2ndVisual) == 0x000000, "Member 'WBP_TitleMenu_C_InitVisualSelect::L_Is2ndVisual' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_InitVisualSelect, Temp_bool_Variable) == 0x000001, "Member 'WBP_TitleMenu_C_InitVisualSelect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_InitVisualSelect, Temp_bool_Variable_1) == 0x000002, "Member 'WBP_TitleMenu_C_InitVisualSelect::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_InitVisualSelect, Temp_byte_Variable) == 0x000003, "Member 'WBP_TitleMenu_C_InitVisualSelect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_InitVisualSelect, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_TitleMenu_C_InitVisualSelect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_InitVisualSelect, K2Node_Select_Default) == 0x000005, "Member 'WBP_TitleMenu_C_InitVisualSelect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_InitVisualSelect, CallFunc_GetTitleVisualId_ReturnValue) == 0x000006, "Member 'WBP_TitleMenu_C_InitVisualSelect::CallFunc_GetTitleVisualId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_InitVisualSelect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000007, "Member 'WBP_TitleMenu_C_InitVisualSelect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_InitVisualSelect, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_TitleMenu_C_InitVisualSelect::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.MessageAppear
// 0x0018 (0x0018 - 0x0000)
struct WBP_TitleMenu_C_MessageAppear final
{
public:
	class FText                                   Message_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_MessageAppear) == 0x000008, "Wrong alignment on WBP_TitleMenu_C_MessageAppear");
static_assert(sizeof(WBP_TitleMenu_C_MessageAppear) == 0x000018, "Wrong size on WBP_TitleMenu_C_MessageAppear");
static_assert(offsetof(WBP_TitleMenu_C_MessageAppear, Message_0) == 0x000000, "Member 'WBP_TitleMenu_C_MessageAppear::Message_0' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_MessageAppear, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_TitleMenu_C_MessageAppear::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnAcceptKeyPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnAcceptKeyPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnAcceptKeyPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnAcceptKeyPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnAcceptKeyPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnAcceptKeyPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnAcceptKeyPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnAcceptKeyPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnAcceptKeyReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnAcceptKeyReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnAcceptKeyReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnAcceptKeyReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnAcceptKeyReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnAcceptKeyReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnAcceptKeyReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnAcceptKeyReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnBackKeyPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnBackKeyPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnBackKeyPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnBackKeyPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnBackKeyPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnBackKeyPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnBackKeyPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnBackKeyPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnBackKeyReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnBackKeyReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnBackKeyReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnBackKeyReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnBackKeyReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnBackKeyReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnBackKeyReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnBackKeyReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnDownKeyPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnDownKeyPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnDownKeyPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnDownKeyPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnDownKeyPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnDownKeyPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnDownKeyPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnDownKeyPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnDownKeyReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnDownKeyReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnDownKeyReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnDownKeyReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnDownKeyReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnDownKeyReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnDownKeyReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnDownKeyReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnFaceButtonLeftPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnFaceButtonLeftPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnFaceButtonLeftPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnFaceButtonLeftPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnFaceButtonLeftPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnFaceButtonLeftPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnFaceButtonLeftPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnFaceButtonLeftPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnFaceButtonLeftReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnFaceButtonLeftReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnFaceButtonLeftReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnFaceButtonLeftReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnFaceButtonLeftReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnFaceButtonLeftReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnFaceButtonLeftReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnFaceButtonLeftReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnFaceButtonTopPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnFaceButtonTopPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnFaceButtonTopPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnFaceButtonTopPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnFaceButtonTopPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnFaceButtonTopPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnFaceButtonTopPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnFaceButtonTopPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnFaceButtonTopReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnFaceButtonTopReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnFaceButtonTopReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnFaceButtonTopReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnFaceButtonTopReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnFaceButtonTopReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnFaceButtonTopReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnFaceButtonTopReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnLeftKeyPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnLeftKeyPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnLeftKeyPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnLeftKeyPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnLeftKeyPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnLeftKeyPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnLeftKeyPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnLeftKeyPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnLeftKeyReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnLeftKeyReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnLeftKeyReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnLeftKeyReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnLeftKeyReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnLeftKeyReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnLeftKeyReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnLeftKeyReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnLeftShoulderPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnLeftShoulderPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnLeftShoulderPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnLeftShoulderPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnLeftShoulderPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnLeftShoulderPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnLeftShoulderPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnLeftShoulderPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnLeftShoulderReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnLeftShoulderReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnLeftShoulderReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnLeftShoulderReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnLeftShoulderReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnLeftShoulderReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnLeftShoulderReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnLeftShoulderReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnLeftStickAxis
// 0x0010 (0x0010 - 0x0000)
struct WBP_TitleMenu_C_OnLeftStickAxis final
{
public:
	struct FVector2D                              Value;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnLeftStickAxis) == 0x000008, "Wrong alignment on WBP_TitleMenu_C_OnLeftStickAxis");
static_assert(sizeof(WBP_TitleMenu_C_OnLeftStickAxis) == 0x000010, "Wrong size on WBP_TitleMenu_C_OnLeftStickAxis");
static_assert(offsetof(WBP_TitleMenu_C_OnLeftStickAxis, Value) == 0x000000, "Member 'WBP_TitleMenu_C_OnLeftStickAxis::Value' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnLeftStickAxisWithPlayerId
// 0x0018 (0x0018 - 0x0000)
struct WBP_TitleMenu_C_OnLeftStickAxisWithPlayerId final
{
public:
	struct FVector2D                              Value;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerControllerIndex;                             // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnLeftStickAxisWithPlayerId) == 0x000008, "Wrong alignment on WBP_TitleMenu_C_OnLeftStickAxisWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnLeftStickAxisWithPlayerId) == 0x000018, "Wrong size on WBP_TitleMenu_C_OnLeftStickAxisWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnLeftStickAxisWithPlayerId, Value) == 0x000000, "Member 'WBP_TitleMenu_C_OnLeftStickAxisWithPlayerId::Value' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_OnLeftStickAxisWithPlayerId, PlayerControllerIndex) == 0x000010, "Member 'WBP_TitleMenu_C_OnLeftStickAxisWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnLeftStickButtonPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnLeftStickButtonPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnLeftStickButtonPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnLeftStickButtonPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnLeftStickButtonPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnLeftStickButtonPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnLeftStickButtonPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnLeftStickButtonPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnLeftStickButtonReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnLeftStickButtonReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnLeftStickButtonReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnLeftStickButtonReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnLeftStickButtonReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnLeftStickButtonReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnLeftStickButtonReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnLeftStickButtonReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnRightKeyPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnRightKeyPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnRightKeyPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnRightKeyPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnRightKeyPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnRightKeyPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnRightKeyPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnRightKeyPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnRightKeyReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnRightKeyReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnRightKeyReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnRightKeyReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnRightKeyReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnRightKeyReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnRightKeyReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnRightKeyReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnRightShoulderPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnRightShoulderPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnRightShoulderPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnRightShoulderPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnRightShoulderPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnRightShoulderPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnRightShoulderPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnRightShoulderPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnRightShoulderReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnRightShoulderReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnRightShoulderReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnRightShoulderReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnRightShoulderReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnRightShoulderReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnRightShoulderReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnRightShoulderReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnRightStickAxis
// 0x0010 (0x0010 - 0x0000)
struct WBP_TitleMenu_C_OnRightStickAxis final
{
public:
	struct FVector2D                              Value;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnRightStickAxis) == 0x000008, "Wrong alignment on WBP_TitleMenu_C_OnRightStickAxis");
static_assert(sizeof(WBP_TitleMenu_C_OnRightStickAxis) == 0x000010, "Wrong size on WBP_TitleMenu_C_OnRightStickAxis");
static_assert(offsetof(WBP_TitleMenu_C_OnRightStickAxis, Value) == 0x000000, "Member 'WBP_TitleMenu_C_OnRightStickAxis::Value' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnRightStickAxisWithPlayerId
// 0x0018 (0x0018 - 0x0000)
struct WBP_TitleMenu_C_OnRightStickAxisWithPlayerId final
{
public:
	struct FVector2D                              Value;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerControllerIndex;                             // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnRightStickAxisWithPlayerId) == 0x000008, "Wrong alignment on WBP_TitleMenu_C_OnRightStickAxisWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnRightStickAxisWithPlayerId) == 0x000018, "Wrong size on WBP_TitleMenu_C_OnRightStickAxisWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnRightStickAxisWithPlayerId, Value) == 0x000000, "Member 'WBP_TitleMenu_C_OnRightStickAxisWithPlayerId::Value' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_OnRightStickAxisWithPlayerId, PlayerControllerIndex) == 0x000010, "Member 'WBP_TitleMenu_C_OnRightStickAxisWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnRightStickButtonPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnRightStickButtonPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnRightStickButtonPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnRightStickButtonPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnRightStickButtonPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnRightStickButtonPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnRightStickButtonPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnRightStickButtonPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnRightStickButtonReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnRightStickButtonReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnRightStickButtonReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnRightStickButtonReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnRightStickButtonReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnRightStickButtonReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnRightStickButtonReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnRightStickButtonReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnSpecialPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnSpecialPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnSpecialPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnSpecialPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnSpecialPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnSpecialPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnSpecialPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnSpecialPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnSpecialReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnSpecialReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnSpecialReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnSpecialReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnSpecialReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnSpecialReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnSpecialReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnSpecialReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnUpKeyPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnUpKeyPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnUpKeyPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnUpKeyPressedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnUpKeyPressedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnUpKeyPressedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnUpKeyPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnUpKeyPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.OnUpKeyReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_TitleMenu_C_OnUpKeyReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_OnUpKeyReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_TitleMenu_C_OnUpKeyReleasedWithPlayerId");
static_assert(sizeof(WBP_TitleMenu_C_OnUpKeyReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_TitleMenu_C_OnUpKeyReleasedWithPlayerId");
static_assert(offsetof(WBP_TitleMenu_C_OnUpKeyReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_TitleMenu_C_OnUpKeyReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TitleMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TitleMenu_C_PreConstruct");
static_assert(sizeof(WBP_TitleMenu_C_PreConstruct) == 0x000001, "Wrong size on WBP_TitleMenu_C_PreConstruct");
static_assert(offsetof(WBP_TitleMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TitleMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.SetNeedPressButtonInAnim
// 0x0001 (0x0001 - 0x0000)
struct WBP_TitleMenu_C_SetNeedPressButtonInAnim final
{
public:
	bool                                          InNeed;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_SetNeedPressButtonInAnim) == 0x000001, "Wrong alignment on WBP_TitleMenu_C_SetNeedPressButtonInAnim");
static_assert(sizeof(WBP_TitleMenu_C_SetNeedPressButtonInAnim) == 0x000001, "Wrong size on WBP_TitleMenu_C_SetNeedPressButtonInAnim");
static_assert(offsetof(WBP_TitleMenu_C_SetNeedPressButtonInAnim, InNeed) == 0x000000, "Member 'WBP_TitleMenu_C_SetNeedPressButtonInAnim::InNeed' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.SetTitleLogoTexture
// 0x0010 (0x0010 - 0x0000)
struct WBP_TitleMenu_C_SetTitleLogoTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ETitleVisualId                                CallFunc_GetTitleVisualId_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_SetTitleLogoTexture) == 0x000008, "Wrong alignment on WBP_TitleMenu_C_SetTitleLogoTexture");
static_assert(sizeof(WBP_TitleMenu_C_SetTitleLogoTexture) == 0x000010, "Wrong size on WBP_TitleMenu_C_SetTitleLogoTexture");
static_assert(offsetof(WBP_TitleMenu_C_SetTitleLogoTexture, Texture) == 0x000000, "Member 'WBP_TitleMenu_C_SetTitleLogoTexture::Texture' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_SetTitleLogoTexture, CallFunc_GetTitleVisualId_ReturnValue) == 0x000008, "Member 'WBP_TitleMenu_C_SetTitleLogoTexture::CallFunc_GetTitleVisualId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_SetTitleLogoTexture, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'WBP_TitleMenu_C_SetTitleLogoTexture::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.SetTitleLogoVisibility
// 0x0003 (0x0003 - 0x0000)
struct WBP_TitleMenu_C_SetTitleLogoVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETitleVisualId                                CallFunc_GetTitleVisualId_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_SetTitleLogoVisibility) == 0x000001, "Wrong alignment on WBP_TitleMenu_C_SetTitleLogoVisibility");
static_assert(sizeof(WBP_TitleMenu_C_SetTitleLogoVisibility) == 0x000003, "Wrong size on WBP_TitleMenu_C_SetTitleLogoVisibility");
static_assert(offsetof(WBP_TitleMenu_C_SetTitleLogoVisibility, InVisibility) == 0x000000, "Member 'WBP_TitleMenu_C_SetTitleLogoVisibility::InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_SetTitleLogoVisibility, CallFunc_GetTitleVisualId_ReturnValue) == 0x000001, "Member 'WBP_TitleMenu_C_SetTitleLogoVisibility::CallFunc_GetTitleVisualId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TitleMenu_C_SetTitleLogoVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_TitleMenu_C_SetTitleLogoVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.SilentFocusReady
// 0x0001 (0x0001 - 0x0000)
struct WBP_TitleMenu_C_SilentFocusReady final
{
public:
	bool                                          bOnce;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TitleMenu_C_SilentFocusReady) == 0x000001, "Wrong alignment on WBP_TitleMenu_C_SilentFocusReady");
static_assert(sizeof(WBP_TitleMenu_C_SilentFocusReady) == 0x000001, "Wrong size on WBP_TitleMenu_C_SilentFocusReady");
static_assert(offsetof(WBP_TitleMenu_C_SilentFocusReady, bOnce) == 0x000000, "Member 'WBP_TitleMenu_C_SilentFocusReady::bOnce' has a wrong offset!");

// Function WBP_TitleMenu.WBP_TitleMenu_C.Toggle Selectable Hit Test
// 0x0001 (0x0001 - 0x0000)
struct WBP_TitleMenu_C_Toggle_Selectable_Hit_Test final
{
public:
