#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Online_PlayerName_Btn

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.ChangeActiveWidget
// 0x0004 (0x0004 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_ChangeActiveWidget final
{
public:
	int32                                         InActiveWidgetIndex;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_ChangeActiveWidget) == 0x000004, "Wrong alignment on WBP_Online_PlayerName_Btn_C_ChangeActiveWidget");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_ChangeActiveWidget) == 0x000004, "Wrong size on WBP_Online_PlayerName_Btn_C_ChangeActiveWidget");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ChangeActiveWidget, InActiveWidgetIndex) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_ChangeActiveWidget::InActiveWidgetIndex' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.ExecuteUbergraph_WBP_Online_PlayerName_Btn
// 0x0188 (0x0188 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0018(0x0008)(NoDestructor)
	class FText                                   K2Node_Event_InText;                               // 0x0020(0x0010)(ConstParm)
	int32                                         K2Node_Event_InPlatformID;                         // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrossplayPlatform                            CallFunc_GetEAppSupportedPlatformToECrossplayPlatform_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCrossplayPlatformIconIndex_ReturnValue; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Event_InVisibility_1;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InNiceCount;                          // 0x0064(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0068(0x0010)()
	bool                                          K2Node_Event_bIsRival;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerNameContext                     K2Node_Event_InContext;                            // 0x0088(0x0020)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrossplayPlatform                            CallFunc_GetEAppSupportedPlatformToECrossplayPlatform_ReturnValue_1; // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCrossplayPlatformIconIndex_ReturnValue_1; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00B0(0x0008)(NoDestructor)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x00B8(0x0004)()
	int32                                         Temp_int_Variable;                                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBlockPlayerState                             K2Node_Event_InBlockType;                          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Event_InVisibility;                         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlockPlayerState                             Temp_byte_Variable_2;                              // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlatformIconComIndex_ReturnValue;      // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlatformIconComIndex_ReturnValue_1;    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InActiveWidgetIndex;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumWidgets_ReturnValue;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_5;                               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetClampUserNameLength_ReturnValue;       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TruncateTextWithEllipsis_ReturnValue;     // 0x0140(0x0010)()
	int32                                         Temp_int_Variable_7;                               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0154(0x0004)()
	EBlockPlayerState                             Temp_byte_Variable_5;                              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_3;                           // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16B[0x1];                                      // 0x016B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x016C(0x0004)()
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_3;                  // 0x0170(0x0004)()
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn) == 0x000008, "Wrong alignment on WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn) == 0x000188, "Wrong size on WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, EntryPoint) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_bool_Variable) == 0x000004, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_byte_Variable) == 0x000005, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Event_InFocusEvent_1) == 0x000018, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Event_InText) == 0x000020, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Event_InPlatformID) == 0x000030, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Event_InPlatformID' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetEAppSupportedPlatformToECrossplayPlatform_ReturnValue) == 0x000040, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetEAppSupportedPlatformToECrossplayPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetCrossplayPlatformIconIndex_ReturnValue) == 0x000044, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetCrossplayPlatformIconIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Event_InVisibility_1) == 0x000050, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Event_InVisibility_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000058, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_byte_Variable_1) == 0x000060, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Event_InNiceCount) == 0x000064, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Event_InNiceCount' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_Conv_IntToText_ReturnValue) == 0x000068, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Event_bIsRival) == 0x000078, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Event_bIsRival' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_SelectInt_ReturnValue) == 0x00007C, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_bool_Variable_1) == 0x000080, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Event_InContext) == 0x000088, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Event_InContext' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000A8, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetEAppSupportedPlatformToECrossplayPlatform_ReturnValue_1) == 0x0000A9, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetEAppSupportedPlatformToECrossplayPlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetCrossplayPlatformIconIndex_ReturnValue_1) == 0x0000AC, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetCrossplayPlatformIconIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Event_InFocusEvent) == 0x0000B0, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_SoundPlay_ReturnValue) == 0x0000B8, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_int_Variable) == 0x0000BC, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x0000C0, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Event_InBlockType) == 0x0000C8, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Event_InBlockType' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000C9, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x0000D0, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Select_Default) == 0x0000D8, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_int_Variable_1) == 0x0000DC, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Event_InVisibility) == 0x0000E0, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Event_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_int_Variable_2) == 0x0000E4, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_PlayAnimation_ReturnValue) == 0x0000E8, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_int_Variable_3) == 0x0000F0, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_byte_Variable_2) == 0x0000F4, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_byte_Variable_3) == 0x0000F5, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Select_Default_1) == 0x0000F8, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000100, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_byte_Variable_4) == 0x000108, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_bool_Variable_2) == 0x000109, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_int_Variable_4) == 0x00010C, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Select_Default_2) == 0x000110, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetPlatformIconComIndex_ReturnValue) == 0x000114, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetPlatformIconComIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetPlatformIconComIndex_ReturnValue_1) == 0x000118, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetPlatformIconComIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Event_InActiveWidgetIndex) == 0x00011C, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Event_InActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetNumWidgets_ReturnValue) == 0x000120, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetNumWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000124, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_Less_IntInt_ReturnValue) == 0x000125, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_int_Variable_5) == 0x000128, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_BooleanAND_ReturnValue) == 0x00012C, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetAppPlayerController_ReturnValue) == 0x000130, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_GetClampUserNameLength_ReturnValue) == 0x000138, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_GetClampUserNameLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_int_Variable_6) == 0x00013C, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_TruncateTextWithEllipsis_ReturnValue) == 0x000140, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_TruncateTextWithEllipsis_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_int_Variable_7) == 0x000150, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_SoundPlay_ReturnValue_1) == 0x000154, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_SoundPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_byte_Variable_5) == 0x000158, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Select_Default_3) == 0x00015C, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000160, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_byte_Variable_6) == 0x000168, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, Temp_byte_Variable_7) == 0x000169, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, K2Node_Select_Default_4) == 0x00016A, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_SoundPlay_ReturnValue_2) == 0x00016C, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_SoundPlay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_SoundPlay_ReturnValue_3) == 0x000170, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_SoundPlay_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000174, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000178, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x00017C, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000180, "Member 'WBP_Online_PlayerName_Btn_C_ExecuteUbergraph_WBP_Online_PlayerName_Btn::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_Online_PlayerName_Btn_C_OnFocusLost");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_OnFocusLost) == 0x000008, "Wrong size on WBP_Online_PlayerName_Btn_C_OnFocusLost");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.OnFocusLostImpl
// 0x0008 (0x0008 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_OnFocusLostImpl final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_OnFocusLostImpl) == 0x000004, "Wrong alignment on WBP_Online_PlayerName_Btn_C_OnFocusLostImpl");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_OnFocusLostImpl) == 0x000008, "Wrong size on WBP_Online_PlayerName_Btn_C_OnFocusLostImpl");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_OnFocusLostImpl, InFocusEvent) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_OnFocusLostImpl::InFocusEvent' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.OnFocusReceived
// 0x0268 (0x0268 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_OnFocusReceived_ReturnValue;              // 0x00F8(0x00B8)()
	struct FEventReply                            CallFunc_OnFocusReceivedImpl_ReturnValue;          // 0x01B0(0x00B8)()
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Online_PlayerName_Btn_C_OnFocusReceived");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_OnFocusReceived) == 0x000268, "Wrong size on WBP_Online_PlayerName_Btn_C_OnFocusReceived");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Online_PlayerName_Btn_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Online_PlayerName_Btn_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_OnFocusReceived, CallFunc_OnFocusReceived_ReturnValue) == 0x0000F8, "Member 'WBP_Online_PlayerName_Btn_C_OnFocusReceived::CallFunc_OnFocusReceived_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_OnFocusReceived, CallFunc_OnFocusReceivedImpl_ReturnValue) == 0x0001B0, "Member 'WBP_Online_PlayerName_Btn_C_OnFocusReceived::CallFunc_OnFocusReceivedImpl_ReturnValue' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.OnFocusReceivedImpl
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_OnFocusReceivedImpl_ReturnValue;          // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl) == 0x000008, "Wrong alignment on WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl) == 0x0001B0, "Wrong size on WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl, MyGeometry) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl, InFocusEvent) == 0x000038, "Member 'WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl, ReturnValue) == 0x000040, "Member 'WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl, CallFunc_OnFocusReceivedImpl_ReturnValue) == 0x0000F8, "Member 'WBP_Online_PlayerName_Btn_C_OnFocusReceivedImpl::CallFunc_OnFocusReceivedImpl_ReturnValue' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.PlayAnimationActive
// 0x0018 (0x0018 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_PlayAnimationActive final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_PlayAnimationActive) == 0x000008, "Wrong alignment on WBP_Online_PlayerName_Btn_C_PlayAnimationActive");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_PlayAnimationActive) == 0x000018, "Wrong size on WBP_Online_PlayerName_Btn_C_PlayAnimationActive");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_PlayAnimationActive, Temp_bool_Variable) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_PlayAnimationActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_PlayAnimationActive, K2Node_Select_Default) == 0x000008, "Member 'WBP_Online_PlayerName_Btn_C_PlayAnimationActive::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_PlayAnimationActive, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_Online_PlayerName_Btn_C_PlayAnimationActive::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.PlayAnimationSelect
// 0x0018 (0x0018 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_PlayAnimationSelect final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_PlayAnimationSelect) == 0x000008, "Wrong alignment on WBP_Online_PlayerName_Btn_C_PlayAnimationSelect");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_PlayAnimationSelect) == 0x000018, "Wrong size on WBP_Online_PlayerName_Btn_C_PlayAnimationSelect");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_PlayAnimationSelect, Temp_bool_Variable) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_PlayAnimationSelect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_PlayAnimationSelect, K2Node_Select_Default) == 0x000008, "Member 'WBP_Online_PlayerName_Btn_C_PlayAnimationSelect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_PlayAnimationSelect, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_Online_PlayerName_Btn_C_PlayAnimationSelect::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.SetBlockState
// 0x0001 (0x0001 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_SetBlockState final
{
public:
	EBlockPlayerState                             InBlockType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_SetBlockState) == 0x000001, "Wrong alignment on WBP_Online_PlayerName_Btn_C_SetBlockState");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_SetBlockState) == 0x000001, "Wrong size on WBP_Online_PlayerName_Btn_C_SetBlockState");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_SetBlockState, InBlockType) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_SetBlockState::InBlockType' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.SetContext
// 0x0020 (0x0020 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_SetContext final
{
public:
	struct FPlayerNameContext                     InContext;                                         // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_SetContext) == 0x000008, "Wrong alignment on WBP_Online_PlayerName_Btn_C_SetContext");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_SetContext) == 0x000020, "Wrong size on WBP_Online_PlayerName_Btn_C_SetContext");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_SetContext, InContext) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_SetContext::InContext' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.SetIsRival
// 0x0001 (0x0001 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_SetIsRival final
{
public:
	bool                                          bIsRival;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_SetIsRival) == 0x000001, "Wrong alignment on WBP_Online_PlayerName_Btn_C_SetIsRival");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_SetIsRival) == 0x000001, "Wrong size on WBP_Online_PlayerName_Btn_C_SetIsRival");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_SetIsRival, bIsRival) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_SetIsRival::bIsRival' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.SetNiceCount
// 0x0004 (0x0004 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_SetNiceCount final
{
public:
	int32                                         InNiceCount;                                       // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_SetNiceCount) == 0x000004, "Wrong alignment on WBP_Online_PlayerName_Btn_C_SetNiceCount");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_SetNiceCount) == 0x000004, "Wrong size on WBP_Online_PlayerName_Btn_C_SetNiceCount");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_SetNiceCount, InNiceCount) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_SetNiceCount::InNiceCount' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.SetPlatformIcon
// 0x0004 (0x0004 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_SetPlatformIcon final
{
public:
	int32                                         InPlatformId;                                      // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_SetPlatformIcon) == 0x000004, "Wrong alignment on WBP_Online_PlayerName_Btn_C_SetPlatformIcon");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_SetPlatformIcon) == 0x000004, "Wrong size on WBP_Online_PlayerName_Btn_C_SetPlatformIcon");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_SetPlatformIcon, InPlatformId) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_SetPlatformIcon::InPlatformId' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_SetText) == 0x000008, "Wrong alignment on WBP_Online_PlayerName_Btn_C_SetText");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_SetText) == 0x000010, "Wrong size on WBP_Online_PlayerName_Btn_C_SetText");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_SetText, InText) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_SetText::InText' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.SetVisibilityOwnerIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_SetVisibilityOwnerIcon final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_SetVisibilityOwnerIcon) == 0x000001, "Wrong alignment on WBP_Online_PlayerName_Btn_C_SetVisibilityOwnerIcon");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_SetVisibilityOwnerIcon) == 0x000001, "Wrong size on WBP_Online_PlayerName_Btn_C_SetVisibilityOwnerIcon");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_SetVisibilityOwnerIcon, InVisibility) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_SetVisibilityOwnerIcon::InVisibility' has a wrong offset!");

// Function WBP_Online_PlayerName_Btn.WBP_Online_PlayerName_Btn_C.SetVisibilityPlatformIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_Online_PlayerName_Btn_C_SetVisibilityPlatformIcon final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Online_PlayerName_Btn_C_SetVisibilityPlatformIcon) == 0x000001, "Wrong alignment on WBP_Online_PlayerName_Btn_C_SetVisibilityPlatformIcon");
static_assert(sizeof(WBP_Online_PlayerName_Btn_C_SetVisibilityPlatformIcon) == 0x000001, "Wrong size on WBP_Online_PlayerName_Btn_C_SetVisibilityPlatformIcon");
static_assert(offsetof(WBP_Online_PlayerName_Btn_C_SetVisibilityPlatformIcon, InVisibility) == 0x000000, "Member 'WBP_Online_PlayerName_Btn_C_SetVisibilityPlatformIcon::InVisibility' has a wrong offset!");

}

