#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_TimeTrial_TimeDiff

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Sub_TimeTrial_TimeDiff.WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C.ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff
// 0x0040 (0x0040 - 0x0000)
struct WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff");
static_assert(sizeof(WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff) == 0x000040, "Wrong size on WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff");
static_assert(offsetof(WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff, EntryPoint) == 0x000000, "Member 'WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000028, "Member 'WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000030, "Member 'WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_ExecuteUbergraph_WBP_Race_HUD_Sub_TimeTrial_TimeDiff::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_TimeTrial_TimeDiff.WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C.Open
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_Open final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_Open) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_Open");
static_assert(sizeof(WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_Open) == 0x000008, "Wrong size on WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_Open");
static_assert(offsetof(WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_Open, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_Race_HUD_Sub_TimeTrial_TimeDiff_C_Open::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

