#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_Window_Hint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Popup_Window_Hint.WBP_Popup_Window_Hint_C.ChangeInputTypeIF
// 0x0001 (0x0001 - 0x0000)
struct WBP_Popup_Window_Hint_C_ChangeInputTypeIF final
{
public:
	EAppControllerInputType                       InNewControllerInputType;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Popup_Window_Hint_C_ChangeInputTypeIF) == 0x000001, "Wrong alignment on WBP_Popup_Window_Hint_C_ChangeInputTypeIF");
static_assert(sizeof(WBP_Popup_Window_Hint_C_ChangeInputTypeIF) == 0x000001, "Wrong size on WBP_Popup_Window_Hint_C_ChangeInputTypeIF");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ChangeInputTypeIF, InNewControllerInputType) == 0x000000, "Member 'WBP_Popup_Window_Hint_C_ChangeInputTypeIF::InNewControllerInputType' has a wrong offset!");

// Function WBP_Popup_Window_Hint.WBP_Popup_Window_Hint_C.ExecuteUbergraph_WBP_Popup_Window_Hint
// 0x05E0 (0x05E0 - 0x0000)
struct WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInLVisible;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInRVisible;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInIsTips;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHintId                                       K2Node_CustomEvent_InHintId;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHintDataTableRow                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0070)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText_1;                             // 0x00A0(0x0010)(ConstParm)
	class FText                                   K2Node_Event_InText;                               // 0x00B0(0x0010)(ConstParm)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_InImageTexture;                       // 0x00C0(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHintId                                       K2Node_Event_InHintId;                             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInDecisionClose;                     // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0100(0x0004)()
	bool                                          K2Node_Event_bInVisible_2;                         // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInVisible_1;                         // 0x0105(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIButtonIconType                             K2Node_CustomEvent_InUIButtonIconType;             // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_107[0x1];                                      // 0x0107(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InButtonIndex;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_CustomEvent_InTextArray;                    // 0x0110(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UTexture2D>>      K2Node_CustomEvent_InImageTextureArray;            // 0x0128(0x0010)(ConstParm, ReferenceParm)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item;                           // 0x0138(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0164(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHintCategory                                 K2Node_CustomEvent_InCategory;                     // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InTipsIndex;                    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17F[0x1];                                      // 0x017F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InPageNum;                            // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InCurrentPageIndex;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InChangeValue;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultiPage_bOutIsMultiPage;              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultiPage_bOutIsMultiPage_1;            // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultiPage_bOutIsMultiPage_2;            // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   K2Node_Event_InImageWidget;                        // 0x01A8(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	float                                         K2Node_Event_InAnimationInterval;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_As__________;              // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UTexture2D>>      K2Node_CustomEvent_InImageTexture_1;               // 0x0218(0x0010)(ConstParm, ReferenceParm)
	TArray<TSoftClassPtr<class UClass>>           K2Node_CustomEvent_InImageWidgetArray;             // 0x0228(0x0010)(ConstParm, ReferenceParm)
	TArray<double>                                K2Node_CustomEvent_InAnimationInterval;            // 0x0238(0x0010)(ConstParm, ReferenceParm)
	TSoftClassPtr<class UClass>                   CallFunc_Array_Get_Item_1;                         // 0x0248(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0274(0x0014)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0288(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x02A0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x02B0(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0300(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_312[0x2];                                      // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInVisible;                           // 0x031A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31B[0x1];                                      // 0x031B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x031C(0x0004)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0320(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x0330(0x0004)()
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0338(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultiPage_bOutIsMultiPage_3;            // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343[0x5];                                      // 0x0343(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0348(0x0010)()
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x0358(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_Variable_2;                              // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0393(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0396(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0397(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UTexture2D>>      K2Node_CustomEvent_InImageTexture;                 // 0x0398(0x0010)(ConstParm, ReferenceParm)
	TArray<TSoftClassPtr<class UClass>>           K2Node_CustomEvent_InImageWidget;                  // 0x03A8(0x0010)(ConstParm, ReferenceParm)
	TArray<double>                                K2Node_CustomEvent_InImageWidgetAnimationInterval; // 0x03B8(0x0010)(ConstParm, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x03CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x03CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_5;                           // 0x03CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x03CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CF[0x1];                                      // 0x03CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UTexture2D>>      K2Node_CustomEvent_InImageWidgetTexture;           // 0x03D0(0x0010)(ConstParm, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item_2;                         // 0x03E8(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0432(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_433[0x1];                                      // 0x0433(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A[0x6];                                      // 0x043A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item_3;                         // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x044D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x044E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x044F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0458(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_1;                    // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0480(0x0060)(HasGetValueTypeHash)
	class UHint_Sub*                              K2Node_DynamicCast_AsHint_Sub;                     // 0x04E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidControllerUI_ReturnValue;          // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA[0x6];                                      // 0x04EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0500(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x050C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D[0x3];                                      // 0x050D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_515[0x3];                                      // 0x0515(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_3;                  // 0x0520(0x0004)()
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0539(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_enable;                         // 0x053A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53B[0x5];                                      // 0x053B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0554(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAppControllerInputType                       CallFunc_GetCurrentInputType_ReturnValue;          // 0x0564(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_565[0x3];                                      // 0x0565(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_2;                    // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0580(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_2;      // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0592(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0593(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0594(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppControllerInputType                       K2Node_Event_InNewControllerInputType;             // 0x0595(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_596[0x2];                                      // 0x0596(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRaceButtonText_ReturnValue;            // 0x0598(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x05A8(0x0010)()
	class FText                                   CallFunc_GetTerminologyTextByText_ReturnValue;     // 0x05B8(0x0010)()
	TArray<double>                                CallFunc_SetPageImageTextureAndWidget_InImageWidgetAnimationInterval_ImplicitCast; // 0x05C8(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_SetImageWidget_InAnimationInterval_ImplicitCast; // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Size_ImplicitCast;               // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint) == 0x000008, "Wrong alignment on WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint");
static_assert(sizeof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint) == 0x0005E0, "Wrong size on WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, EntryPoint) == 0x000000, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, Temp_byte_Variable) == 0x000004, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_bInLVisible) == 0x000005, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_bInLVisible' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_bInRVisible) == 0x000006, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_bInRVisible' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_bInIsTips) == 0x000007, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_bInIsTips' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_InHintId) == 0x000008, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_InHintId' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_GetEnumeratorName_ReturnValue) == 0x00000C, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000090, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000098, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Greater_IntInt_ReturnValue) == 0x000099, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Event_InText_1) == 0x0000A0, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Event_InText_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Event_InText) == 0x0000B0, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Event_InImageTexture) == 0x0000C0, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Event_InImageTexture' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000E8, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CreateDelegate_OutputDelegate) == 0x0000EC, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Event_InHintId) == 0x0000FC, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Event_InHintId' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Event_bInDecisionClose) == 0x0000FD, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Event_bInDecisionClose' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_SoundPlay_ReturnValue) == 0x000100, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Event_bInVisible_2) == 0x000104, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Event_bInVisible_2' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Event_bInVisible_1) == 0x000105, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Event_bInVisible_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_InUIButtonIconType) == 0x000106, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_InUIButtonIconType' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_InButtonIndex) == 0x000108, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_InButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_InTextArray) == 0x000110, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_InTextArray' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000120, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_InImageTextureArray) == 0x000128, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_InImageTextureArray' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Array_Get_Item) == 0x000138, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000160, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, Temp_bool_Variable) == 0x000161, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CreateDelegate_OutputDelegate_1) == 0x000164, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_InCategory) == 0x000174, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_InCategory' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_InTipsIndex) == 0x000178, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_InTipsIndex' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00017C, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00017D, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00017E, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, Temp_int_Array_Index_Variable) == 0x000180, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Event_InPageNum) == 0x000184, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Event_InPageNum' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Event_InCurrentPageIndex) == 0x000188, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Event_InCurrentPageIndex' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, Temp_int_Array_Index_Variable_1) == 0x00018C, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_InChangeValue) == 0x000190, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_InChangeValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Add_IntInt_ReturnValue) == 0x000194, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Add_IntInt_ReturnValue_1) == 0x000198, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Percent_IntInt_ReturnValue) == 0x00019C, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_IsMultiPage_bOutIsMultiPage) == 0x0001A0, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_IsMultiPage_bOutIsMultiPage' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_IsMultiPage_bOutIsMultiPage_1) == 0x0001A1, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_IsMultiPage_bOutIsMultiPage_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_IsMultiPage_bOutIsMultiPage_2) == 0x0001A2, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_IsMultiPage_bOutIsMultiPage_2' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Event_InImageWidget) == 0x0001A8, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Event_InImageWidget' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Event_InAnimationInterval) == 0x0001D0, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Event_InAnimationInterval' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x0001D8, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x0001E0, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_ClassDynamicCast_As__________) == 0x0001E8, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_ClassDynamicCast_As__________' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_ClassDynamicCast_bSuccess) == 0x0001F0, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, Temp_int_Loop_Counter_Variable) == 0x0001F4, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, Temp_byte_Variable_1) == 0x0001F8, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001FC, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Select_Default) == 0x000200, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_GetOwningPlayer_ReturnValue) == 0x000208, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Create_ReturnValue) == 0x000210, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_InImageTexture_1) == 0x000218, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_InImageTexture_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_InImageWidgetArray) == 0x000228, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_InImageWidgetArray' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CustomEvent_InAnimationInterval) == 0x000238, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CustomEvent_InAnimationInterval' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Array_Get_Item_1) == 0x000248, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x000270, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Array_IsValidIndex_ReturnValue_3) == 0x000271, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Array_IsValidIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_MakeStruct_SlateColor) == 0x000274, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_CreateDelegate_OutputDelegate_2) == 0x000288, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_MakeLiteralByte_ReturnValue) == 0x000298, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_MakeLiteralText_ReturnValue) == 0x0002A0, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_MakeStruct_FormatArgumentData) == 0x0002B0, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0002F8, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_MakeArray_Array) == 0x000300, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000310, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, Temp_bool_Variable_1) == 0x000311, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000314, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Select_Default_1) == 0x000318, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, CallFunc_BooleanAND_ReturnValue) == 0x000319, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint, K2Node_Event_bInVisible) == 0x00031A, "Member 'WBP_Popup_Window_Hint_C_ExecuteUbergraph_WBP_Popup_Window_Hint::K2Node_Event_bInVisible' has a wrong offset!");
