#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_SmallWindow_Top

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Friend_SmallWindow_Top.WBP_Friend_SmallWindow_Top_C
// 0x0018 (0x03F0 - 0x03D8)
class UWBP_Friend_SmallWindow_Top_C final : public UFriendListSubMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOutOfContentButton*                    OutOfContentButton;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Friend_SmallWindow_C*              WBP_Friend_SmallWindow;                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Friend_SmallWindow_Top(int32 EntryPoint);
	class UUnionUISceneBase* GetMainWidget();
	void SetMainWidgetFocus(int32 InButtonIndex);
	void SetupMainWidget(const TArray<class FText>& InButtonText, const TArray<bool>& InButtonSelectable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Friend_SmallWindow_Top_C">();
	}
	static class UWBP_Friend_SmallWindow_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Friend_SmallWindow_Top_C>();
	}
};
static_assert(alignof(UWBP_Friend_SmallWindow_Top_C) == 0x000008, "Wrong alignment on UWBP_Friend_SmallWindow_Top_C");
static_assert(sizeof(UWBP_Friend_SmallWindow_Top_C) == 0x0003F0, "Wrong size on UWBP_Friend_SmallWindow_Top_C");
static_assert(offsetof(UWBP_Friend_SmallWindow_Top_C, UberGraphFrame) == 0x0003D8, "Member 'UWBP_Friend_SmallWindow_Top_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_SmallWindow_Top_C, OutOfContentButton) == 0x0003E0, "Member 'UWBP_Friend_SmallWindow_Top_C::OutOfContentButton' has a wrong offset!");
static_assert(offsetof(UWBP_Friend_SmallWindow_Top_C, WBP_Friend_SmallWindow) == 0x0003E8, "Member 'UWBP_Friend_SmallWindow_Top_C::WBP_Friend_SmallWindow' has a wrong offset!");

}

