#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeaderMenu_Sub_WinInfo

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HeaderMenu_Sub_WinInfo.WBP_HeaderMenu_Sub_WinInfo_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_HeaderMenu_Sub_WinInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WinInfo_Out;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WinInfo_Loop;                                      // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WinInfo_In;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_WinInfo;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_HeaderMenu_Sub_WinInfo(int32 EntryPoint);
	void SetWinCounts(int32 InWinCounts);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HeaderMenu_Sub_WinInfo_C">();
	}
	static class UWBP_HeaderMenu_Sub_WinInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HeaderMenu_Sub_WinInfo_C>();
	}
};
static_assert(alignof(UWBP_HeaderMenu_Sub_WinInfo_C) == 0x000008, "Wrong alignment on UWBP_HeaderMenu_Sub_WinInfo_C");
static_assert(sizeof(UWBP_HeaderMenu_Sub_WinInfo_C) == 0x000310, "Wrong size on UWBP_HeaderMenu_Sub_WinInfo_C");
static_assert(offsetof(UWBP_HeaderMenu_Sub_WinInfo_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_HeaderMenu_Sub_WinInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_WinInfo_C, WinInfo_Out) == 0x0002E8, "Member 'UWBP_HeaderMenu_Sub_WinInfo_C::WinInfo_Out' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_WinInfo_C, WinInfo_Loop) == 0x0002F0, "Member 'UWBP_HeaderMenu_Sub_WinInfo_C::WinInfo_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_WinInfo_C, WinInfo_In) == 0x0002F8, "Member 'UWBP_HeaderMenu_Sub_WinInfo_C::WinInfo_In' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_WinInfo_C, base) == 0x000300, "Member 'UWBP_HeaderMenu_Sub_WinInfo_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_HeaderMenu_Sub_WinInfo_C, TXT_WinInfo) == 0x000308, "Member 'UWBP_HeaderMenu_Sub_WinInfo_C::TXT_WinInfo' has a wrong offset!");

}

