#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_Sub_RSR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result_Sub_RSR.WBP_Result_Sub_RSR_C
// 0x00A0 (0x0398 - 0x02F8)
class UWBP_Result_Sub_RSR_C final : public UUnionRaceUIResultRedStarRing
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RSR_Overlap_In;                                    // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RSR_Off_Loop;                                      // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RSR_Loop;                                          // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RSR_Get_Loop;                                      // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RSR_Get_In;                                        // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Circle_01;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Circle_02;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Icon;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Icon_Base;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Icon_Effect;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Icon_Get;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RSR_Icon_Off;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_01;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_02;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_03;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_04;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_05;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              AddAnimeFinishedEvent;                             // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Result_Sub_RSR(int32 EntryPoint);
	void InitRing(bool bPickUp);
	void OnEndGetInAnim();
	void OnEndOverlapAnim();
	void PickUpRing();
	void Play_Level_Up_Impl();
	void PlayBonusGetImpl();
	void ResetRing();
	void SkipRSRRing();
	void WidgetAnimationEvt_RSR_Get_In_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_RSR_Overlap_In_K2Node_WidgetAnimationEvent_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Result_Sub_RSR_C">();
	}
	static class UWBP_Result_Sub_RSR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_Sub_RSR_C>();
	}
};
static_assert(alignof(UWBP_Result_Sub_RSR_C) == 0x000008, "Wrong alignment on UWBP_Result_Sub_RSR_C");
static_assert(sizeof(UWBP_Result_Sub_RSR_C) == 0x000398, "Wrong size on UWBP_Result_Sub_RSR_C");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_Result_Sub_RSR_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, RSR_Overlap_In) == 0x000300, "Member 'UWBP_Result_Sub_RSR_C::RSR_Overlap_In' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, RSR_Off_Loop) == 0x000308, "Member 'UWBP_Result_Sub_RSR_C::RSR_Off_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, RSR_Loop) == 0x000310, "Member 'UWBP_Result_Sub_RSR_C::RSR_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, RSR_Get_Loop) == 0x000318, "Member 'UWBP_Result_Sub_RSR_C::RSR_Get_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, RSR_Get_In) == 0x000320, "Member 'UWBP_Result_Sub_RSR_C::RSR_Get_In' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, Circle_01) == 0x000328, "Member 'UWBP_Result_Sub_RSR_C::Circle_01' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, Circle_02) == 0x000330, "Member 'UWBP_Result_Sub_RSR_C::Circle_02' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, RSR_Icon) == 0x000338, "Member 'UWBP_Result_Sub_RSR_C::RSR_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, RSR_Icon_Base) == 0x000340, "Member 'UWBP_Result_Sub_RSR_C::RSR_Icon_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, RSR_Icon_Effect) == 0x000348, "Member 'UWBP_Result_Sub_RSR_C::RSR_Icon_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, RSR_Icon_Get) == 0x000350, "Member 'UWBP_Result_Sub_RSR_C::RSR_Icon_Get' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, RSR_Icon_Off) == 0x000358, "Member 'UWBP_Result_Sub_RSR_C::RSR_Icon_Off' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, Star_01) == 0x000360, "Member 'UWBP_Result_Sub_RSR_C::Star_01' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, Star_02) == 0x000368, "Member 'UWBP_Result_Sub_RSR_C::Star_02' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, Star_03) == 0x000370, "Member 'UWBP_Result_Sub_RSR_C::Star_03' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, Star_04) == 0x000378, "Member 'UWBP_Result_Sub_RSR_C::Star_04' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, Star_05) == 0x000380, "Member 'UWBP_Result_Sub_RSR_C::Star_05' has a wrong offset!");
static_assert(offsetof(UWBP_Result_Sub_RSR_C, AddAnimeFinishedEvent) == 0x000388, "Member 'UWBP_Result_Sub_RSR_C::AddAnimeFinishedEvent' has a wrong offset!");

}

