#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo.WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C.SetIcon
// 0x0020 (0x0020 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon final
{
public:
	EDriverId                                     newParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon) == 0x000020, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon, newParam) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon::newParam' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetIcon::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo.WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C.SetRank
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetRank final
{
public:
	int32                                         NewRank;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetRank) == 0x000004, "Wrong alignment on WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetRank");
static_assert(sizeof(WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetRank) == 0x000004, "Wrong size on WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetRank");
static_assert(offsetof(WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetRank, NewRank) == 0x000000, "Member 'WBP_Race_HUD_Sub_Festa_TeamHUD_CharaInfo_C_SetRank::NewRank' has a wrong offset!");

}

