#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FooterMenu_Sub_CommonBtn

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_FooterMenu_Sub_CommonBtn.WBP_FooterMenu_Sub_CommonBtn_C.ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn
// 0x0038 (0x0038 - 0x0000)
struct WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn) == 0x000008, "Wrong alignment on WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn");
static_assert(sizeof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn) == 0x000038, "Wrong size on WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, EntryPoint) == 0x000000, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000004, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000011, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000012, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000013, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000028, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000029, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00002A, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00002B, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x00002C, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x00002D, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x00002E, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, K2Node_CustomEvent_InVisibility) == 0x00002F, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn, K2Node_Event_IsDesignTime) == 0x000030, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_ExecuteUbergraph_WBP_FooterMenu_Sub_CommonBtn::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_FooterMenu_Sub_CommonBtn.WBP_FooterMenu_Sub_CommonBtn_C.OnVisibilityChanged_イベント
// 0x0001 (0x0001 - 0x0000)
struct WBP_FooterMenu_Sub_CommonBtn_C_OnVisibilityChanged_イベント final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FooterMenu_Sub_CommonBtn_C_OnVisibilityChanged_イベント) == 0x000001, "Wrong alignment on WBP_FooterMenu_Sub_CommonBtn_C_OnVisibilityChanged_イベント");
static_assert(sizeof(WBP_FooterMenu_Sub_CommonBtn_C_OnVisibilityChanged_イベント) == 0x000001, "Wrong size on WBP_FooterMenu_Sub_CommonBtn_C_OnVisibilityChanged_イベント");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_OnVisibilityChanged_イベント, InVisibility) == 0x000000, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_OnVisibilityChanged_イベント::InVisibility' has a wrong offset!");

// Function WBP_FooterMenu_Sub_CommonBtn.WBP_FooterMenu_Sub_CommonBtn_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_FooterMenu_Sub_CommonBtn_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FooterMenu_Sub_CommonBtn_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_FooterMenu_Sub_CommonBtn_C_PreConstruct");
static_assert(sizeof(WBP_FooterMenu_Sub_CommonBtn_C_PreConstruct) == 0x000001, "Wrong size on WBP_FooterMenu_Sub_CommonBtn_C_PreConstruct");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_FooterMenu_Sub_CommonBtn.WBP_FooterMenu_Sub_CommonBtn_C.SetIconGauge
// 0x0020 (0x0020 - 0x0000)
struct WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge final
{
public:
	float                                         InGaugeParam;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CMN_ControllerBtn_C*               K2Node_DynamicCast_AsWBP_CMN_Controller_Btn;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0014(0x0004)()
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge) == 0x000008, "Wrong alignment on WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge");
static_assert(sizeof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge) == 0x000020, "Wrong size on WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge, InGaugeParam) == 0x000000, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge::InGaugeParam' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000004, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge, K2Node_DynamicCast_AsWBP_CMN_Controller_Btn) == 0x000008, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge::K2Node_DynamicCast_AsWBP_CMN_Controller_Btn' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge, CallFunc_SoundPlay_ReturnValue) == 0x000014, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetIconGauge::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_FooterMenu_Sub_CommonBtn.WBP_FooterMenu_Sub_CommonBtn_C.SetIconType
// 0x0018 (0x0018 - 0x0000)
struct WBP_FooterMenu_Sub_CommonBtn_C_SetIconType final
{
public:
	int32                                         InButtonIconIndex;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIButtonIconType                             InButtonIconType;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CMN_ControllerBtn_C*               K2Node_DynamicCast_AsWBP_CMN_Controller_Btn;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconType) == 0x000008, "Wrong alignment on WBP_FooterMenu_Sub_CommonBtn_C_SetIconType");
static_assert(sizeof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconType) == 0x000018, "Wrong size on WBP_FooterMenu_Sub_CommonBtn_C_SetIconType");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconType, InButtonIconIndex) == 0x000000, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetIconType::InButtonIconIndex' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconType, InButtonIconType) == 0x000004, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetIconType::InButtonIconType' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconType, K2Node_DynamicCast_AsWBP_CMN_Controller_Btn) == 0x000008, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetIconType::K2Node_DynamicCast_AsWBP_CMN_Controller_Btn' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconType, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetIconType::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconType, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetIconType::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetIconType, CallFunc_SelectInt_ReturnValue) == 0x000014, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetIconType::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function WBP_FooterMenu_Sub_CommonBtn.WBP_FooterMenu_Sub_CommonBtn_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WBP_FooterMenu_Sub_CommonBtn_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_FooterMenu_Sub_CommonBtn_C_SetText) == 0x000008, "Wrong alignment on WBP_FooterMenu_Sub_CommonBtn_C_SetText");
static_assert(sizeof(WBP_FooterMenu_Sub_CommonBtn_C_SetText) == 0x000010, "Wrong size on WBP_FooterMenu_Sub_CommonBtn_C_SetText");
static_assert(offsetof(WBP_FooterMenu_Sub_CommonBtn_C_SetText, InText) == 0x000000, "Member 'WBP_FooterMenu_Sub_CommonBtn_C_SetText::InText' has a wrong offset!");

}

