#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusInfo_Sub_RankingTable

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_StatusInfo_Sub_RankingTable.WBP_StatusInfo_Sub_RankingTable_C.ExecuteUbergraph_WBP_StatusInfo_Sub_RankingTable
// 0x0010 (0x0010 - 0x0000)
struct WBP_StatusInfo_Sub_RankingTable_C_ExecuteUbergraph_WBP_StatusInfo_Sub_RankingTable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusInfo_Sub_RankingTable_C_ExecuteUbergraph_WBP_StatusInfo_Sub_RankingTable) == 0x000008, "Wrong alignment on WBP_StatusInfo_Sub_RankingTable_C_ExecuteUbergraph_WBP_StatusInfo_Sub_RankingTable");
static_assert(sizeof(WBP_StatusInfo_Sub_RankingTable_C_ExecuteUbergraph_WBP_StatusInfo_Sub_RankingTable) == 0x000010, "Wrong size on WBP_StatusInfo_Sub_RankingTable_C_ExecuteUbergraph_WBP_StatusInfo_Sub_RankingTable");
static_assert(offsetof(WBP_StatusInfo_Sub_RankingTable_C_ExecuteUbergraph_WBP_StatusInfo_Sub_RankingTable, EntryPoint) == 0x000000, "Member 'WBP_StatusInfo_Sub_RankingTable_C_ExecuteUbergraph_WBP_StatusInfo_Sub_RankingTable::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_RankingTable_C_ExecuteUbergraph_WBP_StatusInfo_Sub_RankingTable, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_StatusInfo_Sub_RankingTable_C_ExecuteUbergraph_WBP_StatusInfo_Sub_RankingTable::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_RankingTable_C_ExecuteUbergraph_WBP_StatusInfo_Sub_RankingTable, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_StatusInfo_Sub_RankingTable_C_ExecuteUbergraph_WBP_StatusInfo_Sub_RankingTable::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_StatusInfo_Sub_RankingTable.WBP_StatusInfo_Sub_RankingTable_C.GetMouseButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_StatusInfo_Sub_RankingTable_C_GetMouseButton final
{
public:
	class UButton*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UButton*                                CallFunc_GetMouseInteractionButton_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusInfo_Sub_RankingTable_C_GetMouseButton) == 0x000008, "Wrong alignment on WBP_StatusInfo_Sub_RankingTable_C_GetMouseButton");
static_assert(sizeof(WBP_StatusInfo_Sub_RankingTable_C_GetMouseButton) == 0x000010, "Wrong size on WBP_StatusInfo_Sub_RankingTable_C_GetMouseButton");
static_assert(offsetof(WBP_StatusInfo_Sub_RankingTable_C_GetMouseButton, ReturnValue) == 0x000000, "Member 'WBP_StatusInfo_Sub_RankingTable_C_GetMouseButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_RankingTable_C_GetMouseButton, CallFunc_GetMouseInteractionButton_ReturnValue) == 0x000008, "Member 'WBP_StatusInfo_Sub_RankingTable_C_GetMouseButton::CallFunc_GetMouseInteractionButton_ReturnValue' has a wrong offset!");

// Function WBP_StatusInfo_Sub_RankingTable.WBP_StatusInfo_Sub_RankingTable_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_StatusInfo_Sub_RankingTable_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusInfo_Sub_RankingTable_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_StatusInfo_Sub_RankingTable_C_PreConstruct");
static_assert(sizeof(WBP_StatusInfo_Sub_RankingTable_C_PreConstruct) == 0x000001, "Wrong size on WBP_StatusInfo_Sub_RankingTable_C_PreConstruct");
static_assert(offsetof(WBP_StatusInfo_Sub_RankingTable_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_StatusInfo_Sub_RankingTable_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

