#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSelect_Sub_RivalNext

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CourseSelect_Sub_RivalNext.WBP_CourseSelect_Sub_RivalNext_C
// 0x0170 (0x0818 - 0x06A8)
class UWBP_CourseSelect_Sub_RivalNext_C final : public UCourseSelectRivalWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Arrow;                                             // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Level_High;                                   // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Level_High_Glow;                              // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Level_Normal;                                 // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_WinComplete;                                  // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Icon_Level_10;                                 // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Icon_Level_06;                                 // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Icon_Level_07;                                 // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Icon_Level_08;                                 // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Icon_Level_09;                                 // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_SpSonic;                                       // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire01;                                            // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire01_01;                                         // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire02;                                            // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire02_01;                                         // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire03;                                            // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire03_01;                                         // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow_High;                                         // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grow_Normal;                                       // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Complete;                                     // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_High;                                         // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Level_01;                                     // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Level_02;                                     // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Level_03;                                     // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Level_04;                                     // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Level_05;                                     // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_CharaIcon;                                     // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate_High;                                        // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate_Normal;                                      // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate_Text;                                        // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RingBase;                                          // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RingEff;                                           // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RingEff_Add;                                       // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sparks;                                            // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sparks_01;                                         // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpSonic_Icon;                                      // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Complete_Num;                                  // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Level;                                         // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Rival;                                         // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn;                             // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_Base;                                           // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_Level;                                          // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UImage*>                         LevelIconArray;                                    // 0x0808(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CourseSelect_Sub_RivalNext(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateDisplayLevel(int32 RivalLevel, int32 BaseRivalLevel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CourseSelect_Sub_RivalNext_C">();
	}
	static class UWBP_CourseSelect_Sub_RivalNext_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CourseSelect_Sub_RivalNext_C>();
	}
};
static_assert(alignof(UWBP_CourseSelect_Sub_RivalNext_C) == 0x000008, "Wrong alignment on UWBP_CourseSelect_Sub_RivalNext_C");
static_assert(sizeof(UWBP_CourseSelect_Sub_RivalNext_C) == 0x000818, "Wrong size on UWBP_CourseSelect_Sub_RivalNext_C");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, UberGraphFrame) == 0x0006A8, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Arrow) == 0x0006B0, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Base_Level_High) == 0x0006B8, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Base_Level_High' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Base_Level_High_Glow) == 0x0006C0, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Base_Level_High_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Base_Level_Normal) == 0x0006C8, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Base_Level_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Base_WinComplete) == 0x0006D0, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Base_WinComplete' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, DSP_Icon_Level_10) == 0x0006D8, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::DSP_Icon_Level_10' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, DSP_Icon_Level_06) == 0x0006E0, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::DSP_Icon_Level_06' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, DSP_Icon_Level_07) == 0x0006E8, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::DSP_Icon_Level_07' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, DSP_Icon_Level_08) == 0x0006F0, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::DSP_Icon_Level_08' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, DSP_Icon_Level_09) == 0x0006F8, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::DSP_Icon_Level_09' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, DSP_SpSonic) == 0x000700, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::DSP_SpSonic' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Fire01) == 0x000708, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Fire01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Fire01_01) == 0x000710, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Fire01_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Fire02) == 0x000718, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Fire02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Fire02_01) == 0x000720, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Fire02_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Fire03) == 0x000728, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Fire03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Fire03_01) == 0x000730, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Fire03_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Grow_High) == 0x000738, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Grow_High' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Grow_Normal) == 0x000740, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Grow_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Icon_Complete) == 0x000748, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Icon_Complete' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Icon_High) == 0x000750, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Icon_High' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Icon_Level_01) == 0x000758, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Icon_Level_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Icon_Level_02) == 0x000760, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Icon_Level_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Icon_Level_03) == 0x000768, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Icon_Level_03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Icon_Level_04) == 0x000770, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Icon_Level_04' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Icon_Level_05) == 0x000778, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Icon_Level_05' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Panel) == 0x000780, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, PAT_CharaIcon) == 0x000788, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::PAT_CharaIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Plate_High) == 0x000790, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Plate_High' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Plate_Normal) == 0x000798, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Plate_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Plate_Text) == 0x0007A0, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Plate_Text' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, RingBase) == 0x0007A8, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::RingBase' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, RingEff) == 0x0007B0, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::RingEff' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, RingEff_Add) == 0x0007B8, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::RingEff_Add' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Sparks) == 0x0007C0, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Sparks' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, Sparks_01) == 0x0007C8, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::Sparks_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, SpSonic_Icon) == 0x0007D0, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::SpSonic_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, TXT_Complete_Num) == 0x0007D8, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::TXT_Complete_Num' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, TXT_Level) == 0x0007E0, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::TXT_Level' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, TXT_Rival) == 0x0007E8, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::TXT_Rival' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, WBP_CMN_ControllerBtn) == 0x0007F0, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::WBP_CMN_ControllerBtn' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, WS_Base) == 0x0007F8, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::WS_Base' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, WS_Level) == 0x000800, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::WS_Level' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_Sub_RivalNext_C, LevelIconArray) == 0x000808, "Member 'UWBP_CourseSelect_Sub_RivalNext_C::LevelIconArray' has a wrong offset!");

}

