#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_PlayerDetail

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionRun_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.ChangeTab
// 0x0070 (0x0070 - 0x0000)
struct WBP_CMN_PlayerDetail_C_ChangeTab final
{
public:
	bool                                          Local_ActiveWidgetIndexFlag;                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumWidgets_ReturnValue;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	int32                                         CallFunc_GetNumWidgets_ReturnValue_1;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x006C(0x0004)()
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_ChangeTab) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_C_ChangeTab");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_ChangeTab) == 0x000070, "Wrong size on WBP_CMN_PlayerDetail_C_ChangeTab");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, Local_ActiveWidgetIndexFlag) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::Local_ActiveWidgetIndexFlag' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, Temp_int_Variable) == 0x000004, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, CallFunc_GetNumWidgets_ReturnValue) == 0x00000C, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::CallFunc_GetNumWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000020, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, CallFunc_GetNumWidgets_ReturnValue_1) == 0x000060, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::CallFunc_GetNumWidgets_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000064, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ChangeTab, CallFunc_SoundPlay_ReturnValue) == 0x00006C, "Member 'WBP_CMN_PlayerDetail_C_ChangeTab::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.CheckMachineType
// 0x0218 (0x0218 - 0x0000)
struct WBP_CMN_PlayerDetail_C_CheckMachineType final
{
public:
	EMachineId                                    MachineId;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                Car_Status_Type;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMachinePartsData                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x01F8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_CheckMachineType) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_C_CheckMachineType");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_CheckMachineType) == 0x000218, "Wrong size on WBP_CMN_PlayerDetail_C_CheckMachineType");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_CheckMachineType, MachineId) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_CheckMachineType::MachineId' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_CheckMachineType, Car_Status_Type) == 0x000001, "Member 'WBP_CMN_PlayerDetail_C_CheckMachineType::Car_Status_Type' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_CheckMachineType, CallFunc_GetEnumeratorName_ReturnValue) == 0x000004, "Member 'WBP_CMN_PlayerDetail_C_CheckMachineType::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_CheckMachineType, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_CMN_PlayerDetail_C_CheckMachineType::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_CheckMachineType, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'WBP_CMN_PlayerDetail_C_CheckMachineType::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_CheckMachineType, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000210, "Member 'WBP_CMN_PlayerDetail_C_CheckMachineType::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.ExecuteUbergraph_WBP_CMN_PlayerDetail
// 0x0250 (0x0250 - 0x0000)
struct WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_27;             // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_26;             // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_25;             // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_24;             // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_23;             // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_22;             // 0x0034(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_21;             // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_20;             // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_19;             // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_18;             // 0x0044(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_17;             // 0x0048(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_16;             // 0x004C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_15;             // 0x0050(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_14;             // 0x0054(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Value_3;                              // 0x0058(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Value_2;                              // 0x0068(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_13;             // 0x0078(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_12;             // 0x007C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_11;             // 0x0080(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_10;             // 0x0084(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_9;              // 0x0088(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_8;              // 0x008C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_7;              // 0x0090(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_Value_1;                              // 0x0098(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Value;                                // 0x00A8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_6;              // 0x00B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_5;              // 0x00BC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_4;              // 0x00C0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_3;              // 0x00C4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_2;              // 0x00C8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_1;              // 0x00CC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex;                // 0x00D0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOnce;                                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLobbyPlayerData                       K2Node_Event_InRacerData;                          // 0x00F0(0x00F8)(ConstParm)
	bool                                          K2Node_Event_bIsOwn;                               // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlockPlayerState                             K2Node_Event_InBlockType;                          // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x01F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_DynamicCast_As__;                           // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EGadgetId>                             K2Node_Event_InDisableGadgetList;                  // 0x0228(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0238(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail) == 0x000250, "Wrong size on WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, EntryPoint) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_27) == 0x000020, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_27' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_26) == 0x000024, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_26' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_25) == 0x000028, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_25' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_24) == 0x00002C, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_24' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_23) == 0x000030, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_23' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_22) == 0x000034, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_22' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_21) == 0x000038, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_21' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_20) == 0x00003C, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_20' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_19) == 0x000040, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_19' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_18) == 0x000044, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_18' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_17) == 0x000048, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_17' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_16) == 0x00004C, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_16' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_15) == 0x000050, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_15' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_14) == 0x000054, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_14' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_Value_3) == 0x000058, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_Value_2) == 0x000068, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_13) == 0x000078, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_13' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_12) == 0x00007C, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_12' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_11) == 0x000080, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_11' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_10) == 0x000084, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_10' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_9) == 0x000088, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_9' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_8) == 0x00008C, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_8' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_7) == 0x000090, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_7' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_Value_1) == 0x000098, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_Value) == 0x0000A8, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_6) == 0x0000B8, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_6' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_5) == 0x0000BC, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_5' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_4) == 0x0000C0, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_4' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_3) == 0x0000C4, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_2) == 0x0000C8, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex_1) == 0x0000CC, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_PlayerControllerIndex) == 0x0000D0, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_bOnce) == 0x0000D4, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_bOnce' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D8, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000E0, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, Temp_int_Loop_Counter_Variable) == 0x0000E8, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, CallFunc_Add_IntInt_ReturnValue) == 0x0000EC, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_InRacerData) == 0x0000F0, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_InRacerData' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_bIsOwn) == 0x0001E8, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_bIsOwn' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_InBlockType) == 0x0001E9, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_InBlockType' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, CallFunc_GetAllChildren_ReturnValue) == 0x0001F0, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, CallFunc_Array_Get_Item) == 0x000200, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, CallFunc_Array_Length_ReturnValue) == 0x000208, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_DynamicCast_As__) == 0x000210, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_DynamicCast_As__' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_DynamicCast_bSuccess) == 0x000218, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, CallFunc_Less_IntInt_ReturnValue) == 0x000219, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000220, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_Event_InDisableGadgetList) == 0x000228, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_Event_InDisableGadgetList' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, K2Node_CreateDelegate_OutputDelegate) == 0x000238, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000248, "Member 'WBP_CMN_PlayerDetail_C_ExecuteUbergraph_WBP_CMN_PlayerDetail::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.GetSoftObjectCharaIconTextures
// 0x0458 (0x0458 - 0x0000)
struct WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures final
{
public:
	TArray<struct FUsageCountChara>               InUsedCharas;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<TSoftObjectPtr<class UTexture2D>>      OutSoftObjectTextures;                             // 0x0010(0x0010)(Parm, OutParm)
	TArray<EDriverId>                             Local_UsedDriverId;                                // 0x0020(0x0010)(Edit, BlueprintVisible)
	EDriverId                                     Local_LastDriverId;                                // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UTexture2D>>      Local_SoftobjectTextures;                          // 0x0038(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUsageCountChara                       CallFunc_Array_Get_Item;                           // 0x005C(0x0008)(NoDestructor)
	bool                                          CallFunc_GetIsCharacterReleased_ReturnValue;       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UTexture2D>>      K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUsageCountChara                       CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     K2Node_Select_Default;                             // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x1];                                       // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDriverData                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C0(0x0390)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures) == 0x000458, "Wrong size on WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, InUsedCharas) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::InUsedCharas' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, OutSoftObjectTextures) == 0x000010, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::OutSoftObjectTextures' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, Local_UsedDriverId) == 0x000020, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::Local_UsedDriverId' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, Local_LastDriverId) == 0x000030, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::Local_LastDriverId' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, Local_SoftobjectTextures) == 0x000038, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::Local_SoftobjectTextures' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, Temp_int_Array_Index_Variable) == 0x000058, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Array_Get_Item) == 0x00005C, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_GetIsCharacterReleased_ReturnValue) == 0x000064, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_GetIsCharacterReleased_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, Temp_int_Array_Index_Variable_1) == 0x000068, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Array_Contains_ReturnValue) == 0x00006C, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000070, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Conv_IntToByte_ReturnValue) == 0x000088, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_GetValidValue_ReturnValue) == 0x000089, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, Temp_int_Loop_Counter_Variable_1) == 0x00008C, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Add_IntInt_ReturnValue_2) == 0x000090, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000098, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Array_Add_ReturnValue) == 0x0000A8, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Array_Length_ReturnValue_1) == 0x0000AC, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B0, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, Temp_bool_Variable) == 0x0000B1, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, K2Node_Select_Default) == 0x0000B2, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_GetEnumeratorName_ReturnValue) == 0x0000B4, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000C0, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000450, "Member 'WBP_CMN_PlayerDetail_C_GetSoftObjectCharaIconTextures::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.OnAcceptKeyPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_CMN_PlayerDetail_C_OnAcceptKeyPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_OnAcceptKeyPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_CMN_PlayerDetail_C_OnAcceptKeyPressedWithPlayerId");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_OnAcceptKeyPressedWithPlayerId) == 0x000004, "Wrong size on WBP_CMN_PlayerDetail_C_OnAcceptKeyPressedWithPlayerId");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_OnAcceptKeyPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_OnAcceptKeyPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.OnAcceptKeyReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_CMN_PlayerDetail_C_OnAcceptKeyReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_OnAcceptKeyReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_CMN_PlayerDetail_C_OnAcceptKeyReleasedWithPlayerId");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_OnAcceptKeyReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_CMN_PlayerDetail_C_OnAcceptKeyReleasedWithPlayerId");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_OnAcceptKeyReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_OnAcceptKeyReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.OnBackKeyPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_CMN_PlayerDetail_C_OnBackKeyPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_OnBackKeyPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_CMN_PlayerDetail_C_OnBackKeyPressedWithPlayerId");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_OnBackKeyPressedWithPlayerId) == 0x000004, "Wrong size on WBP_CMN_PlayerDetail_C_OnBackKeyPressedWithPlayerId");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_OnBackKeyPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_OnBackKeyPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.OnBackKeyReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_CMN_PlayerDetail_C_OnBackKeyReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_OnBackKeyReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_CMN_PlayerDetail_C_OnBackKeyReleasedWithPlayerId");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_OnBackKeyReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_CMN_PlayerDetail_C_OnBackKeyReleasedWithPlayerId");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_OnBackKeyReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_OnBackKeyReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.OnDownKeyPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_CMN_PlayerDetail_C_OnDownKeyPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_OnDownKeyPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_CMN_PlayerDetail_C_OnDownKeyPressedWithPlayerId");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_OnDownKeyPressedWithPlayerId) == 0x000004, "Wrong size on WBP_CMN_PlayerDetail_C_OnDownKeyPressedWithPlayerId");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_OnDownKeyPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_OnDownKeyPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.OnDownKeyReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_CMN_PlayerDetail_C_OnDownKeyReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_OnDownKeyReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_CMN_PlayerDetail_C_OnDownKeyReleasedWithPlayerId");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_OnDownKeyReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_CMN_PlayerDetail_C_OnDownKeyReleasedWithPlayerId");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_OnDownKeyReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_OnDownKeyReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.OnFaceButtonLeftPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_CMN_PlayerDetail_C_OnFaceButtonLeftPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_OnFaceButtonLeftPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_CMN_PlayerDetail_C_OnFaceButtonLeftPressedWithPlayerId");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_OnFaceButtonLeftPressedWithPlayerId) == 0x000004, "Wrong size on WBP_CMN_PlayerDetail_C_OnFaceButtonLeftPressedWithPlayerId");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_OnFaceButtonLeftPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_OnFaceButtonLeftPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.OnFaceButtonLeftReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_CMN_PlayerDetail_C_OnFaceButtonLeftReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_OnFaceButtonLeftReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_CMN_PlayerDetail_C_OnFaceButtonLeftReleasedWithPlayerId");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_OnFaceButtonLeftReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_CMN_PlayerDetail_C_OnFaceButtonLeftReleasedWithPlayerId");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_OnFaceButtonLeftReleasedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_OnFaceButtonLeftReleasedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.OnFaceButtonTopPressedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_CMN_PlayerDetail_C_OnFaceButtonTopPressedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_OnFaceButtonTopPressedWithPlayerId) == 0x000004, "Wrong alignment on WBP_CMN_PlayerDetail_C_OnFaceButtonTopPressedWithPlayerId");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_OnFaceButtonTopPressedWithPlayerId) == 0x000004, "Wrong size on WBP_CMN_PlayerDetail_C_OnFaceButtonTopPressedWithPlayerId");
static_assert(offsetof(WBP_CMN_PlayerDetail_C_OnFaceButtonTopPressedWithPlayerId, PlayerControllerIndex) == 0x000000, "Member 'WBP_CMN_PlayerDetail_C_OnFaceButtonTopPressedWithPlayerId::PlayerControllerIndex' has a wrong offset!");

// Function WBP_CMN_PlayerDetail.WBP_CMN_PlayerDetail_C.OnFaceButtonTopReleasedWithPlayerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_CMN_PlayerDetail_C_OnFaceButtonTopReleasedWithPlayerId final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_C_OnFaceButtonTopReleasedWithPlayerId) == 0x000004, "Wrong alignment on WBP_CMN_PlayerDetail_C_OnFaceButtonTopReleasedWithPlayerId");
static_assert(sizeof(WBP_CMN_PlayerDetail_C_OnFaceButtonTopReleasedWithPlayerId) == 0x000004, "Wrong size on WBP_CMN_PlayerDetail_C_OnFaceButtonTopReleasedWithPlayerId");
