#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01.WBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C final : public UUserWidget
{
public:
	class UImage*                                 Fire01_01;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire01_02;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire02_01;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire02_02;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fire03_01;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sparks_01;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sparks_02;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sparks_03;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C">();
	}
	static class UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C>();
	}
};
static_assert(alignof(UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C) == 0x000008, "Wrong alignment on UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C");
static_assert(sizeof(UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C) == 0x000320, "Wrong size on UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C, Fire01_01) == 0x0002E0, "Member 'UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C::Fire01_01' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C, Fire01_02) == 0x0002E8, "Member 'UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C::Fire01_02' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C, Fire02_01) == 0x0002F0, "Member 'UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C::Fire02_01' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C, Fire02_02) == 0x0002F8, "Member 'UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C::Fire02_02' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C, Fire03_01) == 0x000300, "Member 'UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C::Fire03_01' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C, Sparks_01) == 0x000308, "Member 'UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C::Sparks_01' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C, Sparks_02) == 0x000310, "Member 'UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C::Sparks_02' has a wrong offset!");
static_assert(offsetof(UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C, Sparks_03) == 0x000318, "Member 'UWBP_RaceBefore_RivalRacer_Cutin_Sub_Fire_High01_C::Sparks_03' has a wrong offset!");

}

