#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_Sub_MatchingState_CharaIcon

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_Sub_MatchingState_CharaIcon.WBP_CMN_Sub_MatchingState_CharaIcon_C.ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon
// 0x0110 (0x0110 - 0x0000)
struct WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_As_____;                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     K2Node_Event_InDriverId;                           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_InTexture;                            // 0x00C8(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon) == 0x000008, "Wrong alignment on WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon");
static_assert(sizeof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon) == 0x000110, "Wrong size on WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, EntryPoint) == 0x000000, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, Temp_object_Variable) == 0x000008, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, K2Node_DynamicCast_As_____) == 0x000010, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::K2Node_DynamicCast_As_____' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, Temp_int_Variable) == 0x00001C, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, Temp_struct_Variable) == 0x000024, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, Temp_struct_Variable_1) == 0x000034, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, Temp_struct_Variable_2) == 0x000044, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, Temp_struct_Variable_3) == 0x000054, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, Temp_struct_Variable_4) == 0x000064, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, Temp_struct_Variable_5) == 0x000074, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, Temp_struct_Variable_6) == 0x000084, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, Temp_struct_Variable_7) == 0x000094, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, K2Node_CustomEvent_Loaded) == 0x0000A8, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, K2Node_Event_InDriverId) == 0x0000C0, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::K2Node_Event_InDriverId' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, K2Node_Event_InTexture) == 0x0000C8, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::K2Node_Event_InTexture' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000F0, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000F8, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F9, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, CallFunc_Add_IntInt_ReturnValue) == 0x0000FC, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon, K2Node_Select_Default) == 0x000100, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_ExecuteUbergraph_WBP_CMN_Sub_MatchingState_CharaIcon::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CMN_Sub_MatchingState_CharaIcon.WBP_CMN_Sub_MatchingState_CharaIcon_C.OnLoaded_059828894949E7A9162E1F8DAA9DD74A
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_Sub_MatchingState_CharaIcon_C_OnLoaded_059828894949E7A9162E1F8DAA9DD74A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_Sub_MatchingState_CharaIcon_C_OnLoaded_059828894949E7A9162E1F8DAA9DD74A) == 0x000008, "Wrong alignment on WBP_CMN_Sub_MatchingState_CharaIcon_C_OnLoaded_059828894949E7A9162E1F8DAA9DD74A");
static_assert(sizeof(WBP_CMN_Sub_MatchingState_CharaIcon_C_OnLoaded_059828894949E7A9162E1F8DAA9DD74A) == 0x000008, "Wrong size on WBP_CMN_Sub_MatchingState_CharaIcon_C_OnLoaded_059828894949E7A9162E1F8DAA9DD74A");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_OnLoaded_059828894949E7A9162E1F8DAA9DD74A, Loaded) == 0x000000, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_OnLoaded_059828894949E7A9162E1F8DAA9DD74A::Loaded' has a wrong offset!");

// Function WBP_CMN_Sub_MatchingState_CharaIcon.WBP_CMN_Sub_MatchingState_CharaIcon_C.OnSetUpCharaIconEvent
// 0x0030 (0x0030 - 0x0000)
struct WBP_CMN_Sub_MatchingState_CharaIcon_C_OnSetUpCharaIconEvent final
{
public:
	EDriverId                                     InDriverId;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              InTexture;                                         // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_Sub_MatchingState_CharaIcon_C_OnSetUpCharaIconEvent) == 0x000008, "Wrong alignment on WBP_CMN_Sub_MatchingState_CharaIcon_C_OnSetUpCharaIconEvent");
static_assert(sizeof(WBP_CMN_Sub_MatchingState_CharaIcon_C_OnSetUpCharaIconEvent) == 0x000030, "Wrong size on WBP_CMN_Sub_MatchingState_CharaIcon_C_OnSetUpCharaIconEvent");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_OnSetUpCharaIconEvent, InDriverId) == 0x000000, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_OnSetUpCharaIconEvent::InDriverId' has a wrong offset!");
static_assert(offsetof(WBP_CMN_Sub_MatchingState_CharaIcon_C_OnSetUpCharaIconEvent, InTexture) == 0x000008, "Member 'WBP_CMN_Sub_MatchingState_CharaIcon_C_OnSetUpCharaIconEvent::InTexture' has a wrong offset!");

}

