#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Rank1

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Race_HUD_Sub_Rank1.WBP_Race_HUD_Sub_Rank1_C
// 0x0058 (0x0338 - 0x02E0)
class UWBP_Race_HUD_Sub_Rank1_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Onest;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Onest_Eff_Light_01;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Onest_Eff_Light_02;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Onest_Eff_Rainbow;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_1st;                                            // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              Rank1stDataTable;                                  // 0x0310(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Race_HUD_Sub_Rank1(int32 EntryPoint);
	void UpdateLocalizeTexture();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Race_HUD_Sub_Rank1_C">();
	}
	static class UWBP_Race_HUD_Sub_Rank1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Race_HUD_Sub_Rank1_C>();
	}
};
static_assert(alignof(UWBP_Race_HUD_Sub_Rank1_C) == 0x000008, "Wrong alignment on UWBP_Race_HUD_Sub_Rank1_C");
static_assert(sizeof(UWBP_Race_HUD_Sub_Rank1_C) == 0x000338, "Wrong size on UWBP_Race_HUD_Sub_Rank1_C");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank1_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Race_HUD_Sub_Rank1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank1_C, Onest) == 0x0002E8, "Member 'UWBP_Race_HUD_Sub_Rank1_C::Onest' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank1_C, Onest_Eff_Light_01) == 0x0002F0, "Member 'UWBP_Race_HUD_Sub_Rank1_C::Onest_Eff_Light_01' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank1_C, Onest_Eff_Light_02) == 0x0002F8, "Member 'UWBP_Race_HUD_Sub_Rank1_C::Onest_Eff_Light_02' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank1_C, Onest_Eff_Rainbow) == 0x000300, "Member 'UWBP_Race_HUD_Sub_Rank1_C::Onest_Eff_Rainbow' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank1_C, MI_1st) == 0x000308, "Member 'UWBP_Race_HUD_Sub_Rank1_C::MI_1st' has a wrong offset!");
static_assert(offsetof(UWBP_Race_HUD_Sub_Rank1_C, Rank1stDataTable) == 0x000310, "Member 'UWBP_Race_HUD_Sub_Rank1_C::Rank1stDataTable' has a wrong offset!");

}

