#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_System_AutoSave

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_System_AutoSave.WBP_System_AutoSave_C.ExecuteUbergraph_WBP_System_AutoSave
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESaveDataStatus                               K2Node_CustomEvent_Status;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESaveDataStatus Status)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue_1;                        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Sub_DateTimeDateTime_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave) == 0x000008, "Wrong alignment on WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave");
static_assert(sizeof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave) == 0x0000A8, "Wrong size on WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, EntryPoint) == 0x000000, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, K2Node_CustomEvent_Status) == 0x000010, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::K2Node_CustomEvent_Status' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, CallFunc_PlayAnimation_ReturnValue_2) == 0x000038, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000040, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, CallFunc_Now_ReturnValue) == 0x000058, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, CallFunc_Now_ReturnValue_1) == 0x000060, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::CallFunc_Now_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, CallFunc_Sub_DateTimeDateTime_ReturnValue) == 0x000068, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::CallFunc_Sub_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, CallFunc_GetTotalSeconds_ReturnValue) == 0x000070, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, K2Node_CreateDelegate_OutputDelegate_2) == 0x000074, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000088, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, K2Node_Event_IsDesignTime) == 0x000090, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000098, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave, CallFunc_Delay_Duration_ImplicitCast) == 0x0000A0, "Member 'WBP_System_AutoSave_C_ExecuteUbergraph_WBP_System_AutoSave::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function WBP_System_AutoSave.WBP_System_AutoSave_C.OnSaveComplete
// 0x0001 (0x0001 - 0x0000)
struct WBP_System_AutoSave_C_OnSaveComplete final
{
public:
	ESaveDataStatus                               Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_System_AutoSave_C_OnSaveComplete) == 0x000001, "Wrong alignment on WBP_System_AutoSave_C_OnSaveComplete");
static_assert(sizeof(WBP_System_AutoSave_C_OnSaveComplete) == 0x000001, "Wrong size on WBP_System_AutoSave_C_OnSaveComplete");
static_assert(offsetof(WBP_System_AutoSave_C_OnSaveComplete, Status) == 0x000000, "Member 'WBP_System_AutoSave_C_OnSaveComplete::Status' has a wrong offset!");

// Function WBP_System_AutoSave.WBP_System_AutoSave_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_System_AutoSave_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_System_AutoSave_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_System_AutoSave_C_PreConstruct");
static_assert(sizeof(WBP_System_AutoSave_C_PreConstruct) == 0x000001, "Wrong size on WBP_System_AutoSave_C_PreConstruct");
static_assert(offsetof(WBP_System_AutoSave_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_System_AutoSave_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

