#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_Sub_PullDownMenu_Text

#include "Basic.hpp"

#include "ST_PullDownMenuItemData_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_Sub_PullDownMenu_Text.WBP_CMN_Sub_PullDownMenu_Text_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_CMN_Sub_PullDownMenu_Text_C final : public UUserWidget
{
public:
	class UImage*                                 DSP_Set_Icon;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_PullDown;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FST_PullDownMenuItemData               ItemData;                                          // 0x02F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void SetSelectIconVisible(bool bInIsVisible);
	void Setup(const struct FST_PullDownMenuItemData& InItemData);

	void GetItemData(struct FST_PullDownMenuItemData* OutItemData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_Sub_PullDownMenu_Text_C">();
	}
	static class UWBP_CMN_Sub_PullDownMenu_Text_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_Sub_PullDownMenu_Text_C>();
	}
};
static_assert(alignof(UWBP_CMN_Sub_PullDownMenu_Text_C) == 0x000008, "Wrong alignment on UWBP_CMN_Sub_PullDownMenu_Text_C");
static_assert(sizeof(UWBP_CMN_Sub_PullDownMenu_Text_C) == 0x000310, "Wrong size on UWBP_CMN_Sub_PullDownMenu_Text_C");
static_assert(offsetof(UWBP_CMN_Sub_PullDownMenu_Text_C, DSP_Set_Icon) == 0x0002E0, "Member 'UWBP_CMN_Sub_PullDownMenu_Text_C::DSP_Set_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_PullDownMenu_Text_C, TXT_PullDown) == 0x0002E8, "Member 'UWBP_CMN_Sub_PullDownMenu_Text_C::TXT_PullDown' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_PullDownMenu_Text_C, ItemData) == 0x0002F0, "Member 'UWBP_CMN_Sub_PullDownMenu_Text_C::ItemData' has a wrong offset!");

}

