#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hint_Sub_11014

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hint_Sub_11014.WBP_Hint_Sub_11014_C
// 0x0040 (0x0328 - 0x02E8)
class UWBP_Hint_Sub_11014_C final : public UHint_Sub
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       B_Out;                                             // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       A_Out;                                             // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Title;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_BG_01_C*                       WBP_CMN_BG_01;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FontScroll_C*                      WBP_FontScroll_A;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FontScroll_C*                      WBP_FontScroll_B;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hint_Sub_11014(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hint_Sub_11014_C">();
	}
	static class UWBP_Hint_Sub_11014_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hint_Sub_11014_C>();
	}
};
static_assert(alignof(UWBP_Hint_Sub_11014_C) == 0x000008, "Wrong alignment on UWBP_Hint_Sub_11014_C");
static_assert(sizeof(UWBP_Hint_Sub_11014_C) == 0x000328, "Wrong size on UWBP_Hint_Sub_11014_C");
static_assert(offsetof(UWBP_Hint_Sub_11014_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_Hint_Sub_11014_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hint_Sub_11014_C, B_Out) == 0x0002F0, "Member 'UWBP_Hint_Sub_11014_C::B_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Hint_Sub_11014_C, A_Out) == 0x0002F8, "Member 'UWBP_Hint_Sub_11014_C::A_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Hint_Sub_11014_C, In) == 0x000300, "Member 'UWBP_Hint_Sub_11014_C::In' has a wrong offset!");
static_assert(offsetof(UWBP_Hint_Sub_11014_C, TXT_Title) == 0x000308, "Member 'UWBP_Hint_Sub_11014_C::TXT_Title' has a wrong offset!");
static_assert(offsetof(UWBP_Hint_Sub_11014_C, WBP_CMN_BG_01) == 0x000310, "Member 'UWBP_Hint_Sub_11014_C::WBP_CMN_BG_01' has a wrong offset!");
static_assert(offsetof(UWBP_Hint_Sub_11014_C, WBP_FontScroll_A) == 0x000318, "Member 'UWBP_Hint_Sub_11014_C::WBP_FontScroll_A' has a wrong offset!");
static_assert(offsetof(UWBP_Hint_Sub_11014_C, WBP_FontScroll_B) == 0x000320, "Member 'UWBP_Hint_Sub_11014_C::WBP_FontScroll_B' has a wrong offset!");

}

