#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_CMN_Window

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Friend_CMN_Window.WBP_Friend_CMN_Window_C.ChangeCategoryDisplay
// 0x0002 (0x0002 - 0x0000)
struct WBP_Friend_CMN_Window_C_ChangeCategoryDisplay final
{
public:
	EFriendListCategory                           InCategory;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInDataCommunicationDisplay;                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_CMN_Window_C_ChangeCategoryDisplay) == 0x000001, "Wrong alignment on WBP_Friend_CMN_Window_C_ChangeCategoryDisplay");
static_assert(sizeof(WBP_Friend_CMN_Window_C_ChangeCategoryDisplay) == 0x000002, "Wrong size on WBP_Friend_CMN_Window_C_ChangeCategoryDisplay");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeCategoryDisplay, InCategory) == 0x000000, "Member 'WBP_Friend_CMN_Window_C_ChangeCategoryDisplay::InCategory' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeCategoryDisplay, bInDataCommunicationDisplay) == 0x000001, "Member 'WBP_Friend_CMN_Window_C_ChangeCategoryDisplay::bInDataCommunicationDisplay' has a wrong offset!");

// Function WBP_Friend_CMN_Window.WBP_Friend_CMN_Window_C.ChangeTabWidgetCategory
// 0x0050 (0x0050 - 0x0000)
struct WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory final
{
public:
	EFriendListCategory                           InCategory;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetIcons_ReturnValue;                     // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_TabBtn_C*        K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Tab_Btn; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory) == 0x000008, "Wrong alignment on WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory");
static_assert(sizeof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory) == 0x000050, "Wrong size on WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, InCategory) == 0x000000, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::InCategory' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, CallFunc_GetIcons_ReturnValue) == 0x000018, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::CallFunc_GetIcons_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Tab_Btn) == 0x000038, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Tab_Btn' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory, CallFunc_IsVisible_ReturnValue) == 0x000049, "Member 'WBP_Friend_CMN_Window_C_ChangeTabWidgetCategory::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WBP_Friend_CMN_Window.WBP_Friend_CMN_Window_C.ClearContentsWidgetListPlayerInfo
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_CMN_Window_C_ClearContentsWidgetListPlayerInfo final
{
public:
	EFriendListCategory                           InCategory;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_CMN_Window_C_ClearContentsWidgetListPlayerInfo) == 0x000001, "Wrong alignment on WBP_Friend_CMN_Window_C_ClearContentsWidgetListPlayerInfo");
static_assert(sizeof(WBP_Friend_CMN_Window_C_ClearContentsWidgetListPlayerInfo) == 0x000001, "Wrong size on WBP_Friend_CMN_Window_C_ClearContentsWidgetListPlayerInfo");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ClearContentsWidgetListPlayerInfo, InCategory) == 0x000000, "Member 'WBP_Friend_CMN_Window_C_ClearContentsWidgetListPlayerInfo::InCategory' has a wrong offset!");

// Function WBP_Friend_CMN_Window.WBP_Friend_CMN_Window_C.ExecuteUbergraph_WBP_Friend_CMN_Window
// 0x04D8 (0x04D8 - 0x0000)
struct WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           K2Node_Event_InCategory_1;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInDataCommunicationDisplay;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_GetParentCategory_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           K2Node_CustomEvent_InCategory_1;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           K2Node_CustomEvent_InCategory;                     // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object_3;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInputEnable_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInputEnable_ReturnValue_1;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_2;                       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object_1;                       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFriendListPlayerInfo>          K2Node_Event_ListPlayerInfo_1;                     // 0x0080(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_InDataError_2;                        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           Temp_byte_Variable;                                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFriendListPlayerInfo                  K2Node_Event_InListPlayerInfo;                     // 0x00C8(0x00E8)(ConstParm)
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_1;         // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B8(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCommon_UserSearchData>         K2Node_Event_InUserSearchData_1;                   // 0x01D0(0x0010)(ConstParm, ReferenceParm)
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_2;         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_3;         // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCommandType                        K2Node_Event_InCommandType;                        // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_4;         // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           Temp_byte_Variable_1;                              // 0x01E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E7[0x1];                                      // 0x01E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFriendListPlayerInfo>          K2Node_Event_ListPlayerInfo;                       // 0x01E8(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_InDataError_1;                        // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0200(0x0010)()
	class APlayerController*                      K2Node_Event_PlayerController;                     // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_5;         // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0220(0x0010)()
	class FString                                 K2Node_Event_InShortLobbyId;                       // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInSuccess;                           // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrossplayPlatform                            CallFunc_GetPlatformGroup_ReturnValue;             // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCommon_UserSearchData>         K2Node_Event_InUserSearchData;                     // 0x0248(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FLobbyId>                       K2Node_Event_InLobbyIdData;                        // 0x0258(0x0010)(ConstParm, ReferenceParm)
	ELobbyType                                    K2Node_Event_InLobbyType;                          // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           K2Node_Event_InCategory;                           // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26B[0x1];                                      // 0x026B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x026C(0x0004)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0280(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0290(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x02A0(0x0010)()
	class FText                                   Temp_text_Variable_4;                              // 0x02B0(0x0010)()
	class FText                                   Temp_text_Variable_5;                              // 0x02C0(0x0010)()
	class FText                                   Temp_text_Variable_6;                              // 0x02D0(0x0010)()
	class FText                                   Temp_text_Variable_7;                              // 0x02E0(0x0010)()
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_6;         // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_7;         // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         Temp_byte_Variable_2;                              // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           Temp_byte_Variable_3;                              // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F7[0x1];                                      // 0x02F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFriendListContentsWidget*              K2Node_Select_Default;                             // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_8;         // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_GetParentCategory_ReturnValue_1;          // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFriendListOnlineSettingData>   K2Node_Event_InOnlineSettingData;                  // 0x0308(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_InDataError;                          // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_9;         // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_GetNextMoveCategory_ReturnValue;          // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x031B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestOnlineSettingSave_ReturnValue;     // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_InIconTexture;                        // 0x0320(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_InBgColor;                            // 0x0348(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestOnlineSettingSave_ReturnValue_1;   // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_10;        // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCommandType                        K2Node_Event_PrevWidgetCommandType;                // 0x035B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuInputRecieveObject*                CallFunc_SpawnObject_ReturnValue;                  // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_1;                  // 0x0368(0x0004)()
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_11;        // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_8;                    // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E[0x2];                                      // 0x036E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0378(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_12;        // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         CallFunc_GetPlatform_ReturnValue;                  // 0x0393(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0398(0x0010)()
	EFriendListCategory                           CallFunc_GetCurrentCategory_ReturnValue_13;        // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTerminologyTextByText_ReturnValue;     // 0x03B0(0x0010)()
	bool                                          K2Node_Event_bInEnanle;                            // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFriendListContentsWidget*              K2Node_Select_Default_2;                           // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EMachineCustomizeTabID InTabID)> K2Node_CreateDelegate_OutputDelegate_4;          // 0x03D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetIcons_ReturnValue;                     // 0x03E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	EMachineCustomizeTabID                        K2Node_CustomEvent_InTabID;                        // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EFriendListCategory                           CallFunc_TabIDToCategory_ReturnValue;              // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_TabBtn_C*        K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Tab_Btn; // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestOnlineSettingSave_ReturnValue_2;   // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A[0x2];                                      // 0x041A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInputEnable_ReturnValue_2;             // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue_2;                  // 0x0424(0x0004)()
	int32                                         Temp_int_Variable_4;                               // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_2;      // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_5;                               // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_GetRegisteredSubMenu_ReturnValue;         // 0x0448(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetIcons_ReturnValue_1;                   // 0x0460(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0470(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetIcons_ReturnValue_2;                   // 0x0478(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_MachineCustom_Sub_TabBtn_C*        K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Tab_Btn_1; // 0x0488(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0498(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_TabBtn_C*        K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Tab_Btn_2; // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x3];                                      // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Event_Param;                                // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x3];                                      // 0x04C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_6;                               // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window) == 0x000008, "Wrong alignment on WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window");
static_assert(sizeof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window) == 0x0004D8, "Wrong size on WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, EntryPoint) == 0x000000, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_GetCurrentCategory_ReturnValue) == 0x000004, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_GetCurrentCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_InCategory_1) == 0x000006, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_InCategory_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_bInDataCommunicationDisplay) == 0x000007, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_bInDataCommunicationDisplay' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_GetParentCategory_ReturnValue) == 0x000008, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_GetParentCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_CustomEvent_InCategory_1) == 0x000009, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_CustomEvent_InCategory_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_CustomEvent_InCategory) == 0x00001C, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_CustomEvent_InCategory' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_SwitchEnum_CmpSuccess_1) == 0x00001D, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_int_Variable) == 0x000020, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_CustomEvent_Object_3) == 0x000028, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_CustomEvent_Object_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_GetInputEnable_ReturnValue) == 0x000030, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_GetInputEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_GetInputEnable_ReturnValue_1) == 0x000031, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_GetInputEnable_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_int_Loop_Counter_Variable_1) == 0x000044, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_CustomEvent_Object_2) == 0x000048, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_CustomEvent_Object_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_int_Array_Index_Variable_2) == 0x000064, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_CustomEvent_Object_1) == 0x000068, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_CustomEvent_Object_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_ListPlayerInfo_1) == 0x000080, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_ListPlayerInfo_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_InDataError_2) == 0x000090, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_InDataError_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_byte_Variable) == 0x000091, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_GetOwningPlayer_ReturnValue) == 0x000098, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_DynamicCast_AsApp_Player_Controller) == 0x0000A0, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000B0, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_DynamicCast_AsApp_Player_Controller_1) == 0x0000B8, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_DynamicCast_AsApp_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_InListPlayerInfo) == 0x0000C8, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_InListPlayerInfo' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_GetCurrentCategory_ReturnValue_1) == 0x0001B0, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_GetCurrentCategory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_SwitchEnum_CmpSuccess_2) == 0x0001B1, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_Conv_StringToText_ReturnValue) == 0x0001B8, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_IsValid_ReturnValue) == 0x0001C8, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_InUserSearchData_1) == 0x0001D0, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_InUserSearchData_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_GetCurrentCategory_ReturnValue_2) == 0x0001E0, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_GetCurrentCategory_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_SwitchEnum_CmpSuccess_3) == 0x0001E1, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_GetCurrentCategory_ReturnValue_3) == 0x0001E2, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_GetCurrentCategory_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_InCommandType) == 0x0001E3, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_InCommandType' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_GetCurrentCategory_ReturnValue_4) == 0x0001E4, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_GetCurrentCategory_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_SwitchEnum_CmpSuccess_4) == 0x0001E5, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_byte_Variable_1) == 0x0001E6, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_ListPlayerInfo) == 0x0001E8, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_ListPlayerInfo' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_InDataError_1) == 0x0001F8, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_InDataError_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_text_Variable) == 0x000200, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_PlayerController) == 0x000210, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_PlayerController' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_GetCurrentCategory_ReturnValue_5) == 0x000218, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_GetCurrentCategory_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_text_Variable_1) == 0x000220, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_InShortLobbyId) == 0x000230, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_InShortLobbyId' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_bInSuccess) == 0x000240, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_bInSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_GetPlatformGroup_ReturnValue) == 0x000241, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_GetPlatformGroup_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_InUserSearchData) == 0x000248, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_InUserSearchData' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_InLobbyIdData) == 0x000258, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_InLobbyIdData' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_InLobbyType) == 0x000268, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_InLobbyType' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_Event_InCategory) == 0x000269, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_Event_InCategory' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, K2Node_SwitchEnum_CmpSuccess_5) == 0x00026A, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_SoundPlay_ReturnValue) == 0x00026C, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_PlayAnimation_ReturnValue) == 0x000270, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000278, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_text_Variable_2) == 0x000280, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_text_Variable_3) == 0x000290, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, CallFunc_MakeLiteralText_ReturnValue) == 0x0002A0, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_text_Variable_4) == 0x0002B0, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window, Temp_text_Variable_5) == 0x0002C0, "Member 'WBP_Friend_CMN_Window_C_ExecuteUbergraph_WBP_Friend_CMN_Window::Temp_text_Variable_5' has a wrong offset!");
