#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugOneMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugOneMessage.WBP_DebugOneMessage_C
// 0x0050 (0x0330 - 0x02E0)
class UWBP_DebugOneMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MessageAnim;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             BKMessage;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_48;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MessageCanvas;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_121;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Message;                                           // 0x0310(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         OffsetIndex;                                       // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FontScale;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_DebugOneMessage(int32 EntryPoint);
	void FireAnim();
	void OnEndMessage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugOneMessage_C">();
	}
	static class UWBP_DebugOneMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugOneMessage_C>();
	}
};
static_assert(alignof(UWBP_DebugOneMessage_C) == 0x000008, "Wrong alignment on UWBP_DebugOneMessage_C");
static_assert(sizeof(UWBP_DebugOneMessage_C) == 0x000330, "Wrong size on UWBP_DebugOneMessage_C");
static_assert(offsetof(UWBP_DebugOneMessage_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_DebugOneMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugOneMessage_C, MessageAnim) == 0x0002E8, "Member 'UWBP_DebugOneMessage_C::MessageAnim' has a wrong offset!");
static_assert(offsetof(UWBP_DebugOneMessage_C, BKMessage) == 0x0002F0, "Member 'UWBP_DebugOneMessage_C::BKMessage' has a wrong offset!");
static_assert(offsetof(UWBP_DebugOneMessage_C, Image_48) == 0x0002F8, "Member 'UWBP_DebugOneMessage_C::Image_48' has a wrong offset!");
static_assert(offsetof(UWBP_DebugOneMessage_C, MessageCanvas) == 0x000300, "Member 'UWBP_DebugOneMessage_C::MessageCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_DebugOneMessage_C, TextBlock_121) == 0x000308, "Member 'UWBP_DebugOneMessage_C::TextBlock_121' has a wrong offset!");
static_assert(offsetof(UWBP_DebugOneMessage_C, Message) == 0x000310, "Member 'UWBP_DebugOneMessage_C::Message' has a wrong offset!");
static_assert(offsetof(UWBP_DebugOneMessage_C, OffsetIndex) == 0x000320, "Member 'UWBP_DebugOneMessage_C::OffsetIndex' has a wrong offset!");
static_assert(offsetof(UWBP_DebugOneMessage_C, FontScale) == 0x000328, "Member 'UWBP_DebugOneMessage_C::FontScale' has a wrong offset!");

}

