#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_System_Title_Communication

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_System_Title_Communication.WBP_System_Title_Communication_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_System_Title_Communication_C final : public UUserWidget
{
public:
	class UImage*                                 BG_Circle;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_UV_01;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_UV_02;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_UV_Arc;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_UV_BG;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Outline;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_System;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_System_Sub_LoadingSonic_C*         WBP_System_Sub_LoadingSonic;                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void InvisibleText();
	void PlayLoadAnimation();
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_System_Title_Communication_C">();
	}
	static class UWBP_System_Title_Communication_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_System_Title_Communication_C>();
	}
};
static_assert(alignof(UWBP_System_Title_Communication_C) == 0x000008, "Wrong alignment on UWBP_System_Title_Communication_C");
static_assert(sizeof(UWBP_System_Title_Communication_C) == 0x000328, "Wrong size on UWBP_System_Title_Communication_C");
static_assert(offsetof(UWBP_System_Title_Communication_C, BG_Circle) == 0x0002E0, "Member 'UWBP_System_Title_Communication_C::BG_Circle' has a wrong offset!");
static_assert(offsetof(UWBP_System_Title_Communication_C, BG_UV_01) == 0x0002E8, "Member 'UWBP_System_Title_Communication_C::BG_UV_01' has a wrong offset!");
static_assert(offsetof(UWBP_System_Title_Communication_C, BG_UV_02) == 0x0002F0, "Member 'UWBP_System_Title_Communication_C::BG_UV_02' has a wrong offset!");
static_assert(offsetof(UWBP_System_Title_Communication_C, BG_UV_Arc) == 0x0002F8, "Member 'UWBP_System_Title_Communication_C::BG_UV_Arc' has a wrong offset!");
static_assert(offsetof(UWBP_System_Title_Communication_C, BG_UV_BG) == 0x000300, "Member 'UWBP_System_Title_Communication_C::BG_UV_BG' has a wrong offset!");
static_assert(offsetof(UWBP_System_Title_Communication_C, CanvasPanel) == 0x000308, "Member 'UWBP_System_Title_Communication_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_System_Title_Communication_C, Outline) == 0x000310, "Member 'UWBP_System_Title_Communication_C::Outline' has a wrong offset!");
static_assert(offsetof(UWBP_System_Title_Communication_C, SafeZone_System) == 0x000318, "Member 'UWBP_System_Title_Communication_C::SafeZone_System' has a wrong offset!");
static_assert(offsetof(UWBP_System_Title_Communication_C, WBP_System_Sub_LoadingSonic) == 0x000320, "Member 'UWBP_System_Title_Communication_C::WBP_System_Sub_LoadingSonic' has a wrong offset!");

}

