#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_PlayerDetail_Sub_Info_Machine

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_PlayerDetail_Sub_Info_Machine.WBP_CMN_PlayerDetail_Sub_Info_Machine_C.ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine
// 0x0098 (0x0098 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_As_____;                        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_RacerTexture;                   // 0x0040(0x0028)(HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_RacerName;                      // 0x0068(0x0010)()
	EDriverType                                   K2Node_CustomEvent_DriverType;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine) == 0x000098, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, EntryPoint) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, K2Node_CustomEvent_Loaded) == 0x000020, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, Temp_object_Variable) == 0x000028, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, K2Node_DynamicCast_As_____) == 0x000030, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::K2Node_DynamicCast_As_____' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, K2Node_CustomEvent_RacerTexture) == 0x000040, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::K2Node_CustomEvent_RacerTexture' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, K2Node_CustomEvent_RacerName) == 0x000068, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::K2Node_CustomEvent_RacerName' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, K2Node_CustomEvent_DriverType) == 0x000078, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::K2Node_CustomEvent_DriverType' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00007C, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000080, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000088, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000090, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_ExecuteUbergraph_WBP_CMN_PlayerDetail_Sub_Info_Machine::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Machine.WBP_CMN_PlayerDetail_Sub_Info_Machine_C.OnLoaded_63E3412942D2292B63AF1FBE0A3214A7
// 0x0008 (0x0008 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Machine_C_OnLoaded_63E3412942D2292B63AF1FBE0A3214A7 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_OnLoaded_63E3412942D2292B63AF1FBE0A3214A7) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_OnLoaded_63E3412942D2292B63AF1FBE0A3214A7");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_OnLoaded_63E3412942D2292B63AF1FBE0A3214A7) == 0x000008, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_OnLoaded_63E3412942D2292B63AF1FBE0A3214A7");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_OnLoaded_63E3412942D2292B63AF1FBE0A3214A7, Loaded) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_OnLoaded_63E3412942D2292B63AF1FBE0A3214A7::Loaded' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Machine.WBP_CMN_PlayerDetail_Sub_Info_Machine_C.Set Racer Param
// 0x0080 (0x0080 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param final
{
public:
	EDriverId                                     InDriverId;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    InFrontPartsId;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    InRearPartsId;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMachineId                                    InTirePartsId;                                     // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGadgetId>                             InGadgetIds;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         TempCorrection;                                    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxParam;                                          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinParam;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRacerParamData                        CallFunc_GetParamData_OutParamData;                // 0x0030(0x0050)(NoDestructor)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param) == 0x000080, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param, InDriverId) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param::InDriverId' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param, InFrontPartsId) == 0x000001, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param::InFrontPartsId' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param, InRearPartsId) == 0x000002, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param::InRearPartsId' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param, InTirePartsId) == 0x000003, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param::InTirePartsId' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param, InGadgetIds) == 0x000008, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param::InGadgetIds' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param, TempCorrection) == 0x000018, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param::TempCorrection' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param, MaxParam) == 0x00001C, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param::MaxParam' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param, MinParam) == 0x000020, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param::MinParam' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param, CallFunc_GetParamData_OutParamData) == 0x000030, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_Set_Racer_Param::CallFunc_GetParamData_OutParamData' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Machine.WBP_CMN_PlayerDetail_Sub_Info_Machine_C.SetFrontPartsData
// 0x0290 (0x0290 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData final
{
public:
	struct FMachinePartsUIData                    InUIData;                                          // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachinePartsData                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0070(0x01F8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData) == 0x000290, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData, InUIData) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData::InUIData' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData, CallFunc_GetEnumeratorName_ReturnValue) == 0x000064, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000070, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000268, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000270, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000278, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000280, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000288, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetFrontPartsData::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Machine.WBP_CMN_PlayerDetail_Sub_Info_Machine_C.SetRacerData
// 0x0040 (0x0040 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRacerData final
{
public:
	TSoftObjectPtr<class UTexture2D>              RacerTexture;                                      // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   RacerName;                                         // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	EDriverType                                   DriverType;                                        // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRacerData) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRacerData");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRacerData) == 0x000040, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRacerData");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRacerData, RacerTexture) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRacerData::RacerTexture' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRacerData, RacerName) == 0x000028, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRacerData::RacerName' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRacerData, DriverType) == 0x000038, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRacerData::DriverType' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Machine.WBP_CMN_PlayerDetail_Sub_Info_Machine_C.SetRearPartsData
// 0x0298 (0x0298 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData final
{
public:
	struct FMachinePartsUIData                    InUIData;                                          // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bIsHover;                                          // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMachinePartsData                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0078(0x01F8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData) == 0x000298, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData, InUIData) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData::InUIData' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData, bIsHover) == 0x000058, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData::bIsHover' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000060, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData, CallFunc_SelectInt_ReturnValue) == 0x000068, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData, CallFunc_IsValid_ReturnValue) == 0x00006C, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData, CallFunc_GetEnumeratorName_ReturnValue) == 0x000070, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000078, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000270, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000278, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000280, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000288, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000290, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetRearPartsData::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CMN_PlayerDetail_Sub_Info_Machine.WBP_CMN_PlayerDetail_Sub_Info_Machine_C.SetWheelPartsData
// 0x0290 (0x0290 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetWheelPartsData final
{
public:
	struct FMachinePartsUIData                    InUIData;                                          // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMachinePartsData                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0070(0x01F8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetWheelPartsData) == 0x000008, "Wrong alignment on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetWheelPartsData");
static_assert(sizeof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetWheelPartsData) == 0x000290, "Wrong size on WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetWheelPartsData");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetWheelPartsData, InUIData) == 0x000000, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetWheelPartsData::InUIData' has a wrong offset!");
static_assert(offsetof(WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetWheelPartsData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'WBP_CMN_PlayerDetail_Sub_Info_Machine_C_SetWheelPartsData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
