#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyRace_RivalTeamSelect

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_PartyRace_RivalTeamSelect.WBP_PartyRace_RivalTeamSelect_C.BindSelectIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_RivalTeamSelect_C_BindSelectIcon final
{
public:
	class URivalTeamSelectIconWidget*             InSelectIcon;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_RivalTeamSelect_C_BindSelectIcon) == 0x000008, "Wrong alignment on WBP_PartyRace_RivalTeamSelect_C_BindSelectIcon");
static_assert(sizeof(WBP_PartyRace_RivalTeamSelect_C_BindSelectIcon) == 0x000008, "Wrong size on WBP_PartyRace_RivalTeamSelect_C_BindSelectIcon");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_BindSelectIcon, InSelectIcon) == 0x000000, "Member 'WBP_PartyRace_RivalTeamSelect_C_BindSelectIcon::InSelectIcon' has a wrong offset!");

// Function WBP_PartyRace_RivalTeamSelect.WBP_PartyRace_RivalTeamSelect_C.ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URivalTeamSelectIconWidget*             K2Node_Event_InSelectIcon_1;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URivalTeamSelectIconWidget*             K2Node_Event_InSelectIcon;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URivalTeamSelectIconWidget*             K2Node_DynamicCast_AsRival_Team_Select_Icon_Widget; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PartyRace_Sub_RivalTeamIcon_C*     K2Node_DynamicCast_AsWBP_Party_Race_Sub_Rival_Team_Icon; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERivalTeamId                                  CallFunc_GetTeamID_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLock_ReturnValue;                       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;          // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_2;        // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_3;        // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UTexture2D>>      CallFunc_Set_UpGadgetPlate_OutGadgetIconSoftTextures; // 0x0090(0x0010)(ReferenceParm)
	TDelegate<void(EAppControllerInputType BeforeType, EAppControllerInputType AfterType)> K2Node_CreateDelegate_OutputDelegate_4; // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerController_C*             K2Node_DynamicCast_AsBP_Menu_Player_Controller;    // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppControllerInputType                       K2Node_CustomEvent_BeforeType;                     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppControllerInputType                       K2Node_CustomEvent_AfterType;                      // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerController_C*             K2Node_DynamicCast_AsBP_Menu_Player_Controller_1;  // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x00F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadHint_ReturnValue;                   // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PartyRace_Sub_RivalTeamIcon_C*     CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Array_Get_Item_1;                         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue_1;     // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue_2;     // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_GetRegisteredSubMenu_ReturnValue;         // 0x0178(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue_3;     // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x1];                                      // 0x019B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_PartyRace_Sub_RivalTeamIcon_C* caller)> K2Node_CreateDelegate_OutputDelegate_6; // 0x019C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_PartyRace_Sub_RivalTeamIcon_C*> K2Node_MakeArray_Array;                        // 0x01B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_PartyRace_Sub_RivalTeamIcon_C*     CallFunc_Array_Get_Item_2;                         // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PartyRace_Sub_RivalTeamIcon_C*     K2Node_CustomEvent_caller;                         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Popup_Window_Hint_C*               CallFunc_Create_ReturnValue;                       // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PartyRace_Sub_RivalTeamIcon_C*     CallFunc_Array_Get_Item_3;                         // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect) == 0x000008, "Wrong alignment on WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect");
static_assert(sizeof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect) == 0x0001F0, "Wrong size on WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, EntryPoint) == 0x000000, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_Event_InSelectIcon_1) == 0x000008, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_Event_InSelectIcon_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_Event_InSelectIcon) == 0x000010, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_Event_InSelectIcon' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_CustomEvent_Button_1) == 0x000018, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_CustomEvent_Button) == 0x000020, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_DynamicCast_AsRival_Team_Select_Icon_Widget) == 0x000028, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_DynamicCast_AsRival_Team_Select_Icon_Widget' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_DynamicCast_AsWBP_Party_Race_Sub_Rival_Team_Icon) == 0x000038, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_DynamicCast_AsWBP_Party_Race_Sub_Rival_Team_Icon' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_GetTeamID_ReturnValue) == 0x000041, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_IsLock_ReturnValue) == 0x000042, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_IsLock_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_CreateDelegate_OutputDelegate_2) == 0x00006C, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_CreateDelegate_OutputDelegate_3) == 0x00007C, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, Temp_int_Array_Index_Variable_1) == 0x00008C, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Set_UpGadgetPlate_OutGadgetIconSoftTextures) == 0x000090, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Set_UpGadgetPlate_OutGadgetIconSoftTextures' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A0, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, Temp_int_Array_Index_Variable_2) == 0x0000B0, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000B4, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_GetPlayerController_ReturnValue) == 0x0000B8, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_DynamicCast_AsBP_Menu_Player_Controller) == 0x0000C0, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_DynamicCast_AsBP_Menu_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_CustomEvent_BeforeType) == 0x0000C9, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_CustomEvent_BeforeType' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_CustomEvent_AfterType) == 0x0000CA, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_CustomEvent_AfterType' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, Temp_int_Loop_Counter_Variable_1) == 0x0000CC, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D0, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, Temp_int_Loop_Counter_Variable_2) == 0x0000D4, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000D8, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_DynamicCast_AsBP_Menu_Player_Controller_1) == 0x0000E0, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_DynamicCast_AsBP_Menu_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_DynamicCast_bSuccess_3) == 0x0000E8, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000EC, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, Temp_int_Array_Index_Variable_3) == 0x0000F0, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_Event_Animation) == 0x0000F8, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000100, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000101, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_Event_IsDesignTime) == 0x000102, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_IsReadHint_ReturnValue) == 0x000103, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_IsReadHint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_CreateDelegate_OutputDelegate_5) == 0x000104, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Not_PreBool_ReturnValue) == 0x000114, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_GetPlayerController_ReturnValue_2) == 0x000118, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, Temp_int_Loop_Counter_Variable_3) == 0x000120, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Array_Get_Item) == 0x000128, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Array_Length_ReturnValue) == 0x000130, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Add_IntInt_ReturnValue_3) == 0x000134, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Less_IntInt_ReturnValue) == 0x000138, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_GetAppPlayerController_ReturnValue) == 0x000140, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_GetAppPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Array_Get_Item_1) == 0x000148, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Array_Length_ReturnValue_1) == 0x000150, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000158, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Less_IntInt_ReturnValue_1) == 0x000160, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_GetAppPlayerController_ReturnValue_1) == 0x000168, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_GetAppPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_GetAppPlayerController_ReturnValue_2) == 0x000170, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_GetAppPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_GetRegisteredSubMenu_ReturnValue) == 0x000178, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_GetRegisteredSubMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_MakeLiteralByte_ReturnValue) == 0x000188, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00018C, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_GetAppPlayerController_ReturnValue_3) == 0x000190, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_GetAppPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_GetSelectedGameModeId_ReturnValue) == 0x000198, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_GetSelectedGameModeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000199, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_BooleanAND_ReturnValue) == 0x00019A, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_CreateDelegate_OutputDelegate_6) == 0x00019C, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_MakeArray_Array) == 0x0001B0, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Array_Get_Item_2) == 0x0001C0, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Array_Length_ReturnValue_2) == 0x0001C8, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001CC, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, K2Node_CustomEvent_caller) == 0x0001D0, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::K2Node_CustomEvent_caller' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Create_ReturnValue) == 0x0001D8, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Array_Get_Item_3) == 0x0001E0, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Array_Length_ReturnValue_3) == 0x0001E8, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect, CallFunc_Less_IntInt_ReturnValue_3) == 0x0001EC, "Member 'WBP_PartyRace_RivalTeamSelect_C_ExecuteUbergraph_WBP_PartyRace_RivalTeamSelect::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");

// Function WBP_PartyRace_RivalTeamSelect.WBP_PartyRace_RivalTeamSelect_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_RivalTeamSelect_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_RivalTeamSelect_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_PartyRace_RivalTeamSelect_C_OnAnimationFinished");
static_assert(sizeof(WBP_PartyRace_RivalTeamSelect_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_PartyRace_RivalTeamSelect_C_OnAnimationFinished");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_PartyRace_RivalTeamSelect_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_PartyRace_RivalTeamSelect.WBP_PartyRace_RivalTeamSelect_C.OnCancelEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_RivalTeamSelect_C_OnCancelEvent final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_RivalTeamSelect_C_OnCancelEvent) == 0x000008, "Wrong alignment on WBP_PartyRace_RivalTeamSelect_C_OnCancelEvent");
static_assert(sizeof(WBP_PartyRace_RivalTeamSelect_C_OnCancelEvent) == 0x000008, "Wrong size on WBP_PartyRace_RivalTeamSelect_C_OnCancelEvent");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_OnCancelEvent, Button) == 0x000000, "Member 'WBP_PartyRace_RivalTeamSelect_C_OnCancelEvent::Button' has a wrong offset!");

// Function WBP_PartyRace_RivalTeamSelect.WBP_PartyRace_RivalTeamSelect_C.OnChangeControllerInputTypeEvent_Event
// 0x0002 (0x0002 - 0x0000)
struct WBP_PartyRace_RivalTeamSelect_C_OnChangeControllerInputTypeEvent_Event final
{
public:
	EAppControllerInputType                       BeforeType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppControllerInputType                       AfterType;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_RivalTeamSelect_C_OnChangeControllerInputTypeEvent_Event) == 0x000001, "Wrong alignment on WBP_PartyRace_RivalTeamSelect_C_OnChangeControllerInputTypeEvent_Event");
static_assert(sizeof(WBP_PartyRace_RivalTeamSelect_C_OnChangeControllerInputTypeEvent_Event) == 0x000002, "Wrong size on WBP_PartyRace_RivalTeamSelect_C_OnChangeControllerInputTypeEvent_Event");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_OnChangeControllerInputTypeEvent_Event, BeforeType) == 0x000000, "Member 'WBP_PartyRace_RivalTeamSelect_C_OnChangeControllerInputTypeEvent_Event::BeforeType' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_OnChangeControllerInputTypeEvent_Event, AfterType) == 0x000001, "Member 'WBP_PartyRace_RivalTeamSelect_C_OnChangeControllerInputTypeEvent_Event::AfterType' has a wrong offset!");

// Function WBP_PartyRace_RivalTeamSelect.WBP_PartyRace_RivalTeamSelect_C.OnFocusEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_RivalTeamSelect_C_OnFocusEvent final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_RivalTeamSelect_C_OnFocusEvent) == 0x000008, "Wrong alignment on WBP_PartyRace_RivalTeamSelect_C_OnFocusEvent");
static_assert(sizeof(WBP_PartyRace_RivalTeamSelect_C_OnFocusEvent) == 0x000008, "Wrong size on WBP_PartyRace_RivalTeamSelect_C_OnFocusEvent");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_OnFocusEvent, Button) == 0x000000, "Member 'WBP_PartyRace_RivalTeamSelect_C_OnFocusEvent::Button' has a wrong offset!");

// Function WBP_PartyRace_RivalTeamSelect.WBP_PartyRace_RivalTeamSelect_C.PlayAnimationIn
// 0x0030 (0x0030 - 0x0000)
struct WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn final
{
public:
	bool                                          CallFunc_IsLock_ReturnValue;                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UTexture2D>>      CallFunc_Set_UpGadgetPlate_OutGadgetIconSoftTextures; // 0x0008(0x0010)(ReferenceParm)
	ERivalTeamId                                  CallFunc_GetSelectedRivalTeamId_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn) == 0x000008, "Wrong alignment on WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn");
static_assert(sizeof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn) == 0x000030, "Wrong size on WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn, CallFunc_IsLock_ReturnValue) == 0x000000, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn::CallFunc_IsLock_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn, CallFunc_Set_UpGadgetPlate_OutGadgetIconSoftTextures) == 0x000008, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn::CallFunc_Set_UpGadgetPlate_OutGadgetIconSoftTextures' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn, CallFunc_GetSelectedRivalTeamId_ReturnValue) == 0x000018, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn::CallFunc_GetSelectedRivalTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000028, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationIn::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_PartyRace_RivalTeamSelect.WBP_PartyRace_RivalTeamSelect_C.PlayAnimationLoop
// 0x0010 (0x0010 - 0x0000)
struct WBP_PartyRace_RivalTeamSelect_C_PlayAnimationLoop final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationLoop) == 0x000008, "Wrong alignment on WBP_PartyRace_RivalTeamSelect_C_PlayAnimationLoop");
static_assert(sizeof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationLoop) == 0x000010, "Wrong size on WBP_PartyRace_RivalTeamSelect_C_PlayAnimationLoop");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationLoop, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationLoop::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationLoop, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000008, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationLoop::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationLoop, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationLoop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_PartyRace_RivalTeamSelect.WBP_PartyRace_RivalTeamSelect_C.PlayAnimationOut
// 0x0018 (0x0018 - 0x0000)
struct WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut) == 0x000008, "Wrong alignment on WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut");
static_assert(sizeof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut) == 0x000018, "Wrong size on WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000010, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'WBP_PartyRace_RivalTeamSelect_C_PlayAnimationOut::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_PartyRace_RivalTeamSelect.WBP_PartyRace_RivalTeamSelect_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PartyRace_RivalTeamSelect_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_RivalTeamSelect_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PartyRace_RivalTeamSelect_C_PreConstruct");
static_assert(sizeof(WBP_PartyRace_RivalTeamSelect_C_PreConstruct) == 0x000001, "Wrong size on WBP_PartyRace_RivalTeamSelect_C_PreConstruct");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PartyRace_RivalTeamSelect_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PartyRace_RivalTeamSelect.WBP_PartyRace_RivalTeamSelect_C.SetLatestFocusedButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_RivalTeamSelect_C_SetLatestFocusedButton final
{
public:
	class UWBP_PartyRace_Sub_RivalTeamIcon_C*     caller;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_RivalTeamSelect_C_SetLatestFocusedButton) == 0x000008, "Wrong alignment on WBP_PartyRace_RivalTeamSelect_C_SetLatestFocusedButton");
static_assert(sizeof(WBP_PartyRace_RivalTeamSelect_C_SetLatestFocusedButton) == 0x000008, "Wrong size on WBP_PartyRace_RivalTeamSelect_C_SetLatestFocusedButton");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_SetLatestFocusedButton, caller) == 0x000000, "Member 'WBP_PartyRace_RivalTeamSelect_C_SetLatestFocusedButton::caller' has a wrong offset!");

// Function WBP_PartyRace_RivalTeamSelect.WBP_PartyRace_RivalTeamSelect_C.UnbindSelectIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyRace_RivalTeamSelect_C_UnbindSelectIcon final
{
public:
	class URivalTeamSelectIconWidget*             InSelectIcon;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyRace_RivalTeamSelect_C_UnbindSelectIcon) == 0x000008, "Wrong alignment on WBP_PartyRace_RivalTeamSelect_C_UnbindSelectIcon");
static_assert(sizeof(WBP_PartyRace_RivalTeamSelect_C_UnbindSelectIcon) == 0x000008, "Wrong size on WBP_PartyRace_RivalTeamSelect_C_UnbindSelectIcon");
static_assert(offsetof(WBP_PartyRace_RivalTeamSelect_C_UnbindSelectIcon, InSelectIcon) == 0x000000, "Member 'WBP_PartyRace_RivalTeamSelect_C_UnbindSelectIcon::InSelectIcon' has a wrong offset!");

}

