#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_CustomPaint_LiquidLine

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MachineCustom_Sub_CustomPaint_LiquidLine.WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C.ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint_LiquidLine
// 0x0004 (0x0004 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint_LiquidLine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint_LiquidLine) == 0x000004, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint_LiquidLine");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint_LiquidLine) == 0x000004, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint_LiquidLine");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint_LiquidLine, EntryPoint) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_ExecuteUbergraph_WBP_MachineCustom_Sub_CustomPaint_LiquidLine::EntryPoint' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint_LiquidLine.WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class AMenuPlayerController*                  K2Node_DynamicCast_AsMenu_Player_Controller;       // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0108(0x00B8)()
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived) == 0x0001C0, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived, K2Node_DynamicCast_AsMenu_Player_Controller) == 0x0000F8, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived::K2Node_DynamicCast_AsMenu_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x000108, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint_LiquidLine.WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C.SetCursorVisible
// 0x0005 (0x0005 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible final
{
public:
	bool                                          bInIsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible) == 0x000001, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible) == 0x000005, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible, bInIsVisible) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible::bInIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible, Temp_byte_Variable) == 0x000001, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible, Temp_bool_Variable) == 0x000003, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible, K2Node_Select_Default) == 0x000004, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_SetCursorVisible::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint_LiquidLine.WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C.Setup
// 0x0060 (0x0060 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMachineColorAreaUIData                InItemData;                                        // 0x0008(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup) == 0x000060, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup, InPlayerController) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup::InPlayerController' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup, InItemData) == 0x000008, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup::InItemData' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup, Temp_bool_Variable) == 0x000048, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup, K2Node_Select_Default) == 0x000058, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_Setup::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MachineCustom_Sub_CustomPaint_LiquidLine.WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C.GetItemData
// 0x0040 (0x0040 - 0x0000)
struct WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_GetItemData final
{
public:
	struct FMachineColorAreaUIData                UIData;                                            // 0x0000(0x0040)(Parm, OutParm)
};
static_assert(alignof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_GetItemData) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_GetItemData");
static_assert(sizeof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_GetItemData) == 0x000040, "Wrong size on WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_GetItemData");
static_assert(offsetof(WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_GetItemData, UIData) == 0x000000, "Member 'WBP_MachineCustom_Sub_CustomPaint_LiquidLine_C_GetItemData::UIData' has a wrong offset!");

}

