#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_GP_Player0204

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionRun_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Result_GP_Player0204.WBP_Result_GP_Player0204_C
// 0x00A8 (0x0430 - 0x0388)
class UWBP_Result_GP_Player0204_C final : public UUnionRaceUIResultScene
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                BUTTON_PRESS;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemGet_WindowMini_C*              DSP_WBP_ItemGet_WindowMini;                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Result_GP_Player0204;                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Reward_C*                   WBP_Result_Reward_2_1;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Reward_C*                   WBP_Result_Reward_2_2;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Reward_C*                   WBP_Result_Reward_4_1;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Reward_C*                   WBP_Result_Reward_4_2;                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Reward_C*                   WBP_Result_Reward_4_3;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Reward_C*                   WBP_Result_Reward_4_4;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_RankingTable_GP_Line_C* WBP_Result_Sub_RankingTable_GP_Line;               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bStartOutAnim;                                     // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              PanelDebugTexture;                                 // 0x03F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsPress;                                          // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ForceCount;                                        // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuInputRecieveObject*                MenuInputReceiveObject;                            // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Result_GP_Player0204_BUTTON_PRESS_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_Result_GP_Player0204_BUTTON_PRESS_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void CalcLinesPanelVisibleByRacerCount();
	void Construct();
	void Destruct();
	void EnterStateFinished();
	void ExecuteUbergraph_WBP_Result_GP_Player0204(int32 EntryPoint);
	class UUnionRaceUIResultPanel* GetResultLinesPanel();
	void IsPartyRaceMissionExists(bool* Exists);
	void OnAcceptButton(class UObject* Object);
	void OnFinishedResultAnim(const int32& FinishedResultStateId);
	void OnForcePressed();
	void OnFullScreenMouseClick();
	void PlayLinesPanelAddMoveAnim();
	void PlayLinesPanelInAnim();
	void PlayLinesPanelOutAnimByRacerCount();
	void PlayLinesPanelOutAnimTimelag();
	void PlayLinesPanelTotalInAnim();
	void PreConstruct(bool IsDesignTime);
	void RemoveInputRevieveObj();
	void SetLinesPanelRacerCount(int32 RacerCount);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void カスタムイベント();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Result_GP_Player0204_C">();
	}
	static class UWBP_Result_GP_Player0204_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Result_GP_Player0204_C>();
	}
};
static_assert(alignof(UWBP_Result_GP_Player0204_C) == 0x000008, "Wrong alignment on UWBP_Result_GP_Player0204_C");
static_assert(sizeof(UWBP_Result_GP_Player0204_C) == 0x000430, "Wrong size on UWBP_Result_GP_Player0204_C");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, UberGraphFrame) == 0x000388, "Member 'UWBP_Result_GP_Player0204_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, BUTTON_PRESS) == 0x000390, "Member 'UWBP_Result_GP_Player0204_C::BUTTON_PRESS' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, DSP_WBP_ItemGet_WindowMini) == 0x000398, "Member 'UWBP_Result_GP_Player0204_C::DSP_WBP_ItemGet_WindowMini' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, Panel) == 0x0003A0, "Member 'UWBP_Result_GP_Player0204_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, SafeZone_Result_GP_Player0204) == 0x0003A8, "Member 'UWBP_Result_GP_Player0204_C::SafeZone_Result_GP_Player0204' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, WBP_Result_Reward_2_1) == 0x0003B0, "Member 'UWBP_Result_GP_Player0204_C::WBP_Result_Reward_2_1' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, WBP_Result_Reward_2_2) == 0x0003B8, "Member 'UWBP_Result_GP_Player0204_C::WBP_Result_Reward_2_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, WBP_Result_Reward_4_1) == 0x0003C0, "Member 'UWBP_Result_GP_Player0204_C::WBP_Result_Reward_4_1' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, WBP_Result_Reward_4_2) == 0x0003C8, "Member 'UWBP_Result_GP_Player0204_C::WBP_Result_Reward_4_2' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, WBP_Result_Reward_4_3) == 0x0003D0, "Member 'UWBP_Result_GP_Player0204_C::WBP_Result_Reward_4_3' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, WBP_Result_Reward_4_4) == 0x0003D8, "Member 'UWBP_Result_GP_Player0204_C::WBP_Result_Reward_4_4' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, WBP_Result_Sub_RankingTable_GP_Line) == 0x0003E0, "Member 'UWBP_Result_GP_Player0204_C::WBP_Result_Sub_RankingTable_GP_Line' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, bStartOutAnim) == 0x0003E8, "Member 'UWBP_Result_GP_Player0204_C::bStartOutAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, PanelDebugTexture) == 0x0003F0, "Member 'UWBP_Result_GP_Player0204_C::PanelDebugTexture' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, bIsPress) == 0x000418, "Member 'UWBP_Result_GP_Player0204_C::bIsPress' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, ForceCount) == 0x000420, "Member 'UWBP_Result_GP_Player0204_C::ForceCount' has a wrong offset!");
static_assert(offsetof(UWBP_Result_GP_Player0204_C, MenuInputReceiveObject) == 0x000428, "Member 'UWBP_Result_GP_Player0204_C::MenuInputReceiveObject' has a wrong offset!");

}

