#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Time

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Sub_Time.WBP_Race_HUD_Sub_Time_C.SetLapTimeInfo
// 0x0148 (0x0148 - 0x0000)
struct WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo final
{
public:
	int32                                         Minutes;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Seconds;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MilliSec;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_2;                      // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x00D0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0010)()
};
static_assert(alignof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo");
static_assert(sizeof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo) == 0x000148, "Wrong size on WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, Minutes) == 0x000000, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::Minutes' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, Seconds) == 0x000004, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::Seconds' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, MilliSec) == 0x000008, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::MilliSec' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, CallFunc_Clamp_ReturnValue) == 0x00000C, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, CallFunc_Clamp_ReturnValue_1) == 0x000010, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000028, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, CallFunc_Clamp_ReturnValue_2) == 0x0000C8, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::CallFunc_Clamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, CallFunc_Conv_IntToText_ReturnValue_2) == 0x0000D0, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E0, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, K2Node_MakeArray_Array) == 0x000128, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo, CallFunc_Format_ReturnValue) == 0x000138, "Member 'WBP_Race_HUD_Sub_Time_C_SetLapTimeInfo::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Time.WBP_Race_HUD_Sub_Time_C.SetSecondsTime
// 0x0168 (0x0168 - 0x0000)
struct WBP_Race_HUD_Sub_Time_C_SetSecondsTime final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0040(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x00F0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0100(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0158(0x0010)()
};
static_assert(alignof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Time_C_SetSecondsTime");
static_assert(sizeof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime) == 0x000168, "Wrong size on WBP_Race_HUD_Sub_Time_C_SetSecondsTime");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, Value) == 0x000000, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::Value' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000010, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, CallFunc_FFloor_ReturnValue) == 0x000018, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, CallFunc_Percent_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, CallFunc_FTrunc_ReturnValue) == 0x00002C, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000040, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, CallFunc_FFloor_ReturnValue_1) == 0x0000E8, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, CallFunc_Conv_IntToText_ReturnValue_2) == 0x0000F0, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, K2Node_MakeStruct_FormatArgumentData_2) == 0x000100, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, K2Node_MakeArray_Array) == 0x000148, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Time_C_SetSecondsTime, CallFunc_Format_ReturnValue) == 0x000158, "Member 'WBP_Race_HUD_Sub_Time_C_SetSecondsTime::CallFunc_Format_ReturnValue' has a wrong offset!");

}

