#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_System_Sub_LoadingSonic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_System_Sub_LoadingSonic.WBP_System_Sub_LoadingSonic_C
// 0x0068 (0x0348 - 0x02E0)
class UWBP_System_Sub_LoadingSonic_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SonicCar_Out;                                      // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SonicCar_Loop;                                     // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Car;                                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_sonic;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Throbber_dot;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_End;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Loading;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Wheel_Front;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Wheel_Rear;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnOutAnimFinished;                                 // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ChangeSonicState(uint8 SonicStateID);
	void Construct();
	void ExecuteUbergraph_WBP_System_Sub_LoadingSonic(int32 EntryPoint);
	void FireOutAnim();
	void InvisibleText();
	void OnAnimFinished();
	void PlayLoopAnimation();
	void PlayOutAnim();
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent__ENTRYPOINTWBP_System_Sub_LoadingSonic();
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_System_Sub_LoadingSonic_C">();
	}
	static class UWBP_System_Sub_LoadingSonic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_System_Sub_LoadingSonic_C>();
	}
};
static_assert(alignof(UWBP_System_Sub_LoadingSonic_C) == 0x000008, "Wrong alignment on UWBP_System_Sub_LoadingSonic_C");
static_assert(sizeof(UWBP_System_Sub_LoadingSonic_C) == 0x000348, "Wrong size on UWBP_System_Sub_LoadingSonic_C");
static_assert(offsetof(UWBP_System_Sub_LoadingSonic_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_System_Sub_LoadingSonic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_LoadingSonic_C, SonicCar_Out) == 0x0002E8, "Member 'UWBP_System_Sub_LoadingSonic_C::SonicCar_Out' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_LoadingSonic_C, SonicCar_Loop) == 0x0002F0, "Member 'UWBP_System_Sub_LoadingSonic_C::SonicCar_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_LoadingSonic_C, Car) == 0x0002F8, "Member 'UWBP_System_Sub_LoadingSonic_C::Car' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_LoadingSonic_C, Panel) == 0x000300, "Member 'UWBP_System_Sub_LoadingSonic_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_LoadingSonic_C, PAT_sonic) == 0x000308, "Member 'UWBP_System_Sub_LoadingSonic_C::PAT_sonic' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_LoadingSonic_C, Throbber_dot) == 0x000310, "Member 'UWBP_System_Sub_LoadingSonic_C::Throbber_dot' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_LoadingSonic_C, TXT_End) == 0x000318, "Member 'UWBP_System_Sub_LoadingSonic_C::TXT_End' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_LoadingSonic_C, TXT_Loading) == 0x000320, "Member 'UWBP_System_Sub_LoadingSonic_C::TXT_Loading' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_LoadingSonic_C, Wheel_Front) == 0x000328, "Member 'UWBP_System_Sub_LoadingSonic_C::Wheel_Front' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_LoadingSonic_C, Wheel_Rear) == 0x000330, "Member 'UWBP_System_Sub_LoadingSonic_C::Wheel_Rear' has a wrong offset!");
static_assert(offsetof(UWBP_System_Sub_LoadingSonic_C, OnOutAnimFinished) == 0x000338, "Member 'UWBP_System_Sub_LoadingSonic_C::OnOutAnimFinished' has a wrong offset!");

}

