#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MachineCustom_Sub_StickerSelect

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "ST_StickerPresetPageData_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ST_StickerPresetPageItemData_structs.hpp"


namespace SDK::Params
{

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.AddPage
// 0x0018 (0x0018 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_AddPage final
{
public:
	struct FST_StickerPresetPageData              InPageData;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_AddPage) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_AddPage");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_AddPage) == 0x000018, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_AddPage");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_AddPage, InPageData) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_AddPage::InPageData' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_AddPage, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_AddPage::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C*> K2Node_MakeArray_Array;             // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* CallFunc_Array_Get_Item;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C*> CallFunc_GetItems_Items;              // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* CallFunc_Array_Get_Item_1;                  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemNumInRow_Value;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonsPanel*                   CallFunc_CreateButtonsPanel_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* InButton)> K2Node_CreateDelegate_OutputDelegate;        // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* InButton)> K2Node_CreateDelegate_OutputDelegate_1;      // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* InButton)> K2Node_CreateDelegate_OutputDelegate_2;      // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* CallFunc_Array_Get_Item_2;                  // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUnionUIControlDir Direction, class UUnionUIButtonBase* Button, int32 RowIndex, int32 ColumnIndex)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* CallFunc_Array_Get_Item_3;                  // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* CallFunc_Array_Get_Item_4;                  // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* InButton)> K2Node_CreateDelegate_OutputDelegate_5;      // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_6;        // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect) == 0x0000F0, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, EntryPoint) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_GetItems_Items) == 0x000020, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_GetItems_Items' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_GetItemNumInRow_Value) == 0x000040, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_GetItemNumInRow_Value' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_CreateButtonsPanel_ReturnValue) == 0x000048, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_CreateButtonsPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, Temp_int_Array_Index_Variable) == 0x000054, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_MakeLiteralBool_ReturnValue) == 0x00005C, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_Array_Get_Item_2) == 0x000090, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A0, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_Array_Get_Item_3) == 0x0000B0, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B8, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, CallFunc_Array_Get_Item_4) == 0x0000C8, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000D0, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000E0, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_ExecuteUbergraph_WBP_MachineCustom_Sub_StickerSelect::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.Item_OnCancel
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_Item_OnCancel final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnCancel) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_Item_OnCancel");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnCancel) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_Item_OnCancel");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnCancel, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Item_OnCancel::InButton' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.Item_OnDecision
// 0x0068 (0x0068 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_StickerPresetPageItemData          CallFunc_GetItemData_ItemData;                     // 0x0018(0x0050)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision) == 0x000068, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision::InButton' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon) == 0x000008, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision, CallFunc_GetItemData_ItemData) == 0x000018, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Item_OnDecision::CallFunc_GetItemData_ItemData' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.Item_OnFocus
// 0x0088 (0x0088 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* CallFunc_Array_Get_Item;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FST_StickerPresetPageItemData          CallFunc_GetItemData_ItemData;                     // 0x0020(0x0050)(HasGetValueTypeHash)
	TArray<class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C*> CallFunc_GetItems_Items;              // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus) == 0x000088, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus::InButton' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus, K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon) == 0x000008, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus::K2Node_DynamicCast_AsWBP_Machine_Custom_Sub_Sticker_Preset_Icon' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus, CallFunc_GetItemData_ItemData) == 0x000020, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus::CallFunc_GetItemData_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus, CallFunc_GetItems_Items) == 0x000070, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus::CallFunc_GetItems_Items' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus, CallFunc_Array_Find_ReturnValue) == 0x000080, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Item_OnFocus::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.LeftShoulder
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_LeftShoulder final
{
public:
	class UUnionUIButtonBase*                     InButton;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_LeftShoulder) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_LeftShoulder");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_LeftShoulder) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_LeftShoulder");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_LeftShoulder, InButton) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_LeftShoulder::InButton' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.OnFocusReceivedInternal
// 0x0044 (0x0044 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceivedInternal final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         CallFunc_GetUserIndexByFocusEvent_ReturnValue;     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceivedInternal) == 0x000004, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceivedInternal");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceivedInternal) == 0x000044, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceivedInternal");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceivedInternal, MyGeometry) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceivedInternal::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceivedInternal, InFocusEvent) == 0x000038, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceivedInternal::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceivedInternal, CallFunc_GetUserIndexByFocusEvent_ReturnValue) == 0x000040, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_OnFocusReceivedInternal::CallFunc_GetUserIndexByFocusEvent_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.Page_OnSideNavigationCustom
// 0x0020 (0x0020 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom final
{
public:
	EUnionUIControlDir                            Direction;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     Button;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         RowIndex;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ColumnIndex;                                       // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom) == 0x000020, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom, Direction) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom::Direction' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom, Button) == 0x000008, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom::Button' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom, RowIndex) == 0x000010, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom::RowIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom, ColumnIndex) == 0x000014, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom::ColumnIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_Page_OnSideNavigationCustom::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.PlayAnimationLeftIn
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationLeftIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationLeftIn) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationLeftIn");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationLeftIn) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationLeftIn");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationLeftIn, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationLeftIn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.PlayAnimationRightIn
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationRightIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationRightIn) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationRightIn");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationRightIn) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationRightIn");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationRightIn, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_PlayAnimationRightIn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.PlayPurchaseAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_PlayPurchaseAnim final
{
public:
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* CallFunc_Array_Get_Item;                    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_PlayPurchaseAnim) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_PlayPurchaseAnim");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_PlayPurchaseAnim) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_PlayPurchaseAnim");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_PlayPurchaseAnim, CallFunc_Array_Get_Item) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_PlayPurchaseAnim::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.PlaySETab
// 0x0004 (0x0004 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_PlaySETab final
{
public:
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0000(0x0004)()
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_PlaySETab) == 0x000004, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_PlaySETab");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_PlaySETab) == 0x000004, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_PlaySETab");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_PlaySETab, CallFunc_SoundPlay_ReturnValue) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_PlaySETab::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.RightShoulder
// 0x0008 (0x0008 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_RightShoulder final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_RightShoulder) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_RightShoulder");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_RightShoulder) == 0x000008, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_RightShoulder");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_RightShoulder, Button) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_RightShoulder::Button' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.SetFocusToItem
// 0x0030 (0x0030 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem final
{
public:
	int32                                         InItemIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* CallFunc_Array_Get_Item;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C*> CallFunc_GetItems_Items;              // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* CallFunc_Array_Get_Item_1;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem) == 0x000030, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem, InItemIndex) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem::InItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem, CallFunc_GetItems_Items) == 0x000018, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem::CallFunc_GetItems_Items' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItem::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.SetFocusToItemInNextPage
// 0x0120 (0x0120 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage final
{
public:
	int32                                         InRowIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempItemIndex;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempRowIndex;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsItemFound;                                      // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* CallFunc_Array_Get_Item;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C*> CallFunc_GetItems_Items;              // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* CallFunc_Array_Get_Item_1;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_OnFocusReceivedImpl_ReturnValue;          // 0x0038(0x00B8)()
	int32                                         Temp_int_Variable;                                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage) == 0x000120, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, InRowIndex) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::InRowIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, TempItemIndex) == 0x000004, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::TempItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, TempRowIndex) == 0x000008, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::TempRowIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, bIsItemFound) == 0x00000C, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::bIsItemFound' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_GetItems_Items) == 0x000018, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_GetItems_Items' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_OnFocusReceivedImpl_ReturnValue) == 0x000038, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_OnFocusReceivedImpl_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, Temp_int_Variable) == 0x0000F0, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F4, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000F8, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000F9, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000FC, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000104, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_Not_PreBool_ReturnValue) == 0x000105, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, Temp_int_Variable_1) == 0x000108, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_Not_PreBool_ReturnValue_1) == 0x00010C, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_BooleanAND_ReturnValue) == 0x00010D, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_Multiply_IntInt_ReturnValue) == 0x000110, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000114, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000118, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00011C, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage, CallFunc_BooleanAND_ReturnValue_1) == 0x00011D, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInNextPage::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_MachineCustom_Sub_StickerSelect.WBP_MachineCustom_Sub_StickerSelect_C.SetFocusToItemInPrevPage
// 0x0128 (0x0128 - 0x0000)
struct WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage final
{
public:
	int32                                         InRowIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempItemIndex;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempRowIndex;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsItemFound;                                      // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_Sticker_PresetWindow_C* CallFunc_Array_Get_Item;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C*> CallFunc_GetItems_Items;              // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MachineCustom_Sub_Sticker_PresetIcon_C* CallFunc_Array_Get_Item_1;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_OnFocusReceivedImpl_ReturnValue;          // 0x0038(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage) == 0x000008, "Wrong alignment on WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage");
static_assert(sizeof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage) == 0x000128, "Wrong size on WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, InRowIndex) == 0x000000, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::InRowIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, TempItemIndex) == 0x000004, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::TempItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, TempRowIndex) == 0x000008, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::TempRowIndex' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, bIsItemFound) == 0x00000C, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::bIsItemFound' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, CallFunc_GetItems_Items) == 0x000018, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::CallFunc_GetItems_Items' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, CallFunc_OnFocusReceivedImpl_ReturnValue) == 0x000038, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::CallFunc_OnFocusReceivedImpl_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, CallFunc_Not_PreBool_ReturnValue) == 0x0000F0, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000F1, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F4, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000F8, "Member 'WBP_MachineCustom_Sub_StickerSelect_C_SetFocusToItemInPrevPage::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
