#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Result_GP_Player0204

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_Result_GP_Player0204.WBP_Result_GP_Player0204_C.ExecuteUbergraph_WBP_Result_GP_Player0204
// 0x0188 (0x0188 - 0x0000)
struct WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuInputRecieveObject*                CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0034(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RacerCount;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_FinishedResultStateId;          // 0x0074(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRacerIndexByPlayerID_ReturnValue;      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_1;     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionStatsManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHonorCommendationData>         CallFunc_GetResultHonorList_OutDataList;           // 0x00A8(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedPlayerCount_ReturnValue_2;     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Result_Reward_C*                   K2Node_Select_Default;                             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTipsState_result;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRewardDispComplete_bIsComplete;         // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const int32& FinishedResultStateId)> K2Node_CreateDelegate_OutputDelegate_2;      // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetResultRankingForcePressedTime_ReturnValue; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204) == 0x000008, "Wrong alignment on WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204");
static_assert(sizeof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204) == 0x000188, "Wrong size on WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, EntryPoint) == 0x000000, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_Event_IsDesignTime) == 0x000030, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_Event_MyGeometry) == 0x000034, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_Event_InDeltaTime) == 0x00006C, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_Event_RacerCount) == 0x000070, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_Event_RacerCount' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_CustomEvent_FinishedResultStateId) == 0x000074, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_CustomEvent_FinishedResultStateId' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, Temp_int_Variable) == 0x000078, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, Temp_int_Variable_1) == 0x00007C, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_SwitchInteger_CmpSuccess) == 0x000080, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_GetRacerIndexByPlayerID_ReturnValue) == 0x000084, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_GetRacerIndexByPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000088, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_GetSelectedPlayerCount_ReturnValue) == 0x000090, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_GetSelectedPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_Subtract_IntInt_ReturnValue) == 0x000094, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_GetSelectedPlayerCount_ReturnValue_1) == 0x000098, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_GetSelectedPlayerCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00009C, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000A0, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_GetResultHonorList_OutDataList) == 0x0000A8, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_GetResultHonorList_OutDataList' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, Temp_bool_Variable) == 0x0000B8, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_SwitchEnum_CmpSuccess) == 0x0000B9, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_GetSelectedPlayerCount_ReturnValue_2) == 0x0000BC, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_GetSelectedPlayerCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000C0, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_IsTipsState_result) == 0x0000D0, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_IsTipsState_result' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_IsRewardDispComplete_bIsComplete) == 0x0000D1, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_IsRewardDispComplete_bIsComplete' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D4, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000E4, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000E8, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000F8, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_GetResultRankingForcePressedTime_ReturnValue) == 0x0000FC, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_GetResultRankingForcePressedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000100, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000108, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000118, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000119, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00011C, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_CreateDelegate_OutputDelegate_3) == 0x000120, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000130, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_CustomEvent_Object) == 0x000138, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_CustomEvent_Object' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_GetOwningPlayer_ReturnValue) == 0x000140, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000148, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000151, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000158, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_DynamicCast_As_____2D) == 0x000160, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, K2Node_DynamicCast_bSuccess_1) == 0x000168, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000170, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000178, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000180, "Member 'WBP_Result_GP_Player0204_C_ExecuteUbergraph_WBP_Result_GP_Player0204::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_Result_GP_Player0204.WBP_Result_GP_Player0204_C.GetResultLinesPanel
// 0x0008 (0x0008 - 0x0000)
struct WBP_Result_GP_Player0204_C_GetResultLinesPanel final
{
public:
	class UUnionRaceUIResultPanel*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_GP_Player0204_C_GetResultLinesPanel) == 0x000008, "Wrong alignment on WBP_Result_GP_Player0204_C_GetResultLinesPanel");
static_assert(sizeof(WBP_Result_GP_Player0204_C_GetResultLinesPanel) == 0x000008, "Wrong size on WBP_Result_GP_Player0204_C_GetResultLinesPanel");
static_assert(offsetof(WBP_Result_GP_Player0204_C_GetResultLinesPanel, ReturnValue) == 0x000000, "Member 'WBP_Result_GP_Player0204_C_GetResultLinesPanel::ReturnValue' has a wrong offset!");

// Function WBP_Result_GP_Player0204.WBP_Result_GP_Player0204_C.IsPartyRaceMissionExists
// 0x0001 (0x0001 - 0x0000)
struct WBP_Result_GP_Player0204_C_IsPartyRaceMissionExists final
{
public:
	bool                                          Exists;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_GP_Player0204_C_IsPartyRaceMissionExists) == 0x000001, "Wrong alignment on WBP_Result_GP_Player0204_C_IsPartyRaceMissionExists");
static_assert(sizeof(WBP_Result_GP_Player0204_C_IsPartyRaceMissionExists) == 0x000001, "Wrong size on WBP_Result_GP_Player0204_C_IsPartyRaceMissionExists");
static_assert(offsetof(WBP_Result_GP_Player0204_C_IsPartyRaceMissionExists, Exists) == 0x000000, "Member 'WBP_Result_GP_Player0204_C_IsPartyRaceMissionExists::Exists' has a wrong offset!");

// Function WBP_Result_GP_Player0204.WBP_Result_GP_Player0204_C.OnAcceptButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_Result_GP_Player0204_C_OnAcceptButton final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_GP_Player0204_C_OnAcceptButton) == 0x000008, "Wrong alignment on WBP_Result_GP_Player0204_C_OnAcceptButton");
static_assert(sizeof(WBP_Result_GP_Player0204_C_OnAcceptButton) == 0x000008, "Wrong size on WBP_Result_GP_Player0204_C_OnAcceptButton");
static_assert(offsetof(WBP_Result_GP_Player0204_C_OnAcceptButton, Object) == 0x000000, "Member 'WBP_Result_GP_Player0204_C_OnAcceptButton::Object' has a wrong offset!");

// Function WBP_Result_GP_Player0204.WBP_Result_GP_Player0204_C.OnFinishedResultAnim
// 0x0004 (0x0004 - 0x0000)
struct WBP_Result_GP_Player0204_C_OnFinishedResultAnim final
{
public:
	int32                                         FinishedResultStateId;                             // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_GP_Player0204_C_OnFinishedResultAnim) == 0x000004, "Wrong alignment on WBP_Result_GP_Player0204_C_OnFinishedResultAnim");
static_assert(sizeof(WBP_Result_GP_Player0204_C_OnFinishedResultAnim) == 0x000004, "Wrong size on WBP_Result_GP_Player0204_C_OnFinishedResultAnim");
static_assert(offsetof(WBP_Result_GP_Player0204_C_OnFinishedResultAnim, FinishedResultStateId) == 0x000000, "Member 'WBP_Result_GP_Player0204_C_OnFinishedResultAnim::FinishedResultStateId' has a wrong offset!");

// Function WBP_Result_GP_Player0204.WBP_Result_GP_Player0204_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Result_GP_Player0204_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_GP_Player0204_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Result_GP_Player0204_C_PreConstruct");
static_assert(sizeof(WBP_Result_GP_Player0204_C_PreConstruct) == 0x000001, "Wrong size on WBP_Result_GP_Player0204_C_PreConstruct");
static_assert(offsetof(WBP_Result_GP_Player0204_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Result_GP_Player0204_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Result_GP_Player0204.WBP_Result_GP_Player0204_C.RemoveInputRevieveObj
// 0x0020 (0x0020 - 0x0000)
struct WBP_Result_GP_Player0204_C_RemoveInputRevieveObj final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterSingleSubMenu_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_GP_Player0204_C_RemoveInputRevieveObj) == 0x000008, "Wrong alignment on WBP_Result_GP_Player0204_C_RemoveInputRevieveObj");
static_assert(sizeof(WBP_Result_GP_Player0204_C_RemoveInputRevieveObj) == 0x000020, "Wrong size on WBP_Result_GP_Player0204_C_RemoveInputRevieveObj");
static_assert(offsetof(WBP_Result_GP_Player0204_C_RemoveInputRevieveObj, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_Result_GP_Player0204_C_RemoveInputRevieveObj::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_RemoveInputRevieveObj, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Result_GP_Player0204_C_RemoveInputRevieveObj::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_RemoveInputRevieveObj, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000010, "Member 'WBP_Result_GP_Player0204_C_RemoveInputRevieveObj::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_RemoveInputRevieveObj, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Result_GP_Player0204_C_RemoveInputRevieveObj::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_RemoveInputRevieveObj, CallFunc_UnregisterSingleSubMenu_ReturnValue) == 0x000019, "Member 'WBP_Result_GP_Player0204_C_RemoveInputRevieveObj::CallFunc_UnregisterSingleSubMenu_ReturnValue' has a wrong offset!");

// Function WBP_Result_GP_Player0204.WBP_Result_GP_Player0204_C.SetLinesPanelRacerCount
// 0x0004 (0x0004 - 0x0000)
struct WBP_Result_GP_Player0204_C_SetLinesPanelRacerCount final
{
public:
	int32                                         RacerCount;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_GP_Player0204_C_SetLinesPanelRacerCount) == 0x000004, "Wrong alignment on WBP_Result_GP_Player0204_C_SetLinesPanelRacerCount");
static_assert(sizeof(WBP_Result_GP_Player0204_C_SetLinesPanelRacerCount) == 0x000004, "Wrong size on WBP_Result_GP_Player0204_C_SetLinesPanelRacerCount");
static_assert(offsetof(WBP_Result_GP_Player0204_C_SetLinesPanelRacerCount, RacerCount) == 0x000000, "Member 'WBP_Result_GP_Player0204_C_SetLinesPanelRacerCount::RacerCount' has a wrong offset!");

// Function WBP_Result_GP_Player0204.WBP_Result_GP_Player0204_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Result_GP_Player0204_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Result_GP_Player0204_C_Tick) == 0x000004, "Wrong alignment on WBP_Result_GP_Player0204_C_Tick");
static_assert(sizeof(WBP_Result_GP_Player0204_C_Tick) == 0x00003C, "Wrong size on WBP_Result_GP_Player0204_C_Tick");
static_assert(offsetof(WBP_Result_GP_Player0204_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Result_GP_Player0204_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Result_GP_Player0204_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Result_GP_Player0204_C_Tick::InDeltaTime' has a wrong offset!");

}

