#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Festa_PointReward_FestaPointTable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Festa_PointReward_FestaPointTable.WBP_Festa_PointReward_FestaPointTable_C
// 0x0090 (0x0370 - 0x02E0)
class UWBP_Festa_PointReward_FestaPointTable_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Bonus_Out_02;                                      // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bonus_Out;                                         // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PointReward_GetPoint_02;                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PointReward_GetPoint;                              // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_FestaPoint;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_FestaPoint_Cusor;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Eff_01;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Eff_02;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      DSP_Num_PointUpChance_01;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_x2Base_01;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_x2Base_02;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_01;                                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FestaPointIcon;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_FestaPoint_01;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUITextBlock*                      TXT_Num_FestaPoint_02;                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Festa_PointReward_Sub_Bonus_C*     WBP_Festa_PointReward_Sub_Bonus;                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Point;                                             // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddPoint(int32 Add, int32 NextAdd, int32 NextTotal);
	void CloseReward(bool bIsBonus);
	void Construct();
	void ExecuteUbergraph_WBP_Festa_PointReward_FestaPointTable(int32 EntryPoint);
	void Open(bool isBonus, int32 NowPoint, int32 NextPoint);
	void PreConstruct(bool IsDesignTime);
	void SetPoint(int32 Point_0);
	void SetPoint2(int32 Point_0);
	void SetResultReward(const struct FFestaResultRewardData& ResultData, int32 Ratio);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Festa_PointReward_FestaPointTable_C">();
	}
	static class UWBP_Festa_PointReward_FestaPointTable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Festa_PointReward_FestaPointTable_C>();
	}
};
static_assert(alignof(UWBP_Festa_PointReward_FestaPointTable_C) == 0x000008, "Wrong alignment on UWBP_Festa_PointReward_FestaPointTable_C");
static_assert(sizeof(UWBP_Festa_PointReward_FestaPointTable_C) == 0x000370, "Wrong size on UWBP_Festa_PointReward_FestaPointTable_C");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, Bonus_Out_02) == 0x0002E8, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::Bonus_Out_02' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, Bonus_Out) == 0x0002F0, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::Bonus_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, PointReward_GetPoint_02) == 0x0002F8, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::PointReward_GetPoint_02' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, PointReward_GetPoint) == 0x000300, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::PointReward_GetPoint' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, Base_FestaPoint) == 0x000308, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::Base_FestaPoint' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, Base_FestaPoint_Cusor) == 0x000310, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::Base_FestaPoint_Cusor' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, DSP_Eff_01) == 0x000318, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::DSP_Eff_01' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, DSP_Eff_02) == 0x000320, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::DSP_Eff_02' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, DSP_Num_PointUpChance_01) == 0x000328, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::DSP_Num_PointUpChance_01' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, DSP_x2Base_01) == 0x000330, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::DSP_x2Base_01' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, DSP_x2Base_02) == 0x000338, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::DSP_x2Base_02' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, Eff_01) == 0x000340, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::Eff_01' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, FestaPointIcon) == 0x000348, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::FestaPointIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, TXT_Num_FestaPoint_01) == 0x000350, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::TXT_Num_FestaPoint_01' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, TXT_Num_FestaPoint_02) == 0x000358, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::TXT_Num_FestaPoint_02' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, WBP_Festa_PointReward_Sub_Bonus) == 0x000360, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::WBP_Festa_PointReward_Sub_Bonus' has a wrong offset!");
static_assert(offsetof(UWBP_Festa_PointReward_FestaPointTable_C, Point) == 0x000368, "Member 'UWBP_Festa_PointReward_FestaPointTable_C::Point' has a wrong offset!");

}

