#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Sub_Boost

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UnionSystem_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Sub_Boost.WBP_Race_HUD_Sub_Boost_C.CheckGadget
// 0x0010 (0x0010 - 0x0000)
struct WBP_Race_HUD_Sub_Boost_C_CheckGadget final
{
public:
	int32                                         PlayerIndex_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isSingle;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRacerIndexByPlayerID_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFastThirdCharge_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFastSecondCharge_ReturnValue;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFastFirstCharge_ReturnValue;            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Boost_C_CheckGadget) == 0x000004, "Wrong alignment on WBP_Race_HUD_Sub_Boost_C_CheckGadget");
static_assert(sizeof(WBP_Race_HUD_Sub_Boost_C_CheckGadget) == 0x000010, "Wrong size on WBP_Race_HUD_Sub_Boost_C_CheckGadget");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_CheckGadget, PlayerIndex_0) == 0x000000, "Member 'WBP_Race_HUD_Sub_Boost_C_CheckGadget::PlayerIndex_0' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_CheckGadget, isSingle) == 0x000004, "Member 'WBP_Race_HUD_Sub_Boost_C_CheckGadget::isSingle' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_CheckGadget, CallFunc_GetRacerIndexByPlayerID_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Boost_C_CheckGadget::CallFunc_GetRacerIndexByPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_CheckGadget, CallFunc_IsFastThirdCharge_ReturnValue) == 0x00000C, "Member 'WBP_Race_HUD_Sub_Boost_C_CheckGadget::CallFunc_IsFastThirdCharge_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_CheckGadget, CallFunc_IsFastSecondCharge_ReturnValue) == 0x00000D, "Member 'WBP_Race_HUD_Sub_Boost_C_CheckGadget::CallFunc_IsFastSecondCharge_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_CheckGadget, CallFunc_IsFastFirstCharge_ReturnValue) == 0x00000E, "Member 'WBP_Race_HUD_Sub_Boost_C_CheckGadget::CallFunc_IsFastFirstCharge_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Boost.WBP_Race_HUD_Sub_Boost_C.ExecuteUbergraph_WBP_Race_HUD_Sub_Boost
// 0x0030 (0x0030 - 0x0000)
struct WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost");
static_assert(sizeof(WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost) == 0x000030, "Wrong size on WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost, EntryPoint) == 0x000000, "Member 'WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost, CallFunc_GetEndTime_ReturnValue) == 0x000018, "Member 'WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_Race_HUD_Sub_Boost_C_ExecuteUbergraph_WBP_Race_HUD_Sub_Boost::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Boost.WBP_Race_HUD_Sub_Boost_C.PlayJustBoostAnimation
// 0x0030 (0x0030 - 0x0000)
struct WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsViewGhostReplay_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x0014(0x0004)()
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue;                  // 0x0018(0x0004)()
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue_1;                // 0x0028(0x0004)()
	struct FSoundHandle                           CallFunc_SetPanSplit_ReturnValue_2;                // 0x002C(0x0004)()
};
static_assert(alignof(WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation");
static_assert(sizeof(WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation) == 0x000030, "Wrong size on WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation, Level) == 0x000000, "Member 'WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation::Level' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation, CallFunc_IsViewGhostReplay_ReturnValue) == 0x000004, "Member 'WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation::CallFunc_IsViewGhostReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation, CallFunc_GetEndTime_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation, CallFunc_Percent_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation, CallFunc_SoundPlay_ReturnValue) == 0x000014, "Member 'WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation, CallFunc_SetPanSplit_ReturnValue) == 0x000018, "Member 'WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation::CallFunc_SetPanSplit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation, CallFunc_SetPanSplit_ReturnValue_1) == 0x000028, "Member 'WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation::CallFunc_SetPanSplit_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation, CallFunc_SetPanSplit_ReturnValue_2) == 0x00002C, "Member 'WBP_Race_HUD_Sub_Boost_C_PlayJustBoostAnimation::CallFunc_SetPanSplit_ReturnValue_2' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Boost.WBP_Race_HUD_Sub_Boost_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Race_HUD_Sub_Boost_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Boost_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Race_HUD_Sub_Boost_C_PreConstruct");
static_assert(sizeof(WBP_Race_HUD_Sub_Boost_C_PreConstruct) == 0x000001, "Wrong size on WBP_Race_HUD_Sub_Boost_C_PreConstruct");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Race_HUD_Sub_Boost_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Boost.WBP_Race_HUD_Sub_Boost_C.SetChargeInfo
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Race_HUD_Sub_Boost_C_SetChargeInfo final
{
public:
	int32                                         ChargeLevel_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ChargeRate;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Boost_C_SetChargeInfo");
static_assert(sizeof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo) == 0x0000B0, "Wrong size on WBP_Race_HUD_Sub_Boost_C_SetChargeInfo");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, ChargeLevel_0) == 0x000000, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::ChargeLevel_0' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, ChargeRate) == 0x000008, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::ChargeRate' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000021, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, Temp_byte_Variable) == 0x000022, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000023, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, Temp_byte_Variable_1) == 0x000030, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_BooleanOR_ReturnValue) == 0x000031, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000032, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000033, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_BooleanAND_ReturnValue_1) == 0x000034, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, Temp_bool_Variable) == 0x000040, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000048, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000051, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, K2Node_Select_Default) == 0x000052, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000053, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_PlayAnimation_ReturnValue_2) == 0x000058, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000060, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000070, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_Less_IntInt_ReturnValue_1) == 0x000098, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000A0, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000A8, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetChargeInfo, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0000AC, "Member 'WBP_Race_HUD_Sub_Boost_C_SetChargeInfo::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Boost.WBP_Race_HUD_Sub_Boost_C.SetHUDVisivle
// 0x0006 (0x0006 - 0x0000)
struct WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle) == 0x000001, "Wrong alignment on WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle");
static_assert(sizeof(WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle) == 0x000006, "Wrong size on WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle, Visible) == 0x000000, "Member 'WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle::Visible' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle, Temp_byte_Variable) == 0x000001, "Member 'WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle, Temp_bool_Variable) == 0x000004, "Member 'WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle, K2Node_Select_Default) == 0x000005, "Member 'WBP_Race_HUD_Sub_Boost_C_SetHUDVisivle::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Race_HUD_Sub_Boost.WBP_Race_HUD_Sub_Boost_C.SetQuickDriftCharge
// 0x0020 (0x0020 - 0x0000)
struct WBP_Race_HUD_Sub_Boost_C_SetQuickDriftCharge final
{
public:
	bool                                          IsFever;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Sub_Boost_C_SetQuickDriftCharge) == 0x000008, "Wrong alignment on WBP_Race_HUD_Sub_Boost_C_SetQuickDriftCharge");
static_assert(sizeof(WBP_Race_HUD_Sub_Boost_C_SetQuickDriftCharge) == 0x000020, "Wrong size on WBP_Race_HUD_Sub_Boost_C_SetQuickDriftCharge");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetQuickDriftCharge, IsFever) == 0x000000, "Member 'WBP_Race_HUD_Sub_Boost_C_SetQuickDriftCharge::IsFever' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Sub_Boost_C_SetQuickDriftCharge, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Sub_Boost_C_SetQuickDriftCharge::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
