#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusInfo_Sub_Tab

#include "Basic.hpp"

#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function WBP_StatusInfo_Sub_Tab.WBP_StatusInfo_Sub_Tab_C.ExecuteUbergraph_WBP_StatusInfo_Sub_Tab
// 0x0004 (0x0004 - 0x0000)
struct WBP_StatusInfo_Sub_Tab_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Tab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusInfo_Sub_Tab_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Tab) == 0x000004, "Wrong alignment on WBP_StatusInfo_Sub_Tab_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Tab");
static_assert(sizeof(WBP_StatusInfo_Sub_Tab_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Tab) == 0x000004, "Wrong size on WBP_StatusInfo_Sub_Tab_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Tab");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Tab, EntryPoint) == 0x000000, "Member 'WBP_StatusInfo_Sub_Tab_C_ExecuteUbergraph_WBP_StatusInfo_Sub_Tab::EntryPoint' has a wrong offset!");

// Function WBP_StatusInfo_Sub_Tab.WBP_StatusInfo_Sub_Tab_C.SetSelected
// 0x000C (0x000C - 0x0000)
struct WBP_StatusInfo_Sub_Tab_C_SetSelected final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusInfo_Sub_Tab_C_SetSelected) == 0x000004, "Wrong alignment on WBP_StatusInfo_Sub_Tab_C_SetSelected");
static_assert(sizeof(WBP_StatusInfo_Sub_Tab_C_SetSelected) == 0x00000C, "Wrong size on WBP_StatusInfo_Sub_Tab_C_SetSelected");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetSelected, Index_0) == 0x000000, "Member 'WBP_StatusInfo_Sub_Tab_C_SetSelected::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetSelected, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_StatusInfo_Sub_Tab_C_SetSelected::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetSelected, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000005, "Member 'WBP_StatusInfo_Sub_Tab_C_SetSelected::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetSelected, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000006, "Member 'WBP_StatusInfo_Sub_Tab_C_SetSelected::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetSelected, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000007, "Member 'WBP_StatusInfo_Sub_Tab_C_SetSelected::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetSelected, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x000008, "Member 'WBP_StatusInfo_Sub_Tab_C_SetSelected::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetSelected, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x000009, "Member 'WBP_StatusInfo_Sub_Tab_C_SetSelected::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");

// Function WBP_StatusInfo_Sub_Tab.WBP_StatusInfo_Sub_Tab_C.SetupTab
// 0x0078 (0x0078 - 0x0000)
struct WBP_StatusInfo_Sub_Tab_C_SetupTab final
{
public:
	int32                                         TabIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventInfoWidgetPageCategory                  Category;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventInfoWidgetPageCategory                  Temp_byte_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_MainTabBtn_C*       K2Node_Select_Default_1;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusInfo_Sub_Tab_C_SetupTab) == 0x000008, "Wrong alignment on WBP_StatusInfo_Sub_Tab_C_SetupTab");
static_assert(sizeof(WBP_StatusInfo_Sub_Tab_C_SetupTab) == 0x000078, "Wrong size on WBP_StatusInfo_Sub_Tab_C_SetupTab");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, TabIndex) == 0x000000, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::TabIndex' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, Category) == 0x000004, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::Category' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, Text) == 0x000008, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::Text' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, Temp_real_Variable) == 0x000018, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, Temp_real_Variable_1) == 0x000028, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, Temp_real_Variable_2) == 0x000030, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, Temp_real_Variable_3) == 0x000038, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, Temp_int_Variable) == 0x000040, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, Temp_real_Variable_4) == 0x000048, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, Temp_real_Variable_5) == 0x000050, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, Temp_real_Variable_6) == 0x000058, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, Temp_byte_Variable) == 0x000060, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, K2Node_Select_Default) == 0x000068, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_StatusInfo_Sub_Tab_C_SetupTab, K2Node_Select_Default_1) == 0x000070, "Member 'WBP_StatusInfo_Sub_Tab_C_SetupTab::K2Node_Select_Default_1' has a wrong offset!");

}

