#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_Window_Error

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Popup_Window_Error.WBP_Popup_Window_Error_C
// 0x00D8 (0x04C8 - 0x03F0)
class UWBP_Popup_Window_Error_C final : public UUnionUIPopupWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Popup_Error_Out;                                   // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_Error_Loop;                                  // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Popup_Error_In;                                    // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AttentionImage;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Header_Red;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         OutOfContentButton;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton_80;                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_MainTitle_Attention;                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UV_Scroll_L_01;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UV_Scroll_L_02;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UV_Scroll_R_01;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UV_Scroll_R_02;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FooterMenu_Sub_CommonBtn_C*        WBP_FooterMenu_Sub_CommonBtn;                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Popup_Info_C*                      WBP_Popup_Info;                                    // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBase;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPopupWindowType                              WindowType;                                        // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupWindowButtonType                        ButtonType;                                        // 0x0491(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_492[0x2];                                      // 0x0492(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DecideButtonIndex;                                 // 0x0494(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InitialFocusButtonIndex;                           // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonControlState;                                // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ButtonControlTimer;                                // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ButtonControlDelayTime;                            // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFinishInitialize;                                // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FinishInitializeTimer;                             // 0x04B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         WaitFinishInitializeTime;                          // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddFocusButton(const TArray<class UUnionUIButtonBase*>& InButtonArray);
	void AddFocusButtonByButtonType();
	void BndEvt__WBP_Popup_Window_Error_MouseInteraction_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void ClearButtonNavigation();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Popup_Window_Error(int32 EntryPoint);
	void FinishInitializerEvent();
	class UWidgetAnimation* GetAnimationIn();
	class UWidgetAnimation* GetAnimationLoop();
	class UWidgetAnimation* GetAnimationOut();
	void GetNoButton(class UUnionUIButtonBase** Button);
	EPopupWindowButtonType GetPopupWindowButtonType();
	EPopupWindowType GetPopupWindowType();
	void GetYesButton(class UUnionUIButtonBase** Button);
	void InitButtonControlDelay();
	void InitParam(EPopupWindowButtonType ButtonType_0);
	void OnAcceptKeyPressed();
	void OnAcceptKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnAcceptKeyReleased();
	void OnAcceptKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnAnimationInFinished();
	void OnBackKeyPressed();
	void OnBackKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnBackKeyReleased();
	void OnBackKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnButtonDecision(class UUnionUIButtonBase* Button);
	void OnDownKeyPressed();
	void OnDownKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnDownKeyReleased();
	void OnDownKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnFaceButtonLeftPressed();
	void OnFaceButtonLeftPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnFaceButtonLeftReleased();
	void OnFaceButtonLeftReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnFaceButtonTopPressed();
	void OnFaceButtonTopPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnFaceButtonTopReleased();
	void OnFaceButtonTopReleasedWithPlayerId(const int32& PlayerControllerIndex);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnLeftKeyPressed();
	void OnLeftKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftKeyReleased();
	void OnLeftKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftShoulderPressed();
	void OnLeftShoulderPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftShoulderReleased();
	void OnLeftShoulderReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftStickAxis(const struct FVector2D& Value);
	void OnLeftStickAxisWithPlayerId(const struct FVector2D& Value, const int32& PlayerControllerIndex);
	void OnLeftStickButtonPressed();
	void OnLeftStickButtonPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnLeftStickButtonReleased();
	void OnLeftStickButtonReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnOutAnimFinished_Impl();
	void OnPanelDecision_Impl(class UUnionUIButtonBase* Button, int32 ButtonIndex);
	void OnRightKeyPressed();
	void OnRightKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightKeyReleased();
	void OnRightKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightShoulderPressed();
	void OnRightShoulderPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightShoulderReleased();
	void OnRightShoulderReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightStickAxis(const struct FVector2D& Value);
	void OnRightStickAxisWithPlayerId(const struct FVector2D& Value, const int32& PlayerControllerIndex);
	void OnRightStickButtonPressed();
	void OnRightStickButtonPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnRightStickButtonReleased();
	void OnRightStickButtonReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnSpecialPressed();
	void OnSpecialPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnSpecialReleased();
	void OnSpecialReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void OnUpKeyPressed();
	void OnUpKeyPressedWithPlayerId(const int32& PlayerControllerIndex);
	void OnUpKeyReleased();
	void OnUpKeyReleasedWithPlayerId(const int32& PlayerControllerIndex);
	void PlayAnimationIn();
	void SetButtonControlDelayTime(float InTime);
	void SetButtonFocusType(EButtonFocusType InButtonFocusType);
	void SetButtonNavigation();
	void SetButtonText(const TArray<class FText>& BtnTextArray);
	void SetDisplayFooterButton(const bool InDisplay);
	void SetDonpaTicketCount(int32 CurrentCount, int32 AfterCount);
	void SetEnableInput(bool InEnable);
	void SetFooterMenuBtn(int32 BtnIconIndex, int32 BtnIconType, const class FText& BtnText);
	void SetImageButtonSelectText(const class FText& InText);
	void SetImageTexture(const class UTexture2D* Texture2D);
	void SetInfoDisplay(bool SetImage);
	void SetInitialFocusButtonIndex(const int32 InButtonIndex);
	void SetPopupInfoDisplayIndex(int32 Index_0);
	void SetPopupInfoMainMenuButtonIconIndex(int32 Btn01IconIndex, int32 Btn02IconIndex);
	void SetTextMessege(const class FText& Text);
	void SetTextTitle(const class FText& Text, bool Attension);
	void SilentFocusReady(bool bOnce);
	void StartButtonContolDelay();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateButtonControlDelay(double InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Popup_Window_Error_C">();
	}
	static class UWBP_Popup_Window_Error_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Popup_Window_Error_C>();
	}
};
static_assert(alignof(UWBP_Popup_Window_Error_C) == 0x000008, "Wrong alignment on UWBP_Popup_Window_Error_C");
static_assert(sizeof(UWBP_Popup_Window_Error_C) == 0x0004C8, "Wrong size on UWBP_Popup_Window_Error_C");
static_assert(offsetof(UWBP_Popup_Window_Error_C, UberGraphFrame) == 0x0003F0, "Member 'UWBP_Popup_Window_Error_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, Popup_Error_Out) == 0x0003F8, "Member 'UWBP_Popup_Window_Error_C::Popup_Error_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, Popup_Error_Loop) == 0x000400, "Member 'UWBP_Popup_Window_Error_C::Popup_Error_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, Popup_Error_In) == 0x000408, "Member 'UWBP_Popup_Window_Error_C::Popup_Error_In' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, AttentionImage) == 0x000410, "Member 'UWBP_Popup_Window_Error_C::AttentionImage' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, Header_Red) == 0x000418, "Member 'UWBP_Popup_Window_Error_C::Header_Red' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, MouseInteraction) == 0x000420, "Member 'UWBP_Popup_Window_Error_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, OutOfContentButton) == 0x000428, "Member 'UWBP_Popup_Window_Error_C::OutOfContentButton' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, OutOfContentButton_80) == 0x000430, "Member 'UWBP_Popup_Window_Error_C::OutOfContentButton_80' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, Panel) == 0x000438, "Member 'UWBP_Popup_Window_Error_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, RetainerBox) == 0x000440, "Member 'UWBP_Popup_Window_Error_C::RetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, RetainerBox_0) == 0x000448, "Member 'UWBP_Popup_Window_Error_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, TXT_MainTitle_Attention) == 0x000450, "Member 'UWBP_Popup_Window_Error_C::TXT_MainTitle_Attention' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, UV_Scroll_L_01) == 0x000458, "Member 'UWBP_Popup_Window_Error_C::UV_Scroll_L_01' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, UV_Scroll_L_02) == 0x000460, "Member 'UWBP_Popup_Window_Error_C::UV_Scroll_L_02' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, UV_Scroll_R_01) == 0x000468, "Member 'UWBP_Popup_Window_Error_C::UV_Scroll_R_01' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, UV_Scroll_R_02) == 0x000470, "Member 'UWBP_Popup_Window_Error_C::UV_Scroll_R_02' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, WBP_FooterMenu_Sub_CommonBtn) == 0x000478, "Member 'UWBP_Popup_Window_Error_C::WBP_FooterMenu_Sub_CommonBtn' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, WBP_Popup_Info) == 0x000480, "Member 'UWBP_Popup_Window_Error_C::WBP_Popup_Info' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, WindowBase) == 0x000488, "Member 'UWBP_Popup_Window_Error_C::WindowBase' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, WindowType) == 0x000490, "Member 'UWBP_Popup_Window_Error_C::WindowType' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, ButtonType) == 0x000491, "Member 'UWBP_Popup_Window_Error_C::ButtonType' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, DecideButtonIndex) == 0x000494, "Member 'UWBP_Popup_Window_Error_C::DecideButtonIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, InitialFocusButtonIndex) == 0x000498, "Member 'UWBP_Popup_Window_Error_C::InitialFocusButtonIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, ButtonControlState) == 0x00049C, "Member 'UWBP_Popup_Window_Error_C::ButtonControlState' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, ButtonControlTimer) == 0x0004A0, "Member 'UWBP_Popup_Window_Error_C::ButtonControlTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, ButtonControlDelayTime) == 0x0004A8, "Member 'UWBP_Popup_Window_Error_C::ButtonControlDelayTime' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, IsFinishInitialize) == 0x0004B0, "Member 'UWBP_Popup_Window_Error_C::IsFinishInitialize' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, FinishInitializeTimer) == 0x0004B8, "Member 'UWBP_Popup_Window_Error_C::FinishInitializeTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Popup_Window_Error_C, WaitFinishInitializeTime) == 0x0004C0, "Member 'UWBP_Popup_Window_Error_C::WaitFinishInitializeTime' has a wrong offset!");

}

