#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_Sub_TabBtn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_Sub_TabBtn.WBP_CMN_Sub_TabBtn_C
// 0x0040 (0x04C0 - 0x0480)
class UWBP_CMN_Sub_TabBtn_C final : public UUnionUIButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Tab_NonActive_Loop;                                // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tab_Select_Loop;                                   // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tab_Active_Loop;                                   // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 PAT_BtnBase;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_TabPict;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_CategoryName;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Selectable;                                        // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActiveAnim();
	void ExecuteUbergraph_WBP_CMN_Sub_TabBtn(int32 EntryPoint);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SelectAnim();
	void SelectAnimation(bool bIsSelected);
	void Set_Up_Tab_Texts(const class FText& InText);
	void SetIconIndex(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_Sub_TabBtn_C">();
	}
	static class UWBP_CMN_Sub_TabBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_Sub_TabBtn_C>();
	}
};
static_assert(alignof(UWBP_CMN_Sub_TabBtn_C) == 0x000008, "Wrong alignment on UWBP_CMN_Sub_TabBtn_C");
static_assert(sizeof(UWBP_CMN_Sub_TabBtn_C) == 0x0004C0, "Wrong size on UWBP_CMN_Sub_TabBtn_C");
static_assert(offsetof(UWBP_CMN_Sub_TabBtn_C, UberGraphFrame) == 0x000480, "Member 'UWBP_CMN_Sub_TabBtn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_TabBtn_C, Tab_NonActive_Loop) == 0x000488, "Member 'UWBP_CMN_Sub_TabBtn_C::Tab_NonActive_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_TabBtn_C, Tab_Select_Loop) == 0x000490, "Member 'UWBP_CMN_Sub_TabBtn_C::Tab_Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_TabBtn_C, Tab_Active_Loop) == 0x000498, "Member 'UWBP_CMN_Sub_TabBtn_C::Tab_Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_TabBtn_C, PAT_BtnBase) == 0x0004A0, "Member 'UWBP_CMN_Sub_TabBtn_C::PAT_BtnBase' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_TabBtn_C, PAT_TabPict) == 0x0004A8, "Member 'UWBP_CMN_Sub_TabBtn_C::PAT_TabPict' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_TabBtn_C, TXT_CategoryName) == 0x0004B0, "Member 'UWBP_CMN_Sub_TabBtn_C::TXT_CategoryName' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_TabBtn_C, Selectable) == 0x0004B8, "Member 'UWBP_CMN_Sub_TabBtn_C::Selectable' has a wrong offset!");

}

