#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClassSelect

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ClassSelect.WBP_ClassSelect_C.CheckComplete
// 0x0070 (0x0070 - 0x0000)
struct WBP_ClassSelect_C_CheckComplete final
{
public:
	EMenuSpeedClassId                             MenuSpeed;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutComplete;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Current;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGrandPrixId>                          NewLocalVar;                                       // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         LocalMax;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalCurrent;                                      // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompleted;                                        // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClearedGrandPrixMenuSpeedClass_ReturnValue; // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_C_CheckComplete) == 0x000008, "Wrong alignment on WBP_ClassSelect_C_CheckComplete");
static_assert(sizeof(WBP_ClassSelect_C_CheckComplete) == 0x000070, "Wrong size on WBP_ClassSelect_C_CheckComplete");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, MenuSpeed) == 0x000000, "Member 'WBP_ClassSelect_C_CheckComplete::MenuSpeed' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, OutComplete) == 0x000001, "Member 'WBP_ClassSelect_C_CheckComplete::OutComplete' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, Current) == 0x000004, "Member 'WBP_ClassSelect_C_CheckComplete::Current' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, Max) == 0x000008, "Member 'WBP_ClassSelect_C_CheckComplete::Max' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, NewLocalVar) == 0x000010, "Member 'WBP_ClassSelect_C_CheckComplete::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, LocalMax) == 0x000020, "Member 'WBP_ClassSelect_C_CheckComplete::LocalMax' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, LocalCurrent) == 0x000024, "Member 'WBP_ClassSelect_C_CheckComplete::LocalCurrent' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, bCompleted) == 0x000028, "Member 'WBP_ClassSelect_C_CheckComplete::bCompleted' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, Temp_int_Variable) == 0x00002C, "Member 'WBP_ClassSelect_C_CheckComplete::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, Temp_int_Variable_1) == 0x000030, "Member 'WBP_ClassSelect_C_CheckComplete::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_Conv_IntToByte_ReturnValue) == 0x000034, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_GetValidValue_ReturnValue) == 0x00003C, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00003D, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00003E, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00003F, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000040, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000044, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_BooleanOR_ReturnValue) == 0x000048, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_IsClearedGrandPrixMenuSpeedClass_ReturnValue) == 0x000049, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_IsClearedGrandPrixMenuSpeedClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, K2Node_SwitchEnum_CmpSuccess) == 0x00004A, "Member 'WBP_ClassSelect_C_CheckComplete::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, Temp_int_Variable_2) == 0x00004C, "Member 'WBP_ClassSelect_C_CheckComplete::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_Array_Contains_ReturnValue) == 0x000054, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, Temp_int_Variable_3) == 0x000058, "Member 'WBP_ClassSelect_C_CheckComplete::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_MakeLiteralInt_ReturnValue) == 0x00005C, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_CheckComplete, CallFunc_Add_IntInt_ReturnValue_2) == 0x000068, "Member 'WBP_ClassSelect_C_CheckComplete::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function WBP_ClassSelect.WBP_ClassSelect_C.ExecuteUbergraph_WBP_ClassSelect
// 0x0258 (0x0258 - 0x0000)
struct WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClassSelectTrophyUI*                   CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetProgress_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_ByteByte_ReturnValue;           // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckComplete_OutComplete;                // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CheckComplete_Current;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CheckComplete_Max;                        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenSuperSonicSpeed_ReturnValue;        // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenMirror_ReturnValue;                 // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMilestoneVersion                             CallFunc_GetMileStoneVersion_ReturnValue;          // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOnlineGameMode_ReturnValue;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_SpawnObject_ReturnValue;                  // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ClassSelect_Sub_Btn_Class_C*       K2Node_DynamicCast_AsWBP_Class_Select_Sub_Btn_Class; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectTrophyUI*                   CallFunc_Array_Get_Item_1;                         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EGrandPrixProgressId                          CallFunc_GetProgressIdGrandPrixMenuSpeedClass_ReturnValue; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetProgress_ReturnValue_1;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClassSelectTrophyUI*>           K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_2;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ClassSelect_Sub_Btn_Class_C*       K2Node_DynamicCast_AsWBP_Class_Select_Sub_Btn_Class_1; // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             K2Node_CustomEvent_FirstSelectedClass_1;           // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_2;        // 0x017C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   CallFunc_GetAppPlayerController_ReturnValue;       // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UClassSelectButtonBase*>         K2Node_MakeArray_Array_1;                          // 0x0198(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_3;                         // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_4;                         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_5;                         // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_6;                         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             K2Node_CustomEvent_FirstSelectedClass;             // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Immediate;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableGrandPrixMilestoneVersion_ReturnValue; // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_7;                         // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_8;                         // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSpeedClassId                             CallFunc_GetLastFocusedMenuSpeedClassId_ReturnValue; // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_216[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectButtonBase*                 CallFunc_Array_Get_Item_9;                         // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0234(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect) == 0x000008, "Wrong alignment on WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect");
static_assert(sizeof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect) == 0x000258, "Wrong size on WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, EntryPoint) == 0x000000, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_bool_Variable) == 0x000014, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_byte_Variable) == 0x000028, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_byte_Variable_1) == 0x000029, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Variable) == 0x00002C, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_MakeLiteralByte_ReturnValue) == 0x000030, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000038, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Conv_IntToByte_ReturnValue) == 0x00003C, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000040, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_DynamicCast_As_____2D) == 0x000050, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_DynamicCast_As_____2D' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Array_Index_Variable) == 0x000060, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Loop_Counter_Variable_1) == 0x000068, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Add_IntInt_ReturnValue_2) == 0x00006C, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Variable_1) == 0x000074, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Add_IntInt_ReturnValue_3) == 0x000078, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00007C, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00007D, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000080, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Array_Index_Variable_2) == 0x000084, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_SetProgress_ReturnValue) == 0x000090, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_SetProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Loop_Counter_Variable_2) == 0x000094, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Add_IntInt_ReturnValue_4) == 0x000098, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Array_Index_Variable_3) == 0x00009C, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Loop_Counter_Variable_3) == 0x0000A0, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Add_IntInt_ReturnValue_5) == 0x0000A4, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Loop_Counter_Variable_4) == 0x0000A8, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Add_IntInt_ReturnValue_6) == 0x0000B0, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Loop_Counter_Variable_5) == 0x0000B4, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Add_IntInt_ReturnValue_7) == 0x0000B8, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Array_Index_Variable_4) == 0x0000BC, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Variable_2) == 0x0000C0, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Conv_IntToByte_ReturnValue_2) == 0x0000C4, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Conv_IntToByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_GetValidValue_ReturnValue) == 0x0000C5, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_LessEqual_ByteByte_ReturnValue) == 0x0000C6, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_LessEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_CheckComplete_OutComplete) == 0x0000C7, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_CheckComplete_OutComplete' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_CheckComplete_Current) == 0x0000C8, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_CheckComplete_Current' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_CheckComplete_Max) == 0x0000CC, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_CheckComplete_Max' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x0000D0, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_SwitchEnum_CmpSuccess) == 0x0000D4, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Array_Index_Variable_5) == 0x0000D8, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_IsOpenSuperSonicSpeed_ReturnValue) == 0x0000DC, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_IsOpenSuperSonicSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_IsOpenMirror_ReturnValue) == 0x0000DD, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_IsOpenMirror_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Not_PreBool_ReturnValue) == 0x0000DE, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_GetMileStoneVersion_ReturnValue) == 0x0000DF, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_GetMileStoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E0, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_GetIsOnlineGameMode_ReturnValue) == 0x0000E1, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_GetIsOnlineGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000E2, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_Event_IsDesignTime) == 0x0000E3, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_BooleanAND_ReturnValue) == 0x0000E4, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000E5, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Array_Length_ReturnValue_1) == 0x0000E8, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000EC, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_GetPlayerController_ReturnValue) == 0x0000F0, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_SpawnObject_ReturnValue) == 0x0000F8, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_CustomEvent_Button) == 0x000100, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_DynamicCast_AsWBP_Class_Select_Sub_Btn_Class) == 0x000108, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_DynamicCast_AsWBP_Class_Select_Sub_Btn_Class' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Array_Get_Item_1) == 0x000118, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_GetProgressIdGrandPrixMenuSpeedClass_ReturnValue) == 0x000120, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_GetProgressIdGrandPrixMenuSpeedClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Array_Length_ReturnValue_2) == 0x000124, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_SetProgress_ReturnValue_1) == 0x000128, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_SetProgress_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_MakeArray_Array) == 0x000130, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Array_Get_Item_2) == 0x000140, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000148, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_DynamicCast_AsWBP_Class_Select_Sub_Btn_Class_1) == 0x000150, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_DynamicCast_AsWBP_Class_Select_Sub_Btn_Class_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_DynamicCast_bSuccess_2) == 0x000158, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, Temp_int_Loop_Counter_Variable_6) == 0x00015C, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_MakeLiteralInt_ReturnValue) == 0x000160, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Less_IntInt_ReturnValue_2) == 0x000164, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Add_IntInt_ReturnValue_8) == 0x000168, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Add_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, K2Node_CustomEvent_FirstSelectedClass_1) == 0x00016C, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::K2Node_CustomEvent_FirstSelectedClass_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000170, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000174, "Member 'WBP_ClassSelect_C_ExecuteUbergraph_WBP_ClassSelect::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
