#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetCustom_Sub_TabBtn

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GadgetCustom_Sub_TabBtn.WBP_GadgetCustom_Sub_TabBtn_C
// 0x0050 (0x0548 - 0x04F8)
class UWBP_GadgetCustom_Sub_TabBtn_C final : public UGadgetCustomTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Tab_Select_Loop;                                   // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tab_Active_Loop;                                   // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Active;                                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_FestaIcon;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_GadgetPlate_TabPict_Delete;                    // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select;                                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_TabBtnName;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_TabBntBase;                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GadgetCustom_Sub_TabBtn_MouseInteraction_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_GadgetCustom_Sub_TabBtn(int32 EntryPoint);
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnConstFestaIconImage();
	void OnConstMouseInteractionButton();
	void OnConstNameText();
	void OnDownKeyPressed();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnFocusReceivedInternal(const struct FGeometry& InGeometry, const struct FFocusEvent& InFocusEvent);
	void OnLeftKeyPressed();
	void OnLeftShoulderPressed();
	void OnRightKeyPressed();
	void OnRightShoulderPressed();
	void OnUpKeyPressed();
	void SetActive(const bool InIsActive);
	void SetRentalPlate(bool InUseRentalPlate);
	void SetShape(int32 InShapeIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GadgetCustom_Sub_TabBtn_C">();
	}
	static class UWBP_GadgetCustom_Sub_TabBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GadgetCustom_Sub_TabBtn_C>();
	}
};
static_assert(alignof(UWBP_GadgetCustom_Sub_TabBtn_C) == 0x000008, "Wrong alignment on UWBP_GadgetCustom_Sub_TabBtn_C");
static_assert(sizeof(UWBP_GadgetCustom_Sub_TabBtn_C) == 0x000548, "Wrong size on UWBP_GadgetCustom_Sub_TabBtn_C");
static_assert(offsetof(UWBP_GadgetCustom_Sub_TabBtn_C, UberGraphFrame) == 0x0004F8, "Member 'UWBP_GadgetCustom_Sub_TabBtn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Sub_TabBtn_C, Tab_Select_Loop) == 0x000500, "Member 'UWBP_GadgetCustom_Sub_TabBtn_C::Tab_Select_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Sub_TabBtn_C, Tab_Active_Loop) == 0x000508, "Member 'UWBP_GadgetCustom_Sub_TabBtn_C::Tab_Active_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Sub_TabBtn_C, Active) == 0x000510, "Member 'UWBP_GadgetCustom_Sub_TabBtn_C::Active' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Sub_TabBtn_C, DSP_FestaIcon) == 0x000518, "Member 'UWBP_GadgetCustom_Sub_TabBtn_C::DSP_FestaIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Sub_TabBtn_C, MouseInteraction) == 0x000520, "Member 'UWBP_GadgetCustom_Sub_TabBtn_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Sub_TabBtn_C, PAT_GadgetPlate_TabPict_Delete) == 0x000528, "Member 'UWBP_GadgetCustom_Sub_TabBtn_C::PAT_GadgetPlate_TabPict_Delete' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Sub_TabBtn_C, Select) == 0x000530, "Member 'UWBP_GadgetCustom_Sub_TabBtn_C::Select' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Sub_TabBtn_C, TXT_TabBtnName) == 0x000538, "Member 'UWBP_GadgetCustom_Sub_TabBtn_C::TXT_TabBtnName' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCustom_Sub_TabBtn_C, WidgetSwitcher_TabBntBase) == 0x000540, "Member 'UWBP_GadgetCustom_Sub_TabBtn_C::WidgetSwitcher_TabBntBase' has a wrong offset!");

}

