#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemSwitch_Sub_Window

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemSwitch_Sub_Window.WBP_ItemSwitch_Sub_Window_C
// 0x0198 (0x0618 - 0x0480)
class UWBP_ItemSwitch_Sub_Window_C final : public UPartyRaceItemSwitchWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               DSP_Btn;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_40;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutOfContentButton*                    OutOfContentButton_80;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_SubMenu_Btn_C*                 WBP_CMN_SubMenu_Btn_01;                            // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_SubMenu_Btn_C*                 WBP_CMN_SubMenu_Btn_02;                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_SubMenu_Btn_C*                 WBP_CMN_SubMenu_Btn_03;                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_10;                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_12;                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_13;                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_15;                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_16;                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_17;                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_18;                    // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_19;                    // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_20;                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_21;                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_23;                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_24;                    // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_25;                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_26;                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_27;                    // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_28;                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_01;                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_02;                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_03;                    // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_04;                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_05;                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_06;                    // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_07;                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_08;                    // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSwitch_Sub_ItemIcon_C*         WBP_ItemSwitch_Sub_ItemIcon_09;                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnFocusOutToDown;                                  // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<EItemId, class UTexture*>                NewVar;                                            // 0x0590(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UDataTable>              DefaultDisableItemTable;                           // 0x05E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsGuest;                                           // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHint;                                            // 0x0609(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A[0x6];                                      // 0x060A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ItemSwitch_C*                      Parent;                                            // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CheckIsGuest_ItemSwitch_Sub_Window(bool IsGuest_0);
	void CheckIsHint_ItemSwitch_Sub_Window(bool IsHint_0);
	void Construct();
	class UWidget* DoCustomNavigation(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_ItemSwitch_Sub_Window(int32 EntryPoint);
	void FocusFromOK();
	void GetGroupSettingFromGameMode(ERaceSettingGrouping* GroupSetting);
	void OnDecisionEvent_Event(class UUnionUIButtonBase* Button);
	void OnFocusEvent_Event(class UUnionUIButtonBase* Button);
	void PreConstruct(bool IsDesignTime);
	void SetupItemTexture();
	void StartRandomBP();
	void UpdateSetting();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemSwitch_Sub_Window_C">();
	}
	static class UWBP_ItemSwitch_Sub_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemSwitch_Sub_Window_C>();
	}
};
static_assert(alignof(UWBP_ItemSwitch_Sub_Window_C) == 0x000008, "Wrong alignment on UWBP_ItemSwitch_Sub_Window_C");
static_assert(sizeof(UWBP_ItemSwitch_Sub_Window_C) == 0x000618, "Wrong size on UWBP_ItemSwitch_Sub_Window_C");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, UberGraphFrame) == 0x000480, "Member 'UWBP_ItemSwitch_Sub_Window_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, DSP_Btn) == 0x000488, "Member 'UWBP_ItemSwitch_Sub_Window_C::DSP_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, Image_40) == 0x000490, "Member 'UWBP_ItemSwitch_Sub_Window_C::Image_40' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, OutOfContentButton_80) == 0x000498, "Member 'UWBP_ItemSwitch_Sub_Window_C::OutOfContentButton_80' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_CMN_SubMenu_Btn_01) == 0x0004A0, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_CMN_SubMenu_Btn_01' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_CMN_SubMenu_Btn_02) == 0x0004A8, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_CMN_SubMenu_Btn_02' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_CMN_SubMenu_Btn_03) == 0x0004B0, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_CMN_SubMenu_Btn_03' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_10) == 0x0004B8, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_10' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_12) == 0x0004C0, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_12' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_13) == 0x0004C8, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_13' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_15) == 0x0004D0, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_15' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_16) == 0x0004D8, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_16' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_17) == 0x0004E0, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_17' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_18) == 0x0004E8, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_18' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_19) == 0x0004F0, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_19' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_20) == 0x0004F8, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_20' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_21) == 0x000500, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_21' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_23) == 0x000508, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_23' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_24) == 0x000510, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_24' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_25) == 0x000518, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_25' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_26) == 0x000520, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_26' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_27) == 0x000528, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_27' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_28) == 0x000530, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_28' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_01) == 0x000538, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_01' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_02) == 0x000540, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_02' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_03) == 0x000548, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_03' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_04) == 0x000550, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_04' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_05) == 0x000558, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_05' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_06) == 0x000560, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_06' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_07) == 0x000568, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_07' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_08) == 0x000570, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_08' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, WBP_ItemSwitch_Sub_ItemIcon_09) == 0x000578, "Member 'UWBP_ItemSwitch_Sub_Window_C::WBP_ItemSwitch_Sub_ItemIcon_09' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, OnFocusOutToDown) == 0x000580, "Member 'UWBP_ItemSwitch_Sub_Window_C::OnFocusOutToDown' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, NewVar) == 0x000590, "Member 'UWBP_ItemSwitch_Sub_Window_C::NewVar' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, DefaultDisableItemTable) == 0x0005E0, "Member 'UWBP_ItemSwitch_Sub_Window_C::DefaultDisableItemTable' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, IsGuest) == 0x000608, "Member 'UWBP_ItemSwitch_Sub_Window_C::IsGuest' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, IsHint) == 0x000609, "Member 'UWBP_ItemSwitch_Sub_Window_C::IsHint' has a wrong offset!");
static_assert(offsetof(UWBP_ItemSwitch_Sub_Window_C, Parent) == 0x000610, "Member 'UWBP_ItemSwitch_Sub_Window_C::Parent' has a wrong offset!");

}

