#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CourseSelect

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionLib_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CourseSelect.WBP_CourseSelect_C
// 0x0220 (0x06F8 - 0x04D8)
class UWBP_CourseSelect_C final : public UCourseSelectWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Black;                                             // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ClassSelectMouseButton;                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConnectLine;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        DSP_BackgroundBlur;                                // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DSP_Overlay_BG;                                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_RacePark_BG;                                   // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_C*                 DSP_WBP_CMN_TextBalloon_01_01;                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_C*                 DSP_WBP_CMN_TextBalloon_01_02;                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_C*                 DSP_WBP_CMN_TextBalloon_01_03;                     // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_C*                 DSP_WBP_CMN_TextBalloon_01_04;                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_C*                 DSP_WBP_CMN_TextBalloon_01_05;                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_C*                 DSP_WBP_CMN_TextBalloon_01_06;                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_C*                 DSP_WBP_CMN_TextBalloon_01_07;                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_C*                 DSP_WBP_CMN_TextBalloon_02_01;                     // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_C*                 DSP_WBP_CMN_TextBalloon_02_02;                     // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_TextBalloon_C*                 DSP_WBP_CMN_TextBalloon_02_03;                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Outline;                                           // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ClassBtn;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_CourseSelect;                             // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_BG_01_C*                       WBP_CMN_BG_01;                                     // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn;                             // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_Sub_GadgetCustom_C*            WBP_CMN_Sub_GadgetCustom;                          // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_Sub_SpeedClassInfo_C*          WBP_CMN_Sub_SpeedClassInfo;                        // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_CourseIcon_C*     WBP_CourseSelect_Sub_CourseIcon_10;                // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_CourseIcon_C*     WBP_CourseSelect_Sub_CourseIcon_01;                // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_CourseIcon_C*     WBP_CourseSelect_Sub_CourseIcon_02;                // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_CourseIcon_C*     WBP_CourseSelect_Sub_CourseIcon_03;                // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_CourseIcon_C*     WBP_CourseSelect_Sub_CourseIcon_04;                // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_CourseIcon_C*     WBP_CourseSelect_Sub_CourseIcon_05;                // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_CourseIcon_C*     WBP_CourseSelect_Sub_CourseIcon_06;                // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_CourseIcon_C*     WBP_CourseSelect_Sub_CourseIcon_07;                // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_CourseIcon_C*     WBP_CourseSelect_Sub_CourseIcon_08;                // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_CourseIcon_C*     WBP_CourseSelect_Sub_CourseIcon_09;                // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_RivalNext_C*      WBP_CourseSelect_Sub_RivalNext;                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_ThumbnailSelecter_C* WBP_CourseSelect_Sub_ThumbnailSelecter;         // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CourseSelect_Sub_TimeTrialIcon_C*  WBP_CourseSelect_Sub_TimeTrialIcon;                // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EStageId                                      FirstStageId;                                      // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForceOpened;                                      // 0x0609(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A[0x6];                                      // 0x060A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentThreshold;                                  // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewVar;                                            // 0x0618(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C[0x4];                                      // 0x061C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EStageId, TSoftObjectPtr<class UTexture2D>> NewVar_2;                                       // 0x0620(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EStageId, struct FGrandPrixStageSetting> GrandPrixSetting;                                  // 0x0670(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCourseSelectSubCategoryIcon*           LastFocusGrandprixButton;                          // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x06C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9[0x3];                                      // 0x06C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewVar_1;                                          // 0x06CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuInputRecieveObject*                SubInputReceiver;                                  // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bRandoming;                                        // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CMN_TextBalloon_C*>         GrandPrixNameBalloons;                             // 0x06E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	EGameModeId                                   NewVar_3;                                          // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GPSelecting;                                       // 0x06F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CalcRandomStageIndexBP(EGrandPrixId GrandPrix, int32* Index_0);
	void Construct();
	void DebugOpenGrandPrix();
	void DeselectSelectedEmblem();
	class UWidget* DoFlirstGPIconNavigationLeft(EUINavigation Navigation_0);
	void DoRandomStageSelect();
	void ExecuteUbergraph_WBP_CourseSelect(int32 EntryPoint);
	void FinalizeSubCommands();
	void Focus();
	void GetRandomGrandprixBP(EGrandPrixId* OutItem);
	void Init(EGameModeId InGameModeId);
	void InitStageDef();
	void InitSubCommands();
	bool IsTimeTrialEnabled();
	void On3PieceStageIconFocusEvent_Event_0(EStageId StageId, int32 Index_0);
	void OnClassSelectButtonClicked();
	void OnDecisionStageId(EStageId SelectedStageId);
	void OnExitState();
	void OnFaceButtonLeftPressed(class UObject* Object);
	void OnFaceButtonTopPressed(class UObject* Object);
	void OnGadgetCustomClicked(class UUnionUIButtonBaseCore* Button);
	void OnGPCancel(class UUnionUIButtonBase* Button);
	void OnGPDecision_CourseSelect(class UUnionUIButtonBase* Button);
	void OnGPDecision_GrandprixSelect(class UUnionUIButtonBase* Button);
	void OnGPDecision_TimeTrial(class UUnionUIButtonBase* Button);
	void OnGPFocusEvent_Event(class UUnionUIButtonBase* Button);
	void OnInitialized();
	void OnInitState(class AActor* OwnerSequence);
	void OnInputChangedFromMouseBP();
	void OnLeftShoulderPressed(class UObject* Object);
	void OnReadyCanceled();
	void OnRightShoulderEvent_Event(class UUnionUIButtonBase* Button);
	void OnRivalSelectClicked(class UUnionUIButtonBaseCore* Button);
	void OnStageCancelEvent_Event_0();
	void OnStageIconFocusEvent_Event_0(int32 PanelIndex, int32 ButtonIndex);
	void OnStoreShortcutClicked(EStageId StageId);
	void PlayInAnimation();
	void Set_Control_Button_Opacity(double Render_Opacity);
	void SetAndUpdateForceOpened(double OpenThreshold);
	void SetEnableGPFocusSound(bool bEnable);
	void SetFocusMenu(class APlayerController* PlayerController);
	void SetupTimeTrialButton();
	void Update3Stage(EGrandPrixId GrandPrixId, double OpenThreshold, TArray<EStageId>* Output_Get);
	void UpdateButtonAnimationState(class UUnionUIButtonBase* CurrentSelectedButton, class UUnionUIButtonStandard* UpdateTargetButton, int32 UpdateTargetButtonIndex);
	void UpdateRivalSelectUI(class AGrandPrixSequence* GrandPrixSequence);
	void UpdateSpeedClass();
	void UpdateStages();
	void UpdateTrophy();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CourseSelect_C">();
	}
	static class UWBP_CourseSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CourseSelect_C>();
	}
};
static_assert(alignof(UWBP_CourseSelect_C) == 0x000008, "Wrong alignment on UWBP_CourseSelect_C");
static_assert(sizeof(UWBP_CourseSelect_C) == 0x0006F8, "Wrong size on UWBP_CourseSelect_C");
static_assert(offsetof(UWBP_CourseSelect_C, UberGraphFrame) == 0x0004D8, "Member 'UWBP_CourseSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, base) == 0x0004E0, "Member 'UWBP_CourseSelect_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, Black) == 0x0004E8, "Member 'UWBP_CourseSelect_C::Black' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, ClassSelectMouseButton) == 0x0004F0, "Member 'UWBP_CourseSelect_C::ClassSelectMouseButton' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, ConnectLine) == 0x0004F8, "Member 'UWBP_CourseSelect_C::ConnectLine' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_BackgroundBlur) == 0x000500, "Member 'UWBP_CourseSelect_C::DSP_BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_Overlay_BG) == 0x000508, "Member 'UWBP_CourseSelect_C::DSP_Overlay_BG' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_RacePark_BG) == 0x000510, "Member 'UWBP_CourseSelect_C::DSP_RacePark_BG' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_WBP_CMN_TextBalloon_01_01) == 0x000518, "Member 'UWBP_CourseSelect_C::DSP_WBP_CMN_TextBalloon_01_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_WBP_CMN_TextBalloon_01_02) == 0x000520, "Member 'UWBP_CourseSelect_C::DSP_WBP_CMN_TextBalloon_01_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_WBP_CMN_TextBalloon_01_03) == 0x000528, "Member 'UWBP_CourseSelect_C::DSP_WBP_CMN_TextBalloon_01_03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_WBP_CMN_TextBalloon_01_04) == 0x000530, "Member 'UWBP_CourseSelect_C::DSP_WBP_CMN_TextBalloon_01_04' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_WBP_CMN_TextBalloon_01_05) == 0x000538, "Member 'UWBP_CourseSelect_C::DSP_WBP_CMN_TextBalloon_01_05' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_WBP_CMN_TextBalloon_01_06) == 0x000540, "Member 'UWBP_CourseSelect_C::DSP_WBP_CMN_TextBalloon_01_06' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_WBP_CMN_TextBalloon_01_07) == 0x000548, "Member 'UWBP_CourseSelect_C::DSP_WBP_CMN_TextBalloon_01_07' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_WBP_CMN_TextBalloon_02_01) == 0x000550, "Member 'UWBP_CourseSelect_C::DSP_WBP_CMN_TextBalloon_02_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_WBP_CMN_TextBalloon_02_02) == 0x000558, "Member 'UWBP_CourseSelect_C::DSP_WBP_CMN_TextBalloon_02_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, DSP_WBP_CMN_TextBalloon_02_03) == 0x000560, "Member 'UWBP_CourseSelect_C::DSP_WBP_CMN_TextBalloon_02_03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, Outline) == 0x000568, "Member 'UWBP_CourseSelect_C::Outline' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, Overlay_ClassBtn) == 0x000570, "Member 'UWBP_CourseSelect_C::Overlay_ClassBtn' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, SafeZone_CourseSelect) == 0x000578, "Member 'UWBP_CourseSelect_C::SafeZone_CourseSelect' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CMN_BG_01) == 0x000580, "Member 'UWBP_CourseSelect_C::WBP_CMN_BG_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CMN_ControllerBtn) == 0x000588, "Member 'UWBP_CourseSelect_C::WBP_CMN_ControllerBtn' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CMN_Sub_GadgetCustom) == 0x000590, "Member 'UWBP_CourseSelect_C::WBP_CMN_Sub_GadgetCustom' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CMN_Sub_SpeedClassInfo) == 0x000598, "Member 'UWBP_CourseSelect_C::WBP_CMN_Sub_SpeedClassInfo' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_CourseIcon_10) == 0x0005A0, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_CourseIcon_10' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_CourseIcon_01) == 0x0005A8, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_CourseIcon_01' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_CourseIcon_02) == 0x0005B0, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_CourseIcon_02' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_CourseIcon_03) == 0x0005B8, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_CourseIcon_03' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_CourseIcon_04) == 0x0005C0, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_CourseIcon_04' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_CourseIcon_05) == 0x0005C8, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_CourseIcon_05' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_CourseIcon_06) == 0x0005D0, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_CourseIcon_06' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_CourseIcon_07) == 0x0005D8, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_CourseIcon_07' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_CourseIcon_08) == 0x0005E0, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_CourseIcon_08' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_CourseIcon_09) == 0x0005E8, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_CourseIcon_09' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_RivalNext) == 0x0005F0, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_RivalNext' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_ThumbnailSelecter) == 0x0005F8, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_ThumbnailSelecter' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, WBP_CourseSelect_Sub_TimeTrialIcon) == 0x000600, "Member 'UWBP_CourseSelect_C::WBP_CourseSelect_Sub_TimeTrialIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, FirstStageId) == 0x000608, "Member 'UWBP_CourseSelect_C::FirstStageId' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, bForceOpened) == 0x000609, "Member 'UWBP_CourseSelect_C::bForceOpened' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, CurrentThreshold) == 0x000610, "Member 'UWBP_CourseSelect_C::CurrentThreshold' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, NewVar) == 0x000618, "Member 'UWBP_CourseSelect_C::NewVar' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, NewVar_2) == 0x000620, "Member 'UWBP_CourseSelect_C::NewVar_2' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, GrandPrixSetting) == 0x000670, "Member 'UWBP_CourseSelect_C::GrandPrixSetting' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, LastFocusGrandprixButton) == 0x0006C0, "Member 'UWBP_CourseSelect_C::LastFocusGrandprixButton' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, NewVar_0) == 0x0006C8, "Member 'UWBP_CourseSelect_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, NewVar_1) == 0x0006CC, "Member 'UWBP_CourseSelect_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, SubInputReceiver) == 0x0006D0, "Member 'UWBP_CourseSelect_C::SubInputReceiver' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, bRandoming) == 0x0006D8, "Member 'UWBP_CourseSelect_C::bRandoming' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, GrandPrixNameBalloons) == 0x0006E0, "Member 'UWBP_CourseSelect_C::GrandPrixNameBalloons' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, NewVar_3) == 0x0006F0, "Member 'UWBP_CourseSelect_C::NewVar_3' has a wrong offset!");
static_assert(offsetof(UWBP_CourseSelect_C, GPSelecting) == 0x0006F1, "Member 'UWBP_CourseSelect_C::GPSelecting' has a wrong offset!");

}

