#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_HUD_Player02

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UnionRun_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.AddCourseMapActor
// 0x0010 (0x0010 - 0x0000)
struct WBP_Race_HUD_Player02_C_AddCourseMapActor final
{
public:
	class AActor*                                 InAttackItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EItemId                                       InItemId;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_AddCourseMapActor) == 0x000008, "Wrong alignment on WBP_Race_HUD_Player02_C_AddCourseMapActor");
static_assert(sizeof(WBP_Race_HUD_Player02_C_AddCourseMapActor) == 0x000010, "Wrong size on WBP_Race_HUD_Player02_C_AddCourseMapActor");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AddCourseMapActor, InAttackItem) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_AddCourseMapActor::InAttackItem' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AddCourseMapActor, InItemId) == 0x000008, "Member 'WBP_Race_HUD_Player02_C_AddCourseMapActor::InItemId' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.AddToHUDAttackInfoWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_Race_HUD_Player02_C_AddToHUDAttackInfoWidget final
{
public:
	TArray<class URaceUISubApproachWarning*>      InAttackWidget;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EUnionAttackItemInfoType                      InItemType;                                        // 0x0010(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         InId;                                              // 0x0011(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_AddToHUDAttackInfoWidget) == 0x000008, "Wrong alignment on WBP_Race_HUD_Player02_C_AddToHUDAttackInfoWidget");
static_assert(sizeof(WBP_Race_HUD_Player02_C_AddToHUDAttackInfoWidget) == 0x000018, "Wrong size on WBP_Race_HUD_Player02_C_AddToHUDAttackInfoWidget");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AddToHUDAttackInfoWidget, InAttackWidget) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_AddToHUDAttackInfoWidget::InAttackWidget' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AddToHUDAttackInfoWidget, InItemType) == 0x000010, "Member 'WBP_Race_HUD_Player02_C_AddToHUDAttackInfoWidget::InItemType' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AddToHUDAttackInfoWidget, InId) == 0x000011, "Member 'WBP_Race_HUD_Player02_C_AddToHUDAttackInfoWidget::InId' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.AfterFinish
// 0x0030 (0x0030 - 0x0000)
struct WBP_Race_HUD_Player02_C_AfterFinish final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URaceUISubRing*                         CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_Ring_C*               K2Node_DynamicCast_AsWBP_Race_HUD_Sub_Ring;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_AfterFinish) == 0x000008, "Wrong alignment on WBP_Race_HUD_Player02_C_AfterFinish");
static_assert(sizeof(WBP_Race_HUD_Player02_C_AfterFinish) == 0x000030, "Wrong size on WBP_Race_HUD_Player02_C_AfterFinish");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AfterFinish, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_AfterFinish::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AfterFinish, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Race_HUD_Player02_C_AfterFinish::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AfterFinish, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Race_HUD_Player02_C_AfterFinish::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AfterFinish, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Race_HUD_Player02_C_AfterFinish::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AfterFinish, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Race_HUD_Player02_C_AfterFinish::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AfterFinish, K2Node_DynamicCast_AsWBP_Race_HUD_Sub_Ring) == 0x000020, "Member 'WBP_Race_HUD_Player02_C_AfterFinish::K2Node_DynamicCast_AsWBP_Race_HUD_Sub_Ring' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AfterFinish, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Race_HUD_Player02_C_AfterFinish::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AfterFinish, CallFunc_Less_IntInt_ReturnValue) == 0x000029, "Member 'WBP_Race_HUD_Player02_C_AfterFinish::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.AfterFireManualAimingUI
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player02_C_AfterFireManualAimingUI final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_AfterFireManualAimingUI) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_AfterFireManualAimingUI");
static_assert(sizeof(WBP_Race_HUD_Player02_C_AfterFireManualAimingUI) == 0x000004, "Wrong size on WBP_Race_HUD_Player02_C_AfterFireManualAimingUI");
static_assert(offsetof(WBP_Race_HUD_Player02_C_AfterFireManualAimingUI, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_AfterFireManualAimingUI::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.ApplyBoost
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player02_C_ApplyBoost final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_ApplyBoost) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_ApplyBoost");
static_assert(sizeof(WBP_Race_HUD_Player02_C_ApplyBoost) == 0x000004, "Wrong size on WBP_Race_HUD_Player02_C_ApplyBoost");
static_assert(offsetof(WBP_Race_HUD_Player02_C_ApplyBoost, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_ApplyBoost::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.ApplyJustBoost
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Player02_C_ApplyJustBoost final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_ApplyJustBoost) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_ApplyJustBoost");
static_assert(sizeof(WBP_Race_HUD_Player02_C_ApplyJustBoost) == 0x000008, "Wrong size on WBP_Race_HUD_Player02_C_ApplyJustBoost");
static_assert(offsetof(WBP_Race_HUD_Player02_C_ApplyJustBoost, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_ApplyJustBoost::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_ApplyJustBoost, Level) == 0x000004, "Member 'WBP_Race_HUD_Player02_C_ApplyJustBoost::Level' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.ChangePlayerConntrollerForPauseMenu
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player02_C_ChangePlayerConntrollerForPauseMenu final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_ChangePlayerConntrollerForPauseMenu) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_ChangePlayerConntrollerForPauseMenu");
static_assert(sizeof(WBP_Race_HUD_Player02_C_ChangePlayerConntrollerForPauseMenu) == 0x000004, "Wrong size on WBP_Race_HUD_Player02_C_ChangePlayerConntrollerForPauseMenu");
static_assert(offsetof(WBP_Race_HUD_Player02_C_ChangePlayerConntrollerForPauseMenu, PlayerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_ChangePlayerConntrollerForPauseMenu::PlayerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.ChangeRingBoostGaugeToBoost
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToBoost final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToBoost) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToBoost");
static_assert(sizeof(WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToBoost) == 0x000004, "Wrong size on WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToBoost");
static_assert(offsetof(WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToBoost, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToBoost::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.ChangeRingBoostGaugeToNormal
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToNormal final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToNormal) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToNormal");
static_assert(sizeof(WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToNormal) == 0x000004, "Wrong size on WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToNormal");
static_assert(offsetof(WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToNormal, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_ChangeRingBoostGaugeToNormal::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.CheckRivalInScreen
// 0x0060 (0x0060 - 0x0000)
struct WBP_Race_HUD_Player02_C_CheckRivalInScreen final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionRacerStatusObject*                RivalStatusObj;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisible_0;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_Rival_RaceStart_C*    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRearView_IsRearView;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInScreen_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInScreen_ReturnValue_1;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_Rival_RaceStart_C*    CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_CheckRivalInScreen) == 0x000008, "Wrong alignment on WBP_Race_HUD_Player02_C_CheckRivalInScreen");
static_assert(sizeof(WBP_Race_HUD_Player02_C_CheckRivalInScreen) == 0x000060, "Wrong size on WBP_Race_HUD_Player02_C_CheckRivalInScreen");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, RivalStatusObj) == 0x000008, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::RivalStatusObj' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, IsVisible_0) == 0x000010, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::IsVisible_0' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, CallFunc_Add_VectorVector_ReturnValue) == 0x000028, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, CallFunc_IsRearView_IsRearView) == 0x000048, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::CallFunc_IsRearView_IsRearView' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, CallFunc_IsInScreen_ReturnValue) == 0x000049, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::CallFunc_IsInScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, CallFunc_IsInScreen_ReturnValue_1) == 0x00004A, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::CallFunc_IsInScreen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00004B, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x00004C, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_CheckRivalInScreen, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000058, "Member 'WBP_Race_HUD_Player02_C_CheckRivalInScreen::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.DebugUpdate
// 0x0010 (0x0010 - 0x0000)
struct WBP_Race_HUD_Player02_C_DebugUpdate final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DebugElapsedTime_0;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_DebugUpdate) == 0x000008, "Wrong alignment on WBP_Race_HUD_Player02_C_DebugUpdate");
static_assert(sizeof(WBP_Race_HUD_Player02_C_DebugUpdate) == 0x000010, "Wrong size on WBP_Race_HUD_Player02_C_DebugUpdate");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DebugUpdate, PlayerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_DebugUpdate::PlayerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DebugUpdate, DebugElapsedTime_0) == 0x000008, "Member 'WBP_Race_HUD_Player02_C_DebugUpdate::DebugElapsedTime_0' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.DecideLotteryItem
// 0x000C (0x000C - 0x0000)
struct WBP_Race_HUD_Player02_C_DecideLotteryItem final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemInfoType                                 ItemInfoType;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InItemId;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_DecideLotteryItem) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_DecideLotteryItem");
static_assert(sizeof(WBP_Race_HUD_Player02_C_DecideLotteryItem) == 0x00000C, "Wrong size on WBP_Race_HUD_Player02_C_DecideLotteryItem");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DecideLotteryItem, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_DecideLotteryItem::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DecideLotteryItem, ItemInfoType) == 0x000004, "Member 'WBP_Race_HUD_Player02_C_DecideLotteryItem::ItemInfoType' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DecideLotteryItem, InItemId) == 0x000008, "Member 'WBP_Race_HUD_Player02_C_DecideLotteryItem::InItemId' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.DispOffControlGuideFlight
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player02_C_DispOffControlGuideFlight final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_DispOffControlGuideFlight) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_DispOffControlGuideFlight");
static_assert(sizeof(WBP_Race_HUD_Player02_C_DispOffControlGuideFlight) == 0x000004, "Wrong size on WBP_Race_HUD_Player02_C_DispOffControlGuideFlight");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOffControlGuideFlight, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_DispOffControlGuideFlight::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.DispOffControlItemUse
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player02_C_DispOffControlItemUse final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_DispOffControlItemUse) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_DispOffControlItemUse");
static_assert(sizeof(WBP_Race_HUD_Player02_C_DispOffControlItemUse) == 0x000004, "Wrong size on WBP_Race_HUD_Player02_C_DispOffControlItemUse");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOffControlItemUse, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_DispOffControlItemUse::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.DispOffControlReleaseItemEffect
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player02_C_DispOffControlReleaseItemEffect final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_DispOffControlReleaseItemEffect) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_DispOffControlReleaseItemEffect");
static_assert(sizeof(WBP_Race_HUD_Player02_C_DispOffControlReleaseItemEffect) == 0x000004, "Wrong size on WBP_Race_HUD_Player02_C_DispOffControlReleaseItemEffect");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOffControlReleaseItemEffect, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_DispOffControlReleaseItemEffect::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.DispOnControlGuideFlight
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Player02_C_DispOnControlGuideFlight final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuggestUpInput;                                   // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_DispOnControlGuideFlight) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_DispOnControlGuideFlight");
static_assert(sizeof(WBP_Race_HUD_Player02_C_DispOnControlGuideFlight) == 0x000008, "Wrong size on WBP_Race_HUD_Player02_C_DispOnControlGuideFlight");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOnControlGuideFlight, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_DispOnControlGuideFlight::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOnControlGuideFlight, bSuggestUpInput) == 0x000004, "Member 'WBP_Race_HUD_Player02_C_DispOnControlGuideFlight::bSuggestUpInput' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.DispOnControlItemUse
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Player02_C_DispOnControlItemUse final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemId                                       ItemId;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFever;                                          // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_DispOnControlItemUse) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_DispOnControlItemUse");
static_assert(sizeof(WBP_Race_HUD_Player02_C_DispOnControlItemUse) == 0x000008, "Wrong size on WBP_Race_HUD_Player02_C_DispOnControlItemUse");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOnControlItemUse, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_DispOnControlItemUse::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOnControlItemUse, ItemId) == 0x000004, "Member 'WBP_Race_HUD_Player02_C_DispOnControlItemUse::ItemId' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOnControlItemUse, bIsFever) == 0x000005, "Member 'WBP_Race_HUD_Player02_C_DispOnControlItemUse::bIsFever' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.DispOnControlReleaseItemEffect
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Player02_C_DispOnControlReleaseItemEffect final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemId                                       ItemId;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_DispOnControlReleaseItemEffect) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_DispOnControlReleaseItemEffect");
static_assert(sizeof(WBP_Race_HUD_Player02_C_DispOnControlReleaseItemEffect) == 0x000008, "Wrong size on WBP_Race_HUD_Player02_C_DispOnControlReleaseItemEffect");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOnControlReleaseItemEffect, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_DispOnControlReleaseItemEffect::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOnControlReleaseItemEffect, ItemId) == 0x000004, "Member 'WBP_Race_HUD_Player02_C_DispOnControlReleaseItemEffect::ItemId' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.DispOnInterimReport
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_HUD_Player02_C_DispOnInterimReport final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_DispOnInterimReport) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_DispOnInterimReport");
static_assert(sizeof(WBP_Race_HUD_Player02_C_DispOnInterimReport) == 0x000004, "Wrong size on WBP_Race_HUD_Player02_C_DispOnInterimReport");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOnInterimReport, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_DispOnInterimReport::PlayerControllerIndex' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.DispOnRaceActionTutorial
// 0x0008 (0x0008 - 0x0000)
struct WBP_Race_HUD_Player02_C_DispOnRaceActionTutorial final
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETutorialAction                               tutorialAction;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_HUD_Player02_C_DispOnRaceActionTutorial) == 0x000004, "Wrong alignment on WBP_Race_HUD_Player02_C_DispOnRaceActionTutorial");
static_assert(sizeof(WBP_Race_HUD_Player02_C_DispOnRaceActionTutorial) == 0x000008, "Wrong size on WBP_Race_HUD_Player02_C_DispOnRaceActionTutorial");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOnRaceActionTutorial, PlayerControllerIndex) == 0x000000, "Member 'WBP_Race_HUD_Player02_C_DispOnRaceActionTutorial::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_HUD_Player02_C_DispOnRaceActionTutorial, tutorialAction) == 0x000004, "Member 'WBP_Race_HUD_Player02_C_DispOnRaceActionTutorial::tutorialAction' has a wrong offset!");

// Function WBP_Race_HUD_Player02.WBP_Race_HUD_Player02_C.ExecuteUbergraph_WBP_Race_HUD_Player02
// 0x1100 (0x1100 - 0x0000)
struct WBP_Race_HUD_Player02_C_ExecuteUbergraph_WBP_Race_HUD_Player02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFireAttackItemInfo                    K2Node_Event_Info;                                 // 0x0008(0x0030)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRacerIndex_OutRacerIndex;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Race_HUD_Sub_Ring_C*>       K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0064(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0065(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0066(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARacePlayerController*                  K2Node_DynamicCast_AsRace_Player_Controller;       // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_Festa_TeamHUD_C*      CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_Festa_TeamHUD_C*      CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_ItemIconSet_Simple_C* CallFunc_Array_Get_Item_2;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_Festa_TeamHUD_C*      CallFunc_Array_Get_Item_3;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_Festa_TeamHUD_C*      CallFunc_Array_Get_Item_4;                         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_4;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_5;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_HitInfo_C*            CallFunc_Array_Get_Item_6;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_5;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_HitInfo_C*            CallFunc_Array_Get_Item_7;                         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGroupIndex_ReturnValue;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_6;         // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRacerIndexByPlayerID_ReturnValue;      // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_HitInfo_C*            CallFunc_Array_Get_Item_8;                         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_7;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_HitInfo_C*            CallFunc_Array_Get_Item_9;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_8;         // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_HitInfo_C*            CallFunc_Array_Get_Item_10;                        // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_9;         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRacerIndex_OutRacerIndex_1;            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrossplayPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerControllerIndex_OutPlayerControllerIndex; // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayer_ReturnValue;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_HitInfo_C*            CallFunc_Array_Get_Item_11;                        // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_10;        // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Race_HUD_Sub_HitInfo_C*            CallFunc_Array_Get_Item_12;                        // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_11;        // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRivalPowerful_ReturnValue;              // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRivalCom_ReturnValue;                   // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18B[0x1];                                      // 0x018B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_61;             // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSuggestUpInput;                      // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PlayerControllerIndex_60;             // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerControllerIndex_59;             // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETutorialAction                               K2Node_Event_TutorialAction;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundPan                                     Temp_byte_Variable;                                // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InNewValue;                           // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InOldValue;                           // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceInfoStateType                            K2Node_Event_InNewState;                           // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERaceInfoStateType                            K2Node_Event_InOldState;                           // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_CustomEvent_StartUI;                        // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUnionVehicleRaceObjectInterface> K2Node_DynamicCast_AsUnion_Vehicle_Race_Object_Interface; // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetButtonWidget_ReturnValue;              // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetButtonWidget_ReturnValue_1;            // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IUnionVehicleRaceObjectInterface> K2Node_DynamicCast_AsUnion_Vehicle_Race_Object_Interface_1; // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URaceUISubRing*                         CallFunc_Array_Get_Item_13;                        // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PlayerIndex;                    // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_DebugElapsedTime;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_ItemWarning_C*        CallFunc_Array_Get_Item_14;                        // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_HitInfo_C*            CallFunc_Array_Get_Item_15;                        // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Race_HUD_Sub_ItemWarning_C*        CallFunc_Array_Get_Item_16;                        // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_12;        // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_13;        // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_14;        // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_293[0x5];                                      // 0x0293(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
