#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GadgetCutom_M2_Div

#include "Basic.hpp"

#include "UNION_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GadgetCutom_M2_Div.WBP_GadgetCutom_M2_Div_C
// 0x00A8 (0x0390 - 0x02E8)
class UWBP_GadgetCutom_M2_Div_C final : public UGadgetCustomizeWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       M2_Out;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       M2_Loop;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       M2_In;                                             // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Name_Line_1;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Name_Line_P1;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_CharaName;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_CharaName_P2;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_GadgetCount_C*                 WBP_CMN_GadgetCount;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_C*                WBP_CMN_PlayerNumber_P1;                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_PlayerNumber_C*                WBP_CMN_PlayerNumber_P2;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_GadgetPlate_C*    WBP_GadgetCustom_Sub_GadgetPlate_P1;               // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_GadgetPlate_C*    WBP_GadgetCustom_Sub_GadgetPlate_P2;               // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_SkillPlate_C*     WBP_GadgetCustom_Sub_SkillPlate_P1;                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Sub_SkillPlate_C*     WBP_GadgetCustom_Sub_SkillPlate_P2;                // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Window_C*             WBP_GadgetCustom_Window_P1;                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GadgetCustom_Window_C*             WBP_GadgetCustom_Window_P2;                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SelectBG_M2_C*                     WBP_SelectBG_M2;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_MachineParameter_C*         WBP_Window_MachineParameter_P1;                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Window_MachineParameter_C*         WBP_Window_MachineParameter_P2;                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GadgetCutom_M2_Div(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void Setup(const struct FGadgetCustomizeWindowData& InWindowData, const bool bInFestaSpecialRule);

	void GetCharaNameBoxes(TArray<class UUnionRichTextBlock*>* OutCharaNameBoxes) const;
	void GetDetailWindows(TArray<class UGadgetDetailWindow*>* OutDetailWindows) const;
	void GetGadgetCustomWindows(TArray<class UGadgetCustomWindow*>* OutGadgetCustomWindows) const;
	void GetmachineParameterWindows(TArray<class UCharaMachineParamWindow*>* OutMachineParameterWindows) const;
	void GetPlateWindows(TArray<class UGadgetPlateWindow*>* OutPlateWindows) const;
	class UCommonCountNumberWidget* GetTicketBox() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GadgetCutom_M2_Div_C">();
	}
	static class UWBP_GadgetCutom_M2_Div_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GadgetCutom_M2_Div_C>();
	}
};
static_assert(alignof(UWBP_GadgetCutom_M2_Div_C) == 0x000008, "Wrong alignment on UWBP_GadgetCutom_M2_Div_C");
static_assert(sizeof(UWBP_GadgetCutom_M2_Div_C) == 0x000390, "Wrong size on UWBP_GadgetCutom_M2_Div_C");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_GadgetCutom_M2_Div_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, M2_Out) == 0x0002F0, "Member 'UWBP_GadgetCutom_M2_Div_C::M2_Out' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, M2_Loop) == 0x0002F8, "Member 'UWBP_GadgetCutom_M2_Div_C::M2_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, M2_In) == 0x000300, "Member 'UWBP_GadgetCutom_M2_Div_C::M2_In' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, Name_Line_1) == 0x000308, "Member 'UWBP_GadgetCutom_M2_Div_C::Name_Line_1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, Name_Line_P1) == 0x000310, "Member 'UWBP_GadgetCutom_M2_Div_C::Name_Line_P1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, SafeZone) == 0x000318, "Member 'UWBP_GadgetCutom_M2_Div_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, TXT_CharaName) == 0x000320, "Member 'UWBP_GadgetCutom_M2_Div_C::TXT_CharaName' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, TXT_CharaName_P2) == 0x000328, "Member 'UWBP_GadgetCutom_M2_Div_C::TXT_CharaName_P2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, WBP_CMN_GadgetCount) == 0x000330, "Member 'UWBP_GadgetCutom_M2_Div_C::WBP_CMN_GadgetCount' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, WBP_CMN_PlayerNumber_P1) == 0x000338, "Member 'UWBP_GadgetCutom_M2_Div_C::WBP_CMN_PlayerNumber_P1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, WBP_CMN_PlayerNumber_P2) == 0x000340, "Member 'UWBP_GadgetCutom_M2_Div_C::WBP_CMN_PlayerNumber_P2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, WBP_GadgetCustom_Sub_GadgetPlate_P1) == 0x000348, "Member 'UWBP_GadgetCutom_M2_Div_C::WBP_GadgetCustom_Sub_GadgetPlate_P1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, WBP_GadgetCustom_Sub_GadgetPlate_P2) == 0x000350, "Member 'UWBP_GadgetCutom_M2_Div_C::WBP_GadgetCustom_Sub_GadgetPlate_P2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, WBP_GadgetCustom_Sub_SkillPlate_P1) == 0x000358, "Member 'UWBP_GadgetCutom_M2_Div_C::WBP_GadgetCustom_Sub_SkillPlate_P1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, WBP_GadgetCustom_Sub_SkillPlate_P2) == 0x000360, "Member 'UWBP_GadgetCutom_M2_Div_C::WBP_GadgetCustom_Sub_SkillPlate_P2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, WBP_GadgetCustom_Window_P1) == 0x000368, "Member 'UWBP_GadgetCutom_M2_Div_C::WBP_GadgetCustom_Window_P1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, WBP_GadgetCustom_Window_P2) == 0x000370, "Member 'UWBP_GadgetCutom_M2_Div_C::WBP_GadgetCustom_Window_P2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, WBP_SelectBG_M2) == 0x000378, "Member 'UWBP_GadgetCutom_M2_Div_C::WBP_SelectBG_M2' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, WBP_Window_MachineParameter_P1) == 0x000380, "Member 'UWBP_GadgetCutom_M2_Div_C::WBP_Window_MachineParameter_P1' has a wrong offset!");
static_assert(offsetof(UWBP_GadgetCutom_M2_Div_C, WBP_Window_MachineParameter_P2) == 0x000388, "Member 'UWBP_GadgetCutom_M2_Div_C::WBP_Window_MachineParameter_P2' has a wrong offset!");

}

