#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupResult_Sub_BonusInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GroupResult_Sub_BonusInfo.WBP_GroupResult_Sub_BonusInfo_C
// 0x0050 (0x0330 - 0x02E0)
class UWBP_GroupResult_Sub_BonusInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BonusInfo_Out;                                     // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BonusInfo_Loop;                                    // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BonusInfo_In;                                      // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bonus_Base;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BonusDetail_Base;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Bonus;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_BonusDetail;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Result_Sub_BonusIcon_C*            WBP_Result_Sub_BonusIcon;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Close();
	void ExecuteUbergraph_WBP_GroupResult_Sub_BonusInfo(int32 EntryPoint);
	void Open(const class FText& Title, const class FText& Detail);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GroupResult_Sub_BonusInfo_C">();
	}
	static class UWBP_GroupResult_Sub_BonusInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GroupResult_Sub_BonusInfo_C>();
	}
};
static_assert(alignof(UWBP_GroupResult_Sub_BonusInfo_C) == 0x000008, "Wrong alignment on UWBP_GroupResult_Sub_BonusInfo_C");
static_assert(sizeof(UWBP_GroupResult_Sub_BonusInfo_C) == 0x000330, "Wrong size on UWBP_GroupResult_Sub_BonusInfo_C");
static_assert(offsetof(UWBP_GroupResult_Sub_BonusInfo_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_GroupResult_Sub_BonusInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_BonusInfo_C, BonusInfo_Out) == 0x0002E8, "Member 'UWBP_GroupResult_Sub_BonusInfo_C::BonusInfo_Out' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_BonusInfo_C, BonusInfo_Loop) == 0x0002F0, "Member 'UWBP_GroupResult_Sub_BonusInfo_C::BonusInfo_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_BonusInfo_C, BonusInfo_In) == 0x0002F8, "Member 'UWBP_GroupResult_Sub_BonusInfo_C::BonusInfo_In' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_BonusInfo_C, BG) == 0x000300, "Member 'UWBP_GroupResult_Sub_BonusInfo_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_BonusInfo_C, Bonus_Base) == 0x000308, "Member 'UWBP_GroupResult_Sub_BonusInfo_C::Bonus_Base' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_BonusInfo_C, BonusDetail_Base) == 0x000310, "Member 'UWBP_GroupResult_Sub_BonusInfo_C::BonusDetail_Base' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_BonusInfo_C, TXT_Bonus) == 0x000318, "Member 'UWBP_GroupResult_Sub_BonusInfo_C::TXT_Bonus' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_BonusInfo_C, TXT_BonusDetail) == 0x000320, "Member 'UWBP_GroupResult_Sub_BonusInfo_C::TXT_BonusDetail' has a wrong offset!");
static_assert(offsetof(UWBP_GroupResult_Sub_BonusInfo_C, WBP_Result_Sub_BonusIcon) == 0x000328, "Member 'UWBP_GroupResult_Sub_BonusInfo_C::WBP_Result_Sub_BonusIcon' has a wrong offset!");

}

