#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_Sub_BoxBtn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CMN_Sub_BoxBtn.WBP_CMN_Sub_BoxBtn_C
// 0x0080 (0x06C8 - 0x0648)
class UWBP_CMN_Sub_BoxBtn_C final : public UUnionUIButtonStandard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Release;                                       // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select;                                        // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Select_Out;                                    // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_Active_Out;                                    // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Btn_Cursor;                                        // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Cursor_Texture;                                // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseInteraction;                                  // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PAT_BtnBase;                                       // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag;                                          // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Active;                                   // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_Btn;                                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ControllerBtn_C*               WBP_CMN_ControllerBtn;                             // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsReady;                                          // 0x06B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnMouseAcceptPressed;                              // 0x06B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CMN_Sub_BoxBtn(int32 EntryPoint);
	void GadgetSelectedEvent();
	void GadgetSelectRestartEvent();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SelectStartEvent();
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CMN_Sub_BoxBtn_C">();
	}
	static class UWBP_CMN_Sub_BoxBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CMN_Sub_BoxBtn_C>();
	}
};
static_assert(alignof(UWBP_CMN_Sub_BoxBtn_C) == 0x000008, "Wrong alignment on UWBP_CMN_Sub_BoxBtn_C");
static_assert(sizeof(UWBP_CMN_Sub_BoxBtn_C) == 0x0006C8, "Wrong size on UWBP_CMN_Sub_BoxBtn_C");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, UberGraphFrame) == 0x000648, "Member 'UWBP_CMN_Sub_BoxBtn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, Btn_Release) == 0x000650, "Member 'UWBP_CMN_Sub_BoxBtn_C::Btn_Release' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, Btn_Select) == 0x000658, "Member 'UWBP_CMN_Sub_BoxBtn_C::Btn_Select' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, Btn_Select_Out) == 0x000660, "Member 'UWBP_CMN_Sub_BoxBtn_C::Btn_Select_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, Btn_Active_Out) == 0x000668, "Member 'UWBP_CMN_Sub_BoxBtn_C::Btn_Active_Out' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, Btn_Cursor) == 0x000670, "Member 'UWBP_CMN_Sub_BoxBtn_C::Btn_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, DSP_Cursor_Texture) == 0x000678, "Member 'UWBP_CMN_Sub_BoxBtn_C::DSP_Cursor_Texture' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, MouseInteraction) == 0x000680, "Member 'UWBP_CMN_Sub_BoxBtn_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, PAT_BtnBase) == 0x000688, "Member 'UWBP_CMN_Sub_BoxBtn_C::PAT_BtnBase' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, RaceFlag) == 0x000690, "Member 'UWBP_CMN_Sub_BoxBtn_C::RaceFlag' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, RaceFlag_Active) == 0x000698, "Member 'UWBP_CMN_Sub_BoxBtn_C::RaceFlag_Active' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, TXT_Btn) == 0x0006A0, "Member 'UWBP_CMN_Sub_BoxBtn_C::TXT_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, WBP_CMN_ControllerBtn) == 0x0006A8, "Member 'UWBP_CMN_Sub_BoxBtn_C::WBP_CMN_ControllerBtn' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, bIsReady) == 0x0006B0, "Member 'UWBP_CMN_Sub_BoxBtn_C::bIsReady' has a wrong offset!");
static_assert(offsetof(UWBP_CMN_Sub_BoxBtn_C, OnMouseAcceptPressed) == 0x0006B8, "Member 'UWBP_CMN_Sub_BoxBtn_C::OnMouseAcceptPressed' has a wrong offset!");

}

