#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopMenu_Sub_BtnPlay_Online

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_classes.hpp"
#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TopMenu_Sub_BtnPlay_Online.WBP_TopMenu_Sub_BtnPlay_Online_C
// 0x0068 (0x0550 - 0x04E8)
class UWBP_TopMenu_Sub_BtnPlay_Online_C final : public UTopMenuPlayModeButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Btn_Active_Out;                                    // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Btn_NonActive_Loop;                                // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_Left_02;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Right_02;                                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnBase;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corsor;                                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DSP_Cover;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopMenu_Sub_Icon_PlayBonus_C*      DSP_WBP_TopMenu_Sub_Icon_PlayBonus;                // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionUIButton*                         MouseInteraction;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlagWave;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_BtnPlay;                                       // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          AcceptBackFlag;                                    // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TopMenu_Sub_BtnPlay_Online(int32 EntryPoint);
	void InitializePlayerNum();
	void JudgeMenuClose();
	void OnAcceptKeyPressed();
	void OnBackKeyPressed();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnFocusLostImpl(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInitialize();
	void OnLeftKeyPressed();
	void OnRightShoulderPressed();
	void SetEnableButton(bool IsEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TopMenu_Sub_BtnPlay_Online_C">();
	}
	static class UWBP_TopMenu_Sub_BtnPlay_Online_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TopMenu_Sub_BtnPlay_Online_C>();
	}
};
static_assert(alignof(UWBP_TopMenu_Sub_BtnPlay_Online_C) == 0x000008, "Wrong alignment on UWBP_TopMenu_Sub_BtnPlay_Online_C");
static_assert(sizeof(UWBP_TopMenu_Sub_BtnPlay_Online_C) == 0x000550, "Wrong size on UWBP_TopMenu_Sub_BtnPlay_Online_C");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, UberGraphFrame) == 0x0004E8, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, Btn_Active_Out) == 0x0004F0, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::Btn_Active_Out' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, Btn_NonActive_Loop) == 0x0004F8, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::Btn_NonActive_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, Arrow_Left_02) == 0x000500, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::Arrow_Left_02' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, Arrow_Right_02) == 0x000508, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::Arrow_Right_02' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, BtnBase) == 0x000510, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::BtnBase' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, Corsor) == 0x000518, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::Corsor' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, DSP_Cover) == 0x000520, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::DSP_Cover' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, DSP_WBP_TopMenu_Sub_Icon_PlayBonus) == 0x000528, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::DSP_WBP_TopMenu_Sub_Icon_PlayBonus' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, MouseInteraction) == 0x000530, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::MouseInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, RaceFlagWave) == 0x000538, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::RaceFlagWave' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, TXT_BtnPlay) == 0x000540, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::TXT_BtnPlay' has a wrong offset!");
static_assert(offsetof(UWBP_TopMenu_Sub_BtnPlay_Online_C, AcceptBackFlag) == 0x000548, "Member 'UWBP_TopMenu_Sub_BtnPlay_Online_C::AcceptBackFlag' has a wrong offset!");

}

